Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/pyplots/boxplot_demo_pyplot.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_pyplots_boxplot_demo_pyplot.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_pyplots_boxplot_demo_pyplot.py>` para descargar el código de ejemplo completo

source: Boxplot Demo
es_es: Demostración de Boxplot

source: Example boxplot code
es_es: Ejemplo de código de boxplot

source: Out:
es_es: Salida:

source: Fake up some more data
es_es: Falsificar algunos datos más

source: Making a 2-D array only works if all the columns are the same length. If they are not, then use a list instead. This is actually more efficient because boxplot converts a 2-D array into a list of vectors internally anyway.
es_es: Hacer un arreglo bidimensional sólo funciona si todas las columnas tienen la misma longitud. Si no la tienen, entonces usa una lista en su lugar. Esto es en realidad más eficiente porque boxplot convierte un arreglo 2-D en una lista de vectores internamente de todos modos.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 2.091 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2.091 segundos)

source: :download:`Download Python source code: boxplot_demo_pyplot.py <boxplot_demo_pyplot.py>`
es_es: :download:`Descarga el código fuente de Python: boxplot_demo_pyplot.py <boxplot_demo_pyplot.py>`

source: :download:`Download Jupyter notebook: boxplot_demo_pyplot.ipynb <boxplot_demo_pyplot.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: boxplot_demo_pyplot.ipynb <boxplot_demo_pyplot.ipynb>`
