Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/faq/howto_faq.po
Languages: es_es

source: How-to
es_es: Instrucciones

source: Contents
es_es: Contenidos

source: Check whether a figure is empty
es_es: Comprobar si una figura está vacía

source: Empty can actually mean different things. Does the figure contain any artists? Does a figure with an empty `~.axes.Axes` still count as empty? Is the figure empty if it was rendered pure white (there may be artists present, but they could be outside the drawing area or transparent)?
es_es: Vacío puede significar diferentes cosas. ¿Contiene la figura algún artist? ¿Una figura con un `~.axes.Axes` vacío sigue contando como vacía? ¿Está vacía la figura si se ha renderizado en blanco puro (puede haber artists presentes, pero podrían estar fuera del área de dibujado o ser transparentes)?

source: For the purpose here, we define empty as: "The figure does not contain any artists except it's background patch." The exception for the background is necessary, because by default every figure contains a `.Rectangle` as it's background patch. This definition could be checked via::
es_es: Para el propósito aquí, definimos vacía como: "La figura no contiene ningún artista excepto su parche de fondo". La excepción para el fondo es necesaria, porque por defecto cada figura contiene un `.Rectangle` como su parche de fondo. Esta definición puede ser comprobada a través de::

source: We've decided not to include this as a figure method because this is only one way of defining empty, and checking the above is only rarely necessary. Usually the user or program handling the figure know if they have added something to the figure.
es_es: Hemos decidido no incluir esto como un método de la figura porque es sólo una forma de definir el vacío, y la comprobación de lo anterior sólo es necesaria en raras ocasiones. Normalmente el usuario o el programa que maneja la figura saben si han añadido algo a la figura.

source: Checking whether a figure would render empty cannot be reliably checked except by actually rendering the figure and investigating the rendered result.
es_es: La comprobación de si una figura se renderizará vacía no puede verificarse de forma fiable, excepto si se renderiza realmente la figura y se investiga el resultado renderizado.

source: Find all objects in a figure of a certain type
es_es: Encuentra todos los objetos en una figura de un tipo determinado

source: Every Matplotlib artist (see :doc:`/tutorials/intermediate/artists`) has a method called :meth:`~matplotlib.artist.Artist.findobj` that can be used to recursively search the artist for any artists it may contain that meet some criteria (e.g., match all :class:`~matplotlib.lines.Line2D` instances or match some arbitrary filter function). For example, the following snippet finds every object in the figure which has a ``set_color`` property and makes the object blue::
es_es: Cada artist de Matplotlib (ver :doc:`/tutorials/intermediate/artists`) tiene un método llamado :meth:`~matplotlib.artist.Artist.findobj` que puede utilizarse para buscar recursivamente en el artist cualquier artist que pueda contener y que cumpla algún criterio (por ejemplo, que coincida con todas las instancias de :class:`~matplotlib.lines.Line2D` o que coincida con alguna función de filtro arbitraria). Por ejemplo, el siguiente fragmento encuentra todos los objetos de la figura que tienen una propiedad ``set_color`` y hace que el objeto sea azul::

source: You can also filter on class instances::
es_es: También puedes filtrar por instancias de clase::

source: Prevent ticklabels from having an offset
es_es: Evitar que las etiquetas tengan un desplazamiento

source: The default formatter will use an offset to reduce the length of the ticklabels. To turn this feature off on a per-axis basis::
es_es: El formateador por defecto utilizará un desplazamiento para reducir la longitud de las etiquetas de la marca del eje. Para desactivar esta función por eje::

source: set :rc:`axes.formatter.useoffset`, or use a different formatter. See :mod:`~matplotlib.ticker` for details.
es_es: establecer :rc:`axes.formatter.useoffset`, o utilizar un formato diferente. Ver :mod:`~matplotlib.ticker` para más detalles.

source: Save transparent figures
es_es: Guardar figuras transparentes

source: The :meth:`~matplotlib.pyplot.savefig` command has a keyword argument *transparent* which, if 'True', will make the figure and axes backgrounds transparent when saving, but will not affect the displayed image on the screen.
es_es: El comando :meth:`~matplotlib.pyplot.savefig` tiene un argumento de palabra clave *transparent* que, si es 'True', hará que los fondos de las figuras y los ejes sean transparentes al guardar, pero no afectará a la imagen mostrada en la pantalla.

source: If you need finer grained control, e.g., you do not want full transparency or you want to affect the screen displayed version as well, you can set the alpha properties directly. The figure has a :class:`~matplotlib.patches.Rectangle` instance called *patch* and the axes has a Rectangle instance called *patch*. You can set any property on them directly (*facecolor*, *edgecolor*, *linewidth*, *linestyle*, *alpha*). e.g.::
es_es: Si necesitas un control más fino, por ejemplo, no quieres una transparencia total o quieres afectar también a la versión mostrada en pantalla, puedes establecer las propiedades alfa directamente. La figura tiene una instancia :class:`~matplotlib.patches.Rectangle` llamada *patch* y los ejes tienen una instancia Rectangle llamada *patch*. Puedes establecer cualquier propiedad en ellos directamente (*facecolor*, *edgecolor*, *linewidth*, *linestyle*, *alpha*). e.g.::

source: If you need *all* the figure elements to be transparent, there is currently no global alpha setting, but you can set the alpha channel on individual elements, e.g.::
es_es: Si necesitas que *todos* los elementos de la figura sean transparentes, actualmente no hay un ajuste global de alfa, pero puedes establecer el canal alfa en elementos individuales, por ejemplo.::

source: Save multiple plots to one pdf file
es_es: Guardar varios gráficos en un archivo pdf

source: Many image file formats can only have one image per file, but some formats support multi-page files. Currently, Matplotlib only provides multi-page output to pdf files, using either the pdf or pgf backends, via the `.backend_pdf.PdfPages` and `.backend_pgf.PdfPages` classes.
es_es: Muchos formatos de archivo de imagen sólo pueden tener una imagen por archivo, pero algunos formatos soportan archivos multipágina. Actualmente, Matplotlib sólo proporciona salida multipágina a archivos pdf, utilizando los backends pdf o pgf, a través de las clases `.backend_pdf.PdfPages` y `.backend_pgf.PdfPages`.

source: Make room for tick labels
es_es: Hacer espacio para las etiquetas de la marca del eje

source: By default, Matplotlib uses fixed percentage margins around subplots. This can lead to labels overlapping or being cut off at the figure boundary. There are multiple ways to fix this:
es_es: Por defecto, Matplotlib utiliza márgenes porcentuales fijos alrededor de los subgráficos. Esto puede llevar a que las etiquetas se superpongan o se corten en el límite de la figura. Hay varias maneras de arreglar esto:

source: Manually adapt the subplot parameters using `.Figure.subplots_adjust` / `.pyplot.subplots_adjust`.
es_es: Adaptar manualmente los parámetros de los subgráficos con `.Figure.subplots_adjust` / `.pyplot.subplots_adjust`.

source: Use one of the automatic layout mechanisms:
es_es: Utilice uno de los mecanismos de distribución automática:

source: constrained layout (:doc:`/tutorials/intermediate/constrainedlayout_guide`)
es_es: distribución restringida (:doc:`/tutorials/intermediate/constrainedlayout_guide`)

source: tight layout (:doc:`/tutorials/intermediate/tight_layout_guide`)
es_es: diseño ajustado (:doc:`/tutorials/intermediate/tight_layout_guide`)

source: Calculate good values from the size of the plot elements yourself (:doc:`/gallery/pyplots/auto_subplots_adjust`)
es_es: Calcula tú mismo los valores buenos del tamaño de los elementos del gráfico (:doc:`/gallery/pyplots/auto_subplots_adjust`)

source: Align my ylabels across multiple subplots
es_es: Alinear mis etiquetas y en múltiples subgráficos

source: If you have multiple subplots over one another, and the y data have different scales, you can often get ylabels that do not align vertically across the multiple subplots, which can be unattractive. By default, Matplotlib positions the x location of the ylabel so that it does not overlap any of the y ticks. You can override this default behavior by specifying the coordinates of the label. The example below shows the default behavior in the left subplots, and the manual setting in the right subplots.
es_es: Si tiene varios subplots superpuestos, y los datos y tienen diferentes escalas, a menudo puede obtener etiquetas y que no se alinean verticalmente a través de los múltiples subgráficos, lo que puede ser poco atractivo. Por defecto, Matplotlib posiciona la ubicación x de la etiqueta y de manera que no se superponga a ninguna de las marcas y. Puede anular este comportamiento por defecto especificando las coordenadas de la etiqueta. El ejemplo siguiente muestra el comportamiento por defecto en los subgráficos de la izquierda, y la configuración manual en los subgráficos de la derecha.

source: Control the draw order of plot elements
es_es: Controla el orden de dibujado de los elementos del gráfico

source: The draw order of plot elements, and thus which elements will be on top, is determined by the `~.Artist.set_zorder` property. See :doc:`/gallery/misc/zorder_demo` for a detailed description.
es_es: El orden de dibujado de los elementos del gráfico, y por lo tanto qué elementos estarán en la parte superior, está determinado por la propiedad `~.Artist.set_zorder`. Ver :doc:`/gallery/misc/zorder_demo` para una descripción detallada.

source: Make the aspect ratio for plots equal
es_es: Igualar el ratio de aspecto de los gráficos

source: The Axes property :meth:`~matplotlib.axes.Axes.set_aspect` controls the aspect ratio of the axes. You can set it to be 'auto', 'equal', or some ratio which controls the ratio::
es_es: La propiedad Axes :meth:`~matplotlib.axes.Axes.set_aspect` controla la relación de aspecto de los ejes. Se puede establecer que sea 'auto', 'equal', o algún ratio que controle la relación::

source: See :doc:`/gallery/subplots_axes_and_figures/axis_equal_demo` for a complete example.
es_es: Ver :doc:`/gallery/subplots_axes_and_figures/axis_equal_demo` para un ejemplo completo.

source: Draw multiple y-axis scales
es_es: Dibujar múltiples escalas del eje y

source: A frequent request is to have two scales for the left and right y-axis, which is possible using :func:`~matplotlib.pyplot.twinx` (more than two scales are not currently supported, though it is on the wish list). This works pretty well, though there are some quirks when you are trying to interactively pan and zoom, because both scales do not get the signals.
es_es: Una solicitud frecuente es tener dos escalas para los ejes Y izquierdo y derecho, lo cual es posible usando :func:`~matplotlib.pyplot.twinx` (actualmente no se soportan más de dos escalas, aunque está en la lista de peticiones). Esto funciona bastante bien, aunque hay algunas peculiaridades cuando se intenta hacer paneo y zoom de forma interactiva, porque ambas escalas no reciben las señales.

source: The approach uses :func:`~matplotlib.pyplot.twinx` (and its sister :func:`~matplotlib.pyplot.twiny`) to use *2 different axes*, turning the axes rectangular frame off on the 2nd axes to keep it from obscuring the first, and manually setting the tick locs and labels as desired. You can use separate ``matplotlib.ticker`` formatters and locators as desired because the two axes are independent.
es_es: El enfoque utiliza :func:`~matplotlib.pyplot.twinx` (y su hermana :func:`~matplotlib.pyplot.twiny`) para utilizar *2 ejes diferentes*, desactivando el marco rectangular de los ejes en el segundo eje para evitar que oscurezca el primero, y configurando manualmente las localizaciones y etiquetas de la marca dej eje como se desee. Puede utilizar formateadores y localizadores separados de ``matplotlib.ticker`` como desee porque los dos ejes son independientes.

source: See :doc:`/gallery/subplots_axes_and_figures/two_scales` for a complete example.
es_es: Ver :doc:`/gallery/subplots_axes_and_figures/two_scales` para un ejemplo completo.

source: Generate images without having a window appear
es_es: Generar imágenes sin que aparezca una ventana

source: Simply do not call `~matplotlib.pyplot.show`, and directly save the figure to the desired format::
es_es: Simplemente no invoques `~matplotlib.pyplot.show`, y guarda directamente la figura en el formato deseado::

source: :doc:`/gallery/user_interfaces/web_application_server_sgskip` for information about running matplotlib inside of a web application.
es_es: :doc:`/gallery/user_interfaces/web_application_server_sgskip` para obtener información sobre la ejecución de matplotlib dentro de una aplicación web.

source: Work with threads
es_es: Trabajar con hilos

source: Matplotlib is not thread-safe: in fact, there are known race conditions that affect certain artists. Hence, if you work with threads, it is your responsibility to set up the proper locks to serialize access to Matplotlib artists.
es_es: Matplotlib no es seguro para los hilos: de hecho, hay condiciones de carrera conocidas que afectan a ciertos artists. Por lo tanto, si trabaja con hilos, es tu responsabilidad configurar los bloqueos adecuados para serializar el acceso a los artists de Matplotlib.

source: You may be able to work on separate figures from separate threads. However, you must in that case use a *non-interactive backend* (typically Agg), because most GUI backends *require* being run from the main thread as well.
es_es: Es posible que puedas trabajar en figuras separadas desde hilos separados. Sin embargo, en ese caso debes utilizar un *backend no interactivo* (típicamente Agg), porque la mayoría de los backends de IGU *requieren* ser ejecutados también desde el hilo principal.
