Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_api_api.po
Languages: es_es

source: Helper functions for managing the Matplotlib API.
es_es: Funciones de ayuda para administrar la API de Matplotlib.

source: This documentation is only relevant for Matplotlib developers, not for users.
es_es: Esta documentación sólo es relevante para los desarrolladores de Matplotlib, no para los usuarios.

source: This module and its submodules are for internal use only. Do not use them in your own code. We may change the API at any time with no warning.
es_es: Este módulo y sus submódulos son sólo para uso interno. No los utilices en tu propio código. Podemos cambiar la API en cualquier momento sin previo aviso.

source: Helper decorator for implementing module-level ``__getattr__`` as a class.
es_es: Decorador de ayuda para implementar el nivel de módulo ``__getattr__`` como una clase.

source: This decorator must be used at the module toplevel as follows::
es_es: Este decorador debe ser utilizado en el nivel superior del módulo de la siguiente manera::

source: The ``__getattr__`` class will be replaced by a ``__getattr__`` function such that trying to access ``name`` on the module will resolve the corresponding property (which may be decorated e.g. with ``_api.deprecated`` for deprecating module globals). The properties are all implicitly cached. Moreover, a suitable AttributeError is generated and raised if no property with the given name exists.
es_es: La clase ``__getattr__`` será reemplazada por una función ``__getattr__`` tal que intentar acceder a ``nombre`` en el módulo resolverá la propiedad correspondiente (que puede ser decorada. . con ``_api. eprecated`` para los globales de módulos obsoletos). Las propiedades son todas implícitamente cacheadas. Además, se genera un AttributeError adecuado y se eleva si no existe una propiedad con el nombre dado.

source: *kwargs* must consist of a single *key, value* pair. If *key* is in *_mapping*, return ``_mapping[value]``; else, raise an appropriate ValueError.
es_es: *kwargs* debe consistir en un único par de *clave, valor*. Si *llave* está en *_mapeo*, devuelve ``_mapeando[value]``; en otro caso, levanta un ValueError.

source: Examples
es_es: Ejemplos

source: For each *key, value* pair in *kwargs*, check that *value* is in *_values*.
es_es: Para cada par de *clave, valor* en *kwargs*, compruebe que *valor* está en *valores*.

source: Parameters
es_es: Parámetros

source: **_values**
es_es: **_valores**

source: Sequence of values to check on.
es_es: Secuencia de valores a comprobar.

source: **_print_supported_values**
es_es: **Valores_soportados_por_impresión**

source: bool, default: True
es_es: bool, por defecto: True

source: Whether to print *_values* when raising ValueError.
es_es: Si imprimir *_values* al elevar ValueError.

source: *key, value* pairs as keyword arguments to find in *_values*.
es_es: *llave, valor* pares como argumentos de palabra clave para encontrar en *_values*.

source: Raises
es_es: Plantea

source: If any *value* in *kwargs* is not found in *_values*.
es_es: Si algún *valor* en *kwargs* no se encuentra en *_values*.

source: For each *key, value* pair in *kwargs*, check that *value* is an instance of one of *_types*; if not, raise an appropriate TypeError.
es_es: Para cada par de *llave* en *kwargs*, compruebe que *value* es una instancia de uno de *_types*; si no, genera un TypeError apropiado.

source: As a special case, a ``None`` entry in *_types* is treated as NoneType.
es_es: Como un caso especial, se trata una entrada ``Ninguna`` en *_types*.

source: For each *key, value* pair in *kwargs*, check that *value* has the shape *_shape*, if not, raise an appropriate ValueError.
es_es: Para cada par de *llave* de *kwargs*, compruebe que *value* tiene la forma *_shape*, si no, levanta un ValueError apropiado.

source: *None* in the shape is treated as a "free" size that can have any length. e.g. (None, 2) -> (N, 2)
es_es: *Ninguno* en la forma se trata como un tamaño "libre" que puede tener cualquier longitud. ej. (None, 2) -> (N, 2)

source: The values checked must be numpy arrays.
es_es: Los valores marcados deben ser matrices numpy.

source: To check for (N, 2) shaped arrays
es_es: Para comprobar por (N, 2) arrays en forma

source: Like `property`, but also triggers on access via the class, and it is the *class* that's passed as argument.
es_es: Como `property`, pero también activa el acceso a través de la clase, y es la *clase* que se pasa como argumento.

source: Select and call the function that accepts ``*args, **kwargs``.
es_es: Seleccione y llame a la función que acepta ``*args, **kwargs``.

source: *funcs* is a list of functions which should not raise any exception (other than `TypeError` if the arguments passed do not match their signature).
es_es: *funcs* es una lista de funciones que no deberían generar ninguna excepción (aparte de `TypeError` si los argumentos pasados no coinciden con su firma).

source: `select_matching_signature` tries to call each of the functions in *funcs* with ``*args, **kwargs`` (in the order in which they are given). Calls that fail with a `TypeError` are silently skipped. As soon as a call succeeds, `select_matching_signature` returns its return value. If no function accepts ``*args, **kwargs``, then the `TypeError` raised by the last failing call is re-raised.
es_es: `select_matching_signature` intenta llamar a cada una de las funciones en *funciones* con ``*args, **kwargs`` (en el orden en que son dadas). Las llamadas que fallan con un `TypeError` se omiten silenciosamente. Tan pronto como una llamada tenga éxito, `select_matching_signature` devuelve su valor devuelto. Si ninguna función acepta ``*args, **kwargs``, entonces el `TypeError` planteado por la última llamada fallida es re-levantado.

source: Callers should normally make sure that any ``*args, **kwargs`` can only bind a single *func* (to avoid any ambiguity), although this is not checked by `select_matching_signature`.
es_es: Las llamadas normalmente deben asegurarse de que cualquier ``*args, **kwargs`` sólo puede enlazar una única *función* (para evitar cualquier ambigüedad), aunque esto no es comprobado por `select_matching_signature`.

source: `select_matching_signature` is intended to help implementing signature-overloaded functions. In general, such functions should be avoided, except for back-compatibility concerns. A typical use pattern is ::
es_es: `select_matching_signature` está destinado a ayudar a implementar funciones sobrecargadas de firma. En general, tales funciones deben evitarse, excepto por problemas de compatibilidad inversa. Un patrón de uso típico es ::

source: which allows *my_func* to be called either with two parameters (*old1* and *old2*) or a single one (*new*). Note that the new signature is given last, so that callers get a `TypeError` corresponding to the new signature if the arguments they passed in do not match any signature.
es_es: que permite llamar a *my_func* con dos parámetros (*old1* y *old2*) o uno único (*nuevo*). Tenga en cuenta que la nueva firma es la última, para que las llamadas obtengan un `TypeError` correspondiente a la nueva firma si los argumentos que han pasado no coinciden con ninguna firma.

source: `warnings.warn` wrapper that sets *stacklevel* to "outside Matplotlib".
es_es: `warnings.warn` envoltorio que establece *stacklevel* a "fuera de Matplotlib".

source: The original emitter of the warning can be obtained by patching this function back to `warnings.warn`, i.e. ``_api.warn_external = warnings.warn`` (or ``functools.partial(warnings.warn, stacklevel=2)``, etc.).
es_es: El emisor original de la advertencia puede obtenerse parcheando esta función de nuevo a `warnings.warn`, es decir, ``_api.warn_external = warnings.warn`` (o ``functools.partial(warnings.warn, stacklevel=2)``, etc.).

source: Helper functions for deprecating parts of the Matplotlib API.
es_es: Funciones de ayuda para partes obsoletas de la API de Matplotlib.

source: This module is for internal use only. Do not use it in your own code. We may change the API at any time with no warning.
es_es: Este módulo es sólo para uso interno. No lo utilice en su propio código. Podemos cambiar la API en cualquier momento sin previo aviso.

source: A class for issuing deprecation warnings for Matplotlib users.
es_es: Una clase para emitir advertencias de desaprobación para los usuarios de Matplotlib.

source: Decorator indicating that parameter *name* of *func* is being deprecated.
es_es: Decorador que indica que el parámetro *nombre* de *función* está siendo desaprobado.

source: The actual implementation of *func* should keep the *name* parameter in its signature, or accept a ``**kwargs`` argument (through which *name* would be passed).
es_es: La implementación real de *func* debe mantener el parámetro *name* en su firma, o aceptar un argumento ``**kwargs`` (a través del cual se pasaría *name*).

source: Parameters that come after the deprecated parameter effectively become keyword-only (as they cannot be passed positionally without triggering the DeprecationWarning on the deprecated parameter), and should be marked as such after the deprecation period has passed and the deprecated parameter is removed.
es_es: Los parámetros que vienen después del parámetro obsoleto se convierten efectivamente en palabra clave (ya que no se pueden pasar posicionalmente sin activar la advertencia de destrucción en el parámetro obsoleto), y debe marcarse como tal después de que el período de desaprobación haya pasado y se elimine el parámetro obsoleto.

source: Parameters other than *since*, *name*, and *func* are keyword-only and forwarded to `.warn_deprecated`.
es_es: Los parámetros que no sean *n*, *nombre*, y *función* son sólo palabras clave y reenviados a `.warn_deprecated`.

source: Return ``obj.method`` with a deprecation if it was overridden, else None.
es_es: Devuelve ``obj.method`` con una desaprobación si fue anulada, sino ninguna.

source: **method**
es_es: **método**

source: An unbound method, i.e. an expression of the form ``Class.method_name``. Remember that within the body of a method, one can always use ``__class__`` to refer to the class that is currently being defined.
es_es: Un método unbound (unbound method), es decir, una expresión del formulario ``Class.method_name``. Recuerda que dentro del cuerpo de un método, uno siempre puede usar ``__class__`` para referirse a la clase que se está definiendo actualmente.

source: Either an object of the class where *method* is defined, or a subclass of that class.
es_es: O bien un objeto de la clase donde *method* es definido, o una subclase de esa clase.

source: **allow_empty**
es_es: **permitir_vacío**

source: bool, default: False
es_es: bool, por defecto: False

source: Whether to allow overrides by "empty" methods without emitting a warning.
es_es: Si permitir sobrescritas mediante métodos "empty" sin emitir una advertencia.

source: Additional parameters passed to `warn_deprecated` to generate the deprecation warning; must at least include the "since" key.
es_es: Parámetros adicionales pasados a `warn_deprecated` para generar la advertencia de desaprobación; debe incluir al menos la clave de "desaprobación".

source: Helper to deprecate public access to an attribute (or method).
es_es: Ayudante para desaprobar el acceso público a un atributo (o método).

source: This helper should only be used at class scope, as follows::
es_es: Este ayudante solo debe ser utilizado en el ámbito de clase, de la siguiente manera::

source: where *all* parameters are forwarded to `deprecated`. This form makes ``attr`` a property which forwards read and write access to ``self._attr`` (same name but with a leading underscore), with a deprecation warning. Note that the attribute name is derived from *the name this helper is assigned to*. This helper also works for deprecating methods.
es_es: donde *todos* los parámetros son reenviados a `obsoletos`. Esta forma hace a ``attr`` una propiedad que reenvía el acceso de lectura y escritura a ``self'. attr`` (mismo nombre pero con guiones bajos principales), con una advertencia de desaprobación. Tenga en cuenta que el nombre de atributo se deriva de *el nombre al que se asigna este ayudante*. Este ayudante también funciona para métodos obsoletos.

source: Decorator to mark a function, a class, or a property as deprecated.
es_es: Decorador para marcar una función, una clase o una propiedad como obsoleta.

source: When deprecating a classmethod, a staticmethod, or a property, the ``@deprecated`` decorator should go *under* ``@classmethod`` and ``@staticmethod`` (i.e., `deprecated` should directly decorate the underlying callable), but *over* ``@property``.
es_es: Al desaprobar un método de clase, un método estático o una propiedad, el decorador ``@deprecated`` debería ir *menos* ``@classmethod`` y ``@staticmethod`` (i. ., `deprecated` debe decorar directamente el callable subyacente), pero *sobre* ``@property``.

source: When deprecating a class ``C`` intended to be used as a base class in a multiple inheritance hierarchy, ``C`` *must* define an ``__init__`` method (if ``C`` instead inherited its ``__init__`` from its own base class, then ``@deprecated`` would mess up ``__init__`` inheritance when installing its own (deprecation-emitting) ``C.__init__``).
es_es: Al desaprobar una clase ``C`` destinada a ser usada como una clase base en una jerarquía de herencia múltiple, ``C`` *debe* definir un método ``__init__`` (si en su lugar ``C`` heredó su ``__init__`` de su propia clase base, entonces ``@deprecated`` arruinaría la herencia ``__init__`` al instalar su propia (deprecation-emitting) ``C.__init__``).

source: Parameters are the same as for `warn_deprecated`, except that *obj_type* defaults to 'class' if decorating a class, 'attribute' if decorating a property, and 'function' otherwise.
es_es: Los parámetros son los mismos que para `warn_deprecated`, excepto que *obj_type* por defecto es 'class' si decoramos una clase, 'attribute' si decoramos una propiedad, y 'function' si no lo hacemos.

source: Decorator indicating that passing parameter *name* (or any of the following ones) positionally to *func* is being deprecated.
es_es: Decorador que indica que pasar el parámetro *nombre* (o cualquiera de los siguientes) positivamente a *función* está siendo obsoleto.

source: When used on a method that has a pyplot wrapper, this should be the outermost decorator, so that :file:`boilerplate.py` can access the original signature.
es_es: Cuando se utiliza en un método que tiene un envoltorio pyplot, este debe ser el decorador remoto, para que :file:`boilerplate.py` pueda acceder a la firma original.

source: Decorator indicating that parameter *old* of *func* is renamed to *new*.
es_es: Decorator indicando que el parámetro *viejo* de *función* es renombrado a *nuevo*.

source: The actual implementation of *func* should use *new*, not *old*. If *old* is passed to *func*, a DeprecationWarning is emitted, and its value is used, even if *new* is also passed by keyword (this is to simplify pyplot wrapper functions, which always pass *new* explicitly to the Axes method). If *new* is also passed but positionally, a TypeError will be raised by the underlying function during argument binding.
es_es: La implementación real de *func* debe usar *new*, no *old*. Si se pasa *viejo* a *func*, se emite una DeprecationWarning y se utiliza su valor. incluso si *new* también es pasado por palabra clave (esto es para simplificar las funciones de envoltura de pyplot, que siempre pasan *new* explícitamente al método de ejes). Si también se pasa *new* pero posicionalmente, la función subyacente generará un TypeError durante la vinculación del argumento.

source: Display a standardized deprecation.
es_es: Muestra una desaprobación estandarizada.

source: **since**
es_es: **Excelencia**

source: The release at which this API became deprecated.
es_es: El lanzamiento en el que esta API se volvió obsoleta.

source: **message**
es_es: **mensaje**

source: str, optional
es_es: str, opcional

source: Override the default deprecation message. The ``%(since)s``, ``%(name)s``, ``%(alternative)s``, ``%(obj_type)s``, ``%(addendum)s``, and ``%(removal)s`` format specifiers will be replaced by the values of the respective arguments passed to this function.
es_es: Anular el mensaje de desaprobación predeterminado. El ``%(since)s``, ``%(name)s``, ``%(alternative)s``, ``%(obj_type)s``, ``%(addendum)s``, y ``%(removal)s`` especificadores de formato serán reemplazados por los valores de los respectivos argumentos pasados a esta función.

source: The name of the deprecated object.
es_es: El nombre del objeto obsoleto.

source: **alternative**
es_es: **alternativa**

source: An alternative API that the user may use in place of the deprecated API. The deprecation warning will tell the user about this alternative if provided.
es_es: Una API alternativa que el usuario puede utilizar en lugar de la API obsoleta. La advertencia de desaprobación le informará al usuario sobre esta alternativa si se proporciona.

source: If True, uses a PendingDeprecationWarning instead of a DeprecationWarning. Cannot be used together with *removal*.
es_es: Si es verdadero, usa un PendingDeprecationWarning en lugar de un DeprecationWarning. No se puede usar junto con *removal*.

source: The object type being deprecated.
es_es: El tipo de objeto que está siendo obsoleto.

source: **addendum**
es_es: **añadir**

source: Additional text appended directly to the final message.
es_es: Texto adicional añadido directamente al mensaje final.

source: **removal**
es_es: **eliminación**

source: The expected removal version. With the default (an empty string), a removal version is automatically computed from *since*. Set to other Falsy values to not schedule a removal date. Cannot be used together with *pending*.
es_es: La versión de eliminación esperada. Con el valor predeterminado (una cadena vacía), una versión de eliminación es automáticamente calculada desde *a*. Establecer en otros valores de Falsy para no programar una fecha de eliminación. No se puede utilizar junto con *pendiente*.
