Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_enums_api.po
Languages: es_es

source: Enums representing sets of strings that Matplotlib uses as input parameters.
es_es: Enums que representan conjuntos de cadenas que Matplotlib utiliza como parámetros de entrada.

source: Matplotlib often uses simple data types like strings or tuples to define a concept; e.g. the line capstyle can be specified as one of 'butt', 'round', or 'projecting'. The classes in this module are used internally and serve to document these concepts formally.
es_es: Matplotlib a menudo utiliza tipos de datos simples como cadenas o tuplas para definir un concepto; por ejemplo, el estilo de la línea puede ser especificado como uno de 'tope', 'redondo', o 'proyectando'. Las clases de este módulo se utilizan internamente y sirven para documentar estos conceptos formalmente.

source: As an end-user you will not use these classes directly, but only the values they define.
es_es: Como usuario final no usarás estas clases directamente, sino sólo los valores que definen.

source: Define how the connection between two line segments is drawn.
es_es: Definir cómo se dibuja la conexión entre dos segmentos de línea.

source: For a visual impression of each *JoinStyle*, `view these docs online <JoinStyle>`, or run `JoinStyle.demo`.
es_es: Para una impresión visual de cada *JoinStyle*, `revisa estos documentos en línea <JoinStyle>`, o ejecuta `JoinStyle.demo`.

source: Lines in Matplotlib are typically defined by a 1D `~.path.Path` and a finite ``linewidth``, where the underlying 1D `~.path.Path` represents the center of the stroked line.
es_es: Las líneas en Matplotlib se definen típicamente por un `~.path.Path` 1D y un ``linewidth`` finito, donde el `~.path.Path` 1D subyacente representa el centro de la línea trazada.

source: By default, `~.backend_bases.GraphicsContextBase` defines the boundaries of a stroked line to simply be every point within some radius, ``linewidth/2``, away from any point of the center line. However, this results in corners appearing "rounded", which may not be the desired behavior if you are drawing, for example, a polygon or pointed star.
es_es: Por defecto, `~.backend_bases.GraphicsContextBase` define los límites de una línea trazada para ser simplemente cada punto dentro de algún radio, ``linewidth/2``, lejos de cualquier punto de la línea central. Sin embargo, esto hace que las esquinas aparezcan "redondeadas", lo que puede no ser el comportamiento deseado si se está dibujando, por ejemplo, un polígono o una estrella puntiaguda.

source: **Supported values:**
es_es: **Valores soportados:**

source: the "arrow-tip" style. Each boundary of the filled-in area will extend in a straight line parallel to the tangent vector of the centerline at the point it meets the corner, until they meet in a sharp point.
es_es: el estilo "punta de flecha". Cada límite del área rellenada se extenderá en una línea recta paralela al vector tangente de la línea central en el punto en que se encuentra con la esquina, hasta que se encuentren en un punto agudo.

source: stokes every point within a radius of ``linewidth/2`` of the center lines.
es_es: remata cada punto dentro de un radio de ``linewidth/2`` de las líneas centrales.

source: the "squared-off" style. It can be thought of as a rounded corner where the "circular" part of the corner has been cut off.
es_es: el estilo "cuadrado". Puede considerarse como una esquina redondeada en la que se ha cortado la parte "circular" de la esquina.

source: Very long miter tips are cut off (to form a *bevel*) after a backend-dependent limit called the "miter limit", which specifies the maximum allowed ratio of miter length to line width. For example, the PDF backend uses the default value of 10 specified by the PDF standard, while the SVG backend does not even specify the miter limit, resulting in a default value of 4 per the SVG specification. Matplotlib does not currently allow the user to adjust this parameter.
es_es: Las puntas de inglete muy largas se cortan (para formar un *bisel*) después de un límite dependiente del backend llamado "límite de inglete", que especifica la relación máxima permitida entre la longitud del inglete y el ancho de la línea. Por ejemplo, el backend PDF utiliza el valor por defecto de 10 especificado por el estándar PDF, mientras que el backend SVG ni siquiera especifica el límite de inglete, resultando en un valor por defecto de 4 según la especificación SVG. Matplotlib no permite actualmente al usuario ajustar este parámetro.

source: A more detailed description of the effect of a miter limit can be found in the `Mozilla Developer Docs <https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/stroke-miterlimit>`_
es_es: Una descripción más detallada del efecto de un límite de inglete se puede encontrar en los `Docs para desarrolladores de Mozilla <https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/stroke-miterlimit>`_

source: (`Source code <../api/_enums_api-1.py>`__, `png <../api/_enums_api-1.png>`__, `pdf <../api/_enums_api-1.pdf>`__)
es_es: (`Código fuente <../api/_enums_api-1.py>`__, `png <../api/_enums_api-1.png>`__, `pdf <../api/_enums_api-1.pdf>`__)

source: Demo of possible JoinStyle's
es_es: Demostración de posibles JoinStyle's

source: Demonstrate how each JoinStyle looks for various join angles.
es_es: Demostrar cómo se ve cada JoinStyle para varios ángulos de unión.

source: Define how the two endpoints (caps) of an unclosed line are drawn.
es_es: Define cómo se dibujan los dos puntos finales (tapas) de una línea no cerrada.

source: How to draw the start and end points of lines that represent a closed curve (i.e. that end in a `~.path.Path.CLOSEPOLY`) is controlled by the line's `JoinStyle`. For all other lines, how the start and end points are drawn is controlled by the *CapStyle*.
es_es: La forma de dibujar los puntos inicial y final de las líneas que representan una curva cerrada (es decir, que terminan en un `~.path.Path.CLOSEPOLY`) está controlada por el `JoinStyle` de la línea. Para todas las demás líneas, la forma en que se dibujan los puntos de inicio y final se controla mediante el *CapStyle*.

source: For a visual impression of each *CapStyle*, `view these docs online <CapStyle>` or run `CapStyle.demo`.
es_es: Para una impresión visual de cada *CapStyle*, `vea estos docs online <CapStyle>` o ejecute `CapStyle.demo`.

source: the line is squared off at its endpoint.
es_es: la línea se hace cuadrada en su punto final.

source: the line is squared off as in *butt*, but the filled in area extends beyond the endpoint a distance of ``linewidth/2``.
es_es: la línea se hace cuadrada como en *butt*, pero el área rellenada se extiende más allá del punto final una distancia de ``linewidth/2``.

source: like *butt*, but a semicircular cap is added to the end of the line, of radius ``linewidth/2``.
es_es: como *butt*, pero se añade una tapa semicircular al final de la línea, de radio ``linewidth/2``.

source: (`Source code <../api/_enums_api-2.py>`__, `png <../api/_enums_api-2.png>`__, `pdf <../api/_enums_api-2.pdf>`__)
es_es: (`Código fuente <../api/_enums_api-2.py>`__, `png <../api/_enums_api-2.png>`__, `pdf <../api/_enums_api-2.pdf>`__)

source: Demo of possible CapStyle's
es_es: Demostración de posibles CapStyle's

source: Demonstrate how each CapStyle looks for a thick line segment.
es_es: Demostrar cómo cada CapStyle busca un segmento de línea gruesa.
