Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/afm_api.po
Languages: es_es

source: A python interface to Adobe Font Metrics Files.
es_es: Una interfaz de python para los archivos de Adobe Font Metrics.

source: Although a number of other Python implementations exist, and may be more complete than this, it was decided not to go with them because they were either:
es_es: Aunque existen otras implementaciones de Python, y pueden ser más completas que esta, se decidió no ir con ellas porque eran:

source: copyrighted or used a non-BSD compatible license
es_es: con derechos de autor o utilizaban una licencia no compatible con BSD

source: had too many dependencies and a free standing lib was needed
es_es: tenía demasiadas dependencias y se necesitaba una lib libre

source: did more than needed and it was easier to write afresh rather than figure out how to get just what was needed.
es_es: hacía más de lo necesario y era más fácil escribir de nuevo en lugar de averiguar cómo obtener sólo lo que se necesitaba.

source: It is pretty easy to use, and has no external dependencies:
es_es: Es bastante fácil de usar, y no tiene dependencias externas:

source: As in the Adobe Font Metrics File Format Specification, all dimensions are given in units of 1/1000 of the scale factor (point size) of the font being used.
es_es: Al igual que en la especificación del formato de archivo de métrica de fuentes de Adobe, todas las dimensiones se dan en unidades de 1/1000 del factor de escala (tamaño de punto) de la fuente que se está utilizando.

source: Parse the AFM file in file object *fh*.
es_es: Parsear el archivo AFM en el objeto de archivo *fh*.

source: The font family name, e.g., 'Times'.
es_es: El nombre de la familia de fuentes, por ejemplo, 'Times'.

source: Return the fontangle as float.
es_es: Devuelve el fontangle como float.

source: Return the cap height as float.
es_es: Devuelve la altura de la tapa como float.

source: Return the font family name, e.g., 'Times'.
es_es: Devuelve el nombre de la familia de fuentes, por ejemplo, 'Times'.

source: Return the font name, e.g., 'Times-Roman'.
es_es: Devuelve el nombre de la fuente, por ejemplo, 'Times-Roman'.

source: Return the font full name, e.g., 'Times-Roman'.
es_es: Devuelve el nombre completo de la fuente, por ejemplo, 'Times-Roman'.

source: Get the bounding box (ink) height of character *c* (space is 0).
es_es: Obtener la altura de la caja delimitadora (tinta) del carácter *c* (el espacio es 0).

source: Return the standard horizontal stem width as float, or *None* if not specified in AFM file.
es_es: Devuelve el ancho del tallo horizontal estándar como float, o *None* si no se especifica en el archivo AFM.

source: Return the kerning pair distance (possibly 0) for chars *c1* and *c2*.
es_es: Devuelve la distancia del par de kerning (posiblemente 0) para los caracteres *c1* y *c2*.

source: Return the kerning pair distance (possibly 0) for chars *name1* and *name2*.
es_es: Devuelve la distancia del par de kerning (posiblemente 0) para los caracteres *nombre1* y *nombre2*.

source: Get the name of the character, i.e., ';' is 'semicolon'.
es_es: Obtener el nombre del carácter, es decir, ';' es 'punto y coma'.

source: Return the string bounding box.
es_es: Devuelve el cuadro delimitador de la cadena.

source: Return the string bounding box and the maximal descent.
es_es: Devuelve la caja delimitadora de la cadena y el descenso máximo.

source: Return the underline thickness as float.
es_es: Devuelve el grosor del subrayado como float.

source: Return the standard vertical stem width as float, or *None* if not specified in AFM file.
es_es: Devuelve el ancho del tallo vertical estándar como float, o *None* si no se especifica en el archivo AFM.

source: Return the font weight, e.g., 'Bold' or 'Roman'.
es_es: Devuelve el peso de la fuente, por ejemplo, 'Bold' o 'Roman'.

source: Get the width of the character from the character metric WX field.
es_es: Obtener el ancho del carácter del campo WX de la métrica de caracteres.

source: Get the width of the character from a type1 character name.
es_es: Obtener el ancho del carácter de un nombre de carácter de tipo1.

source: Return the xheight as float.
es_es: Devuelve el xheight como float.

source: Return the string width (including kerning) and string height as a (*w*, *h*) tuple.
es_es: Devuelve el ancho de la cadena (incluyendo el kerning) y la altura de la cadena como una tupla (*w*, *h*).

source: Represents the character metrics of a single character.
es_es: Representa la métrica de caracteres de un solo carácter.

source: Notes
es_es: Notas

source: The fields do currently only describe a subset of character metrics information defined in the AFM standard.
es_es: Los campos actualmente sólo describen un subconjunto de la información de las métricas de caracteres definidas en el estándar AFM.

source: Create new instance of CharMetrics(width, name, bbox)
es_es: Crear nueva instancia de CharMetrics(width, name, bbox)

source: The bbox of the character (B) as a tuple (*llx*, *lly*, *urx*, *ury*).
es_es: La bbox del carácter (B) como tupla (*llx*, *lly*, *urx*, *ury*).

source: The character name (N).
es_es: El nombre del carácter (N).

source: The character width (WX).
es_es: El ancho de los caracteres (WX).

source: Represents the information on a composite element of a composite char.
es_es: Representa la información de un elemento compuesto de un char compuesto.

source: Create new instance of CompositePart(name, dx, dy)
es_es: Crear nueva instancia de CompositePart(nombre, dx, dy)

source: x-displacement of the part from the origin.
es_es: desplazamiento x de la pieza desde el origen.

source: y-displacement of the part from the origin.
es_es: desplazamiento en y de la pieza desde el origen.

source: Name of the part, e.g. 'acute'.
es_es: Nombre de la parte, por ejemplo, 'acute'.
