Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/animation_api.po
Languages: es_es

source: Table of Contents
es_es: Tabla de contenidos

source: Inheritance Diagrams
es_es: Diagramas de herencia

source: Animation
es_es: Animación

source: The easiest way to make a live animation in Matplotlib is to use one of the `Animation` classes.
es_es: La forma más fácil de hacer una animación en vivo en Matplotlib es utilizar una de las clases `Animation`.

source: :py:obj:`Animation <matplotlib.animation.Animation>`
es_es: :py:obj:`Animación <matplotlib.animation.Animation>`

source: A base class for Animations.
es_es: Una clase base para las animaciones.

source: Makes an animation by repeatedly calling a function *func*.
es_es: Hace una animación llamando repetidamente a una función *func*.

source: Animation using a fixed set of `.Artist` objects.
es_es: Animación que utiliza un conjunto fijo de objetos `.Artist`.

source: In both cases it is critical to keep a reference to the instance object. The animation is advanced by a timer (typically from the host GUI framework) which the `Animation` object holds the only reference to. If you do not hold a reference to the `Animation` object, it (and hence the timers) will be garbage collected which will stop the animation.
es_es: En ambos casos es crítico mantener una referencia al objeto instancia. La animación es adelantada por un temporizador (típicamente del framework de la GUI anfitriona) del cual el objeto `Animation` mantiene la única referencia. Si no mantienes una referencia al objeto `Animation`, éste (y por lo tanto los temporizadores) serán recolectados por la basura, lo que detendrá la animación.

source: To save an animation use `Animation.save`, `Animation.to_html5_video`, or `Animation.to_jshtml`.
es_es: Para guardar una animación utiliza `Animation.save`, `Animation.to_html5_video`, o `Animation.to_jshtml`.

source: See :ref:`ani_writer_classes` below for details about what movie formats are supported.
es_es: Ver :ref:`ani_writer_classes` más abajo para conocer los formatos de película soportados.

source: The inner workings of `FuncAnimation` is more-or-less::
es_es: El funcionamiento interno de `FuncAnimation` es más o menos::

source: with details to handle 'blitting' (to dramatically improve the live performance), to be non-blocking, not repeatedly start/stop the GUI event loop, handle repeats, multiple animated axes, and easily save the animation to a movie file.
es_es: con detalles para manejar el 'blitting' (para mejorar drásticamente el rendimiento en vivo), ser no bloqueante, no iniciar/detener repetidamente el bucle de eventos de la GUI, manejar repeticiones, múltiples ejes animados, y guardar fácilmente la animación en un archivo de película.

source: 'Blitting' is a `standard technique <https://en.wikipedia.org/wiki/Bit_blit>`__ in computer graphics. The general gist is to take an existing bit map (in our case a mostly rasterized figure) and then 'blit' one more artist on top. Thus, by managing a saved 'clean' bitmap, we can only re-draw the few artists that are changing at each frame and possibly save significant amounts of time. When we use blitting (by passing ``blit=True``), the core loop of `FuncAnimation` gets a bit more complicated::
es_es: El 'Blitting' es una técnica estándar <https://en.wikipedia.org/wiki/Bit_blit>`__ en gráficos por ordenador. La esencia general es tomar un mapa de bits existente (en nuestro caso una figura mayormente rasterizada) y luego 'blit' un artista más en la parte superior. Así, al manejar un mapa de bits 'limpio' guardado, sólo podemos volver a dibujar los pocos artistas que cambian en cada fotograma y, posiblemente, ahorrar cantidades significativas de tiempo. Cuando usamos el blitting (pasando ``blit=True``), el bucle central de `FuncAnimation` se complica un poco::

source: This is of course leaving out many details (such as updating the background when the figure is resized or fully re-drawn). However, this hopefully minimalist example gives a sense of how ``init_func`` and ``func`` are used inside of `FuncAnimation` and the theory of how 'blitting' works.
es_es: Por supuesto, esto deja fuera muchos detalles (como la actualización del fondo cuando la figura se redimensiona o se redibuja completamente). Sin embargo, este ejemplo, que espero sea minimalista, da una idea de cómo se usan ``init_func`` y ``func`` dentro de `FuncAnimation` y la teoría de cómo funciona el 'blitting'.

source: The expected signature on ``func`` and ``init_func`` is very simple to keep `FuncAnimation` out of your book keeping and plotting logic, but this means that the callable objects you pass in must know what artists they should be working on. There are several approaches to handling this, of varying complexity and encapsulation. The simplest approach, which works quite well in the case of a script, is to define the artist at a global scope and let Python sort things out. For example ::
es_es: La firma esperada en ``func`` y ``init_func`` es muy simple para mantener `FuncAnimation` fuera de su lógica de contabilidad y trazado, pero esto significa que los objetos llamables que se pasan deben saber en qué artistas deben trabajar. Hay varios enfoques para manejar esto, de diversa complejidad y encapsulación. El enfoque más simple, que funciona bastante bien en el caso de un script, es definir el artista en un ámbito global y dejar que Python lo resuelva. Por ejemplo ::

source: The second method is to use `functools.partial` to 'bind' artists to function. A third method is to use closures to build up the required artists and functions. A fourth method is to create a class.
es_es: El segundo método consiste en utilizar `functools.partial` para "enlazar" artists a la función. Un tercer método es utilizar cierres para construir los artistas y funciones necesarios. Un cuarto método es crear una clase.

source: Examples
es_es: Ejemplos

source: Writer Classes
es_es: Clases de escritores

source: The provided writers fall into a few broad categories.
es_es: Los escritores proporcionados se dividen en algunas categorías generales.

source: The Pillow writer relies on the Pillow library to write the animation, keeping all data in memory.
es_es: El escritor Pillow depende de la biblioteca Pillow para escribir la animación, manteniendo todos los datos en memoria.

source: The HTML writer generates JavaScript-based animations.
es_es: El escritor de HTML genera animaciones basadas en JavaScript.

source: Writer for JavaScript-based HTML movies.
es_es: Escritor para películas HTML basadas en JavaScript.

source: The pipe-based writers stream the captured frames over a pipe to an external process. The pipe-based variants tend to be more performant, but may not work on all systems.
es_es: Los escritores basados en tuberías transmiten los fotogramas capturados a través de una tubería a un proceso externo. Las variantes basadas en tuberías tienden a ser más performantes, pero pueden no funcionar en todos los sistemas.

source: Pipe-based ffmpeg writer.
es_es: Escritor ffmpeg basado en tuberías.

source: Pipe-based animated gif.
es_es: Gif animado basado en tuberías.

source: The file-based writers save temporary files for each frame which are stitched into a single file at the end. Although slower, these writers can be easier to debug.
es_es: Los escritores basados en archivos guardan archivos temporales para cada fotograma que se cosen en un solo archivo al final. Aunque son más lentos, estos escritores pueden ser más fáciles de depurar.

source: File-based ffmpeg writer.
es_es: Escritor de ffmpeg basado en archivos.

source: File-based animated gif writer.
es_es: Escritor de gifs animados basado en archivos.

source: Fundamentally, a `MovieWriter` provides a way to grab sequential frames from the same underlying `~matplotlib.figure.Figure` object. The base class `MovieWriter` implements 3 methods and a context manager. The only difference between the pipe-based and file-based writers is in the arguments to their respective ``setup`` methods.
es_es: Fundamentalmente, un `MovieWriter` proporciona una forma de coger fotogramas secuenciales del mismo objeto subyacente `~matplotlib.figure.Figure`. La clase base `MovieWriter` implementa 3 métodos y un gestor de contexto. La única diferencia entre los escritores basados en tuberías y los basados en archivos está en los argumentos de sus respectivos métodos de ``setup``.

source: The ``setup()`` method is used to prepare the writer (possibly opening a pipe), successive calls to ``grab_frame()`` capture a single frame at a time and ``finish()`` finalizes the movie and writes the output file to disk. For example ::
es_es: El método ``setup()`` se utiliza para preparar al escritor (posiblemente abriendo una tubería), las sucesivas llamadas a ``grab_frame()`` capturan solo un fotograma a la vez y ``finish()`` finaliza la película y escribe el archivo de salida en el disco. Por ejemplo ::

source: If using the writer classes directly (not through `Animation.save`), it is strongly encouraged to use the `~MovieWriter.saving` context manager ::
es_es: Si se utilizan las clases de escritor directamente (no a través de `Animation.save`), se recomienda encarecidamente utilizar el gestor de contexto `~MovieWriter.saving` ::

source: to ensures that setup and cleanup are performed as necessary.
es_es: para asegurar que la configuración y la limpieza se realicen según sea necesario.

source: Helper Classes
es_es: Clases de ayuda

source: Animation Base Classes
es_es: Clases base de animación

source: `Animation` subclass for time-based animation.
es_es: Subclase `Animation` para la animación basada en el tiempo.

source: Writer Registry
es_es: Registro del escritor

source: A module-level registry is provided to map between the name of the writer and the class to allow a string to be passed to `Animation.save` instead of a writer instance.
es_es: Se proporciona un registro a nivel de módulo para mapear entre el nombre del escritor y la clase para permitir que se pase una cadena a `Animation.save` en lugar de una instancia del escritor.

source: Registry of available writer classes by human readable name.
es_es: Registro de clases de escritores disponibles por nombre legible para humanos.

source: Writer Base Classes
es_es: Clases base del escritor

source: To reduce code duplication base classes
es_es: Para reducir la duplicación de código las clases base

source: Abstract base class for writing movies.
es_es: Clase base abstracta para escribir películas.

source: Base class for writing movies.
es_es: Clase base para escribir películas.

source: `MovieWriter` for writing to individual files and stitching at the end.
es_es: `MovieWriter` para escribir en archivos individuales y coser al final.

source: and mixins
es_es: y los mixins

source: Mixin class for FFMpeg output.
es_es: Clase mixin para la salida de FFMpeg.

source: Mixin class for ImageMagick output.
es_es: Clase mixin para la salida de ImageMagick.

source: are provided.
es_es: se proporcionan.

source: See the source code for how to easily implement new `MovieWriter` classes.
es_es: Vea el código fuente para saber cómo implementar fácilmente las nuevas clases `MovieWriter`.
