Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/axes_api.po
Languages: es_es

source: Table of Contents
es_es: Tabla de contenidos

source: Inheritance
es_es: Herencia

source: The Axes class
es_es: La clase Axes

source: The `Axes` contains most of the figure elements: `~.axis.Axis`, `~.axis.Tick`, `~.lines.Line2D`, `~.text.Text`, `~.patches.Polygon`, etc., and sets the coordinate system.
es_es: El `Axes` contiene la mayoría de los elementos de la figura: `~.axis.Axis`, `~.axis.Tick`, `~.lines.Line2D`, `~.text.Text`, `~.patches.Polygon`, etc., y establece el sistema de coordenadas.

source: The `Axes` instance supports callbacks through a callbacks attribute which is a `~.cbook.CallbackRegistry` instance. The events you can connect to are 'xlim_changed' and 'ylim_changed' and the callback will be called with func(*ax*) where *ax* is the `Axes` instance.
es_es: La instancia de `Axes` soporta callbacks a través de un atributo callbacks que es una instancia de `~.cbook.CallbackRegistry`. Los eventos a los que se puede conectar son 'xlim_changed' y 'ylim_changed' y el callback será llamado con func(*ax*) donde *ax* es la instancia de 'Axes'.

source: Attributes
es_es: Atributos

source: The bounding box enclosing all data displayed in the Axes.
es_es: La caja delimitadora que contiene todos los datos mostrados en los ejes.

source: The view limits in data coordinates.
es_es: Límites de vista en las coordenadas de datos.

source: Build an Axes in a figure.
es_es: Construye un hacha en una figura.

source: Parameters
es_es: Parámetros

source: Figure
es_es: Figura

source: The Axes is built in the `.Figure` *fig*.
es_es: Los ejes están construidos en el `.Figure` *figura*.

source: [left, bottom, width, height]
es_es: [izquierda, inferior, anchura, altura]

source: The Axes is built in the rectangle *rect*. *rect* is in `.Figure` coordinates.
es_es: Los ejes están construidos en el rectángulo *rect*. *rect* está en coordenadas `.Figure`.

source: **sharex, sharey** : `~.axes.Axes`, optional
es_es: **sharex, compartir** : `~.axes.Axes`, opcional

source: Axes, optional
es_es: Ejes, opcional

source: The x or y `~.matplotlib.axis` is shared with the x or y axis in the input `~.axes.Axes`.
es_es: El eje x o y `~.matplotlib.axis` se comparte con el eje x o y de la entrada `~.axes.Axes`.

source: bool, default: True
es_es: bool, por defecto: True

source: Whether the Axes frame is visible.
es_es: Si el marco de los ejes es visible.

source: float, optional
es_es: float, opcional

source: Set a fixed aspect for the Axes box, i.e. the ratio of height to width. See `~.axes.Axes.set_box_aspect` for details.
es_es: Establece un aspecto fijo para la caja de los ejes, es decir, la relación entre la altura y la anchura. Ver `~.axes.Axes.set_box_aspect` para más detalles.

source: Other optional keyword arguments:
es_es: Otros argumentos opcionales de palabras clave:

source: Property
es_es: Propiedad

source: Description
es_es: Descripción

source: a filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array
es_es: una función de filtro, que toma un arreglo de puntos flotantes (m, n, 3) y un valor de dpi, y devuelve un arreglo (m, n, 3)

source: scalar or None
es_es: escalar o None

source: (float, float) or {'C', 'SW', 'S', 'SE', 'E', 'NE', ...}
es_es: (float, float) o {'C', 'SW', 'S', 'SE', 'E', 'NE', ...}

source: float or None
es_es: float o None

source: Patch or (Path, Transform) or None
es_es: Patch o (Path, Transform) o None

source: :meth:`facecolor <matplotlib.axes.Axes.set_facecolor>` or fc
es_es: :meth:`facecolor <matplotlib.axes.Axes.set_facecolor>` o fc

source: unknown
es_es: desconocido

source: None or bool or float or callable
es_es: None o bool o float o callable

source: [left, bottom, width, height] or `~matplotlib.transforms.Bbox`
es_es: [left, bottom, width, height] o `~matplotlib.transforms.Bbox`

source: float greater than -0.5
es_es: float mayor que -0,5

source: {"linear", "log", "symlog", "logit", ...} or `.ScaleBase`
es_es: {"linear", "log", "symlog", "logit", ...} o `.ScaleBase`

source: float
es_es: de punto flotante (float)

source: Returns
es_es: Devuelve

source: The new `~.axes.Axes` object.
es_es: El nuevo objeto `~.axes.Axes`.

source: Base class for subplots, which are :class:`Axes` instances with additional methods to facilitate generating and manipulating a set of :class:`Axes` within a figure.
es_es: Clase base para subplots, que son instancias :class:`Axes` con métodos adicionales para facilitar la generación y manipulación de un conjunto de :class:`Axes` dentro de una figura.

source: Plotting
es_es: Trazando

source: Basic
es_es: Básico

source: Plot y versus x as lines and/or markers.
es_es: Trazar y versus x como líneas y/o marcadores.

source: :py:obj:`Axes.errorbar <matplotlib.axes.Axes.errorbar>`
es_es: :py:obj:`Ejes.errorbar <matplotlib.axes.Axes.errorbar>`

source: Plot y versus x as lines and/or markers with attached errorbars.
es_es: Trazar y versus x como líneas y/o marcadores con barras de error adjuntas.

source: :py:obj:`Axes.scatter <matplotlib.axes.Axes.scatter>`
es_es: :py:obj:`Ejes.scatter <matplotlib.axes.Axes.scatter>`

source: A scatter plot of *y* vs.
es_es: Una parcela de dispersión de *y* vs.

source: Plot coercing the axis to treat floats as dates.
es_es: Trazar coaccionar el eje para tratar los flotantes como fechas.

source: :py:obj:`Axes.step <matplotlib.axes.Axes.step>`
es_es: :py:obj:`Ejes.step <matplotlib.axes.Axes.step>`

source: Make a step plot.
es_es: Crear una parcela.

source: Make a plot with log scaling on both the x and y axis.
es_es: Crea un gráfico con escalado de troncos tanto en el eje x como en el eje y.

source: Make a plot with log scaling on the x axis.
es_es: Crea un gráfico con escalado de troncos en el eje x.

source: :py:obj:`Axes.semilogy <matplotlib.axes.Axes.semilogy>`
es_es: :py:obj:`Ejes.semilogía <matplotlib.axes.Axes.semilogy>`

source: Make a plot with log scaling on the y axis.
es_es: Crea un gráfico con escalado de troncos en el eje y.

source: :py:obj:`Axes.fill_between <matplotlib.axes.Axes.fill_between>`
es_es: :py:obj:`Ejes.fill_between <matplotlib.axes.Axes.fill_between>`

source: Fill the area between two horizontal curves.
es_es: Rellena el área entre dos curvas horizontales.

source: Fill the area between two vertical curves.
es_es: Rellena el área entre dos curvas verticales.

source: :py:obj:`Axes.bar <matplotlib.axes.Axes.bar>`
es_es: :py:obj:`Ejes.bar <matplotlib.axes.Axes.bar>`

source: Make a bar plot.
es_es: Crear una parcela de barras.

source: Make a horizontal bar plot.
es_es: Crea una parcela de barras horizontal.

source: :py:obj:`Axes.bar_label <matplotlib.axes.Axes.bar_label>`
es_es: :py:obj:`Ejes.bar_label <matplotlib.axes.Axes.bar_label>`

source: Label a bar plot.
es_es: Etiqueta una parcela de barras.

source: :py:obj:`Axes.stem <matplotlib.axes.Axes.stem>`
es_es: :py:obj:`Ejes.stem <matplotlib.axes.Axes.stem>`

source: Create a stem plot.
es_es: Crear una parcela de tallo.

source: Plot identical parallel lines at the given positions.
es_es: Trazar líneas paralelas idénticas en las posiciones dadas.

source: :py:obj:`Axes.pie <matplotlib.axes.Axes.pie>`
es_es: :py:obj:`Ejes.pie <matplotlib.axes.Axes.pie>`

source: Plot a pie chart.
es_es: Trazar un gráfico de pastel.

source: Draw a stacked area plot.
es_es: Dibuja una parcela de área apilada.

source: :py:obj:`Axes.broken_barh <matplotlib.axes.Axes.broken_barh>`
es_es: :py:obj:`Ejes.broken_barh <matplotlib.axes.Axes.broken_barh>`

source: Plot a horizontal sequence of rectangles.
es_es: Trazar una secuencia horizontal de rectángulos.

source: Plot vertical lines at each *x* from *ymin* to *ymax*.
es_es: Trazar líneas verticales en cada *x* de *ymin* a *ymax*.

source: Plot horizontal lines at each *y* from *xmin* to *xmax*.
es_es: Trazar líneas horizontales en cada *y* de *xmin* a *xmax*.

source: :py:obj:`Axes.fill <matplotlib.axes.Axes.fill>`
es_es: :py:obj:`Ejes.fill <matplotlib.axes.Axes.fill>`

source: Plot filled polygons.
es_es: Trazar polígonos llenos.

source: Add a horizontal line across the axis.
es_es: Agrega una línea horizontal a través del eje.

source: Add a horizontal span (rectangle) across the Axes.
es_es: Añade un tramo horizontal (rectángulo) a través de los Ejes.

source: Add a vertical line across the Axes.
es_es: Agrega una línea vertical a través de los ejes.

source: Add a vertical span (rectangle) across the Axes.
es_es: Agrega una envergadura vertical (rectángulo) a través de los ejes.

source: Add an infinitely long straight line.
es_es: Agrega una línea recta infinitamente larga.

source: Spectral
es_es: Espectral

source: Plot the autocorrelation of *x*.
es_es: Grafica la autocorrelación de *x*.

source: :py:obj:`Axes.angle_spectrum <matplotlib.axes.Axes.angle_spectrum>`
es_es: :py:obj:`Ejes.angle_spectrum <matplotlib.axes.Axes.angle_spectrum>`

source: Plot the angle spectrum.
es_es: Grafica el espectro angular.

source: Plot the coherence between *x* and *y*.
es_es: Trazar la coherencia entre *x* y *y*.

source: Plot the cross-spectral density.
es_es: Trazar la densidad espectral cruzada.

source: Plot the magnitude spectrum.
es_es: Trazar el espectro de magnitud.

source: Plot the phase spectrum.
es_es: Trazar el espectro de la fase.

source: Plot the power spectral density.
es_es: Trazar la densidad espectral de potencia.

source: Plot a spectrogram.
es_es: Trazar un espectrográfico.

source: Plot the cross correlation between *x* and *y*.
es_es: Trazar la correlación cruzada entre *x* y *y*.

source: Statistics
es_es: Estadísticas

source: Draw a box and whisker plot.
es_es: Dibuja una caja y una parcela de whisker.

source: Make a violin plot.
es_es: Hacer una parcela de violín.

source: :py:obj:`Axes.violin <matplotlib.axes.Axes.violin>`
es_es: :py:obj:`Ejes.violin <matplotlib.axes.Axes.violin>`

source: Drawing function for violin plots.
es_es: Función de dibujo para parcelas de violín.

source: Drawing function for box and whisker plots.
es_es: Función de dibujo para parcelas de caja y whisker.

source: Binned
es_es: Vinculado

source: Make a 2D hexagonal binning plot of points *x*, *y*.
es_es: Crea una parcela 2D hutonal de puntos *x*, *y*.

source: Plot a histogram.
es_es: Trazar un histograma.

source: Make a 2D histogram plot.
es_es: Crea un histograma 2D.

source: :py:obj:`Axes.stairs <matplotlib.axes.Axes.stairs>`
es_es: :py:obj:`Ejes.stairs <matplotlib.axes.Axes.stairs>`

source: A stepwise constant function as a line with bounding edges or a filled plot.
es_es: Una función constante paso a paso como una línea con bordes delimitadores o una parcela llena.

source: :py:obj:`Axes.clabel <matplotlib.axes.Axes.clabel>`
es_es: :py:obj:`Ejes.clabel <matplotlib.axes.Axes.clabel>`

source: Label a contour plot.
es_es: Etiqueta una parcela de contorno.

source: Plot contour lines.
es_es: Trazar líneas de contorno.

source: Plot filled contours.
es_es: Trazar contornos llenos.

source: 2D arrays
es_es: Arreglos 2D

source: Display data as an image, i.e., on a 2D regular raster.
es_es: Mostrar datos como una imagen, es decir, en un rastro regular 2D.

source: Plot the values of a 2D matrix or array as color-coded image.
es_es: Trazar los valores de una matriz 2D o matriz como imagen codificada por color.

source: :py:obj:`Axes.pcolor <matplotlib.axes.Axes.pcolor>`
es_es: :py:obj:`Ejes.pcolor <matplotlib.axes.Axes.pcolor>`

source: Create a pseudocolor plot with a non-regular rectangular grid.
es_es: Crea una gráfica pseudocolor con una cuadrícula rectangular no regular.

source: :py:obj:`Axes.pcolorfast <matplotlib.axes.Axes.pcolorfast>`
es_es: :py:obj:`Ejes.pcolorfast <matplotlib.axes.Axes.pcolorfast>`

source: :py:obj:`Axes.pcolormesh <matplotlib.axes.Axes.pcolormesh>`
es_es: :py:obj:`Ejes.pcolormesh <matplotlib.axes.Axes.pcolormesh>`

source: :py:obj:`Axes.spy <matplotlib.axes.Axes.spy>`
es_es: :py:obj:`Ejes.spy <matplotlib.axes.Axes.spy>`

source: Plot the sparsity pattern of a 2D array.
es_es: Trazar el patrón de esparidad de una matriz 2D.

source: Unstructured triangles
es_es: Triángulos no estructurados

source: :py:obj:`Axes.tripcolor <matplotlib.axes.Axes.tripcolor>`
es_es: :py:obj:`Ejes.tripcolor <matplotlib.axes.Axes.tripcolor>`

source: Create a pseudocolor plot of an unstructured triangular grid.
es_es: Crea un gráfico pseudocolor de una cuadrícula triangular no estructurada.

source: Draw a unstructured triangular grid as lines and/or markers.
es_es: Dibuja una cuadrícula triangular no estructurada como líneas y/o marcadores.

source: :py:obj:`Axes.tricontour <matplotlib.axes.Axes.tricontour>`
es_es: :py:obj:`Ejes.tricontour <matplotlib.axes.Axes.tricontour>`

source: Draw contour lines on an unstructured triangular grid.
es_es: Dibuja líneas de contorno sobre una cuadrícula triangular no estructurada.

source: :py:obj:`Axes.tricontourf <matplotlib.axes.Axes.tricontourf>`
es_es: :py:obj:`Ejes.tricontourf <matplotlib.axes.Axes.tricontourf>`

source: Draw contour regions on an unstructured triangular grid.
es_es: Dibujar las regiones de contorno en una red triangular no estructurada.

source: Text and annotations
es_es: Texto y anotaciones

source: Annotate the point *xy* with text *text*.
es_es: Anotar el punto *xy* con el texto *text*.

source: :py:obj:`Axes.text <matplotlib.axes.Axes.text>`
es_es: :py:obj:`Ejes.text <matplotlib.axes.Axes.text>`

source: Add text to the Axes.
es_es: Añadir texto a los ejes.

source: :py:obj:`Axes.table <matplotlib.axes.Axes.table>`
es_es: :py:obj:`Ejes.table <matplotlib.axes.Axes.table>`

source: Add a table to an `~.axes.Axes`.
es_es: Añade una tabla a un `~.axes.Axes`.

source: :py:obj:`Axes.arrow <matplotlib.axes.Axes.arrow>`
es_es: :py:obj:`Ejes.arrow <matplotlib.axes.Axes.arrow>`

source: Add an arrow to the Axes.
es_es: Agrega una flecha a los ejes.

source: Add a child inset Axes to this existing Axes.
es_es: Agrega un eje de entrada hijo a este eje existente.

source: Add an inset indicator to the Axes.
es_es: Agrega un indicador de recubrimiento a los ejes.

source: :py:obj:`Axes.indicate_inset_zoom <matplotlib.axes.Axes.indicate_inset_zoom>`
es_es: :py:obj:`Ejes.indicate_inset_zoom <matplotlib.axes.Axes.indicate_inset_zoom>`

source: Add an inset indicator rectangle to the Axes based on the axis limits for an *inset_ax* and draw connectors between *inset_ax* and the rectangle.
es_es: Agrega un rectángulo de indicador de entrada a los ejes basado en los límites del eje para un *inset_ax* y dibuja los conectores entre *inset_ax* y el rectángulo.

source: :py:obj:`Axes.secondary_xaxis <matplotlib.axes.Axes.secondary_xaxis>`
es_es: :py:obj:`Ejes.secondary_xaxis <matplotlib.axes.Axes.secondary_xaxis>`

source: Add a second x-axis to this Axes.
es_es: Agrega un segundo eje x a este eje.

source: :py:obj:`Axes.secondary_yaxis <matplotlib.axes.Axes.secondary_yaxis>`
es_es: :py:obj:`Ejes.secondary_yaxis <matplotlib.axes.Axes.secondary_yaxis>`

source: Add a second y-axis to this Axes.
es_es: Agrega un segundo eje Y a este eje.

source: Vector fields
es_es: Campos vectoriales

source: :py:obj:`Axes.barbs <matplotlib.axes.Axes.barbs>`
es_es: :py:obj:`Ejes.barbs <matplotlib.axes.Axes.barbs>`

source: Plot a 2D field of barbs.
es_es: Trazar un campo 2D de barbas.

source: Plot a 2D field of arrows.
es_es: Trazar un campo 2D de flechas.

source: Add a key to a quiver plot.
es_es: Agrega una clave a una parcela de quiver.

source: :py:obj:`Axes.streamplot <matplotlib.axes.Axes.streamplot>`
es_es: :py:obj:`Ejes.streamplot <matplotlib.axes.Axes.streamplot>`

source: Draw streamlines of a vector flow.
es_es: Dibuja secuencias de un flujo vectorial.

source: Clearing
es_es: Limpiando

source: Clear the Axes.
es_es: Despeja los ejes.

source: :py:obj:`Axes.clear <matplotlib.axes.Axes.clear>`
es_es: :py:obj:`Ejes.clear <matplotlib.axes.Axes.clear>`

source: Appearance
es_es: Apariencia

source: :py:obj:`Axes.axis <matplotlib.axes.Axes.axis>`
es_es: :py:obj:`Ejes.axis <matplotlib.axes.Axes.axis>`

source: Convenience method to get or set some axis properties.
es_es: Método de conveniencia para obtener o establecer algunas propiedades de ejes.

source: :py:obj:`Axes.set_axis_off <matplotlib.axes.Axes.set_axis_off>`
es_es: :py:obj:`Ejes.set_axis_off <matplotlib.axes.Axes.set_axis_off>`

source: Turn the x- and y-axis off.
es_es: Desactiva el eje x y y.

source: :py:obj:`Axes.set_axis_on <matplotlib.axes.Axes.set_axis_on>`
es_es: :py:obj:`Ejes.set_axis_on <matplotlib.axes.Axes.set_axis_on>`

source: Turn the x- and y-axis on.
es_es: Enciende el eje x y y-.

source: Set whether the Axes rectangle patch is drawn.
es_es: Establecer si el parche rectángulo de ejes está dibujado.

source: Get whether the Axes rectangle patch is drawn.
es_es: Obtenga si el parche del rectángulo de ejes está dibujado.

source: :py:obj:`Axes.set_axisbelow <matplotlib.axes.Axes.set_axisbelow>`
es_es: :py:obj:`Ejes.set_axisbelow <matplotlib.axes.Axes.set_axisbelow>`

source: Set whether axis ticks and gridlines are above or below most artists.
es_es: Establezca si los ticks de eje y líneas de cuadrícula están por encima o por debajo de la mayoría de los artistas.

source: :py:obj:`Axes.get_axisbelow <matplotlib.axes.Axes.get_axisbelow>`
es_es: :py:obj:`Ejes.get_axisbelow <matplotlib.axes.Axes.get_axisbelow>`

source: Get whether axis ticks and gridlines are above or below most artists.
es_es: Obtén si los ticks de eje y líneas de cuadrícula están por encima o por debajo de la mayoría de los artistas.

source: Configure the grid lines.
es_es: Configurar las líneas de la cuadrícula.

source: :py:obj:`Axes.get_facecolor <matplotlib.axes.Axes.get_facecolor>`
es_es: :py:obj:`Ejes.get_facecolor <matplotlib.axes.Axes.get_facecolor>`

source: Get the facecolor of the Axes.
es_es: Consigue el color de cara de los ejes.

source: Set the facecolor of the Axes.
es_es: Establecer el color de cara de los ejes.

source: Property cycle
es_es: Ciclo de propiedad

source: :py:obj:`Axes.set_prop_cycle <matplotlib.axes.Axes.set_prop_cycle>`
es_es: :py:obj:`Ejes.set_prop_cycle <matplotlib.axes.Axes.set_prop_cycle>`

source: Set the property cycle of the Axes.
es_es: Establece el ciclo de propiedades de los ejes.

source: Axis / limits
es_es: Eje / límites

source: Return the XAxis instance.
es_es: Devuelve la instancia de XAxis.

source: Return the YAxis instance.
es_es: Devuelve la instancia de YAxis.

source: Axis limits and direction
es_es: Límites y dirección del eje

source: Invert the x-axis.
es_es: Invertir el eje x.

source: :py:obj:`Axes.xaxis_inverted <matplotlib.axes.Axes.xaxis_inverted>`
es_es: :py:obj:`Ejes.xaxis_inverted <matplotlib.axes.Axes.xaxis_inverted>`

source: Return whether the xaxis is oriented in the "inverse" direction.
es_es: Devuelve si el xaxis está orientado en la dirección "inversa".

source: Invert the y-axis.
es_es: Invertir el eje y.

source: :py:obj:`Axes.yaxis_inverted <matplotlib.axes.Axes.yaxis_inverted>`
es_es: :py:obj:`Ejes.yaxis_inverted <matplotlib.axes.Axes.yaxis_inverted>`

source: Return whether the yaxis is oriented in the "inverse" direction.
es_es: Devuelve si el eje está orientado en la dirección "inversa".

source: :py:obj:`Axes.set_xlim <matplotlib.axes.Axes.set_xlim>`
es_es: :py:obj:`Ejes.set_xlim <matplotlib.axes.Axes.set_xlim>`

source: Set the x-axis view limits.
es_es: Establece los límites de la vista del eje x.

source: Return the x-axis view limits.
es_es: Devuelve los límites de la vista del eje x.

source: :py:obj:`Axes.set_ylim <matplotlib.axes.Axes.set_ylim>`
es_es: :py:obj:`Ejes.set_ylim <matplotlib.axes.Axes.set_ylim>`

source: Set the y-axis view limits.
es_es: Define los límites de la vista del eje y.

source: Return the y-axis view limits.
es_es: Devuelve los límites de la vista del eje y.

source: Extend the `~.Axes.dataLim` Bbox to include the given points.
es_es: Extiende el cuadro `~.Axes.dataLim` para incluir los puntos dados.

source: Set the lower and upper numerical bounds of the x-axis.
es_es: Establece los límites numéricos inferiores y superiores del eje x.

source: Return the lower and upper x-axis bounds, in increasing order.
es_es: Devuelve los límites de eje x inferiores y superiores, en orden creciente.

source: :py:obj:`Axes.set_ybound <matplotlib.axes.Axes.set_ybound>`
es_es: :py:obj:`Ejes.set_ybound <matplotlib.axes.Axes.set_ybound>`

source: Set the lower and upper numerical bounds of the y-axis.
es_es: Establece los límites numéricos inferiores y superiores del eje y-.

source: :py:obj:`Axes.get_ybound <matplotlib.axes.Axes.get_ybound>`
es_es: :py:obj:`Ejes.get_ybound <matplotlib.axes.Axes.get_ybound>`

source: Return the lower and upper y-axis bounds, in increasing order.
es_es: Devuelve los límites del eje inferior y superior, en orden creciente.

source: Axis labels, title, and legend
es_es: Ejes etiquetas, título y leyenda

source: Set the label for the x-axis.
es_es: Establece la etiqueta para el eje x.

source: Get the xlabel text string.
es_es: Obtener la cadena de texto xlab.

source: Set the label for the y-axis.
es_es: Define la etiqueta para el eje y.

source: Get the ylabel text string.
es_es: Obtener la cadena de texto ylabel.

source: Set a title for the Axes.
es_es: Establece un título para los ejes.

source: Get an Axes title.
es_es: Obtén un título de Haces.

source: Place a legend on the Axes.
es_es: Coloca una leyenda en los ejes.

source: Return the `.Legend` instance, or None if no legend is defined.
es_es: Devuelve la instancia de `.Legend`, o Ninguno si no hay leyenda definida.

source: Return handles and labels for legend
es_es: Devuelve asas y etiquetas para la leyenda

source: Axis scales
es_es: Escalas del eje

source: Set the x-axis scale.
es_es: Define la escala del eje x.

source: Return the xaxis' scale (as a str).
es_es: Devuelve la escala del xaxis (como una str).

source: :py:obj:`Axes.set_yscale <matplotlib.axes.Axes.set_yscale>`
es_es: :py:obj:`Ejes.set_yscale <matplotlib.axes.Axes.set_yscale>`

source: Set the y-axis scale.
es_es: Define la escala del eje y.

source: Return the yaxis' scale (as a str).
es_es: Devuelve la escala de los yaxis (como una str).

source: Autoscaling and margins
es_es: Autoescalado y márgenes

source: When autoscaling, whether to obey all `Artist.sticky_edges`.
es_es: Al autoescalar, si obedecer a todos los `Artist.sticky_edges`.

source: :py:obj:`Axes.margins <matplotlib.axes.Axes.margins>`
es_es: :py:obj:`Ejes.margins <matplotlib.axes.Axes.margins>`

source: Set or retrieve autoscaling margins.
es_es: Establece o recupera los márgenes de autoescalado.

source: Set padding of X data limits prior to autoscaling.
es_es: Define el relleno de los límites de datos X antes de autoescalar.

source: :py:obj:`Axes.set_ymargin <matplotlib.axes.Axes.set_ymargin>`
es_es: :py:obj:`Ejes.set_ymargin <matplotlib.axes.Axes.set_ymargin>`

source: Set padding of Y data limits prior to autoscaling.
es_es: Define los límites de datos en Y antes de autoescalar.

source: Recompute the data limits based on current artists.
es_es: Recalcular los límites de datos basados en artistas actuales.

source: Autoscale the axis view to the data (toggle).
es_es: Autoescalar la vista del eje a los datos (toggle).

source: :py:obj:`Axes.autoscale_view <matplotlib.axes.Axes.autoscale_view>`
es_es: :py:obj:`Ejes.autoscale_view <matplotlib.axes.Axes.autoscale_view>`

source: Autoscale the view limits using the data limits.
es_es: Autoescalar los límites de la vista usando los límites de datos.

source: Set whether autoscaling is applied to each axis on the next draw or call to `.Axes.autoscale_view`.
es_es: Establece si la autoescalado se aplica a cada eje en el siguiente dibujo o llama a `.Axes.autoscale_view`.

source: :py:obj:`Axes.get_autoscale_on <matplotlib.axes.Axes.get_autoscale_on>`
es_es: :py:obj:`Ejes.get_autoscale_on <matplotlib.axes.Axes.get_autoscale_on>`
