Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/axes_api.po
Languages: es_es

source: Return True if each axis is autoscaled, False otherwise.
es_es: Devuelve Verdadero si cada eje es autoescalado, False de otra manera.

source: Set whether the x-axis is autoscaled on the next draw or call to `.Axes.autoscale_view`.
es_es: Establece si el eje x es autoescalado en el siguiente dibujo o llama a `.Axes.autoscale_view`.

source: :py:obj:`Axes.get_autoscalex_on <matplotlib.axes.Axes.get_autoscalex_on>`
es_es: :py:obj:`Ejes.get_autoscalex_on <matplotlib.axes.Axes.get_autoscalex_on>`

source: Return whether the x-axis is autoscaled.
es_es: Devuelve si el eje x está autoescalado.

source: Set whether the y-axis is autoscaled on the next draw or call to `.Axes.autoscale_view`.
es_es: Establece si el eje Y es autoescalado en el siguiente dibujo o llama a `.Axes.autoscale_view`.

source: :py:obj:`Axes.get_autoscaley_on <matplotlib.axes.Axes.get_autoscaley_on>`
es_es: :py:obj:`Ejes.get_autoscaley_on <matplotlib.axes.Axes.get_autoscaley_on>`

source: Return whether the y-axis is autoscaled.
es_es: Devuelve si el eje Y está autoescalado.

source: Aspect ratio
es_es: Relación de aspecto

source: :py:obj:`Axes.apply_aspect <matplotlib.axes.Axes.apply_aspect>`
es_es: :py:obj:`Ejes.apply_aspect <matplotlib.axes.Axes.apply_aspect>`

source: Adjust the Axes for a specified data aspect ratio.
es_es: Ajuste los ejes para una relación de aspecto de datos especificada.

source: Set the aspect ratio of the axes scaling, i.e. y/x-scale.
es_es: Establece la relación de aspecto de la escala de los ejes, es decir, la escala y/x.

source: :py:obj:`Axes.get_aspect <matplotlib.axes.Axes.get_aspect>`
es_es: :py:obj:`Ejes.get_aspect <matplotlib.axes.Axes.get_aspect>`

source: Return the aspect ratio of the axes scaling.
es_es: Devuelve la relación de aspecto de la escala de los ejes.

source: Set the Axes box aspect, i.e. the ratio of height to width.
es_es: Establece el aspecto de la caja de ejes, es decir, la relación de altura a anchura.

source: Return the Axes box aspect, i.e. the ratio of height to width.
es_es: Devuelve el aspecto de la caja de ejes, es decir, la proporción de altura a anchura.

source: :py:obj:`Axes.set_adjustable <matplotlib.axes.Axes.set_adjustable>`
es_es: :py:obj:`Axes.set_ajustable <matplotlib.axes.Axes.set_adjustable>`

source: Set how the Axes adjusts to achieve the required aspect ratio.
es_es: Establecer cómo se ajustan los ejes para lograr la relación de aspecto requerida.

source: :py:obj:`Axes.get_adjustable <matplotlib.axes.Axes.get_adjustable>`
es_es: :py:obj:`Ejes.get_ajustable <matplotlib.axes.Axes.get_adjustable>`

source: Return whether the Axes will adjust its physical dimension ('box') or its data limits ('datalim') to achieve the desired aspect ratio.
es_es: Devuelve si los ejes ajustarán su dimensión física ('caja') o sus límites de datos ('datalim') para lograr la relación de aspecto deseada.

source: Ticks and tick labels
es_es: Ticks y etiquetas de marca

source: Set the xaxis' tick locations and optionally labels.
es_es: Establece las ubicaciones de las marcas de xaxis y opcionalmente las etiquetas.

source: :py:obj:`Axes.get_xticks <matplotlib.axes.Axes.get_xticks>`
es_es: :py:obj:`Ejes.get_xticks <matplotlib.axes.Axes.get_xticks>`

source: Return the xaxis' tick locations in data coordinates.
es_es: Devuelve las ubicaciones de ticks de xaxis en las coordenadas de datos.

source: Set the xaxis' labels with list of string labels.
es_es: Establece las etiquetas de xaxis con una lista de etiquetas de cadenas.

source: :py:obj:`Axes.get_xticklabels <matplotlib.axes.Axes.get_xticklabels>`
es_es: :py:obj:`Ejes.get_xticklabels <matplotlib.axes.Axes.get_xticklabels>`

source: Get the xaxis' tick labels.
es_es: Obtener las etiquetas de ticks de xaxis.

source: :py:obj:`Axes.get_xmajorticklabels <matplotlib.axes.Axes.get_xmajorticklabels>`
es_es: :py:obj:`Ejes.get_xmajorticklabels <matplotlib.axes.Axes.get_xmajorticklabels>`

source: Return the xaxis' major tick labels, as a list of `~.text.Text`.
es_es: Devuelve las etiquetas de tick más importantes de xaxis, como una lista de `~.text.Text`.

source: Return the xaxis' minor tick labels, as a list of `~.text.Text`.
es_es: Devuelve las etiquetas de tick menores de xaxis, como una lista de `~.text.Text`.

source: Return the xaxis' grid lines as a list of `.Line2D`\s.
es_es: Devuelve las líneas de cuadrícula de xaxis como una lista de `.Line2D`\s.

source: Return the xaxis' tick lines as a list of `.Line2D`\s.
es_es: Devuelve las líneas de tick de xaxis como una lista de `.Line2D`\s.

source: Set up axis ticks and labels to treat data along the xaxis as dates.
es_es: Establezca etiquetas y ticks de eje para tratar los datos a lo largo del xaxis como fechas.

source: :py:obj:`Axes.set_yticks <matplotlib.axes.Axes.set_yticks>`
es_es: :py:obj:`Ejes.set_yticks <matplotlib.axes.Axes.set_yticks>`

source: Set the yaxis' tick locations and optionally labels.
es_es: Establece las ubicaciones de las marcas yaxis y opcionalmente las etiquetas.

source: :py:obj:`Axes.get_yticks <matplotlib.axes.Axes.get_yticks>`
es_es: :py:obj:`Ejes.get_yticks <matplotlib.axes.Axes.get_yticks>`

source: Return the yaxis' tick locations in data coordinates.
es_es: Devuelve las ubicaciones de ticks de yaxis en las coordenadas de datos.

source: :py:obj:`Axes.set_yticklabels <matplotlib.axes.Axes.set_yticklabels>`
es_es: :py:obj:`Ejes.set_yticklabels <matplotlib.axes.Axes.set_yticklabels>`

source: Set the yaxis' labels with list of string labels.
es_es: Establece las etiquetas de yaxis con una lista de etiquetas de cadenas.

source: :py:obj:`Axes.get_yticklabels <matplotlib.axes.Axes.get_yticklabels>`
es_es: :py:obj:`Ejes.get_yticklabels <matplotlib.axes.Axes.get_yticklabels>`

source: Get the yaxis' tick labels.
es_es: Obtener las etiquetas de garrapata de yaxis.

source: :py:obj:`Axes.get_ymajorticklabels <matplotlib.axes.Axes.get_ymajorticklabels>`
es_es: :py:obj:`Ejes.get_ymajority ticklabels <matplotlib.axes.Axes.get_ymajorticklabels>`

source: Return the yaxis' major tick labels, as a list of `~.text.Text`.
es_es: Devuelve las etiquetas de tick más importantes de yaxis, como una lista de `~.text.Text`.

source: :py:obj:`Axes.get_yminorticklabels <matplotlib.axes.Axes.get_yminorticklabels>`
es_es: :py:obj:`Ejes.get_yminorticklabels <matplotlib.axes.Axes.get_yminorticklabels>`

source: Return the yaxis' minor tick labels, as a list of `~.text.Text`.
es_es: Devuelve las etiquetas de tick menores de yaxis, como una lista de `~.text.Text`.

source: Return the yaxis' grid lines as a list of `.Line2D`\s.
es_es: Devuelve las líneas de cuadrícula de yaxis como una lista de `.Line2D`\s.

source: Return the yaxis' tick lines as a list of `.Line2D`\s.
es_es: Devuelve las líneas de ticks de yaxis como una lista de `.Line2D`\s.

source: Set up axis ticks and labels to treat data along the yaxis as dates.
es_es: Establezca etiquetas y ticks de eje para tratar los datos a lo largo del eje como fechas.

source: :py:obj:`Axes.minorticks_off <matplotlib.axes.Axes.minorticks_off>`
es_es: :py:obj:`Ejes.minorticks_off <matplotlib.axes.Axes.minorticks_off>`

source: Remove minor ticks from the Axes.
es_es: Elimina ticks menores de los ejes.

source: :py:obj:`Axes.minorticks_on <matplotlib.axes.Axes.minorticks_on>`
es_es: :py:obj:`Ejes.minorticks_on <matplotlib.axes.Axes.minorticks_on>`

source: Display minor ticks on the Axes.
es_es: Mostrar ticks menores en los ejes.

source: Configure the `.ScalarFormatter` used by default for linear axes.
es_es: Configura el `.ScalarFormatter` usado por defecto para los ejes lineales.

source: Change the appearance of ticks, tick labels, and gridlines.
es_es: Cambia la apariencia de ticks, etiquetas de ticks y cuadrículas.

source: Control behavior of major tick locators.
es_es: Controlar el comportamiento de los principales localizadores de tick.

source: Units
es_es: Unidades

source: Convert *x* using the unit type of the xaxis.
es_es: Convierte *x* usando el tipo de unidad del xaxis.

source: Convert *y* using the unit type of the yaxis.
es_es: Convierte *y* usando el tipo de unidad del yaxis.

source: :py:obj:`Axes.have_units <matplotlib.axes.Axes.have_units>`
es_es: :py:obj:`Ejes.have_units <matplotlib.axes.Axes.have_units>`

source: Return whether units are set on any axis.
es_es: Devuelve si las unidades están definidas en cualquier eje.

source: Adding artists
es_es: Añadiendo artistas

source: Add an `.Artist` to the Axes; return the artist.
es_es: Añade un `.Artist` a los Ejes; devuelve el artista.

source: :py:obj:`Axes.add_child_axes <matplotlib.axes.Axes.add_child_axes>`
es_es: :py:obj:`Ejes.add_child_axes <matplotlib.axes.Axes.add_child_axes>`

source: Add an `.AxesBase` to the Axes' children; return the child Axes.
es_es: Agregue un `.AxesBase` a los hijos de los ejes; devuelva los ejes hijos.

source: Add a `.Collection` to the Axes; return the collection.
es_es: Añade un `.Collection` a los ejes; devuelve la colección.

source: Add a `.Container` to the axes' containers; return the container.
es_es: Agrega un `.Container` a los contenedores de los ejes; devuelve el contenedor.

source: :py:obj:`Axes.add_image <matplotlib.axes.Axes.add_image>`
es_es: :py:obj:`Ejes.add_image <matplotlib.axes.Axes.add_image>`

source: Add an `.AxesImage` to the Axes; return the image.
es_es: Agrega un `.AxesImage` a los ejes; devuelve la imagen.

source: Add a `.Line2D` to the Axes; return the line.
es_es: Agrega un `.Line2D` a los ejes; devuelve la línea.

source: Add a `.Patch` to the Axes; return the patch.
es_es: Añade un `.Patch` a los ejes; devuelve el parche.

source: Add a `.Table` to the Axes; return the table.
es_es: Agrega un `.Table` a los ejes; devuelve la tabla.

source: Twinning and sharing
es_es: Twinning y compartir

source: Create a twin Axes sharing the xaxis.
es_es: Crea un eje gemelo compartiendo el xaxis.

source: Create a twin Axes sharing the yaxis.
es_es: Crea un eje gemelo compartiendo el yaxis.

source: :py:obj:`Axes.sharex <matplotlib.axes.Axes.sharex>`
es_es: :py:obj:`Ejes.sharex <matplotlib.axes.Axes.sharex>`

source: Share the x-axis with *other*.
es_es: Comparte el eje x con *otro*.

source: :py:obj:`Axes.sharey <matplotlib.axes.Axes.sharey>`
es_es: :py:obj:`Ejes.sharey <matplotlib.axes.Axes.sharey>`

source: Share the y-axis with *other*.
es_es: Comparte el eje Y con *otro*.

source: :py:obj:`Axes.get_shared_x_axes <matplotlib.axes.Axes.get_shared_x_axes>`
es_es: :py:obj:`Ejes.get_shared_x_x_axes <matplotlib.axes.Axes.get_shared_x_axes>`

source: Return a reference to the shared axes Grouper object for x axes.
es_es: Devuelve una referencia al objeto Grupoejes compartidos para x ejes.

source: :py:obj:`Axes.get_shared_y_axes <matplotlib.axes.Axes.get_shared_y_axes>`
es_es: :py:obj:`Ejes.get_shared_y_axes <matplotlib.axes.Axes.get_shared_y_axes>`

source: Return a reference to the shared axes Grouper object for y axes.
es_es: Devuelve una referencia al objeto agrupador de ejes compartidos para los ejes y.

source: Axes position
es_es: Posición de los ejes

source: :py:obj:`Axes.get_anchor <matplotlib.axes.Axes.get_anchor>`
es_es: :py:obj:`Ejes.get_anchor <matplotlib.axes.Axes.get_anchor>`

source: Get the anchor location.
es_es: Obtener el anclaje.

source: Define the anchor location.
es_es: Definir la ubicación del anclaje.

source: :py:obj:`Axes.get_axes_locator <matplotlib.axes.Axes.get_axes_locator>`
es_es: :py:obj:`Ejes.get_axes_locator <matplotlib.axes.Axes.get_axes_locator>`

source: Return the axes_locator.
es_es: Devuelve los ejes_locator.

source: Set the Axes locator.
es_es: Establecer el localizador de ejes.

source: :py:obj:`Axes.reset_position <matplotlib.axes.Axes.reset_position>`
es_es: :py:obj:`Ejes.reset_position <matplotlib.axes.Axes.reset_position>`

source: Reset the active position to the original position.
es_es: Restablece la posición activa a la posición original.

source: Return the position of the Axes within the figure as a `.Bbox`.
es_es: Devuelve la posición de los ejes dentro de la figura como un `.Bbox`.

source: Set the Axes position.
es_es: Establecer la posición de los ejes.

source: Async/event based
es_es: Async/evento basado en

source: Whether the artist is 'stale' and needs to be re-drawn for the output to match the internal state of the artist.
es_es: Si el artista es 'stale' y necesita ser redibujado para que la salida coincida con el estado interno del artista.

source: :py:obj:`Axes.pchanged <matplotlib.axes.Axes.pchanged>`
es_es: :py:obj:`Ejes.pchanged <matplotlib.axes.Axes.pchanged>`

source: Call all of the registered callbacks.
es_es: Llama a todos los callbacks registrados.

source: Add a callback function that will be called whenever one of the `.Artist`'s properties changes.
es_es: Añade una función callback que será llamada cada vez que cambie una de las propiedades de `.Artist`.

source: Remove a callback based on its observer id.
es_es: Eliminar una devolución de llamada basada en su id de observador.

source: Interactive
es_es: Interactivo

source: Return whether this Axes supports any pan/zoom button functionality.
es_es: Devuelve si estos ejes soportan cualquier funcionalidad de botón de acercamiento/pan.

source: :py:obj:`Axes.can_zoom <matplotlib.axes.Axes.can_zoom>`
es_es: :py:obj:`Ejes.can_zoom <matplotlib.axes.Axes.can_zoom>`

source: Return whether this Axes supports the zoom box button functionality.
es_es: Devuelve si estos ejes soportan la funcionalidad del botón de la caja de zoom.

source: Get whether the Axes responds to navigation commands.
es_es: Obtener si los ejes responden a los comandos de navegación.

source: Set whether the Axes responds to navigation toolbar commands.
es_es: Ajuste si los ejes responden a los comandos de la barra de navegación.

source: Get the navigation toolbar button status: 'PAN', 'ZOOM', or None.
es_es: Obtener el estado del botón de la barra de navegación: 'PAN', 'ZOOM' o ninguno.

source: Set the navigation toolbar button status.
es_es: Establecer el estado del botón de la barra de navegación.

source: :py:obj:`Axes.start_pan <matplotlib.axes.Axes.start_pan>`
es_es: :py:obj:`Ejes.start_pan <matplotlib.axes.Axes.start_pan>`

source: Called when a pan operation has started.
es_es: Invocado cuando se ha iniciado una operación.

source: :py:obj:`Axes.drag_pan <matplotlib.axes.Axes.drag_pan>`
es_es: :py:obj:`Ejes.drag_pan <matplotlib.axes.Axes.drag_pan>`

source: Called when the mouse moves during a pan operation.
es_es: Se invoca cuando el ratón se mueve durante una operación de desplazamiento.

source: Called when a pan operation completes (when the mouse button is up.)
es_es: Se invoca cuando se completa una operación de desplazamiento (cuando el botón del ratón está arriba)

source: Return a format string formatting the *x*, *y* coordinates.
es_es: Devuelve una cadena de formato que formatea las coordenadas *x*, *y*.

source: Return a string representation of *data*.
es_es: Devuelve una representación de cadena de *datos*.

source: Return *x* formatted as an x-value.
es_es: Devuelve *x* formateado como un valor x-.

source: Return *y* formatted as an y-value.
es_es: Devuelve *y* formateado como un valor y-.

source: If this property is set to *True*, the artist will be queried for custom context information when the mouse cursor moves over it.
es_es: Si esta propiedad está establecida a *True*, el artist será consultado para obtener información de contexto personalizada cuando el cursor del ratón se mueva sobre él.

source: :py:obj:`Axes.in_axes <matplotlib.axes.Axes.in_axes>`
es_es: :py:obj:`Ejes.in_axes <matplotlib.axes.Axes.in_axes>`

source: Return whether the given event (in display coords) is in the Axes.
es_es: Devuelve si el evento dado (en las coordenadas de visualización) está en los ejes.

source: Test whether the artist contains the mouse event.
es_es: Prueba si el artist contiene el evento del ratón.

source: :py:obj:`Axes.contains_point <matplotlib.axes.Axes.contains_point>`
es_es: :py:obj:`Ejes.contains_point <matplotlib.axes.Axes.contains_point>`

source: Return whether *point* (pair of pixel coordinates) is inside the axes patch.
es_es: Devuelve si *punto* (par de coordenadas de píxeles) está dentro del parche de ejes.

source: :py:obj:`Axes.get_cursor_data <matplotlib.axes.Axes.get_cursor_data>`
es_es: :py:obj:`Ejes.get_cursor_data <matplotlib.axes.Axes.get_cursor_data>`

source: Return the cursor data for a given event.
es_es: Devuelve los datos del cursor para un evento dado.

source: Children
es_es: Niños

source: :py:obj:`Axes.get_children <matplotlib.axes.Axes.get_children>`
es_es: :py:obj:`Ejes.get_children <matplotlib.axes.Axes.get_children>`

source: Return a list of the child `.Artist`\s of this `.Artist`.
es_es: Devuelve una lista del hijo `.Artist`\s de este `.Artist`.

source: Return a list of `.AxesImage`\s contained by the Axes.
es_es: Devuelve una lista de `.AxesImage`\s contenidos en los ejes.

source: Return a list of lines contained by the Axes.
es_es: Devuelve una lista de líneas contenidas en los Ejes.

source: Find artist objects.
es_es: Buscar objetos de artista.

source: Drawing
es_es: Dibujo

source: :py:obj:`Axes.draw <matplotlib.axes.Axes.draw>`
es_es: :py:obj:`Ejes.draw <matplotlib.axes.Axes.draw>`

source: Draw the Artist (and its children) using the given renderer.
es_es: Dibuja el Artist (y sus hijos) usando el renderizador dado.

source: Efficiently redraw a single artist.
es_es: Redibujar eficientemente a un único artista.

source: :py:obj:`Axes.redraw_in_frame <matplotlib.axes.Axes.redraw_in_frame>`
es_es: :py:obj:`Ejes.redraw_in_frame <matplotlib.axes.Axes.redraw_in_frame>`

source: Efficiently redraw Axes data, but not axis ticks, labels, etc.
es_es: Redibujar eficientemente los datos de los ejes, pero no los ticks de ejes, etiquetas, etc.

source: Return the zorder value below which artists will be rasterized.
es_es: Devuelve el valor del zorder debajo del cual los artistas serán rasterizados.

source: Set the zorder threshold for rasterization for vector graphics output.
es_es: Establece el umbral de zorder para rasterización de la salida de gráficos vectoriales.

source: Return the Axes bounding box in display space; *args* and *kwargs* are empty.
es_es: Devuelve el límite de ejes en el espacio de la pantalla; *args* y *kwargs* están vacíos.

source: Return the tight bounding box of the axes, including axis and their decorators (xlabel, title, etc).
es_es: Devuelve la caja de límites apretada de los ejes, incluyendo el eje y sus decoradores (xlabel, título, etc).

source: Projection
es_es: Proyección

source: Methods used by `~matplotlib.axis.Axis` that must be overridden for non-rectilinear Axes.
es_es: Métodos usados por `~matplotlib.axis.Axis` que deben ser anulados para ejes no rectilineales.

source: :py:obj:`Axes.name <matplotlib.axes.Axes.name>`
es_es: :py:obj:`Ejes.name <matplotlib.axes.Axes.name>`

source: :py:obj:`Axes.get_xaxis_transform <matplotlib.axes.Axes.get_xaxis_transform>`
es_es: :py:obj:`Ejes.get_xaxis_transform <matplotlib.axes.Axes.get_xaxis_transform>`

source: Get the transformation used for drawing x-axis labels, ticks and gridlines.
es_es: Obtener la transformación usada para dibujar etiquetas de eje x, ticks y cuadrículas.

source: :py:obj:`Axes.get_yaxis_transform <matplotlib.axes.Axes.get_yaxis_transform>`
es_es: :py:obj:`Ejes.get_yaxis_transform <matplotlib.axes.Axes.get_yaxis_transform>`

source: Get the transformation used for drawing y-axis labels, ticks and gridlines.
es_es: Obtener la transformación utilizada para etiquetas, ticks y gridlines de eje y dibujos.

source: :py:obj:`Axes.get_data_ratio <matplotlib.axes.Axes.get_data_ratio>`
es_es: :py:obj:`Ejes.get_data_ratio <matplotlib.axes.Axes.get_data_ratio>`

source: Return the aspect ratio of the scaled data.
es_es: Devuelve la relación de aspecto de los datos escalados.

source: :py:obj:`Axes.get_xaxis_text1_transform <matplotlib.axes.Axes.get_xaxis_text1_transform>`
es_es: :py:obj:`Ejes.get_xaxis_text1_transform <matplotlib.axes.Axes.get_xaxis_text1_transform>`

source: :py:obj:`Axes.get_xaxis_text2_transform <matplotlib.axes.Axes.get_xaxis_text2_transform>`
es_es: :py:obj:`Ejes.get_xaxis_text2_transform <matplotlib.axes.Axes.get_xaxis_text2_transform>`

source: :py:obj:`Axes.get_yaxis_text1_transform <matplotlib.axes.Axes.get_yaxis_text1_transform>`
es_es: :py:obj:`Ejes.get_yaxis_text1_transform <matplotlib.axes.Axes.get_yaxis_text1_transform>`

source: :py:obj:`Axes.get_yaxis_text2_transform <matplotlib.axes.Axes.get_yaxis_text2_transform>`
es_es: :py:obj:`Ejes.get_yaxis_text2_transform <matplotlib.axes.Axes.get_yaxis_text2_transform>`

source: Other
es_es: Otro

source: Return a default list of artists that are used for the bounding box calculation.
es_es: Devuelve una lista por defecto de los artistas que se utilizan para el cálculo de la caja límite.

source: :py:obj:`Axes.get_transformed_clip_path_and_affine <matplotlib.axes.Axes.get_transformed_clip_path_and_affine>`
es_es: :py:obj:`Ejes.get_transformed_clip_path_and_affine <matplotlib.axes.Axes.get_transformed_clip_path_and_affine>`

source: Return the clip path with the non-affine part of its transformation applied, and the remaining affine part of its transformation.
es_es: Devuelve la ruta del clip con la parte no afectada de su transformación aplicada, y la parte afectada restante de su transformación.

source: Return whether any artists have been added to the Axes.
es_es: Devuelve si algún artista ha sido añadido a los Ejes.

source: :py:obj:`Axes.set <matplotlib.axes.Axes.set>`
es_es: :py:obj:`Ejes.set <matplotlib.axes.Axes.set>`

source: Set multiple properties at once.
es_es: Establece varias propiedades a la vez.
