Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/backend_webagg_api.po
Languages: es_es

source: Displays Agg images in the browser, with interactivity
es_es: Muestra imágenes Agg en el navegador, con interactividad

source: This constructor should always be called with keyword arguments. Arguments are:
es_es: Este constructor siempre debe ser llamado con argumentos de palabra clave. Los argumentos son:

source: *group* should be None; reserved for future extension when a ThreadGroup class is implemented.
es_es: *group* debe ser Ninguno; reservado para futuras extensiones cuando se implementa una clase ThreadGroup.

source: *target* is the callable object to be invoked by the run() method. Defaults to None, meaning nothing is called.
es_es: *target* es el objeto llamable que será invocado por el método run().

source: *name* is the thread name. By default, a unique name is constructed of the form "Thread-N" where N is a small decimal number.
es_es: *name* es el nombre del hilo. De forma predeterminada, se construye un nombre único de la forma "Thread-N" donde N es un pequeño número decimal.

source: *args* is the argument tuple for the target invocation. Defaults to ().
es_es: *args* es la tupla de argumento para la invocación objetivo. Por defecto a ().

source: *kwargs* is a dictionary of keyword arguments for the target invocation. Defaults to {}.
es_es: *kwargs* es un diccionario de argumentos de palabras clave para la invocación objetivo. Por defecto es {}.

source: If a subclass overrides the constructor, it must make sure to invoke the base class constructor (Thread.__init__()) before doing anything else to the thread.
es_es: Si una subclase sobreescribe al constructor, debe asegurarse de invocar el constructor de clase base (Thread.__init__()) antes de hacer cualquier otra cosa al hilo.

source: Method representing the thread's activity.
es_es: Método que representa la actividad del hilo.

source: You may override this method in a subclass. The standard run() method invokes the callable object passed to the object's constructor as the target argument, if any, with sequential and keyword arguments taken from the args and kwargs arguments, respectively.
es_es: Puede sobreescribir este método en una subclase. El método estándar run() invoca el objeto llamable pasado al constructor del objeto como argumento de destino, si los hay, con argumentos secuenciales y de palabras clave tomados de los argumentos y kwargs, respectivamente.

source: Invoked when the WebSocket is closed.
es_es: Invocado cuando el WebSocket está cerrado.

source: If the connection was closed cleanly and a status code or reason phrase was supplied, these values will be available as the attributes ``self.close_code`` and ``self.close_reason``.
es_es: Si la conexión se cerró limpiamente y se proporcionó un código de estado o una frase de razón, estos valores estarán disponibles como los atributos ``self'. lose_code`` y ``self.close_reason``.

source: Added ``close_code`` and ``close_reason`` attributes.
es_es: Añadidos atributos ``close_code`` y ``close_reason``.

source: Handle incoming messages on the WebSocket
es_es: Manejar mensajes entrantes en el WebSocket

source: This method must be overridden.
es_es: Este método debe ser anulado.

source: ``on_message`` can be a coroutine.
es_es: ``on_message`` puede ser una coroutina.

source: Invoked when a new WebSocket is opened.
es_es: Se invoca cuando se abre un nuevo WebSocket.

source: The arguments to `open` are extracted from the `tornado.web.URLSpec` regular expression, just like the arguments to `tornado.web.RequestHandler.get`.
es_es: Los argumentos para `abrir` se extraen de la expresión regular `tornado.web.URLSpec`, al igual que los argumentos a `tornado.web.RequestHandler.get`.

source: `open` may be a coroutine. `on_message` will not be called until `open` has returned.
es_es: `open` puede ser una coroutina. `on_message` no será llamado hasta que `open` haya regresado.

source: ``open`` may be a coroutine.
es_es: ``open`` puede ser una coroutina.

source: Show all figures.
es_es: Mostrar todas las cifras.

source: `show` blocks by calling `mainloop` if *block* is ``True``, or if it is ``None`` and we are neither in IPython's ``%pylab`` mode, nor in `interactive` mode.
es_es: `mostrar` bloques llamando a `mainloop` si *block* es ``True``, o si es ``Ninguno`` y no estamos en modo ``%pylab`` de IPython, ni en modo `interactivo`.
