Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/backend_agg_api.po
Languages: es_es

source: An `Anti-Grain Geometry`_ (AGG) backend.
es_es: Un `Anti-Grain Geometry`_ backend.

source: Features that are implemented:
es_es: Características implementadas:

source: capstyles and join styles
es_es: capstyles y unirse a estilos

source: lines, rectangles, ellipses
es_es: líneas, rectángulos, elipses

source: clipping to a rectangle
es_es: recortando a un rectángulo

source: output to RGBA and Pillow-supported image formats
es_es: salida a formatos de imagen soportados por RGBA y Pillow

source: alpha blending
es_es: mezcla alfa

source: DPI scaling properly - everything scales properly (dashes, linewidths, etc)
es_es: Escala DPI correctamente - todo lo escalado correctamente (guiones, anchuras, etc)

source: draw polygon
es_es: dibujar polígono

source: freetype2 w/ ft2font
es_es: freetype2 con ft2font

source: Still TODO:
es_es: Aún así, es necesario:

source: integrate screen dpi w/ ppi and text
es_es: integrar dpi de pantalla con ppi y texto

source: Get the image as a `memoryview` to the renderer's buffer.
es_es: Obtener la imagen como 'memoryview' al buffer del renderizador.

source: `draw` must be called at least once before this function will work and to update the renderer for any subsequent changes to the Figure.
es_es: `draw` debe ser llamado al menos una vez antes de que esta función funcione y para actualizar el renderizador para cualquier cambio posterior a la figura.

source: Render the `.Figure`.
es_es: Renderiza la `.Figure`.

source: It is important that this method actually walk the artist tree even if not output is produced because this will trigger deferred work (like computing limits auto-limits and tick values) that users may want access to before saving to disk.
es_es: Es importante que este método realmente recorra el árbol del artista incluso si no se produce la salida, ya que esto desencadenará trabajos diferidos (como la computación limita los límites automáticos y los valores de tick) a los que los usuarios pueden querer acceder antes de guardar en el disco.

source: Write the figure to a JPEG file.
es_es: Escriba la figura en un archivo JPEG.

source: Parameters
es_es: Parámetros

source: **filename_or_obj**
es_es: **Nombre de archivo_objeto**

source: str or path-like or file-like
es_es: str o como ruta o archivo

source: The file to write to.
es_es: El archivo al que escribir.

source: Other Parameters
es_es: Otros Parámetros

source: Additional keyword arguments that are passed to `PIL.Image.Image.save` when saving the figure.
es_es: Argumentos adicionales de palabras clave que se pasan a `PIL.Image.save` al guardar la figura.

source: Write the figure to a PNG file.
es_es: Escriba la figura en un archivo PNG.

source: **metadata**
es_es: **metadatos**

source: Metadata in the PNG file as key-value pairs of bytes or latin-1 encodable strings. According to the PNG specification, keys must be shorter than 79 chars.
es_es: Metadatos en el archivo PNG como pares clave-valor de bytes o cadenas codificables latin-1. Según la especificación PNG, las claves deben ser menores de 79 caracteres.

source: The `PNG specification`_ defines some common keywords that may be used as appropriate:
es_es: La `especificación PNG`_ define algunas palabras clave comunes que pueden utilizarse como apropiado:

source: Title: Short (one line) title or caption for image.
es_es: Título: Título corto (una línea) o título para la imagen.

source: Author: Name of image's creator.
es_es: Autor: Nombre del creador de la imagen.

source: Description: Description of image (possibly long).
es_es: Descripción: Descripción de la imagen (posiblemente larga).

source: Copyright: Copyright notice.
es_es: Copia: Aviso de copyright.

source: Creation Time: Time of original image creation (usually RFC 1123 format).
es_es: Tiempo de creación: Tiempo de creación de imagen original (normalmente formato RFC 1123).

source: Software: Software used to create the image.
es_es: Software: Software usado para crear la imagen.

source: Disclaimer: Legal disclaimer.
es_es: Aviso de responsabilidad: Aviso legal.

source: Warning: Warning of nature of content.
es_es: Advertencia: Advertencia de la naturaleza del contenido.

source: Source: Device used to create the image.
es_es: Fuente: Dispositivo usado para crear la imagen.

source: Comment: Miscellaneous comment; conversion from other image format.
es_es: Comentario: Miscellaneous comment; conversion from other image format.

source: Other keywords may be invented for other purposes.
es_es: Otras palabras clave pueden ser inventadas para otros propósitos.

source: If 'Software' is not given, an autogenerated value for Matplotlib will be used. This can be removed by setting it to *None*.
es_es: Si no se da 'Software', se utilizará un valor generado automáticamente para Matplotlib. Esto puede eliminarse configurándolo a *Ninguno*.

source: For more details see the `PNG specification`_.
es_es: Para más detalles vea la `especificación PNG`_.

source: Keyword arguments passed to `PIL.Image.Image.save`.
es_es: Argumentos de palabra clave pasados a `PIL.Image.save`.

source: If the 'pnginfo' key is present, it completely overrides *metadata*, including the default 'Software' key.
es_es: Si la clave 'pnginfo' está presente, anulará completamente los *metadata*, incluyendo la clave 'Software' predeterminada.

source: Get the image as ARGB `bytes`.
es_es: Obtener la imagen como ARGB `bytes`.

source: Get the image as RGB `bytes`.
es_es: Obtener la imagen como RGB `bytes`.

source: The renderer handles all the drawing primitives using a graphics context instance that controls the colors/styles
es_es: El renderizador maneja todos los primitivos de dibujo usando una instancia de contexto de gráficos que controla los colores/estilos

source: Draw mathtext using :mod:`matplotlib.mathtext`.
es_es: Dibuja matemático usando :mod:`matplotlib.mathtext`.

source: Draw a `~.path.Path` instance using the given affine transform.
es_es: Dibuja una instancia `~.path.Path` usando la transforma affine dada.

source: Draw the text instance.
es_es: Dibuja la instancia de texto.

source: GraphicsContextBase
es_es: Contexto gráfico base

source: The graphics context.
es_es: El contexto gráfico.

source: The x location of the text in display coords.
es_es: La posición x del texto en las coordenadas de la pantalla.

source: The y location of the text baseline in display coords.
es_es: La ubicación y de la línea de referencia del texto en las coordenadas de la pantalla.

source: The text string.
es_es: La cadena de texto.

source: The font properties.
es_es: Las propiedades de la fuente.

source: The rotation angle in degrees anti-clockwise.
es_es: El ángulo de rotación en grados en sentido anti-reloj.

source: The original text object to be rendered.
es_es: El objeto de texto original a ser renderizado.

source: **Note for backend implementers:**
es_es: **Nota para implementadores de backend:**

source: When you are trying to determine if you have gotten your bounding box right (which is what enables the text layout/alignment to work properly), it helps to change the line in text.py::
es_es: Cuando está intentando determinar si tiene configurado su cuadro de límite correcto (que es lo que permite que el diseño de texto/alineación funcione correctamente), ayuda a cambiar la línea en el texto. y::

source: to if 1, and then the actual bounding box will be plotted along with your text.
es_es: a si 1, y luego el cuadro de límite actual será trazado junto con su texto.

source: Return the canvas width and height in display coords.
es_es: Devuelve el ancho y la altura del lienzo en las coordenadas de la pantalla.

source: Get the width, height, and descent (offset from the bottom to the baseline), in display coords, of the string *s* with `.FontProperties` *prop*.
es_es: Obtener la anchura, la altura y el descenso (offset de la parte inferior a la línea de referencia), en las coordenadas de visualización, de la cadena *s* con `.FontProperties` *prop*.

source: Return whether image composition by Matplotlib should be skipped.
es_es: Devuelve si la composición de la imagen por Matplotlib debe ser omitida.

source: Raster backends should usually return False (letting the C-level rasterizer take care of image composition); vector backends should usually return ``not rcParams["image.composite_image"]``.
es_es: Los backends Raster generalmente deben devolver False (dejando que el rasterizador de nivel C se ocupe de la composición de la imagen); los backends de vector generalmente deben devolver ``not rcParams["image.composite_image"]``.

source: Return whether arbitrary affine transformations in :meth:`draw_image` are supported (True for most vector backends).
es_es: Devuelve si las transformaciones afectadas arbitrarias en :meth:`draw_image` son soportadas (Verdadero para la mayoría de los servidores vectoriales).

source: Convert points to display units.
es_es: Convierte puntos para mostrar unidades.

source: You need to override this function (unless your backend doesn't have a dpi, e.g., postscript or svg). Some imaging systems assume some value for pixels per inch::
es_es: Necesitas sobreescribir esta función (a menos que tu backend no tenga un dpi, p.ej. postscript o svg). Algunos sistemas de imágenes asumen algún valor para píxeles por pulgada::

source: **points**
es_es: **puntos**

source: float or array-like
es_es: flotante o matriz

source: a float or a numpy array of float
es_es: un float o un array numpy de float

source: Returns
es_es: Devuelve

source: Points converted to pixels
es_es: Puntos convertidos en píxeles

source: Restore the saved region. If bbox (instance of BboxBase, or its extents) is given, only the region specified by the bbox will be restored. *xy* (a pair of floats) optionally specifies the new position (the LLC of the original region, not the LLC of the bbox) where the region will be restored.
es_es: Restaurar la región guardada. Si se da un bbox (instancia de BboxBase, o su tamaño) sólo se restaurará la región especificada por el bbox. *xy* (un par de flotantes opcionalmente especifica la nueva posición (la LLC de la región original, no la LLC del bbox) donde se restablecerá la región.

source: Start filtering. It simply create a new canvas (the old one is saved).
es_es: Empieza a filtrar. Simplemente crea un lienzo nuevo (el antiguo se guarda).

source: Save the plot in the current canvas as a image and apply the *post_processing* function.
es_es: Guarda la gráfica en el lienzo actual como una imagen y aplica la función *post_processing*.

source: def post_processing(image, dpi):
es_es: def post_processing(imagen, dpi):

source: # ny, nx, depth = image.shape # image (numpy array) has RGBA channels and has a depth of 4. ... # create a new_image (numpy array of 4 channels, size can be # different). The resulting image may have offsets from # lower-left corner of the original image return new_image, offset_x, offset_y
es_es: # ny, nx, depth = image.shape # imagen (arreglo numpy) tiene canales RGBA y tiene una profundidad de 4. ... # crear una new_image (array numpy de 4 canales, el tamaño puede ser # diferente). La imagen resultante puede tener desplazamientos desde # esquina inferior izquierda de la imagen original devolver new_image, offset_x, offset_y

source: The saved renderer is restored and the returned image from post_processing is plotted (using draw_image) on it.
es_es: El renderizador guardado es restaurado y la imagen devuelta desde post_processing es trazada (usando draw_image) en él.
