Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/backend_tools_api.po
Languages: es_es

source: Abstract base classes define the primitives for Tools. These tools are used by `matplotlib.backend_managers.ToolManager`
es_es: Las clases base del resumen definen los primitivos para las herramientas. Estas herramientas son usadas por `matplotlib.backend_managers.ToolManager`

source: :class:`ToolBase`
es_es: :class:`Base de herramientas`

source: Simple stateless tool
es_es: Herramienta simple sin estado

source: Tool that has two states, only one Toggle tool can be active at any given time for the same `matplotlib.backend_managers.ToolManager`
es_es: La herramienta que tiene dos estados, sólo una herramienta para alternar puede estar activa en cualquier momento dado para el mismo `matplotlib.backend_managers.ToolManager`

source: Base Tool to toggle between linear and logarithmic.
es_es: Herramienta base para alternar entre lineal y logarítmica.

source: Disable the toggle tool.
es_es: Desactivar la herramienta de alternar.

source: `trigger` call this method when `toggled` is True.
es_es: `trigger` llama a este método cuando `toggled` es True.

source: This can happen in different circumstances.
es_es: Esto puede suceder en circunstancias diferentes.

source: Click on the toolbar tool button.
es_es: Haga clic en el botón de la barra de herramientas.

source: Call to `matplotlib.backend_managers.ToolManager.trigger_tool`.
es_es: Llama a `matplotlib.backend_managers.ToolManager.trigger_tool`.

source: Another `ToolToggleBase` derived tool is triggered (from the same `.ToolManager`).
es_es: Otra herramienta derivada de `ToolToggleBase` se activa (de la misma `.ToolManager`).

source: Enable the toggle tool.
es_es: Activar la herramienta de alternar.

source: `trigger` calls this method when `toggled` is False.
es_es: `trigger` llama a este método cuando `toggled` es False.

source: Calls `enable` or `disable` based on `toggled` value.
es_es: Llama a `enable` o `disable` basado en el valor `toggled`.

source: Base tool for the configuration of subplots.
es_es: Herramienta base para la configuración de subparcelas.

source: Description of the Tool.
es_es: Descripción de la herramienta.

source: `str`: Tooltip used if the Tool is included in a Toolbar.
es_es: `str`: Tooltip usado si la herramienta está incluida en una barra de herramientas.

source: Filename of the image.
es_es: Nombre de archivo de la imagen.

source: `str`: Filename of the image to use in a Toolbar. If None, the *name* is used as a label in the toolbar button.
es_es: `str`: Nombre de archivo de la imagen a usar en una barra de herramientas. Si no, el *nombre* es usado como etiqueta en el botón de la barra de herramientas.

source: Backend-independent cursor types.
es_es: Tipos de cursor independientes de respaldo.

source: Draw and remove a rubberband.
es_es: Dibuja y quita una rubberband.

source: Draw rubberband.
es_es: Dibujar rubberband.

source: This method must get implemented per backend.
es_es: Este método debe implementarse por backend.

source: Remove rubberband.
es_es: Quitar rubberband.

source: This method should get implemented per backend.
es_es: Este método debería implementarse por backend.

source: Call `draw_rubberband` or `remove_rubberband` based on data.
es_es: Llama a `draw_rubberband` o `remove_rubberband` basado en datos.

source: Base tool for figure saving.
es_es: Herramienta base para guardar figuras.

source: Keymap to associate with this tool.
es_es: Mapa de teclas para asociar con esta herramienta.

source: ``list[str]``: List of keys that will trigger this tool when a keypress event is emitted on ``self.figure.canvas``.
es_es: ``list[str]``: Lista de claves que activarán esta herramienta cuando se emita un evento de keypress en ``self.figure.canvas``.

source: Change to the current cursor while inaxes.
es_es: Cambia al cursor actual en los ejes.

source: This tool, keeps track of all `ToolToggleBase` derived tools, and calls `set_cursor` when a tool gets triggered.
es_es: Esta herramienta, mantiene un seguimiento de todas las herramientas derivadas de `ToolToggleBase` y llama a `set_cursor` cuando una herramienta se activa.

source: [*Deprecated*] Set the cursor.
es_es: [*Obsoleto*] Establecer el cursor.

source: Move back up the view limits stack.
es_es: Mover hacia arriba la pila de límites de la vista.

source: Base tool class.
es_es: Clase de herramienta base.

source: A base tool, only implements `trigger` method or no method at all. The tool is instantiated by `matplotlib.backend_managers.ToolManager`.
es_es: Una herramienta base, sólo implementa el método `trigger` o ningún método en absoluto. La herramienta es instanciada por `matplotlib.backend_managers.ToolManager`.

source: The canvas of the figure affected by this tool, or None.
es_es: El lienzo de la figura afectada por esta herramienta, o Ninguno.

source: Destroy the tool.
es_es: Destruir la herramienta.

source: This method is called by `.ToolManager.remove_tool`.
es_es: Este método es llamado por `.ToolManager.remove_tool`.

source: The Figure affected by this tool, or None.
es_es: La Figura afectada por esta herramienta, o ninguna.

source: The tool id (str, must be unique among tools of a tool manager).
es_es: El id de la herramienta (str, debe ser único entre las herramientas de un gestor de herramientas).

source: The `.ToolManager` that controls this tool.
es_es: El `.ToolManager` que controla esta herramienta.

source: Called when this tool gets used.
es_es: Llamado cuando se utiliza esta herramienta.

source: This method is called by `.ToolManager.trigger_tool`.
es_es: Este método es llamado por `.ToolManager.trigger_tool`.

source: Parameters
es_es: Parámetros

source: **event** : `.Event`
es_es: **evento** : `.Event`

source: Event
es_es: Evento

source: The canvas event that caused this tool to be called.
es_es: El evento del lienzo que causó que esta herramienta fuera llamada.

source: **sender**
es_es: **emisor**

source: Object that requested the tool to be triggered.
es_es: Objeto que solicitó que la herramienta se activara.

source: Tool to copy the figure to the clipboard.
es_es: Herramienta para copiar la figura al portapapeles.

source: Send message with the current pointer position.
es_es: Enviar mensaje con la posición actual del puntero.

source: This tool runs in the background reporting the position of the cursor.
es_es: Esta herramienta se ejecuta en segundo plano reportando la posición del cursor.

source: Call `matplotlib.backend_managers.ToolManager.message_event`.
es_es: Llame a `matplotlib.backend_managers.ToolManager.message_event`.

source: Move forward in the view lim stack.
es_es: Avanza en la pila de la vista lim .

source: Tool to toggle full screen.
es_es: Herramienta para activar la pantalla completa.

source: Tool to toggle the major grids of the figure.
es_es: Herramienta para cambiar las rejillas principales de la figura.

source: Convert a shortcut string from the notation used in rc config to the standard notation for displaying shortcuts, e.g. 'ctrl+a' -> 'Ctrl+A'.
es_es: Convierte una cadena de acceso directo de la notación usada en la configuración de rc a la notación estándar para mostrar atajos, por ejemplo, 'ctrl+a' -> 'Ctrl+A'.

source: Restore the original view limits.
es_es: Restaurar los límites originales de la vista.

source: Tool to toggle the major and minor grids of the figure.
es_es: Herramienta para cambiar las rejillas principales y menores de la figura.

source: Pan axes with left mouse, zoom with right.
es_es: Empuje con el ratón izquierdo, acerque con la derecha.

source: Cursor to use when the tool is active.
es_es: Cursor a usar cuando la herramienta está activa.

source: Attribute to group 'radio' like tools (mutually exclusive).
es_es: Atributo al grupo 'radio' como herramientas (mutuamente excluyentes).

source: `str` that identifies the group or **None** if not belonging to a group.
es_es: `str` que identifica al grupo o **nunca** si no pertenece a un grupo.

source: Tool to call the figure manager destroy method.
es_es: Herramienta para llamar al gestor de figuras destruir método.

source: Toggleable tool.
es_es: Herramienta activable.

source: Every time it is triggered, it switches between enable and disable.
es_es: Cada vez que se activa, cambia entre activar y desactivar.

source: Variable length argument to be used by the Tool.
es_es: Argumento de longitud variable que utilizará la herramienta.

source: `toggled` if present and True, sets the initial state of the Tool Arbitrary keyword arguments to be consumed by the Tool
es_es: `toggled` si está presente y True, establece el estado inicial de los argumentos de palabra clave del árbitro de la herramienta a consumir por la herramienta

source: Default of toggled state.
es_es: Por defecto del estado cambiado.

source: State of the toggled tool.
es_es: Estado de la herramienta activada.

source: Auxiliary Tool to handle changes in views and positions.
es_es: Herramienta auxiliar para manejar cambios en vistas y posiciones.

source: Runs in the background and should get used by all the tools that need to access the figure's history of views and positions, e.g.
es_es: Ejecuta en segundo plano y debería ser utilizado por todas las herramientas que necesitan para acceder al historial de vistas y posiciones de la figura, p.ej.

source: Add the current figure to the stack of views and positions.
es_es: Agrega la figura actual a la lista de vistas y posiciones.

source: Back one step in the stack of views and positions.
es_es: Retroceder un paso en la pila de vistas y posiciones.

source: Reset the axes stack.
es_es: Restablecer la pila de ejes.

source: Forward one step in the stack of views and positions.
es_es: Avanzar un paso en la pila de vistas y posiciones.

source: Recall the first view and position from the stack.
es_es: Recordar la primera vista y posición de la pila.

source: Push the current view limits and position onto their respective stacks.
es_es: Empujar los límites de la vista actual y la posición sobre sus respectivas pilas.

source: Make sure that ``self.home_views`` has an entry for all axes present in the figure.
es_es: Asegúrese de que ``self.home_views`` tiene una entrada para todos los ejes presentes en la figura.

source: Update the view limits and position for each axes from the current stack position. If any axes are present in the figure that aren't in the current stack position, use the home view limits for those axes and don't update *any* positions.
es_es: Actualiza los límites de la vista y la posición de cada eje desde la posición de la pila actual. Si algún hacha está presente en la figura que no está en la posición actual de la pila usar los límites de la vista de inicio para esos ejes y no actualizar *ninguna* posiciones.

source: Tool to toggle between linear and logarithmic scales on the X axis.
es_es: Herramienta para alternar entre escamas lineales y logarítmicas en el eje X.

source: Tool to toggle between linear and logarithmic scales on the Y axis.
es_es: Herramienta para alternar entre escamas lineales y logarítmicas en el eje Y.

source: A Tool for zooming using a rectangle selector.
es_es: Una herramienta para encender usando un selector de rectángulo.

source: Base class for `ToolHome`, `ToolBack` and `ToolForward`.
es_es: Clase base para `ToolHome`, `ToolBack` y `ToolForward`.

source: Base class for `ToolZoom` and `ToolPan`.
es_es: Clase base para `ToolZoom` y `ToolPan`.

source: Release the canvas and disconnect press/release events.
es_es: Libera el lienzo y desconecte los eventos de presión/liberación.

source: Connect press/release events and lock the canvas.
es_es: Conecta presión/libera eventos y bloquea el lienzo.

source: Add multiple tools to the container.
es_es: Añadir múltiples herramientas al contenedor.

source: **container**
es_es: **contenedor**

source: Container
es_es: Contenedor

source: `backend_bases.ToolContainerBase` object that will get the tools added.
es_es: Objeto `backend_bases.ToolContainerBase` que obtendrá las herramientas añadidas.

source: **tools**
es_es: **herramientas**

source: list, optional
es_es: lista, opcional

source: List in the form ``[[group1, [tool1, tool2 ...]], [group2, [...]]]`` where the tools ``[tool1, tool2, ...]`` will display in group1. See `add_tool` for details.
es_es: Lista en la forma ``[[group1, [tool1, tool2 ...]], [group2, [...]]]`` donde las herramientas ``[tool1, tool2, ...]`` se mostrarán en el grupo1. Vea `add_tool` para más detalles.

source: Add multiple tools to a `.ToolManager`.
es_es: Añade múltiples herramientas a un `.ToolManager`.

source: backend_managers.ToolManager
es_es: administrador_backend.Gestor de herramientas

source: Manager to which the tools are added.
es_es: Administrador al que se añaden las herramientas.

source: {str: class_like}, optional
es_es: {str: class_like}, opcional

source: The tools to add in a {name: tool} dict, see `add_tool` for more info.
es_es: Las herramientas para añadir en un dictado de {name: tool} vea `add_tool` para más información.

source: Default tools in the toolbar
es_es: Herramientas predeterminadas en la barra de herramientas

source: Default tools
es_es: Herramientas por defecto
