Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/backend_bases_api.po
Languages: es_es

source: Abstract base classes define the primitives that renderers and graphics contexts must implement to serve as a Matplotlib backend.
es_es: Las clases base abstractas definen los primitivos que los renderizadores y los contextos gráficos deben implementar para servir como backend de Matplotlib.

source: `RendererBase`
es_es: `RenderBase`

source: An abstract base class to handle drawing/rendering operations.
es_es: Una clase base abstracta para manejar operaciones de dibujo/renderizado.

source: The abstraction layer that separates the `.Figure` from the backend specific details like a user interface drawing area.
es_es: La capa de abstracción que separa el `.Figure` de los detalles específicos del backend como un área de dibujo de interfaz de usuario.

source: `GraphicsContextBase`
es_es: `Base de Contexto Gráfico`

source: An abstract base class that provides color, line styles, etc.
es_es: Una clase base abstracta que proporciona color, estilos de línea, etc.

source: `Event`
es_es: `Evento`

source: The base class for all of the Matplotlib event handling. Derived classes such as `KeyEvent` and `MouseEvent` store the meta data like keys and buttons pressed, x and y locations in pixel and `~.axes.Axes` coordinates.
es_es: La clase base para todos los eventos de Matplotlib. Clases derivadas como `KeyEvent` y `MouseEvent` almacenan los metadatos como teclas y botones presionados, x y y ubicaciones en pixel y `~. coordenadas de xes.axes`.

source: The base class for the ``Show`` class of each interactive backend; the 'show' callable is then set to ``Show.__call__``.
es_es: La clase base para la clase ``Mostrar`` de cada backend interactivo; la llamada 'mostrar' se establece en ``Mostrar.__call__``.

source: `ToolContainerBase`
es_es: `Base de Contenedor`

source: The base class for the Toolbar class of each interactive backend.
es_es: La clase base para la clase Toolbar de cada backend interactivo.

source: An event triggered by a figure being closed.
es_es: Un evento activado por una figura que está siendo cerrada.

source: An event triggered by a draw operation on the canvas.
es_es: Un evento activado por una operación de sorteo en el lienzo.

source: In most backends, callbacks subscribed to this event will be fired after the rendering is complete but before the screen is updated. Any extra artists drawn to the canvas's renderer will be reflected without an explicit call to ``blit``.
es_es: En la mayoría de los backends, los callbacks suscritos a este evento se activarán después de que el renderizado se haya completado, pero antes de que se actualice la pantalla. Cualquier artista extra dibujado al renderizador del lienzo se reflejará sin una llamada explícita a ``blit``.

source: Calling ``canvas.draw`` and ``canvas.blit`` in these callbacks may not be safe with all backends and may cause infinite recursion.
es_es: Llamar a ``canvas.draw`` y ``canvas.blit`` en estos callbacks puede no ser seguro con todos los backends y puede causar una recursión infinita.

source: A DrawEvent has a number of special attributes in addition to those defined by the parent `Event` class.
es_es: Un DrawEvent tiene un número de atributos especiales además de los definidos por la clase padre `Event`.

source: Attributes
es_es: Atributos

source: **renderer** : `RendererBase`
es_es: **renderizador** : `RenderBase`

source: RendererBase
es_es: RenderizarBase

source: The renderer for the draw event.
es_es: El renderizador para el evento de dibujo.

source: The following attributes are defined and shown with their default values. Subclasses may define additional attributes.
es_es: Los siguientes atributos se definen y se muestran con sus valores predeterminados. Las subclases pueden definir atributos adicionales.

source: The event name.
es_es: El nombre del evento.

source: **canvas** : `FigureCanvasBase`
es_es: **lienzo** : `FigureCanvasBase`

source: FigureCanvasBase
es_es: Base de lienzo de figura

source: The backend-specific canvas instance generating the event.
es_es: La instancia de lienzo específica del backend generando el evento.

source: The GUI event that triggered the Matplotlib event.
es_es: El evento GUI que desencadenó el evento Matplotlib.

source: The canvas the figure renders into.
es_es: El lienzo en el que se muestra la figura.

source: **figure** : `matplotlib.figure.Figure`
es_es: **figura** : `matplotlib.figure.Figure`

source: A high-level figure instance.
es_es: Un ejemplo de cifras de alto nivel.

source: Blit the canvas in bbox (default entire canvas).
es_es: Activa el lienzo en bbox (lienzo entero predeterminado).

source: Callback processing for mouse button press events.
es_es: Procesamiento de llamada para eventos de pulsación del botón del ratón.

source: Backend derived classes should call this function on any mouse button press. (*x*, *y*) are the canvas coords ((0, 0) is lower left). button and key are as defined in `MouseEvent`.
es_es: Las clases derivadas del backend deben llamar a esta función al presionar cualquier botón del ratón. (*x*, *y*) son las coordenadas de lienzo ((0, 0) la parte inferior izquierda) y el botón y la tecla están definidos en `MouseEvent`.

source: This method will call all functions connected to the 'button_press_event' with a `MouseEvent` instance.
es_es: Este método llamará a todas las funciones conectadas al 'button_press_event' con una instancia de 'MouseEvent'.

source: Callback processing for mouse button release events.
es_es: Procesamiento de llamada para eventos de liberación del botón del ratón.

source: Backend derived classes should call this function on any mouse button release.
es_es: Las clases derivadas del backend deben llamar a esta función en cualquier versión del botón del ratón.

source: This method will call all functions connected to the 'button_release_event' with a `MouseEvent` instance.
es_es: Este método llamará a todas las funciones conectadas al 'button_release_event' con una instancia de 'MouseEvent'.

source: Parameters
es_es: Parámetros

source: The canvas coordinates where 0=left.
es_es: El lienzo coordenadas donde 0=izquierda.

source: The canvas coordinates where 0=bottom.
es_es: El lienzo coordina donde 0=inferior.

source: The native UI event that generated the Matplotlib event.
es_es: El evento nativo de la interfaz de usuario que generó el evento Matplotlib.

source: Pass a `CloseEvent` to all functions connected to ``close_event``.
es_es: Pase un `CloseEvent` a todas las funciones conectadas a ``close_event``.

source: The ratio of physical to logical pixels used for the canvas on screen.
es_es: La relación física a píxeles lógicos utilizados para el lienzo en la pantalla.

source: By default, this is 1, meaning physical and logical pixels are the same size. Subclasses that support High DPI screens may set this property to indicate that said ratio is different. All Matplotlib interaction, unless working directly with the canvas, remains in logical pixels.
es_es: Por defecto, este es 1, lo que significa que los píxeles físicos y lógicos son del mismo tamaño. Las subclases que soportan pantallas de alta DPI pueden establecer esta propiedad para indicar que dicha proporción es diferente. Todas las interacciones de Matplotlib, a menos que trabajen directamente con el lienzo, permanecen en píxeles lógicos.

source: Render the `.Figure`.
es_es: Renderiza la `.Figure`.

source: It is important that this method actually walk the artist tree even if not output is produced because this will trigger deferred work (like computing limits auto-limits and tick values) that users may want access to before saving to disk.
es_es: Es importante que este método realmente recorra el árbol del artista incluso si no se produce la salida, ya que esto desencadenará trabajos diferidos (como la computación limita los límites automáticos y los valores de tick) a los que los usuarios pueden querer acceder antes de guardar en el disco.

source: Pass a `DrawEvent` to all functions connected to ``draw_event``.
es_es: Pase un `DrawEvent` a todas las funciones conectadas a ``draw_event``.

source: Request a widget redraw once control returns to the GUI event loop.
es_es: Solicitar el redibujo del widget una vez que el control vuelve al bucle de eventos de la IGU.

source: Even if multiple calls to `draw_idle` occur before control returns to the GUI event loop, the figure will only be rendered once.
es_es: Incluso si varias llamadas a `draw_idle` ocurren antes de que el control regrese al bucle del evento GUI, la figura sólo será renderizada una vez.

source: Backends may choose to override the method and implement their own strategy to prevent multiple renderings.
es_es: Los backends pueden optar por sobreescribir el método e implementar su propia estrategia para prevenir múltiples renderizaciones.

source: Callback processing for the mouse cursor entering the canvas.
es_es: Procesamiento de llamada para el cursor del ratón que entra en el lienzo.

source: Backend derived classes should call this function when entering canvas.
es_es: Las clases derivadas del backend deben llamar a esta función al entrar en lienzo.

source: The coordinate location of the pointer when the canvas is entered.
es_es: La posición de coordenadas del puntero cuando se introduce el lienzo.

source: Flush the GUI events for the figure.
es_es: Limpiar los eventos de la IGU para la figura.

source: Interactive backends need to reimplement this method.
es_es: Los backends interactivos necesitan reimplementar este método.

source: Return a string, which includes extension, suitable for use as a default filename.
es_es: Devuelve una cadena, que incluye extensión, adecuada para ser usada como nombre de archivo predeterminado.

source: Return the default savefig file format as specified in :rc:`savefig.format`.
es_es: Devuelve el formato predeterminado de archivo savefig especificado en :rc:`savefig.format`.

source: The returned string does not include a period. This method is overridden in backends that only support a single file type.
es_es: La cadena devuelta no incluye un período. Este método se reemplaza en backends que sólo soportan un único tipo de archivo.

source: Return dict of savefig file formats supported by this backend.
es_es: Devolver dictado de los formatos de archivo savefig soportados por este backend.

source: Return a dict of savefig file formats supported by this backend, where the keys are a file type name, such as 'Joint Photographic Experts Group', and the values are a list of filename extensions used for that filetype, such as ['jpg', 'jpeg'].
es_es: Devuelve un dictado de formatos de archivo savefig soportados por este backend, donde las claves son un nombre de tipo de archivo, como 'Conjunto de Expertos Fotográficos Grup', y los valores son una lista de extensiones de nombre de archivo utilizadas para ese tipo de archivo, como ['jpg', 'jpeg'].

source: Return the figure width and height in integral points or pixels.
es_es: Devuelve el ancho y la altura de la figura en puntos o píxeles integrales.

source: When the figure is used on High DPI screens (and the backend supports it), the truncation to integers occurs after scaling by the device pixel ratio.
es_es: Cuando la figura se utiliza en pantallas High DPI (y el backend lo soporta), la truncamiento a enteros ocurre después de escalar por la proporción de píxeles del dispositivo.

source: **physical**
es_es: **física**

source: bool, default: False
es_es: bool, por defecto: False

source: Whether to return true physical pixels or logical pixels. Physical pixels may be used by backends that support HiDPI, but still configure the canvas using its actual size.
es_es: Devuelve píxeles físicos verdaderos o píxeles lógicos. Los píxeles físicos pueden ser usados por los backends que soportan HiDPI, pero todavía configuran el lienzo usando su tamaño real.

source: Returns
es_es: Devuelve

source: The size of the figure, in points or pixels, depending on the backend.
es_es: El tamaño de la figura, en puntos o píxeles, dependiendo del backend.

source: [*Deprecated*] Return the title text of the window containing the figure, or None if there is no window (e.g., a PS backend).
es_es: [*Obsoleto*] Devuelve el texto del título de la ventana que contiene la figura, o Ninguno si no hay ninguna ventana (por ejemplo, un backend PS).

source: Set the child `~.axes.Axes` which is grabbing the mouse events.
es_es: Establece el hijo `~.axes.Axes` que está agarrando los eventos del ratón.

source: Usually called by the widgets themselves. It is an error to call this if the mouse is already grabbed by another axes.
es_es: Normalmente los widgets los llaman ellos mismos. Es un error llamar esto si el ratón ya está cogido por otros ejes.

source: Return the topmost visible `~.axes.Axes` containing the point *xy*.
es_es: Devuelve el `~.axes.Axes` más visible que contiene el punto *xy*.

source: (x, y) pixel positions from left/bottom of the canvas.
es_es: (x, y) posiciones de píxeles desde la izquierda/parte inferior del lienzo.

source: `~matplotlib.axes.Axes` or None
es_es: `~matplotlib.axes.Axes` o Ninguno

source: The topmost visible axes containing the point, or None if no axes.
es_es: Los ejes más visibles que contienen el punto, o Ninguno si no hay ejes.

source: Return whether the renderer is in the process of saving to a file, rather than rendering for an on-screen buffer.
es_es: Devuelve si el renderizador está en proceso de guardar en un archivo, en lugar de renderizar para un buffer en pantalla.

source: Pass a `KeyEvent` to all functions connected to ``key_press_event``.
es_es: Pasa un `KeyEvent` a todas las funciones conectadas a ``key_press_event``.

source: Pass a `KeyEvent` to all functions connected to ``key_release_event``.
es_es: Pasa un `KeyEvent` a todas las funciones conectadas a ``key_release_event``.

source: Callback processing for the mouse cursor leaving the canvas.
es_es: Procesamiento de llamada para el cursor del ratón dejando el lienzo.

source: Backend derived classes should call this function when leaving canvas.
es_es: Las clases derivadas del backend deben llamar a esta función cuando dejen el lienzo.

source: Callback processing for mouse movement events.
es_es: Procesamiento de llamada para eventos de movimiento del ratón.

source: Backend derived classes should call this function on any motion-notify-event.
es_es: Las clases derivadas del backend deben llamar a esta función en cualquier movimiento-notificación-evento.

source: This method will call all functions connected to the 'motion_notify_event' with a `MouseEvent` instance.
es_es: Este método llamará a todas las funciones conectadas al 'motion_notify_event' con una instancia de 'MouseEvent'.

source: Bind function *func* to event *s*.
es_es: Enlazar función *función* al evento *s*.

source: One of the following events ids:
es_es: Uno de los siguientes eventos ids:

source: callable
es_es: llamable

source: The callback function to be executed, which must have the signature::
es_es: La función de callback para ser ejecutada, que debe tener la firma::

source: For the location events (button and key press/release), if the mouse is over the axes, the ``inaxes`` attribute of the event will be set to the `~matplotlib.axes.Axes` the event occurs is over, and additionally, the variables ``xdata`` and ``ydata`` attributes will be set to the mouse location in data coordinates. See `.KeyEvent` and `.MouseEvent` for more info.
es_es: Para los eventos de ubicación (botón y tecla/liberación), si el ratón está sobre los ejes, el atributo ``inaxes`` del evento se establecerá en el `~matplotlib. xes. xes` el evento ha terminado, y adicionalmente, los atributos ``xdata`` y ``ydata`` se establecerán en la ubicación del ratón en las coordenadas de datos. Vea `.KeyEvent` y `.MouseEvent` para más información.

source: A connection id that can be used with `.FigureCanvasBase.mpl_disconnect`.
es_es: Un identificador de conexión que se puede utilizar con `.FigureCanvasBase.mpl_disconnect`.

source: Examples
es_es: Ejemplos

source: Disconnect the callback with id *cid*.
es_es: Desconecte el callback con id *cid*.

source: Create a new backend-specific subclass of `.Timer`.
es_es: Crea una nueva subclase específica de backend de `.Timer`.

source: This is useful for getting periodic events through the backend's native event loop. Implemented only for backends with GUIs.
es_es: Esto es útil para obtener eventos periódicos a través del bucle de eventos nativos del backend. Implementado sólo para backends con GUIs.

source: **interval**
es_es: **intervalo**

source: Timer interval in milliseconds.
es_es: Intervalo de tiempo en milisegundos.

source: list[tuple[callable, tuple, dict]]
es_es: lista[tuplo[llamable, tuple, dict]]

source: Sequence of (func, args, kwargs) where ``func(*args, **kwargs)`` will be executed by the timer every *interval*.
es_es: Secuencia de (fun, args, kwargs) donde ``func(*args, **kwargs)`` será ejecutado por el temporizador cada *intervalo*.

source: Callbacks which return ``False`` or ``0`` will be removed from the timer.
es_es: Las llamadas que devuelvan ``False`` o ``0`` se eliminarán del temporizador.

source: Callback processing for pick events.
es_es: Procesamiento de llamadas para eventos de selección.

source: This method will be called by artists who are picked and will fire off `PickEvent` callbacks registered listeners.
es_es: Este método será llamado por artistas que son escogidos y despejarán los callbacks registrados de `PickEvent`.

source: Note that artists are not pickable by default (see `.Artist.set_picker`).
es_es: Tenga en cuenta que los artistas no son elegibles por defecto (vea `.Artist.set_picker`).

source: Render the figure to hardcopy. Set the figure patch face and edge colors. This is useful because some of the GUIs have a gray figure face color background and you'll probably want to override this on hardcopy.
es_es: Renderiza la figura a una copia dura. Establece la cara del parche y los colores del borde. Esto es útil porque algunos de los GUI tienen un fondo de color de figura gris y probablemente querrá sobreescribir esto en una copia impresa.

source: **filename**
es_es: **nombre de archivo**

source: str or path-like or file-like
es_es: str o como ruta o archivo

source: The file where the figure is saved.
es_es: El archivo donde se guarda la figura.

source: **dpi** : float, default: :rc:`savefig.dpi`
es_es: **dpi** : float, por defecto: :rc:`savefig.dpi`

source: float, default:
es_es: flotante, por defecto:

source: The dots per inch to save the figure in.
es_es: Los puntos por pulgada para guardar la figura.

source: **facecolor** : color or 'auto', default: :rc:`savefig.facecolor`
es_es: **facecolor** : color o 'auto', por defecto: :rc:`savefig.facecolor`

source: color or 'auto', default:
es_es: color o 'auto', por defecto:

source: The facecolor of the figure. If 'auto', use the current figure facecolor.
es_es: El color de cara de la figura. Si 'auto', use el color de la figura actual.

source: The edgecolor of the figure. If 'auto', use the current figure edgecolor.
es_es: El color del borde de la figura. Si 'auto', utilice el color de la figura actual.

source: **orientation**
es_es: **orientación**

source: {'landscape', 'portrait'}, default: 'portrait'
es_es: {'landscape', 'portrait'}, por defecto: 'retrato'

source: Only currently applies to PostScript printing.
es_es: Actualmente sólo se aplica a la impresión de PostScript.

source: **format**
es_es: **formato**

source: str, optional
es_es: str, opcional

source: Force a specific file format. If not given, the format is inferred from the *filename* extension, and if that fails from :rc:`savefig.format`.
es_es: Forzar un formato de archivo específico. Si no se proporciona, el formato se inferirá de la extensión *nombre de archivo*, y si falla de :rc:`savefig.format`.

source: **bbox_inches** : 'tight' or `.Bbox`, default: :rc:`savefig.bbox`
es_es: **bbox_inches** : 'tight' o `.Bbox`, por defecto: :rc:`savefig.bbox`

source: 'tight' or
es_es: "apretado" o

source: Bounding box in inches: only the given portion of the figure is saved. If 'tight', try to figure out the tight bbox of the figure.
es_es: Cuadro delimitador en pulgadas: sólo se guarda la porción dada de la figura. Si 'tight', trate de averiguar la caja apretada de la figura.

source: **pad_inches** : float, default: :rc:`savefig.pad_inches`
es_es: **pad_inches** : float, por defecto: :rc:`savefig.pad_inches`

source: Amount of padding around the figure when *bbox_inches* is 'tight'.
es_es: Cantidad de relleno alrededor de la figura cuando *bbox_inches* es 'apretado'.

source: **bbox_extra_artists** : list of `~matplotlib.artist.Artist`, optional
es_es: **bbox_extra_artistas** : lista de `~matplotlib.artist.Artist`, opcional

source: list of
es_es: lista de

source: A list of extra artists that will be considered when the tight bbox is calculated.
es_es: Una lista de artistas adicionales que se considerarán cuando se calcule la caja ajustada.

source: Use a non-default backend to render the file, e.g. to render a png file with the "cairo" backend rather than the default "agg", or a pdf file with the "pgf" backend rather than the default "pdf". Note that the default backend is normally sufficient. See :ref:`the-builtin-backends` for a list of valid backends for each file format. Custom backends can be referenced as "module://...".
es_es: Utilice un backend no predeterminado para renderizar el archivo, p.ej. para renderizar un archivo png con el "cairo" backend en lugar de la "agg" predeterminada o un archivo pdf con el backend "pgf" en lugar del predeterminado "pdf". Tenga en cuenta que el backend por defecto normalmente es suficiente. Vea :ref:`the-builtin-backends` para una lista de backends válidos para cada formato de archivo. Los backends personalizados pueden ser referenciados como "module://...".

source: Release the mouse grab held by the `~.axes.Axes` *ax*.
es_es: Libera la captación del ratón sostenida por el eje `~.axes.Axes` *.

source: Usually called by the widgets. It is ok to call this even if *ax* doesn't have the mouse grab currently.
es_es: Normalmente es llamado por los widgets. Es correcto llamar esto incluso si *ax* no tiene el ratón en este momento.

source: UNUSED: Set the canvas size in pixels.
es_es: DESUSADO: Establezca el tamaño del lienzo en píxeles.

source: Certain backends may implement a similar method internally, but this is not a requirement of, nor is it used by, Matplotlib itself.
es_es: Ciertos backends pueden implementar un método similar internamente, pero esto no es un requisito de, ni lo usa el propio Matplotlib.

source: Pass a `ResizeEvent` to all functions connected to ``resize_event``.
es_es: Pase un `ResizeEvent` a todas las funciones conectadas a ``resize_event``.

source: Callback processing for scroll events.
es_es: Procesamiento de llamadas para eventos de desplazamiento.

source: Backend derived classes should call this function on any scroll wheel event. (*x*, *y*) are the canvas coords ((0, 0) is lower left). button and key are as defined in `MouseEvent`.
es_es: Las clases derivadas del backend deben llamar a esta función en cualquier evento de rueda de desplazamiento. (*x*, *y*) son las coordenadas de lienzo ((0, 0) la parte inferior izquierda) y el botón y la tecla están definidos en `MouseEvent`.

source: This method will call all functions connected to the 'scroll_event' with a `MouseEvent` instance.
es_es: Este método llamará a todas las funciones conectadas al 'scroll_event' con una instancia de 'MouseEvent'.

source: Set the current cursor.
es_es: Establecer el cursor actual.

source: This may have no effect if the backend does not display anything.
es_es: Esto puede no tener ningún efecto si el backend no muestra nada.
