Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/backend_mixed_api.po
Languages: es_es

source: A helper class to implement a renderer that switches between vector and raster drawing. An example may be a PDF writer, where most things are drawn with PDF vector commands, but some very complex objects, such as quad meshes, are rasterised and then output as images.
es_es: Una clase auxiliar para implementar un renderer que cambia entre vector y dibujo raster. Un ejemplo puede ser un escritor PDF, donde la mayoría de las cosas se dibujan con comandos vector PDF, pero algunos objetos muy complejos, como mallas cuadradas, se rasterizan y luego se producen como imágenes.

source: Parameters
es_es: Parámetros

source: **figure** : `matplotlib.figure.Figure`
es_es: **figura** : `matplotlib.figure.Figure`

source: The figure instance.
es_es: El ejemplo de la cifra.

source: scalar
es_es: escalar

source: The width of the canvas in logical units
es_es: El ancho del lienzo en unidades lógicas

source: The height of the canvas in logical units
es_es: La altura del lienzo en unidades lógicas

source: The dpi of the canvas
es_es: El dpi del lienzo

source: **vector_renderer** : `matplotlib.backend_bases.RendererBase`
es_es: **vector_render** : `matplotlib.backend_bases.RendererBase`

source: matplotlib.backend_bases.RendererBase
es_es: base de renderizador

source: An instance of a subclass of `~matplotlib.backend_bases.RendererBase` that will be used for the vector drawing.
es_es: Una instancia de una subclase de `~matplotlib.backend_bases.RendererBase` que será usada para el dibujo vectorial.

source: The renderer class to use for the raster drawing. If not provided, this will use the Agg backend (which is currently the only viable option anyway.)
es_es: La clase renderizadora a usar para el dibujo raster. Si no se proporciona, esto utilizará el backend Agg (que es actualmente la única opción viable de todos modos.)

source: Enter "raster" mode. All subsequent drawing commands (until `stop_rasterizing` is called) will be drawn with the raster backend.
es_es: Introduce el modo "raster". Todos los comandos posteriores de dibujo (hasta que se llame a `stop_rasterizing`) se dibujarán con el backend de raster.

source: Exit "raster" mode. All of the drawing that was done since the last `start_rasterizing` call will be copied to the vector backend by calling draw_image.
es_es: Salir del modo "raster". Todo el dibujo que se hizo desde la última llamada `start_rasterizing` será copiado al backend del vector llamando draw_image.
