Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/backend_bases_api.po
Languages: es_es

source: Name of the tool to add, this gets used as the tool's ID and as the default label of the buttons.
es_es: Nombre de la herramienta a añadir, esto se utiliza como el ID de la herramienta y como la etiqueta predeterminada de los botones.

source: Name of the group that this tool belongs to.
es_es: Nombre del grupo al que pertenece esta herramienta.

source: Position of the tool within its group, if -1 it goes at the end.
es_es: Posición de la herramienta dentro de su grupo, si -1 va al final.

source: **image**
es_es: **imagen**

source: Filename of the image for the button or `None`.
es_es: Nombre de archivo de la imagen para el botón o `Ninguno`.

source: **description**
es_es: **descripción**

source: Description of the tool, used for the tooltips.
es_es: Descripción de la herramienta, usada para las descripciones.

source: **toggle**
es_es: **cambiar**

source: `True` : The button is a toggle (change the pressed/unpressed state between consecutive clicks).
es_es: `Verdadero` : El botón es un interruptor (cambia el estado presionado/no presionado entre pulsaciones consecutivas).

source: `False` : The button is a normal button (returns to unpressed state after release).
es_es: `False` : El botón es un botón normal (vuelve al estado sin pulsar después de la versión).

source: Remove a toolitem from the `ToolContainer`.
es_es: Elimina una herramienta del `ToolContainer`.

source: This method must get implemented per backend.
es_es: Este método debe implementarse por backend.

source: Called when `.ToolManager` emits a `tool_removed_event`.
es_es: Llamado cuando `.ToolManager` emite un `tool_removed_event`.

source: Name of the tool to remove.
es_es: Nombre de la herramienta a eliminar.

source: Display a message on the toolbar.
es_es: Mostrar un mensaje en la barra de herramientas.

source: Message text.
es_es: Texto del mensaje.

source: Toggle the toolitem without firing event.
es_es: Alterna el objeto sin disparar el evento.

source: Id of the tool to toggle.
es_es: Id de la herramienta a cambiar.

source: Whether to set this tool as toggled or not.
es_es: Establecer esta herramienta como activada o no.

source: Trigger the tool.
es_es: Activar la herramienta.

source: Name (id) of the tool triggered from within the container.
es_es: Nombre (id) de la herramienta activada desde dentro del contenedor.

source: The default Matplotlib button actions for extra mouse buttons.
es_es: Las acciones predeterminadas del botón Matplotlib para botones extra del ratón.

source: Parameters are as for `key_press_handler`, except that *event* is a `MouseEvent`.
es_es: Los parámetros son como para `key_press_handler`, excepto que *event* es un `MouseEvent`.

source: Return the registered default canvas for given file format. Handles deferred import of required backend.
es_es: Devuelve el lienzo por defecto registrado para el formato de archivo dado. Maneja la importación diferida del backend requerido.

source: Implement the default Matplotlib key bindings for the canvas and toolbar described at :ref:`key-event-handling`.
es_es: Implementar los enlaces de teclas predeterminados de Matplotlib para el lienzo y la barra de herramientas descritos en :ref:`key-event-handling`.

source: **event** : `KeyEvent`
es_es: **evento** : `KeyEvent`

source: KeyEvent
es_es: Evento clave

source: A key press/release event.
es_es: Un evento de presión/liberación.

source: **canvas** : `FigureCanvasBase`, default: ``event.canvas``
es_es: **canvas** : `FigureCanvasBase`, por defecto: ``event.canvas``

source: FigureCanvasBase, default: event.canvas
es_es: FigureCanvasBase, por defecto: event.canvas

source: The backend-specific canvas instance. This parameter is kept for back-compatibility, but, if set, should always be equal to ``event.canvas``.
es_es: La instancia de lienzo específica del backend. Este parámetro se mantiene para la compatibilidad con back, pero, si se establece, siempre debería ser igual a ``event.canvas``.

source: **toolbar** : `NavigationToolbar2`, default: ``event.canvas.toolbar``
es_es: **barra de herramientas** : `NavigationToolbar2`, por defecto: ``event.canvas.toolbar``

source: NavigationToolbar2, default: event.canvas.toolbar
es_es: NavigationToolbar2, por defecto: event.canvas.toolbar

source: The navigation cursor toolbar. This parameter is kept for back-compatibility, but, if set, should always be equal to ``event.canvas.toolbar``.
es_es: La barra de herramientas del cursor de navegación. Este parámetro se mantiene para la compatibilidad inversa, pero, si se establece, siempre debería ser igual a ``event.canvas.toolbar``.

source: Register a backend for saving to a given file format.
es_es: Registre un backend para guardar en un formato de archivo determinado.

source: File extension
es_es: Extensión de archivo

source: module string or canvas class
es_es: clase de lona o cadena de módulo

source: Backend for handling file output
es_es: Fondo para manejar la salida de archivos

source: Description of the file type.
es_es: Descripción del tipo de archivo.
