Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/backend_bases_api.po
Languages: es_es

source: If required by the backend, this method should trigger an update in the backend event loop after the cursor is set, as this method may be called e.g. before a long-running task during which the GUI is not updated.
es_es: Si es requerido por el backend, este método debería desencadenar una actualización en el bucle del evento backend después de que el cursor está definido, ya que este método puede ser llamado. antes de una tarea de larga duración durante la cual la GUI no se actualiza.

source: The cursor to display over the canvas. Note: some backends may change the cursor for the entire window.
es_es: El cursor para mostrar sobre el lienzo. Nota: algunos backends pueden cambiar el cursor para toda la ventana.

source: [*Deprecated*] Set the title text of the window containing the figure. Note that this has no effect if there is no window (e.g., a PS backend).
es_es: [*Desaprobado*] Establece el texto del título de la ventana que contiene la figura. Tenga en cuenta que esto no tiene efecto si no hay ninguna ventana (por ejemplo, un servidor PS).

source: Start a blocking event loop.
es_es: Iniciar un bucle de eventos de bloqueo.

source: Such an event loop is used by interactive functions, such as `~.Figure.ginput` and `~.Figure.waitforbuttonpress`, to wait for events.
es_es: Tal bucle de eventos es usado por funciones interactivas, como `~.Figure.ginput` y `~.Figure.waitforbuttonpress`, para esperar a los eventos.

source: The event loop blocks until a callback function triggers `stop_event_loop`, or *timeout* is reached.
es_es: El bucle de eventos bloquea hasta que una función de callback activa `stop_event_loop`, o *timeout* es alcanzado.

source: If *timeout* is 0 or negative, never timeout.
es_es: Si el *tiempo de espera* es 0 o negativo, nunca se agota.

source: Only interactive backends need to reimplement this method and it relies on `flush_events` being properly implemented.
es_es: Sólo los backends interactivos necesitan reimplementar este método y depende de que `flush_events` esté correctamente implementado.

source: Interactive backends should implement this in a more native way.
es_es: Los backends interactivos deben implementar esto de una manera más nativa.

source: Stop the current blocking event loop.
es_es: Detener el bucle de eventos de bloqueo actual.

source: Interactive backends need to reimplement this to match `start_event_loop`
es_es: Los backends interactivos necesitan reimplementar esto para que coincida con `start_event_loop`

source: Instantiate an instance of FigureCanvasClass
es_es: Instanciar una instancia de FigureCanvasClass

source: This is used for backend switching, e.g., to instantiate a FigureCanvasPS from a FigureCanvasGTK. Note, deep copying is not done, so any changes to one of the instances (e.g., setting figure size or line props), will be reflected in the other
es_es: Esto se utiliza para cambiar de backend, por ejemplo, para instanciar un FigureCanvasPS de un FigureCanvasGTK. Nota, la copia profunda no se hace, por lo que cualquier cambio en una de las instancias (e. ., establecer tamaño de la figura o accesorios de línea), se reflejará en el otro

source: A backend-independent abstraction of a figure container and controller.
es_es: Una abstracción independiente del backend de un contenedor de figura y controlador.

source: The figure manager is used by pyplot to interact with the window in a backend-independent way. It's an adapter for the real (GUI) framework that represents the visual figure on screen.
es_es: El gestor de figuras es usado por pyplot para interactuar con la ventana de una manera independiente del backend. Es un adaptador para el framework real (GUI) que representa la figura visual en pantalla.

source: GUI backends define from this class to translate common operations such as *show* or *resize* to the GUI-specific code. Non-GUI backends do not support these operations an can just use the base class.
es_es: Los backends de GUI definen desde esta clase para traducir operaciones comunes como *show* o *resize* al código específico de GUI. Los backends no GUI no soportan estas operaciones un puede usar la clase base.

source: This following basic operations are accessible:
es_es: Estas siguientes operaciones básicas son accesibles:

source: **Window operations**
es_es: **Operaciones de ventana**

source: **Key and mouse button press handling**
es_es: **Pulsación de teclas y botón del ratón**

source: The figure manager sets up default key and mouse button press handling by hooking up the `.key_press_handler` to the matplotlib event system. This ensures the same shortcuts and mouse actions across backends.
es_es: El gestor de figuras configura la tecla por defecto y el botón del ratón presiona el manejo enganchando el `. ey_press_handler` al sistema de eventos matplotlib. Esto asegura los mismos atajos y acciones del ratón en los backends.

source: **Other operations**
es_es: **Otras operaciones**

source: Subclasses will have additional attributes and functions to access additional functionality. This is of course backend-specific. For example, most GUI backends have ``window`` and ``toolbar`` attributes that give access to the native GUI widgets of the respective framework.
es_es: Las subclases tendrán atributos y funciones adicionales para acceder a funciones adicionales. Esto es por supuesto específico del backend. Por ejemplo, la mayoría de los servidores GUI tienen atributos ``window`` y ``toolbar`` que dan acceso a los widgets nativos GUI del respectivo framework.

source: The backend-specific canvas instance.
es_es: Instancia de lienzo específica del backend.

source: int or str
es_es: int o str

source: The figure number.
es_es: El número de la cifra.

source: The default key handler cid, when using the toolmanager. To disable the default key press handling use::
es_es: El cid del manejador de teclas predeterminado, al usar el gestor de herramientas. Para desactivar el manejo de teclas predeterminadas, use::

source: The default mouse button handler cid, when using the toolmanager. To disable the default button press handling use::
es_es: El cid predeterminado del manejador del botón del ratón, al usar el gestor de herramientas. Para desactivar el botón predeterminado presione el manejo::

source: [*Deprecated*] The default Matplotlib button actions for extra mouse buttons.
es_es: [*Desaprobado*] Las acciones predeterminadas del botón Matplotlib para botones extra del ratón.

source: Return the title text of the window containing the figure, or None if there is no window (e.g., a PS backend).
es_es: Devuelve el texto del título de la ventana que contiene la figura, o Ninguno si no hay ninguna ventana (por ejemplo, un backend PS).

source: [*Deprecated*] Implement the default Matplotlib key bindings defined at :ref:`key-event-handling`.
es_es: [*Deprecado*] Implementar los enlaces de claves predeterminados de Matplotlib definidos en :ref:`key-event-handling`.

source: For GUI backends, resize the window (in physical pixels).
es_es: Para los backends de GUI, redimensionar la ventana (en píxeles físicos).

source: Set the title text of the window containing the figure.
es_es: Establece el texto del título de la ventana que contiene la figura.

source: This has no effect for non-GUI (e.g., PS) backends.
es_es: Esto no tiene efecto para los backends que no son GUI (por ejemplo, PS).

source: For GUI backends, show the figure window and redraw. For non-GUI backends, raise an exception, unless running headless (i.e. on Linux with an unset DISPLAY); this exception is converted to a warning in `.Figure.show`.
es_es: Para los backends de GUI, mostrar la ventana de figuras y el redibujo. en Linux con un DISPLAY sin definir); esta excepción se convierte en una advertencia en `.Figure.show`.

source: Copy properties from *gc* to self.
es_es: Copiar propiedades de *gc* a sí mismo.

source: Return the alpha value used for blending - not supported on all backends.
es_es: Devuelve el valor alfa usado para mezclar - no soportado en todos los backends.

source: Return whether the object should try to do antialiased rendering.
es_es: Devuelve si el objeto debe tratar de hacer renderizado antialias.

source: Return the `.CapStyle`.
es_es: Devuelve el `.CapStyle`.

source: Return the clip path in the form (path, transform), where path is a `~.path.Path` instance, and transform is an affine transform to apply to the path before clipping.
es_es: Devuelve la ruta del clip en la forma (ruta, transformación), donde la ruta es un `~.path. la instancia ath`, y la transformación es una transformación de afecto para aplicar a la ruta antes de cortar.

source: Return the clip rectangle as a `~matplotlib.transforms.Bbox` instance.
es_es: Devuelve el rectángulo del clip como una instancia `~matplotlib.transforms.Bbox`.

source: Return the dash style as an (offset, dash-list) pair.
es_es: Devuelve el estilo de guión como un par (desplazamiento, lista de guiones).

source: The dash list is a even-length list that gives the ink on, ink off in points. See p. 107 of to PostScript `blue book`_ for more info.
es_es: La lista de guiones es una lista de longitud uniforme que da a la tinta encendida, tinta apagada en puntos. Vea p. 107 de a PostScript `libro azul`_ para más información.

source: Default value is (None, None).
es_es: El valor por defecto es (Ninguna, Ninguna).

source: Return whether the value given by get_alpha() should be used to override any other alpha-channel values.
es_es: Devuelve si el valor dado por get_alpha() debe ser usado para sobreescribir cualquier otro valor alpha-canal.

source: Return the object identifier if one is set, None otherwise.
es_es: Devuelve el identificador de objeto si uno está establecido, Ninguno lo contrario.

source: Get the current hatch style.
es_es: Obtener el estilo de colchón actual.

source: Get the hatch color.
es_es: Consigue el color del colchón.

source: Get the hatch linewidth.
es_es: Obtener el ancho de la colchón.

source: Return a `.Path` for the current hatch.
es_es: Devuelve un `.Path` para la eclosión actual.

source: Return the `.JoinStyle`.
es_es: Devuelve el `.JoinStyle`.

source: Return the line width in points.
es_es: Devuelve el ancho de la línea en puntos.

source: Return a tuple of three or four floats from 0-1.
es_es: Devuelve una tupla de tres o cuatro flotantes de 0-1.

source: Return the sketch parameters for the artist.
es_es: Devuelve los parámetros del croquis para el artista.

source: tuple or `None`
es_es: tupla o `Ninguno`

source: A 3-tuple with the following elements:
es_es: Una 3 tupla con los siguientes elementos:

source: ``scale``: The amplitude of the wiggle perpendicular to the source line.
es_es: ``scale``: La amplitud de la peluca perpendicular a la línea de origen.

source: ``length``: The length of the wiggle along the line.
es_es: ``length``: La longitud de la peluca a lo largo de la línea.

source: ``randomness``: The scale factor by which the length is shrunken or expanded.
es_es: ``aleatorio``: El factor de escala por el cual la longitud es reducida o ampliada.

source: May return `None` if no sketch parameters were set.
es_es: Puede devolver `Ninguno` si no se han establecido parámetros de croquis.

source: Return the snap setting, which can be:
es_es: Devuelve la configuración del snap, que puede ser:

source: True: snap vertices to the nearest pixel center
es_es: Verdadera: cortar vértices al centro de píxeles más cercano

source: False: leave vertices as-is
es_es: Halla: dejar vértices como es

source: None: (auto) If the path contains only rectilinear line segments, round to the nearest pixel center
es_es: Ninguno: (automático) Si la ruta contiene sólo segmentos rectilineales, redondea al centro de píxeles más cercano

source: Return a url if one is set, None otherwise.
es_es: Devuelve una url si una está definida, Ninguno lo contrario.

source: Restore the graphics context from the stack - needed only for backends that save graphics contexts on a stack.
es_es: Restaurar el contexto gráfico de la pila - necesario sólo para los backends que guardan los contextos gráficos en una pila.

source: Set the alpha value used for blending - not supported on all backends.
es_es: Establece el valor alfa usado para mezclar - no soportado en todos los backends.

source: If ``alpha=None`` (the default), the alpha components of the foreground and fill colors will be used to set their respective transparencies (where applicable); otherwise, ``alpha`` will override them.
es_es: Si ``alpha=Ninguno`` (el valor por defecto), los componentes alfa del primer plano y los colores de relleno se utilizarán para establecer sus respectivas transparencias (cuando sea aplicable); de lo contrario, ``alpha`` los anulará.

source: Set whether object should be drawn with antialiased rendering.
es_es: Define si el objeto debe ser dibujado con renderizado antialias.

source: Set how to draw endpoints of lines.
es_es: Establecer cómo dibujar los extremos de las líneas.

source: **cs** : `.CapStyle` or {'butt', 'projecting', 'round'}
es_es: **cs** : `.CapStyle` o {'butt', 'projecting', 'round'}

source: CapStyle or {'butt', 'projecting', 'round'}
es_es: CapEstilo o {'butt', 'projecting', 'round'}

source: Set the clip path to a `.TransformedPath` or None.
es_es: Establece la ruta del clip a un `.TransformedPath` o ninguno.

source: Set the clip rectangle to a `.Bbox` or None.
es_es: Establece el rectángulo del clip a un `.Bbox` o ninguno.

source: Set the dash style for the gc.
es_es: Establece el estilo de guión para el gc.

source: The offset (usually 0).
es_es: El desplazamiento (por lo general 0).

source: **dash_list**
es_es: **lista de guiones**

source: array-like or None
es_es: tipo array o ninguno

source: The on-off sequence as points. None specifies a solid line.
es_es: La secuencia de encendido como puntos. Ninguna especifica una línea sólida.

source: See p. 107 of to PostScript `blue book`_ for more info.
es_es: Vea p. 107 de a PostScript `libro azul`_ para más información.

source: Set the foreground color.
es_es: Establecer el color de primer plano.

source: If *fg* is known to be an ``(r, g, b, a)`` tuple, *isRGBA* can be set to True to improve performance.
es_es: Si se sabe que *fg* es una tupla ``(r, g, b, a)``, *isRGBA* puede establecerse en True para mejorar el rendimiento.

source: Set the id.
es_es: Definir el id.

source: Set the hatch style (for fills).
es_es: Establece el estilo del colchón (para rellenos).

source: Set the hatch color.
es_es: Establecer el color del colchón.

source: Set how to draw connections between line segments.
es_es: Establecer cómo dibujar conexiones entre segmentos de línea.

source: **js** : `.JoinStyle` or {'miter', 'round', 'bevel'}
es_es: **js** : `.JoinStyle` o {'miter', 'round', 'bevel'}

source: JoinStyle or {'miter', 'round', 'bevel'}
es_es: Estilo de registro o {'miter', 'round', 'bevel'}

source: Set the linewidth in points.
es_es: Establecer el ancho de línea en puntos.

source: Set the sketch parameters.
es_es: Establecer los parámetros del croquis.

source: **scale**
es_es: **escala**

source: float, optional
es_es: float, opcional

source: The amplitude of the wiggle perpendicular to the source line, in pixels. If scale is `None`, or not provided, no sketch filter will be provided.
es_es: La amplitud de la muñeca perpendicular a la línea de origen, en píxeles. Si la escala es `Ninguno`, o no proporcionada, no se proporcionará ningún filtro de croquis.

source: float, default: 128
es_es: float, por defecto: 128

source: The length of the wiggle along the line, in pixels.
es_es: La longitud del muñeco a lo largo de la línea, en píxeles.

source: **randomness**
es_es: **aleatoria**

source: float, default: 16
es_es: float, por defecto: 16

source: The scale factor by which the length is shrunken or expanded.
es_es: Factor de escala por el cual la longitud es reducida o ampliada.

source: Set the snap setting which may be:
es_es: Ajuste el ajuste de snap que puede ser:

source: Set the url for links in compatible backends.
es_es: Establecer la url para los enlaces en backends compatibles.

source: A key event (key press, key release).
es_es: Un evento clave (pulsación de teclas, lanzamiento de teclas).

source: A KeyEvent has a number of special attributes in addition to those defined by the parent `Event` and `LocationEvent` classes.
es_es: Un KeyEvent tiene varios atributos especiales además de los definidos por las clases padre `Event` y `LocationEvent`.

source: Modifier keys will be prefixed to the pressed key and will be in the order "ctrl", "alt", "super". The exception to this rule is when the pressed key is itself a modifier key, therefore "ctrl+alt" and "alt+control" can both be valid key values.
es_es: Las teclas modificadoras serán prefijadas a la tecla presionada y estarán en el orden "ctrl", "alt", "super". La excepción a esta regla es cuando la tecla presionada en sí misma es una tecla modificadora, por lo tanto "ctrl+alt" y "alt+control" pueden ser valores de clave válidos.

source: None or str
es_es: Ninguno o str

source: The key(s) pressed. Could be *None*, a single case sensitive Unicode character ("g", "G", "#", etc.), a special key ("control", "shift", "f1", "up", etc.) or a combination of the above (e.g., "ctrl+alt+g", "ctrl+alt+G").
es_es: Las teclas(es) presionadas. Podría ser *Ninguno*, un carácter Unicode sensible a mayúsculas y minúsculas ("g", "G", "#", etc.). , una tecla especial ("control", "shift", "f1", "arriba", etc.) o una combinación de lo anterior (por ejemplo, "ctrl+alt+g", "ctrl+alt+G").

source: An event that has a screen location.
es_es: Un evento que tiene una ubicación en pantalla.

source: A LocationEvent has a number of special attributes in addition to those defined by the parent `Event` class.
es_es: Un LocationEvent tiene un número de atributos especiales además de los definidos por la clase padre `Event`.

source: int or None
es_es: int o ninguno

source: Event location in pixels from bottom left of canvas.
es_es: Ubicación del evento en píxeles desde la parte inferior izquierda del lienzo.

source: **inaxes** : `~.axes.Axes` or None
es_es: **inejes** : `~.axes.Axes` o Ninguno

source: Axes or None
es_es: Ejes o ninguno

source: The `~.axes.Axes` instance over which the mouse is, if any.
es_es: La instancia `~.axes.Axes` sobre la cual está el ratón, si existe.

source: float or None
es_es: float o None

source: Data coordinates of the mouse within *inaxes*, or *None* if the mouse is not over an Axes.
es_es: Coordenadas de datos del ratón dentro de *inejes*, o *nunca* si el ratón no está sobre un eje.

source: An enumeration.
es_es: Una enumeración.

source: A mouse event ('button_press_event', 'button_release_event', 'scroll_event', 'motion_notify_event').
es_es: Un evento del ratón ('button_press_event', 'button_release_event', 'scroll_event', 'motion_notify_event').

source: A MouseEvent has a number of special attributes in addition to those defined by the parent `Event` and `LocationEvent` classes.
es_es: Un MouseEvent tiene varios atributos especiales además de los definidos por las clases padre `Event` y `LocationEvent`.

source: **button** : None or `MouseButton` or {'up', 'down'}
es_es: **botón** : Ninguno o `MouseButton` o {'up', 'down'}

source: None or
es_es: None o

source: The button pressed. 'up' and 'down' are used for scroll events. Note that LEFT and RIGHT actually refer to the "primary" and "secondary" buttons, i.e. if the user inverts their left and right buttons ("left-handed setting") then the LEFT button will be the one physically on the right.
es_es: El botón presionado. 'arriba' y 'abajo' se utilizan para eventos de desplazamiento. Tenga en cuenta que LEFT y RIGHT realmente se refieren a los botones "primario" y "secundario", i. Si el usuario invierte sus botones izquierdo y derecho ("configuración a la izquierda") entonces el botón LEFT será el que esté físicamente a la derecha.

source: The key pressed when the mouse event triggered, e.g. 'shift'. See `KeyEvent`.
es_es: La tecla presionada cuando se activa el evento del ratón, por ejemplo, 'shift'. Ver `KeyEvent`.

source: This key is currently obtained from the last 'key_press_event' or 'key_release_event' that occurred within the canvas. Thus, if the last change of keyboard state occurred while the canvas did not have focus, this attribute will be wrong.
es_es: Esta clave se obtiene actualmente de la última 'key_press_event' o 'key_release_event' que ocurrió dentro del lienzo. Por lo tanto, si el último cambio del estado del teclado ocurrió mientras que el lienzo no tenía enfoque, este atributo será incorrecto.

source: **step**
es_es: **paso**

source: The number of scroll steps (positive for 'up', negative for 'down'). This applies only to 'scroll_event' and defaults to 0 otherwise.
es_es: El número de pasos de desplazamiento (positivo para 'arriba', negativo para 'abajo'). Esto se aplica sólo a 'scroll_event' y por defecto a 0 de otra manera.

source: **dblclick**
es_es: **click**

source: Whether the event is a double-click. This applies only to 'button_press_event' and is False otherwise. In particular, it's not used in 'button_release_event'.
es_es: Si el evento es un doble clic. Esto sólo se aplica a 'button_press_event' y es False de otra manera. En particular, no se usa en 'button_release_event'.

source: Base class for the navigation cursor, version 2.
es_es: Clase base para el cursor de navegación, versión 2.

source: Backends must implement a canvas that handles connections for 'button_press_event' and 'button_release_event'. See :meth:`FigureCanvasBase.mpl_connect` for more information.
es_es: Los backends deben implementar un lienzo que maneja conexiones para 'button_press_event' y 'button_release_event'. Vea :meth:`FigureCanvasBase.mpl_connect` para más información.

source: They must also define
es_es: También deben definir

source: save the current figure
es_es: guardar la figura actual

source: :meth:`draw_rubberband` (optional)
es_es: :meth:`draw_rubberband` (opcional)

source: draw the zoom to rect "rubberband" rectangle
es_es: dibuja el zoom para rectar el rectángulo de "Rubberband"

source: :meth:`set_message` (optional)
es_es: :meth:`set_message` (opcional)

source: display message
es_es: mostrar mensaje

source: :meth:`set_history_buttons` (optional)
es_es: :meth:`set_history_buttons` (opcional)

source: you can change the history back / forward buttons to indicate disabled / enabled state.
es_es: puede cambiar el historial de volver / adelantar botones para indicar deshabilitado / estado habilitado.

source: and override ``__init__`` to set up the toolbar -- without forgetting to call the base-class init. Typically, ``__init__`` needs to set up toolbar buttons connected to the `home`, `back`, `forward`, `pan`, `zoom`, and `save_figure` methods and using standard icons in the "images" subdirectory of the data path.
es_es: y anular ``__init__`` para configurar la barra de herramientas -- sin olvidar llamar a la clase base init. Normalmente, ``__init__`` necesita configurar los botones de la barra de herramientas conectados al `home`, `back`, `forward`, `pan`, `zoom`, y los métodos `save_figure` y usando iconos estándar en el subdirectorio de "imágenes" de la ruta de datos.

source: That's it, we'll do the rest!
es_es: Eso es todo, vamos a hacer el resto!

source: Move back up the view lim stack.
es_es: Mover hacia arriba la pila del lim de la vista.

source: For convenience of being directly connected as a GUI callback, which often get passed additional parameters, this method accepts arbitrary parameters, but does not use them.
es_es: Para comodidad de estar conectado directamente como un callback GUI, que a menudo pasa parámetros adicionales, este método acepta parámetros arbitrarios, pero no los utiliza.
