Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/backend_managers_api.po
Languages: es_es

source: Event for tool manipulation (add/remove).
es_es: Evento de manipulación de herramienta (añadir/eliminar).

source: Manager for actions triggered by user interactions (key press, toolbar clicks, ...) on a Figure.
es_es: Gestor para acciones activadas por interacciones del usuario (pulsación de teclas, clic en la barra de herramientas, ...) en una figura.

source: Attributes
es_es: Atributos

source: :obj:`figure <figure>` : `.Figure`
es_es: :obj:`figura <figure>` : `.Figure`

source: Figure
es_es: Figura

source: Figure that holds the canvas.
es_es: Figura que sostiene el lienzo.

source: LockDraw
es_es: Bloquear Dibujo

source: `.LockDraw` object to know if the `canvas` key_press_event is locked.
es_es: Objeto `.LockDraw` para saber si el key_press_event `canvas` está bloqueado.

source: `.LockDraw` object to know if the message is available to write.
es_es: Objeto `.LockDraw` para saber si el mensaje está disponible para escribir.

source: Currently toggled tools.
es_es: Herramientas cambiadas actualmente.

source: Add *tool* to `ToolManager`.
es_es: Añade *tool* a `ToolManager`.

source: If successful, adds a new event ``tool_trigger_{name}`` where ``{name}`` is the *name* of the tool; the event is fired every time the tool is triggered.
es_es: Si tiene éxito, agrega un nuevo evento ``tool_trigger_{name}`` donde ``{name}`` es el *nombre* de la herramienta; el evento se activa cada vez que se activa la herramienta.

source: Parameters
es_es: Parámetros

source: Name of the tool, treated as the ID, has to be unique.
es_es: El nombre de la herramienta, tratado como el ID, tiene que ser único.

source: **tool**
es_es: **herramienta**

source: class_like, i.e. str or type
es_es: gusta_clase, ej. str o tipo

source: Reference to find the class of the Tool to added.
es_es: Referencia para encontrar la clase de la herramienta a añadir.

source: The base class for tools.
es_es: La clase base para las herramientas.

source: args and kwargs get passed directly to the tools constructor.
es_es: args y kwargs se pasan directamente al constructor de herramientas.

source: Canvas managed by FigureManager.
es_es: Canvas administradas por FigureManager.

source: Return the tool object with the given name.
es_es: Devuelve el objeto de herramienta con el nombre dado.

source: For convenience, this passes tool objects through.
es_es: Para mayor comodidad, esto pasa objetos de herramienta.

source: **name** : str or `.ToolBase`
es_es: **nombre** : str o `.ToolBase`

source: str or
es_es: str o

source: Name of the tool, or the tool itself.
es_es: Nombre de la herramienta, o de la propia herramienta.

source: **warn**
es_es: **advertir**

source: bool, default: True
es_es: bool, por defecto: True

source: Whether a warning should be emitted it no tool with the given name exists.
es_es: Si una advertencia debe ser emitida no existe ninguna herramienta con el nombre dado.

source: Returns
es_es: Devuelve

source: `.ToolBase` or None
es_es: `.ToolBase` o ninguno

source: The tool or None if no tool with the given name exists.
es_es: La herramienta o Ninguno si no existe una herramienta con el nombre dado.

source: Return the keymap associated with the specified tool.
es_es: Devuelve el mapa de teclado asociado con la herramienta especificada.

source: Name of the Tool.
es_es: Nombre de la herramienta.

source: list of str
es_es: lista de str

source: List of keys associated with the tool.
es_es: Lista de claves asociadas con la herramienta.

source: Emit a `ToolManagerMessageEvent`.
es_es: Emite un `ToolManagerMessageEvent`.

source: Remove tool named *name*.
es_es: Eliminar herramienta llamada *nombre*.

source: Name of the tool.
es_es: Nombre de la herramienta.

source: Bind the given figure to the tools.
es_es: Vincula la figura dada a las herramientas.

source: **figure** : `.Figure`
es_es: **figura** : `.Figure`

source: **update_tools**
es_es: **actualizar_herramientas**

source: Force tools to update figure.
es_es: Forzar las herramientas para actualizar la figura.

source: Connect event with string *s* to *func*.
es_es: Conecta el evento con la cadena *s* a *func*.

source: The name of the event. The following events are recognized:
es_es: El nombre del evento. Se reconocen los siguientes eventos:

source: 'tool_removed_event'
es_es: 'herramienta_eliminado_evento'

source: 'tool_added_event'
es_es: 'herramienta_añadido_evento'

source: For every tool added a new event is created
es_es: Para cada herramienta añadida se crea un nuevo evento

source: 'tool_trigger_TOOLNAME', where TOOLNAME is the id of the tool.
es_es: 'tool_trigger_TOOLNAME', donde TOOLNAME es el id de la herramienta.

source: callable
es_es: llamable

source: Callback function for the toolmanager event with signature::
es_es: Función de devolución de llamada para el evento toolmanager con firma::

source: The callback id for the connection. This can be used in `.toolmanager_disconnect`.
es_es: El id de devolución de llamada para la conexión. Esto puede ser usado en `.toolmanager_disconnect`.

source: Disconnect callback id *cid*.
es_es: Desconectar id de devolución de llamada *cid*.

source: Example usage::
es_es: Ejemplo de uso::

source: A dict mapping tool name -> controlled tool.
es_es: Una herramienta de mapeo de diccionarios -> herramienta controlada.

source: Trigger a tool and emit the ``tool_trigger_{name}`` event.
es_es: Activa una herramienta y emite el evento ``tool_trigger_{name}``.

source: **sender**
es_es: **emisor**

source: Object that wishes to trigger the tool.
es_es: Objeto que desea activar la herramienta.

source: **canvasevent**
es_es: **lienzo evento**

source: Event
es_es: Evento

source: Original Canvas event or None.
es_es: Evento original de lienzo o ninguno.

source: Extra data to pass to the tool when triggering.
es_es: Datos adicionales para pasar a la herramienta al activar.

source: Set the keymap to associate with the specified tool.
es_es: Establece el mapa de teclado para asociar con la herramienta especificada.

source: str or list of str
es_es: str o lista de str

source: Keys to associate with the tool.
es_es: Claves para asociar con la herramienta.

source: Event carrying messages from toolmanager.
es_es: Evento llevando mensajes de toolmanager.

source: Messages usually get displayed to the user by the toolbar.
es_es: Los mensajes generalmente se muestran al usuario por la barra de herramientas.

source: Event to inform that a tool has been triggered.
es_es: Evento para informar de que una herramienta ha sido activada.
