Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/backend_bases_api.po
Languages: es_es

source: Callback for dragging in pan/zoom mode.
es_es: Llamada para arrastrar en modo pan/zoom.

source: Callback for dragging in zoom mode.
es_es: Llamada para arrastrar en modo zoom.

source: Draw a rectangle rubberband to indicate zoom limits.
es_es: Dibuja un rubberband rectángulo para indicar límites de zoom.

source: Note that it is not guaranteed that ``x0 <= x1`` and ``y0 <= y1``.
es_es: Tenga en cuenta que no está garantizado que ``x0 <= x1`` y ``y0 <= y1``.

source: Move forward in the view lim stack.
es_es: Avanza en la pila de la vista lim .

source: Restore the original view.
es_es: Restaurar la vista original.

source: Toggle the pan/zoom tool.
es_es: Alterna la herramienta pan/zoom.

source: Pan with left button, zoom with right.
es_es: Despliegue con botón izquierdo, acerque a la derecha.

source: Callback for mouse button press in pan/zoom mode.
es_es: Llamada para pulsar el botón del ratón en modo pan/zoom.

source: Callback for mouse button press in zoom to rect mode.
es_es: Callback para pulsar el botón del ratón en el zoom para cambiar el modo.

source: Push the current view limits and position onto the stack.
es_es: Empuja los límites de la vista actual y la posición sobre la pila.

source: Callback for mouse button release in pan/zoom mode.
es_es: Retroceso de llamada para el lanzamiento del botón del ratón en modo pan/zoom.

source: Callback for mouse button release in zoom to rect mode.
es_es: Retroceso de llamada para el lanzamiento del botón del ratón en modo de acercamiento.

source: Remove the rubberband.
es_es: Eliminar la rubberband.

source: Save the current figure.
es_es: Guardar la figura actual.

source: [*Deprecated*] Set the current cursor to one of the :class:`Cursors` enums values.
es_es: [*Obsoleto*] Establece el cursor actual a uno de los valores de :class:`Cursors` enums.

source: Enable or disable the back/forward button.
es_es: Activar o desactivar el botón Atrás/Adelante.

source: Display a message on toolbar or in status bar.
es_es: Mostrar un mensaje en la barra de herramientas o en la barra de estado.

source: Reset the axes stack.
es_es: Restablecer la pila de ejes.

source: Toggle zoom to rect mode.
es_es: Alternar zoom para cambiar el modo.

source: Raised when trying show a figure in a non-GUI backend.
es_es: Raised al intentar mostrar una figura en un backend no GUI.

source: A pick event.
es_es: Un evento de selección.

source: This event is fired when the user picks a location on the canvas sufficiently close to an artist that has been made pickable with `.Artist.set_picker`.
es_es: Este evento se dispara cuando el usuario elige una ubicación en el lienzo lo suficientemente cerca de un artista que se ha hecho elegible con `.Artist.set_picker`.

source: A PickEvent has a number of special attributes in addition to those defined by the parent `Event` class.
es_es: Un PickEvent tiene un número de atributos especiales además de los definidos por la clase padre `Event`.

source: Bind a function ``on_pick()`` to pick events, that prints the coordinates of the picked data point::
es_es: Enlaza una función ``on_pick()`` para seleccionar eventos, que imprime las coordenadas del punto de datos seleccionado::

source: MouseEvent
es_es: Evento del ratón

source: The mouse event that generated the pick.
es_es: El evento del ratón que generó la selección.

source: The picked artist. Note that artists are not pickable by default (see `.Artist.set_picker`).
es_es: El artista elegido. Tenga en cuenta que los artistas no son elegibles por defecto (vea `.Artist.set_picker`).

source: **other**
es_es: **otro**

source: Additional attributes may be present depending on the type of the picked object; e.g., a `.Line2D` pick may define different extra attributes than a `.PatchCollection` pick.
es_es: Atributos adicionales pueden estar presentes dependiendo del tipo de objeto escogido; p.ej. una selección `.Line2D` puede definir diferentes atributos extra que un `.PatchCollection`.

source: The following methods must be implemented in the backend for full functionality (though just implementing :meth:`draw_path` alone would give a highly capable backend):
es_es: Los siguientes métodos deben ser implementados en el backend para una funcionalidad completa (aunque solo implementando :meth:`draw_path` solo daría un backend altamente capaz):

source: :meth:`draw_gouraud_triangle`
es_es: :meth:`draw_gouraud_triángulo`

source: The following methods *should* be implemented in the backend for optimization reasons:
es_es: Los siguientes métodos *deberían* ser implementados en el backend por razones de optimización:

source: :meth:`draw_text`
es_es: :meth:`dibujar_texto`

source: :meth:`draw_quad_mesh`
es_es: :meth:`dibujar_mesa_quad_mesh`

source: Close a grouping element with label *s*.
es_es: Cerrar un elemento de agrupación con la etiqueta *s*.

source: Only used by the SVG renderer.
es_es: Sólo usado por el renderizador SVG.

source: Draw a Gouraud-shaded triangle.
es_es: Dibuja un triángulo sombreado por Gouraud.

source: GraphicsContextBase
es_es: Contexto gráfico base

source: The graphics context.
es_es: El contexto gráfico.

source: **points**
es_es: **puntos**

source: (3, 2) array-like
es_es: (3, 2) matriz

source: Array of (x, y) points for the triangle.
es_es: Arreglo de puntos (x, y) para el triángulo.

source: **colors**
es_es: **colores**

source: (3, 4) array-like
es_es: (3, 4) tipo matriz

source: RGBA colors for each point of the triangle.
es_es: Colores RGBA para cada punto del triángulo.

source: matplotlib.transforms.Transform
es_es: matplotlib.transforms.Transformar

source: An affine transform to apply to the points.
es_es: Una transformación de afecto para aplicar a los puntos.

source: Draw a series of Gouraud triangles.
es_es: Dibuja una serie de triángulos de Gouraud.

source: Array of *N* (x, y) points for the triangles.
es_es: Array de puntos *N* (x, y) para los triángulos.

source: (N, 3, 4) array-like
es_es: (N, 3, 4) matriz

source: Array of *N* RGBA colors for each point of the triangles.
es_es: Array de colores *N* RGBA para cada punto de los triángulos.

source: A graphics context with clipping information.
es_es: Un contexto gráfico con información de recorte.

source: scalar
es_es: escalar

source: The distance in physical units (i.e., dots or pixels) from the left hand side of the canvas.
es_es: La distancia en unidades físicas (es decir, puntos o píxeles) desde el lado izquierdo del lienzo.

source: The distance in physical units (i.e., dots or pixels) from the bottom side of the canvas.
es_es: La distancia en unidades físicas (es decir, puntos o píxeles) desde la parte inferior del lienzo.

source: (N, M, 4) array-like of np.uint8
es_es: (N, M, 4) array-like de np.uint8

source: An array of RGBA pixels.
es_es: Una matriz de píxeles RGBA.

source: If and only if the concrete backend is written such that :meth:`option_scale_image` returns ``True``, an affine transformation (i.e., an `.Affine2DBase`) *may* be passed to :meth:`draw_image`. The translation vector of the transformation is given in physical units (i.e., dots or pixels). Note that the transformation does not override *x* and *y*, and has to be applied *before* translating the result by *x* and *y* (this can be accomplished by adding *x* and *y* to the translation vector defined by *transform*).
es_es: Si y solo si se escribe el backend concreto tal que :meth:`option_scale_image` devuelva ``True``, una transformación de afino (i.e. un `.Affine2DBase`) *podrá* ser pasado a :meth:`draw_image`. El vector de traducción de la transformación se da en unidades físicas (i. ., puntos o píxeles). Tenga en cuenta que la transformación no anula *x* y *y*, y tiene que ser aplicado *antes* de traducir el resultado por *x* y *y* (esto se puede lograr añadiendo *x* y *y* al vector de traducción definido por *transform*).

source: Draw a marker at each of *path*'s vertices (excluding control points).
es_es: Dibuja un marcador en cada uno de los vértices de *path* (excluyendo los puntos de control).

source: This provides a fallback implementation of draw_markers that makes multiple calls to :meth:`draw_path`. Some backends may want to override this method in order to draw the marker only once and reuse it multiple times.
es_es: Esto proporciona una implementación de draw_markers que hace varias llamadas a :meth:`draw_path`. Algunos backends pueden querer sobreescribir este método para dibujar el marcador una sola vez y reutilizarlo varias veces.

source: An affine transform applied to the marker.
es_es: Una transformación afectada aplicada al marcador.

source: An affine transform applied to the path.
es_es: Una transformación afectada aplicada a la ruta.

source: Draw a `~.path.Path` instance using the given affine transform.
es_es: Dibuja una instancia `~.path.Path` usando la transforma affine dada.

source: Draw a collection of paths selecting drawing properties from the lists *facecolors*, *edgecolors*, *linewidths*, *linestyles* and *antialiaseds*. *offsets* is a list of offsets to apply to each of the paths. The offsets in *offsets* are first transformed by *offsetTrans* before being applied.
es_es: Dibuja una colección de rutas seleccionando propiedades de las listas *colores face*, *colores*, *anchuras de línea*, *linestyles* y *antialias*. *offsets* es una lista de desplazamientos a aplicar a cada una de las rutas. Los desplazamientos en *offsets* son transformados primero por *offsetTrans* antes de ser aplicados.

source: *offset_position* is unused now, but the argument is kept for backwards compatibility.
es_es: *offset_position* no se usa ahora, pero el argumento se mantiene por compatibilidad hacia atrás.

source: This provides a fallback implementation of :meth:`draw_path_collection` that makes multiple calls to :meth:`draw_path`. Some backends may want to override this in order to render each set of path data only once, and then reference that path multiple times with the different offsets, colors, styles etc. The generator methods :meth:`_iter_collection_raw_paths` and :meth:`_iter_collection` are provided to help with (and standardize) the implementation across backends. It is highly recommended to use those generators, so that changes to the behavior of :meth:`draw_path_collection` can be made globally.
es_es: Esto proporciona una implementación de respaldo de :meth:`draw_path_collection` que hace varias llamadas a :meth:`draw_path`. Algunos backends pueden querer anular esto para representar cada conjunto de datos de ruta sólo una vez, y luego referencia que ruta varias veces con los diferentes desplazamientos, colores, estilos, etc. Los métodos generadores :meth:`_iter_collection_raw_paths` y :meth:`_iter_collection` son proporcionados para ayudar con (y estandarizar) la implementación a través de los backends. Es altamente recomendable usar esos generadores, de modo que los cambios en el comportamiento de :meth:`draw_path_collection` puedan hacerse globalmente.

source: Fallback implementation of :meth:`draw_quad_mesh` that generates paths and then calls :meth:`draw_path_collection`.
es_es: Implementación de Fallback de :meth:`draw_quad_mesh` que genera rutas y luego llama a :meth:`draw_path_collection`.

source: Draw the text instance.
es_es: Dibuja la instancia de texto.

source: The x location of the text in display coords.
es_es: La posición x del texto en las coordenadas de la pantalla.

source: The y location of the text baseline in display coords.
es_es: La ubicación y de la línea de referencia del texto en las coordenadas de la pantalla.

source: The text string.
es_es: La cadena de texto.

source: matplotlib.font_manager.FontProperties
es_es: Propiedades de fuente

source: The font properties.
es_es: Las propiedades de la fuente.

source: The rotation angle in degrees anti-clockwise.
es_es: El ángulo de rotación en grados en sentido anti-reloj.

source: matplotlib.text.Text
es_es: matplotlib.text.Texto

source: The original text object to be rendered.
es_es: El objeto de texto original a ser renderizado.

source: **Note for backend implementers:**
es_es: **Nota para implementadores de backend:**

source: When you are trying to determine if you have gotten your bounding box right (which is what enables the text layout/alignment to work properly), it helps to change the line in text.py::
es_es: Cuando está intentando determinar si tiene configurado su cuadro de límite correcto (que es lo que permite que el diseño de texto/alineación funcione correctamente), ayuda a cambiar la línea en el texto. y::

source: to if 1, and then the actual bounding box will be plotted along with your text.
es_es: a si 1, y luego el cuadro de límite actual será trazado junto con su texto.

source: Return whether y values increase from top to bottom.
es_es: Devuelve si los valores y aumentan de arriba a abajo.

source: Note that this only affects drawing of texts and images.
es_es: Tenga en cuenta que esto sólo afecta al dibujo de textos e imágenes.

source: Return the canvas width and height in display coords.
es_es: Devuelve el ancho y la altura del lienzo en las coordenadas de la pantalla.

source: Get the factor by which to magnify images passed to :meth:`draw_image`. Allows a backend to have images at a different resolution to other artists.
es_es: Obtén el factor por el que magnificar las imágenes pasadas a :meth:`draw_image`. Permite que un backend tenga imágenes con una resolución diferente a otros artistas.

source: Return the `.TexManager` instance.
es_es: Devuelve la instancia `.TexManager`.

source: Get the width, height, and descent (offset from the bottom to the baseline), in display coords, of the string *s* with `.FontProperties` *prop*.
es_es: Obtener la anchura, la altura y el descenso (offset de la parte inferior a la línea de referencia), en las coordenadas de visualización, de la cadena *s* con `.FontProperties` *prop*.

source: Return an instance of a `.GraphicsContextBase`.
es_es: Devuelve una instancia de un `.GraphicsContextBase`.

source: Open a grouping element with label *s* and *gid* (if set) as id.
es_es: Abre un elemento de agrupación con la etiqueta *s* y *gid* (si se establece) como id.

source: Return whether image composition by Matplotlib should be skipped.
es_es: Devuelve si la composición de la imagen por Matplotlib debe ser omitida.

source: Raster backends should usually return False (letting the C-level rasterizer take care of image composition); vector backends should usually return ``not rcParams["image.composite_image"]``.
es_es: Los backends Raster generalmente deben devolver False (dejando que el rasterizador de nivel C se ocupe de la composición de la imagen); los backends de vector generalmente deben devolver ``not rcParams["image.composite_image"]``.

source: Return whether arbitrary affine transformations in :meth:`draw_image` are supported (True for most vector backends).
es_es: Devuelve si las transformaciones afectadas arbitrarias en :meth:`draw_image` son soportadas (Verdadero para la mayoría de los servidores vectoriales).

source: Convert points to display units.
es_es: Convierte puntos para mostrar unidades.

source: You need to override this function (unless your backend doesn't have a dpi, e.g., postscript or svg). Some imaging systems assume some value for pixels per inch::
es_es: Necesitas sobreescribir esta función (a menos que tu backend no tenga un dpi, p.ej. postscript o svg). Algunos sistemas de imágenes asumen algún valor para píxeles por pulgada::

source: float or array-like
es_es: flotante o matriz

source: a float or a numpy array of float
es_es: un float o un array numpy de float

source: Points converted to pixels
es_es: Puntos convertidos en píxeles

source: Switch to a temporary renderer for image filtering effects.
es_es: Cambie a un renderizador temporal para efectos de filtrado de imágenes.

source: Currently only supported by the agg renderer.
es_es: Actualmente sólo soportado por el renderizador agg.

source: Switch to the raster renderer.
es_es: Cambiar al renderizador de raster.

source: Used by `.MixedModeRenderer`.
es_es: Utilizado por `.MixedModeRenderer`.

source: Switch back to the original renderer. The contents of the temporary renderer is processed with the *filter_func* and is drawn on the original renderer as an image.
es_es: Volver al renderizador original. El contenido del renderer temporal se procesa con el *filter_func* y se dibuja en el renderizador original como una imagen.

source: Switch back to the vector renderer and draw the contents of the raster renderer as an image on the vector renderer.
es_es: Vuelve al renderizador vectorial y dibuja el contenido del renderizador raster como una imagen en el renderizador vectorial.

source: An event triggered by a canvas resize.
es_es: Un evento activado por un cambio de tamaño de lienzo.

source: A ResizeEvent has a number of special attributes in addition to those defined by the parent `Event` class.
es_es: Un ResizeEvent tiene un número de atributos especiales además de los definidos por la clase padre `Event`.

source: Width of the canvas in pixels.
es_es: Ancho del lienzo en píxeles.

source: Height of the canvas in pixels.
es_es: Altura del lienzo en píxeles.

source: Simple base class to generate a ``show()`` function in backends.
es_es: Clase base simple para generar una función ``show()`` en backends.

source: Subclass must override ``mainloop()`` method.
es_es: La subclase debe anular el método ``mainloop()``.

source: A base class for providing timer events, useful for things animations. Backends need to implement a few specific methods in order to use their own timing mechanisms so that the timer events are integrated into their event loops.
es_es: Una clase base para proporcionar eventos temporizadores, útil para animaciones de cosas. Los backends necesitan implementar algunos métodos específicos para utilizar sus propios mecanismos de temporización de manera que los eventos del temporizador se integren en sus bucles de eventos.

source: Subclasses must override the following methods:
es_es: Las subclases deben sobreescribir los siguientes métodos:

source: ``_timer_start``: Backend-specific code for starting the timer.
es_es: ``_timer_start``: Código específico del backend para iniciar el temporizador.

source: ``_timer_stop``: Backend-specific code for stopping the timer.
es_es: ``_timer_stop``: Código específico del backend para detener el temporizador.

source: Subclasses may additionally override the following methods:
es_es: Las subclases pueden sobreescribir adicionalmente los siguientes métodos:

source: ``_timer_set_single_shot``: Code for setting the timer to single shot operating mode, if supported by the timer object. If not, the `Timer` class itself will store the flag and the ``_on_timer`` method should be overridden to support such behavior.
es_es: ``_timer_set_single_shot``: Código para establecer el temporizador en modo de operación de un solo disparo, si está soportado por el objeto del temporizador. Si no, la propia clase `Timer` almacenará la bandera y el método ``_on_timer`` debe ser anulado para soportar tal comportamiento.

source: ``_timer_set_interval``: Code for setting the interval on the timer, if there is a method for doing so on the timer object.
es_es: ``_timer_set_interval``: Código para establecer el intervalo en el temporizador, si hay un método para hacerlo en el objeto temporizador.

source: ``_on_timer``: The internal function that any timer object should call, which will handle the task of running all callbacks that have been set.
es_es: ``_on_timer``: La función interna que cualquier objeto temporizador debe llamar, la cual manejará la tarea de ejecutar todos los callbacks que se han establecido.

source: int, default: 1000ms
es_es: int, por defecto: 1000ms

source: The time between timer events in milliseconds. Will be stored as ``timer.interval``.
es_es: El tiempo entre eventos temporizadores en milisegundos. Se almacenará como ``timer.interval``.

source: List of (func, args, kwargs) tuples that will be called upon timer events. This list is accessible as ``timer.callbacks`` and can be manipulated directly, or the functions `add_callback` and `remove_callback` can be used.
es_es: Lista de tuples (fun, args, kwargs) que serán llamados en eventos de temporizador. Esta lista es accesible como ``temporizador. allbacks`` y puede ser manipulado directamente, o las funciones `add_callback` y `remove_callback` pueden ser usadas.

source: Register *func* to be called by timer when the event fires. Any additional arguments provided will be passed to *func*.
es_es: Registrar *función* para ser llamado por temporizador cuando el evento se dispare. Cualquier argumento adicional proporcionado se pasará a *función*.

source: This function returns *func*, which makes it possible to use it as a decorator.
es_es: Esta función devuelve *func*, lo que hace posible usarla como decorador.

source: The time between timer events, in milliseconds.
es_es: El tiempo entre los eventos temporizadores, en milisegundos.

source: Remove *func* from list of callbacks.
es_es: Eliminar *función* de la lista de devoluciones.

source: *args* and *kwargs* are optional and used to distinguish between copies of the same function registered to be called with different arguments. This behavior is deprecated. In the future, ``*args, **kwargs`` won't be considered anymore; to keep a specific callback removable by itself, pass it to `add_callback` as a `functools.partial` object.
es_es: *args* y *kwargs* son opcionales y se utilizan para distinguir entre copias de la misma función registradas para ser llamadas con diferentes argumentos. Este comportamiento está obsoleto. En el futuro, ``*args, **kwargs`` ya no se considerará; para mantener un callback específico removible por sí mismo, pasarlo a `add_callback` como una `functools. objeto artial`.

source: Whether this timer should stop after a single run.
es_es: Si este temporizador debe detenerse después de una sola ejecución.

source: Start the timer object.
es_es: Iniciar el objeto temporizador.

source: int, optional
es_es: int, opcional

source: Timer interval in milliseconds; overrides a previously set interval if provided.
es_es: Intervalo de temporizador en milisegundos; anula un intervalo previamente establecido si se proporciona.

source: Stop the timer.
es_es: Detener el temporizador.

source: Base class for all tool containers, e.g. toolbars.
es_es: Clase base para todos los contenedores de herramientas, por ejemplo, barras de herramientas.

source: ToolManager
es_es: Gestor de herramientas

source: The tools with which this `ToolContainer` wants to communicate.
es_es: Las herramientas con las que este `ToolContainer` quiere comunicarse.

source: Add a tool to this container.
es_es: Añadir una herramienta a este contenedor.

source: **tool**
es_es: **herramienta**

source: tool_like
es_es: herramienta_como

source: The tool to add, see `.ToolManager.get_tool`.
es_es: La herramienta para añadir, vea `.ToolManager.get_tool`.

source: **group**
es_es: **grupo**

source: The name of the group to add this tool to.
es_es: El nombre del grupo al que añadir esta herramienta.

source: **position**
es_es: **posición**

source: int, default: -1
es_es: int, por defecto: -1

source: The position within the group to place this tool.
es_es: La posición dentro del grupo para colocar esta herramienta.

source: Add a toolitem to the container.
es_es: Añadir un elemento de herramienta al contenedor.

source: This method must be implemented per backend.
es_es: Este método debe implementarse por backend.

source: The callback associated with the button click event, must be *exactly* ``self.trigger_tool(name)``.
es_es: El callback asociado con el evento de clic del botón debe ser *exactamente* ``self.trigger_tool(name)``.
