Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/backend_nbagg_api.po
Languages: es_es

source: :mod:`.backend_nbagg`
es_es: :mod:`.backend_Textagg`

source: Interactive figures in the IPython notebook.
es_es: Figuras interactivas en el cuaderno IPython.

source: Manages the Comm connection between IPython and the browser (client).
es_es: Administra la conexión de Comm entre IPython y el navegador (cliente).

source: Comms are 2 way, with the CommSocket being able to publish a message via the send_json method, and handle a message with on_message. On the JS side figure.send_message and figure.ws.onmessage do the sending and receiving respectively.
es_es: Los comandos son de 2 maneras, siendo el CommSocket capaz de publicar un mensaje a través del método send_json y manejar un mensaje con on_message. En el lado JS figure.send_message y figure.ws.onmessage hacen el envío y recepción respectivamente.

source: Clear up any closed Comms.
es_es: Limpiar cualquier Comms cerrados.

source: A special method to re-show the figure in the notebook.
es_es: Un método especial para volver a mostrar la figura en el cuaderno.

source: For GUI backends, show the figure window and redraw. For non-GUI backends, raise an exception, unless running headless (i.e. on Linux with an unset DISPLAY); this exception is converted to a warning in `.Figure.show`.
es_es: Para los backends de GUI, mostrar la ventana de figuras y el redibujo. en Linux con un DISPLAY sin definir); esta excepción se convierte en una advertencia en `.Figure.show`.

source: Return a string showing the figure and connection status for the backend.
es_es: Devuelve una cadena que muestra la figura y el estado de conexión del backend.

source: This is intended as a diagnostic tool, and not for general use.
es_es: Se trata de una herramienta de diagnóstico, y no para uso general.

source: Create a new figure manager instance for the given figure.
es_es: Crear una nueva instancia del gestor de figuras para la figura dada.

source: Show all figures.
es_es: Mostrar todas las cifras.

source: `show` blocks by calling `mainloop` if *block* is ``True``, or if it is ``None`` and we are neither in IPython's ``%pylab`` mode, nor in `interactive` mode.
es_es: `mostrar` bloques llamando a `mainloop` si *block* es ``True``, o si es ``Ninguno`` y no estamos en modo ``%pylab`` de IPython, ni en modo `interactivo`.
