Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/bezier_api.po
Languages: es_es

source: A module providing some utility functions regarding Bezier path manipulation.
es_es: Un módulo que proporciona algunas funciones de utilidad con respecto a la manipulación de rutas Bezier.

source: A d-dimensional Bezier segment.
es_es: Un segmento d-dimensional Bézier.

source: Parameters
es_es: Parámetros

source: **control_points**
es_es: **control_puntos**

source: (N, d) array
es_es: (N, d) matriz

source: Location of the *N* control points.
es_es: Posición de los puntos de control *N*.

source: Return the dimension and location of the curve's interior extrema.
es_es: Retorna la dimensión y la ubicación del extremo interior de la curva.

source: The extrema are the points along the curve where one of its partial derivatives is zero.
es_es: Los extremos son los puntos a lo largo de la curva donde uno de sus derivados parciales es cero.

source: Returns
es_es: Devuelve

source: array of int
es_es: array de int

source: Index :math:`i` of the partial derivative which is zero at each interior extrema.
es_es: Índice :math:`i` de la derivada parcial que es cero en cada extremo interior.

source: array of float
es_es: array de flotante

source: Of same size as dims. The :math:`t` such that :math:`d/dx_i B(t) = 0`
es_es: De mismo tamaño que oscuros. El :math:`t` tales que :math:`d/dx_i B(t) = 0`

source: The control points of the curve.
es_es: Los puntos de control de la curva.

source: Degree of the polynomial. One less the number of control points.
es_es: Grado del polinomio, uno menos el número de puntos de control.

source: The dimension of the curve.
es_es: La dimensión de la curva.

source: Evaluate the curve at a single point, returning a tuple of *d* floats.
es_es: Evalúa la curva en un solo punto, devolviendo una tupla de *d* flotantes.

source: The polynomial coefficients of the Bezier curve.
es_es: Los coeficientes polinomiales de la curva Bézier.

source: Follows opposite convention from `numpy.polyval`.
es_es: Sigue la convención opuesta de `numpy.polyval`.

source: (n+1, d) array
es_es: (n+1, d) matriz

source: Coefficients after expanding in polynomial basis, where :math:`n` is the degree of the bezier curve and :math:`d` its dimension. These are the numbers (:math:`C_j`) such that the curve can be written :math:`\sum_{j=0}^n C_j t^j`.
es_es: Coeficientes después de expandirse en base polinomial, donde :math:`n` es el grado de la curva bezier y :math:`d` su dimensión. Estos son los números (:math:`C_j`) tales que la curva puede ser escrita :math:`\sum_{j=0}^n C_j t^j`.

source: The coefficients are calculated as
es_es: Los coeficientes se calculan como

source: where :math:`P_i` are the control points of the curve.
es_es: donde :math:`P_i` son los puntos de control de la curva.

source: Check if two lines are parallel.
es_es: Compruebe si dos líneas son paralelas.

source: The gradients *dy*/*dx* of the two lines.
es_es: Los degradados *dy*/*dx* de las dos líneas.

source: **tolerance**
es_es: **tolerancia**

source: The angular tolerance in radians up to which the lines are considered parallel.
es_es: La tolerancia angular en radianes hasta los cuales las líneas son consideradas paralelas.

source: is_parallel
es_es: es paralelo

source: 1 if two lines are parallel in same direction.
es_es: 1 si dos líneas son paralelas en la misma dirección.

source: -1 if two lines are parallel in opposite direction.
es_es: -1 si dos líneas son paralelas en dirección opuesta.

source: False otherwise.
es_es: De otro modo.

source: Find the intersection of the Bezier curve with a closed path.
es_es: Encuentra la intersección de la curva Bézier con un camino cerrado.

source: The intersection point *t* is approximated by two parameters *t0*, *t1* such that *t0* <= *t* <= *t1*.
es_es: El punto de intersección *t* está aproximado por dos parámetros *t0*, *t1* tales que *t0* <= *t* <= *t1*.

source: Search starts from *t0* and *t1* and uses a simple bisecting algorithm therefore one of the end points must be inside the path while the other doesn't. The search stops when the distance of the points parametrized by *t0* and *t1* gets smaller than the given *tolerance*.
es_es: La búsqueda comienza desde *t0* y *t1* y usa un simple algoritmo de bisecting por lo tanto uno de los puntos finales debe estar dentro de la ruta mientras que el otro no. La búsqueda se detiene cuando la distancia de los puntos parametrizados por *t0* y *t1* es menor que la *tolerancia* dada.

source: callable
es_es: llamable

source: A function returning x, y coordinates of the Bezier at parameter *t*. It must have the signature::
es_es: Una función devolviendo x, y coordenadas del Bezier en el parámetro *t*. Debe tener la firma::

source: **inside_closedpath**
es_es: **dentro de la ruta cerrada**

source: A function returning True if a given point (x, y) is inside the closed path. It must have the signature::
es_es: Una función que devuelve Verdadero si un punto dado (x, y) está dentro de la ruta cerrada. Debe tener la firma::

source: Start parameters for the search.
es_es: Parámetros de inicio para la búsqueda.

source: Maximal allowed distance between the final points.
es_es: Distancia máxima permitida entre los puntos finales.

source: The Bezier path parameters.
es_es: Los parámetros de ruta Bézier.

source: Find control points of the Bezier curve passing through (*c1x*, *c1y*), (*mmx*, *mmy*), and (*c2x*, *c2y*), at parametric values 0, 0.5, and 1.
es_es: Encuentra los puntos de control de la curva Bezier que pasa por (*c1x*, *c1y*), (*mmx*, *mmy*), y (*c2x*, *c2y*), en los valores paramétricos 0, 0.5 y 1.

source: Return the intersection between the line through (*cx1*, *cy1*) at angle *t1* and the line through (*cx2*, *cy2*) at angle *t2*.
es_es: Devuelve la intersección entre la línea a través de (*cx1*, *cy1*) en el ángulo *t1* y la línea a través (*cx2*, *cy2*) en el ángulo *t2*.

source: For a line passing through (*cx*, *cy*) and having an angle *t*, return locations of the two points located along its perpendicular line at the distance of *length*.
es_es: Para una línea que pasa por (*cx*, *cito*) y que tiene un ángulo *t*, ubicaciones de retorno de los dos puntos ubicados a lo largo de su línea perpendicular a la distancia de *longitud*.

source: Given the quadratic Bezier control points *bezier2*, returns control points of quadratic Bezier lines roughly parallel to given one separated by *width*.
es_es: Dados los cuadráticos puntos de control Bézier *bezier2*, devuelve los puntos de control de líneas cuadráticas Bézier más o menos paralelas a uno dado separado por *ancho*.

source: Return a function that checks whether a point is in a circle with center (*cx*, *cy*) and radius *r*.
es_es: Devuelve una función que comprueba si un punto está en un círculo con el centro (*cx*, *ci*) y el radio *r*.

source: The returned function has the signature::
es_es: La función devuelta tiene la firma::

source: Being similar to get_parallels, returns control points of two quadratic Bezier lines having a width roughly parallel to given one separated by *width*.
es_es: Siendo similar a get_parallels, devuelve puntos de control de dos líneas cuadráticas Bézier que tienen un ancho más o menos paralelo a uno dado separado por *ancho*.

source: Split a Bezier curve into two at the intersection with a closed path.
es_es: Divida una curva Bézier en dos en la intersección con un camino cerrado.

source: Control points of the Bezier segment. See `.BezierSegment`.
es_es: Puntos de control del segmento Bezier. Ver `.BezierSegment`.

source: A function returning True if a given point (x, y) is inside the closed path. See also `.find_bezier_t_intersecting_with_closedpath`.
es_es: Una función que devuelve True si un punto dado (x, y) está dentro de la ruta cerrada.

source: The tolerance for the intersection. See also `.find_bezier_t_intersecting_with_closedpath`.
es_es: La tolerancia para la intersección. Vea también `.find_bezier_t_intersecting_with_closedpath`.

source: left, right
es_es: izquierda, derecha

source: Lists of control points for the two Bezier segments.
es_es: Lista de puntos de control para los dos segmentos Bézier.

source: Split a Bezier segment defined by its control points *beta* into two separate segments divided at *t* and return their control points.
es_es: Dividir un segmento Bezier definido por sus puntos de control *beta* en dos segmentos separados divididos en *t* y devolver sus puntos de control.

source: Divide a path into two segments at the point where ``inside(x, y)`` becomes False.
es_es: Divida una ruta en dos segmentos en el punto donde ``dentro (x, y)`` se convierte en False.
