Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/blocking_input_api.po
Languages: es_es

source: Classes used for blocking interaction with figure windows:
es_es: Clases utilizadas para bloquear la interacción con las ventanas de figuras:

source: `BlockingInput`
es_es: `Bloqueando entrada`

source: Creates a callable object to retrieve events in a blocking way for interactive sessions. Base class of the other classes listed here.
es_es: Crea un objeto llamable para recuperar eventos de forma bloqueada para sesiones interactivas. Clase base de las otras clases listadas aquí.

source: Creates a callable object to retrieve key or mouse clicks in a blocking way for interactive sessions. Used by `~.Figure.waitforbuttonpress`.
es_es: Crea un objeto llamable para recuperar teclas o clics del ratón de forma bloqueadora para sesiones interactivas. Utilizado por `~.Figure.waitforbuttonpress`.

source: Creates a callable object to retrieve mouse clicks in a blocking way for interactive sessions. Used by `~.Figure.ginput`.
es_es: Crea un objeto llamable para recuperar los clics del ratón de forma bloqueadora para sesiones interactivas. Utilizado por `~.Figure.ginput`.

source: Creates a callable object to retrieve mouse clicks in a blocking way that will then be used to place labels on a `.ContourSet`. Used by `~.Axes.clabel`.
es_es: Crea un objeto llamable para recuperar los clics del ratón de una manera bloqueadora que se utilizará para colocar etiquetas en un `. ontourSet`. Utilizado por `~.Axes.clabel`.

source: Callable for retrieving mouse clicks and key presses in a blocking way.
es_es: Llamable para recuperar los clics del ratón y pulsaciones de teclas de forma bloqueadora.

source: Used to place contour labels.
es_es: Utilizado para colocar etiquetas de contorno.

source: Add the coordinates of an event to the list of clicks.
es_es: Añade las coordenadas de un evento a la lista de clics.

source: Parameters
es_es: Parámetros

source: **event** : `~.backend_bases.MouseEvent`
es_es: **evento** : `~.backend_bases.MouseEvent`

source: MouseEvent
es_es: Evento del ratón

source: Process an button-1 event (add a label to a contour).
es_es: Procesar un evento botón-1 (añadir una etiqueta a un contorno).

source: Process an button-3 event (remove a label if not in inline mode).
es_es: Procesar un evento botón-3 (remover una etiqueta si no está en modo en línea).

source: Unfortunately, if one is doing inline labels, then there is currently no way to fix the broken contour - once humpty-dumpty is broken, he can't be put back together. In inline mode, this does nothing.
es_es: Desafortunadamente, si uno está haciendo etiquetas en línea, entonces actualmente no hay forma de arreglar el contorno roto - una vez que se rompe el dumpty humpty, no se le puede volver a juntar. En modo en línea, esto no hace nada.

source: Remove a click (by default, the last) from the list of clicks.
es_es: Eliminar un clic (por defecto, el último) de la lista de clics.

source: Callable for retrieving events in a blocking way.
es_es: Llamable para recuperar eventos de forma bloqueadora.

source: For base class, this just appends an event to events.
es_es: Para la clase base, esto sólo añade un evento a los eventos.

source: Disconnect all callbacks.
es_es: Desconectar todas las devoluciones.

source: Event handler; will be passed to the current figure to retrieve events.
es_es: Controlador de eventos; se pasará a la figura actual para recuperar eventos.

source: Remove an event from the event list -- by default, the last.
es_es: Eliminar un evento de la lista de eventos -- de forma predeterminada, el último.

source: Note that this does not check that there are events, much like the normal pop method. If no events exist, this will throw an exception.
es_es: Tenga en cuenta que esto no comprueba que haya eventos, al igual que el método pop normal. Si no existen eventos, se producirá una excepción.

source: For baseclass, do nothing but collect events.
es_es: Para baseclass, no haga más que recoger eventos.

source: Determine if it is a key event.
es_es: Determine si es un acontecimiento clave.

source: Callable for retrieving mouse clicks in a blocking way.
es_es: Llamable para recuperar los clics del ratón de forma bloqueadora.

source: This class will also retrieve keypresses and map them to mouse clicks: delete and backspace are a right click, enter is like a middle click, and all others are like a left click.
es_es: Esta clase también recuperará pulsaciones de teclas y las mapeará a los clics del ratón: borrar y retroceder son un clic derecho, enter es como un clic medio, y todos los demás son como un clic izquierdo.

source: **event** : `~.backend_bases.MouseEvent`, optional
es_es: **event** : `~.backend_bases.MouseEvent`, opcional

source: MouseEvent, optional
es_es: MouseEvent, opcional

source: Not used
es_es: No usado

source: Process a key press event, mapping keys to appropriate mouse clicks.
es_es: Procese un evento de pulsación de teclas, mapeando las teclas a los clics apropiados del ratón.

source: Process a mouse click event.
es_es: Procesar un evento de clic del ratón.

source: Process an button-1 event (add a click if inside axes).
es_es: Procesa un evento botón-1 (añade un clic si está dentro de los ejes).

source: Process an button-3 event (remove the last click).
es_es: Procesar un evento botón-3 (eliminar el último clic).

source: Process an button-2 event (end blocking input).
es_es: Procesar un evento botón-2 (fin de bloqueo de entrada).

source: Remove a click and the associated event from the list of clicks.
es_es: Eliminar un clic y el evento asociado de la lista de clics.

source: Defaults to the last click.
es_es: Por defecto es el último clic.

source: Process an event.
es_es: Procesar un evento.
