Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/category_api.po
Languages: es_es

source: Plotting of string "category" data: ``plot(['d', 'f', 'a'], [1, 2, 3])`` will plot three points with x-axis values of 'd', 'f', 'a'.
es_es: Trato de la cadena "categoría" data: ``plot(['d', 'f', 'a'], [1, 2, 3])`` graficará tres puntos con valores de eje x de 'd', 'f', 'a'.

source: See :doc:`/gallery/lines_bars_and_markers/categorical_variables` for an example.
es_es: Vea :doc:`/gallery/lines_bars_and_markers/categorical_variables` para un ejemplo.

source: The module uses Matplotlib's `matplotlib.units` mechanism to convert from strings to integers and provides a tick locator, a tick formatter, and the `.UnitData` class that creates and stores the string-to-integer mapping.
es_es: El módulo utiliza el mecanismo `matplotlib.units` de Matplotlib's para convertir de cadenas a enteros y proporciona un localizador de tick, un formato de tick, y el `. clase nitData` que crea y almacena el mapeo de cadena a entero.

source: Set the default axis ticks and labels.
es_es: Establece los ticks y etiquetas predeterminados del eje.

source: Parameters
es_es: Parámetros

source: **unit** : `.UnitData`
es_es: **unidad** : `.UnitData`

source: UnitData
es_es: Datos de unidad

source: object string unit information for value
es_es: información de la unidad de cadena de objeto por valor

source: **axis** : `~matplotlib.axis.Axis`
es_es: **eje** : `~matplotlib.axis.Axis`

source: Axis
es_es: Eje

source: axis for which information is being set
es_es: eje para el que se está configurando la información

source: *axis* is not used
es_es: *eje* no es usado

source: Returns
es_es: Devuelve

source: Information to support default tick labeling
es_es: Información para soportar el etiquetado de ticks por defecto

source: Convert strings in *value* to floats using mapping information stored in the *unit* object.
es_es: Convierte cadenas en *valor* a flotantes usando información de mapeo almacenada en el objeto *unidad*.

source: **value**
es_es: **valor**

source: str or iterable
es_es: str o iterable

source: Value or list of values to be converted.
es_es: Valor o lista de valores a convertir.

source: An object mapping strings to integers.
es_es: Una cadena de mapeo de objetos a enteros.

source: The axis on which the converted value is plotted.
es_es: Eje en el que se dibuja el valor convertido.

source: *axis* is unused.
es_es: *eje* no se utiliza.

source: float or ndarray[float]
es_es: decimal o ndarray[float]

source: Set and update the `~matplotlib.axis.Axis` units.
es_es: Establece y actualiza las unidades `~matplotlib.axis.Axis`.

source: str or iterable of str
es_es: str o iterable de str

source: axis on which the data is plotted
es_es: eje en el que se trazan los datos

source: object storing string to integer mapping
es_es: cadena de almacenamiento de objetos a mapeo entero

source: String representation of the data at every tick.
es_es: Representación de cadena de los datos en cada tick.

source: **units_mapping**
es_es: **unidades_mapeo**

source: Mapping of category names (str) to indices (int).
es_es: Mapeo de nombres de categorías (str) a índices (int).

source: Return the tick labels for all the ticks at once.
es_es: Devuelve las etiquetas de los marcadores de todos los ticks a la vez.

source: Tick at every integer mapping of the string data.
es_es: Marcar en cada mapeo entero de los datos de cadena.

source: Return the values of the located ticks given **vmin** and **vmax**.
es_es: Devuelve los valores de los marcadores localizados dados **vmin** y **vmax**.

source: To get tick locations with the vmin and vmax values defined automatically for the associated :attr:`axis` simply call the Locator instance::
es_es: Para obtener las ubicaciones de los marcadores con los valores vmin y vmax definidos automáticamente para el :attr:`eje` asociado, simplemente llame a la instancia Locator::

source: Create mapping between unique categorical values and integer ids.
es_es: Crear mapeo entre valores categóricos únicos e ids enteros.

source: sequence of string values
es_es: secuencia de valores de cadena

source: Map new values to integer identifiers.
es_es: Mapear nuevos valores a identificadores enteros.

source: iterable of str or bytes
es_es: iterable de str o bytes

source: Raises
es_es: Plantea

source: If elements in *data* are neither str nor bytes.
es_es: Si los elementos en *data* no son ni str ni bytes.
