Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/cbook_api.po
Languages: es_es

source: This is meant to be used for a homogeneous list of artists, so that they don't cause long, meaningless output.
es_es: Esto está pensado para ser usado para una lista homogénea de artistas, de modo que no causen una salida larga y sin sentido.

source: Instead of ::
es_es: En lugar de ::

source: one will get ::
es_es: uno obtendrá ::

source: If ``self.type`` is None, the type name is obtained from the first item in the list (if any).
es_es: Si ``self.type`` no es Ninguno, el nombre del tipo se obtiene del primer elemento de la lista (si existe).

source: Resample an array with ``steps - 1`` points between original point pairs.
es_es: Ejemplo de una matriz con puntos ``steps - 1`` entre pares de puntos originales.

source: Along each column of *a*, ``(steps - 1)`` points are introduced between each original values; the values are linearly interpolated.
es_es: A lo largo de cada columna de *a*, los puntos ``(pasos - 1)`` se introducen entre cada valor original; los valores se interpolan linealmente.

source: **a**
es_es: **un**

source: array, shape (n, ...)
es_es: array, forma (n, ...)

source: **steps**
es_es: **Pasos**

source: shape ``((n - 1) * steps + 1, ...)``
es_es: forma ``((n - 1) * pasos + 1, ...)``

source: Remove latex formatting from mathtext.
es_es: Remueve el formato de latex del texto matemático.

source: Only handles fully math and fully non-math strings.
es_es: Sólo maneja cadenas completamente matemáticas y no matemáticas.

source: Convert a path to an open file handle or pass-through a file-like object.
es_es: Convierte una ruta a un manejador de archivos abierto o pase a través de un objeto tipo archivo.

source: Consider using `open_file_cm` instead, as it allows one to properly close newly created file objects more easily.
es_es: Considere usar `open_file_cm` en su lugar, ya que permite cerrar correctamente los objetos de archivo recién creados con mayor facilidad.

source: str or path-like or file-like
es_es: str o como ruta o archivo

source: If `str` or `os.PathLike`, the file is opened using the flags specified by *flag* and *encoding*. If a file-like object, it is passed through.
es_es: Si `str` o `os.Path.U`, el archivo se abre usando las banderas especificadas por *flag* y *encoding*. Si un objeto similar a un archivo, se pasa a través.

source: **flag**
es_es: **bandera**

source: str, default: 'r'
es_es: str, por defecto: 'r'

source: Passed as the *mode* argument to `open` when *fname* is `str` or `os.PathLike`; ignored if *fname* is file-like.
es_es: Pasado como el argumento *mode* a `open` cuando *fname* es `str` o `os.Path.U`; ignorado si *fname* es como archivo.

source: **return_opened**
es_es: **devolución_abierta**

source: bool, default: False
es_es: bool, por defecto: False

source: If True, return both the file object and a boolean indicating whether this was a new file (that the caller needs to close). If False, return only the new file.
es_es: Si es verdadero, devuelve tanto el objeto de archivo como un booleano indicando si este era un nuevo archivo (que la persona que llama necesita cerrar). Si False, devuelve sólo el nuevo archivo.

source: **encoding**
es_es: **codificando**

source: str or None, default: None
es_es: str o ninguno, por defecto: Ninguno

source: file-like
es_es: como archivo

source: **opened**
es_es: **abierto**

source: *opened* is only returned if *return_opened* is True.
es_es: *abierto* sólo se devuelve si *return_opened* es True.

source: Return a list of dictionaries of data which can be used to draw a series of violin plots.
es_es: Devuelve una lista de diccionarios de datos que se pueden utilizar para dibujar una serie de parcelas de violín.

source: See the ``Returns`` section below to view the required keys of the dictionary.
es_es: Vea la sección ``Devuelve`` de abajo para ver las claves requeridas del diccionario.

source: Users can skip this function and pass a user-defined set of dictionaries with the same keys to `~.axes.Axes.violinplot` instead of using Matplotlib to do the calculations. See the *Returns* section below for the keys that must be present in the dictionaries.
es_es: Los usuarios pueden omitir esta función y pasar un conjunto definido por el usuario de diccionarios con las mismas claves a `~.axes.Axes. iolinplot` en lugar de usar Matplotlib para hacer los cálculos. Vea la sección *Devuelve* de abajo para las claves que deben estar presentes en los diccionarios.

source: Sample data that will be used to produce the gaussian kernel density estimates. Must have 2 or fewer dimensions.
es_es: Datos de ejemplo que se usarán para producir las estimaciones de densidad del núcleo gaussiano. Debe tener 2 o menos dimensiones.

source: **method**
es_es: **método**

source: callable
es_es: llamable

source: The method used to calculate the kernel density estimate for each column of data. When called via ``method(v, coords)``, it should return a vector of the values of the KDE evaluated at the values specified in coords.
es_es: El método utilizado para calcular la estimación de densidad del núcleo para cada columna de datos. Cuando se llama a través de ``method(v, coords)``, debe devolver un vector de los valores de KDE evaluados en los valores especificados en coordenadas.

source: **points**
es_es: **puntos**

source: int, default: 100
es_es: int, por defecto: 100

source: Defines the number of points to evaluate each of the gaussian kernel density estimates at.
es_es: Define el número de puntos en los que evaluar cada una de las estimaciones de densidad del núcleo gaussiano.

source: **quantiles**
es_es: **cantidades**

source: array-like, default: None
es_es: como array-like, default: ninguno

source: Defines (if not None) a list of floats in interval [0, 1] for each column of data, which represents the quantiles that will be rendered for that column of data. Must have 2 or fewer dimensions. 1D array will be treated as a singleton list containing them.
es_es: Define (si no ninguno) una lista de flotantes en el intervalo [0, 1] para cada columna de datos, que representa las cantidades que serán renderizadas para esa columna de datos. Debe tener 2 o menos dimensiones. La matriz 1D será tratada como una lista de singleton que las contiene.

source: A list of dictionaries containing the results for each column of data. The dictionaries contain at least the following:
es_es: Una lista de diccionarios que contienen los resultados de cada columna de datos. Los diccionarios contienen al menos lo siguiente:

source: coords: A list of scalars containing the coordinates this particular kernel density estimate was evaluated at.
es_es: coordenadas: Una lista de escalares que contienen las coordenadas en las que se evaluó esta estimación de densidad del núcleo en particular.

source: vals: A list of scalars containing the values of the kernel density estimate at each of the coordinates given in *coords*.
es_es: vals: Una lista de escalares que contienen los valores de la estimación de densidad del núcleo en cada una de las coordenadas dadas en *coords*.

source: mean: The mean value for this column of data.
es_es: significado: El valor promedio de esta columna de datos.

source: median: The median value for this column of data.
es_es: mediana: El valor medio para esta columna de datos.

source: min: The minimum value for this column of data.
es_es: min: El valor mínimo para esta columna de datos.

source: max: The maximum value for this column of data.
es_es: max: El valor máximo para esta columna de datos.

source: quantiles: The quantile values for this column of data.
es_es: quantiles: Los valores cuantitativos para esta columna de datos.
