Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/cbook_api.po
Languages: es_es

source: A collection of utility functions and classes. Originally, many (but not all) were from the Python Cookbook -- hence the name cbook.
es_es: Una colección de funciones y clases de utilidad. Originalmente, muchas (pero no todas) eran de Python Cookbook -- de ahí el nombre del libro.

source: This module is safe to import from anywhere within Matplotlib; it imports Matplotlib only at runtime.
es_es: Este módulo es seguro para importar desde cualquier lugar dentro de Matplotlib; importa Matplotlib sólo en tiempo de ejecución.

source: Handle registering, processing, blocking, and disconnecting for a set of signals and callbacks:
es_es: Maneja el registro, procesar, bloquear y desconectar para un conjunto de señales y callbacks:

source: In practice, one should always disconnect all callbacks when they are no longer needed to avoid dangling references (and thus memory leaks). However, real code in Matplotlib rarely does so, and due to its design, it is rather difficult to place this kind of code. To get around this, and prevent this class of memory leaks, we instead store weak references to bound methods only, so when the destination object needs to die, the CallbackRegistry won't keep it alive.
es_es: En la práctica, siempre se deben desconectar todos los callbacks cuando ya no son necesarios para evitar referencias peligrosas (y por lo tanto fugas de memoria). Sin embargo, el código real en Matplotlib rara vez lo hace, y debido a su diseño, es bastante difícil colocar este tipo de código. Para evitar esto, y evitar esta clase de fugas de memoria, almacenamos referencias débiles sólo a métodos enlazados, así que cuando el objeto de destino necesita morir, el CallbackRegistry no lo mantendrá vivo.

source: Parameters
es_es: Parámetros

source: **exception_handler**
es_es: **excepcion_handler**

source: callable, optional
es_es: llamable, opcional

source: If not None, *exception_handler* must be a function that takes an `Exception` as single parameter. It gets called with any `Exception` raised by the callbacks during `CallbackRegistry.process`, and may either re-raise the exception or handle it in another manner.
es_es: Si no es Ninguno, *exception_handler* debe ser una función que tome una `Exception` como un solo parámetro. Se llama con cualquier 'Excepción' levantada por los callbacks durante 'CallbackRegistry.process', y puede volver a levantar la excepción o manejarla de otra manera.

source: The default handler prints the exception (with `traceback.print_exc`) if an interactive event loop is running; it re-raises the exception if no interactive event loop is running.
es_es: El manejador predeterminado imprime la excepción (con `traceback. rint_exc`) si se está ejecutando un bucle de eventos interactivo; vuelve a levantar la excepción si no se está ejecutando un bucle de eventos interactivo.

source: Block callback signals from being processed.
es_es: Bloquea que las señales de callback sean procesadas.

source: A context manager to temporarily block/disable callback signals from being processed by the registered listeners.
es_es: Un gestor de contexto para bloquear/desactivar temporalmente las señales de callback de ser procesadas por los oyentes registrados.

source: **signal**
es_es: **señal**

source: str, optional
es_es: str, opcional

source: The callback signal to block. The default is to block all signals.
es_es: La señal de callback a bloquear. El valor por defecto es bloquear todas las señales.

source: Register *func* to be called when signal *signal* is generated.
es_es: Registrar *función* para ser llamado cuando se genera la señal *señal*.

source: Disconnect the callback registered with callback id *cid*.
es_es: Desconecte el callback registrado con el identificador de callback *cid*.

source: No error is raised if such a callback does not exist.
es_es: No se produce ningún error si este callback no existe.

source: Process signal *s*.
es_es: Procesar señal *s*.

source: All of the functions registered to receive callbacks on *s* will be called with ``*args`` and ``**kwargs``.
es_es: Todas las funciones registradas para recibir llamadas en *s* serán llamadas con ``*args`` y ``**kwargs``.

source: A disjoint-set data structure.
es_es: Una estructura de datos dis-set.

source: Objects can be joined using :meth:`join`, tested for connectedness using :meth:`joined`, and all disjoint sets can be retrieved by using the object as an iterator.
es_es: Los objetos pueden ser unidos usando :meth:`join`, probados para la conexión usando :meth:`joined`, y todos los conjuntos de desarticulaciones pueden ser recuperados usando el objeto como iterador.

source: The objects being joined must be hashable and weak-referenceable.
es_es: Los objetos que se unen deben ser difíciles y de referencia débil.

source: Examples
es_es: Ejemplos

source: Clean dead weak references from the dictionary.
es_es: Limpiar las referencias muertas débiles del diccionario.

source: Return all of the items joined with *a*, including itself.
es_es: Devuelve todos los objetos unidos con *a*, incluyendo a sí mismo.

source: Join given arguments into the same set. Accepts one or more arguments.
es_es: Unir argumentos dados en el mismo conjunto. Acepta uno o más argumentos.

source: Return whether *a* and *b* are members of the same set.
es_es: Devuelve si *a* y *b* son miembros del mismo conjunto.

source: Stack of elements with a movable cursor.
es_es: Pila de elementos con un cursor móvil.

source: Mimics home/back/forward in a web browser.
es_es: Mimica home/back/forward en un navegador web.

source: Move the position back and return the current element.
es_es: Mueve la posición hacia atrás y devuelve el elemento actual.

source: Raise all references of *o* to the top of the stack, and return it.
es_es: Aumenta todas las referencias de *o* a la parte superior de la pila y devuelve la pila.

source: Raises
es_es: Plantea

source: If *o* is not in the stack.
es_es: Si *o* no está en la pila.

source: Empty the stack.
es_es: Vaciar la pila.

source: Return whether the stack is empty.
es_es: Devuelve si la pila está vacía.

source: Move the position forward and return the current element.
es_es: Mueve la posición hacia adelante y devuelve el elemento actual.

source: Push the first element onto the top of the stack.
es_es: Empuja el primer elemento en la parte superior de la pila.

source: The first element is returned.
es_es: El primer elemento es devuelto.

source: Push *o* to the stack at current position. Discard all later elements.
es_es: Push *o* a la pila en la posición actual. Descartar todos los elementos posteriores.

source: *o* is returned.
es_es: *o* es devuelto.

source: Remove *o* from the stack.
es_es: Eliminar *o* de la pila.

source: Return a list of dictionaries of statistics used to draw a series of box and whisker plots using `~.Axes.bxp`.
es_es: Devuelve una lista de diccionarios de estadísticas utilizadas para dibujar una serie de parcelas de caja y whisker usando `~.Axes.bxp`.

source: Data that will be represented in the boxplots. Should have 2 or fewer dimensions.
es_es: Datos que serán representados en las casillas. Debe tener 2 o menos dimensiones.

source: **whis**
es_es: **susurro**

source: float or (float, float), default: 1.5
es_es: flotante o (flotante), por defecto: 1.5

source: The position of the whiskers.
es_es: La posición de los whiskers.

source: If a float, the lower whisker is at the lowest datum above ``Q1 - whis*(Q3-Q1)``, and the upper whisker at the highest datum below ``Q3 + whis*(Q3-Q1)``, where Q1 and Q3 are the first and third quartiles. The default value of ``whis = 1.5`` corresponds to Tukey's original definition of boxplots.
es_es: Si un flotante, el batidor más bajo es el datum más bajo sobre ``Q1 - whis*(Q3-Q1)``, y la parte superior del whisker en el datum más alto por debajo de ``Q3 + whis*(Q3-Q1)``, donde los Q1 y los Q3 son los primeros y los tercero cuartiles. El valor predeterminado de ``whis = 1.5`` corresponde a la definición original de Tukey de las casillas.

source: If a pair of floats, they indicate the percentiles at which to draw the whiskers (e.g., (5, 95)). In particular, setting this to (0, 100) results in whiskers covering the whole range of the data.
es_es: Si un par de carrozas, indican los percentiles en los que dibujar las batidoras (por ejemplo, (5, 95)). En particular, la fijación de esto a (0, 100) da lugar a que los whiskers cubran toda la gama de datos.

source: In the edge case where ``Q1 == Q3``, *whis* is automatically set to (0, 100) (cover the whole range of the data) if *autorange* is True.
es_es: En el caso donde ``Q1 == Q3``, *whis* se establece automáticamente en (0, 100) (cubre todo el rango de los datos) si *autorange* es verdadero.

source: Beyond the whiskers, data are considered outliers and are plotted as individual points.
es_es: Más allá de los whiskers, los datos se consideran atípicos y se trazan como puntos individuales.

source: int, optional
es_es: int, opcional

source: Number of times the confidence intervals around the median should be bootstrapped (percentile method).
es_es: Número de veces que los intervalos de confianza alrededor de la mediana deben ser arrancados (método percentil).

source: array-like, optional
es_es: tipo arreglo, opcional

source: Labels for each dataset. Length must be compatible with dimensions of *X*.
es_es: Etiquetas para cada conjunto de datos. La longitud debe ser compatible con dimensiones de *X*.

source: bool, optional (False)
es_es: bool, opcional (False)

source: When `True` and the data are distributed such that the 25th and 75th percentiles are equal, ``whis`` is set to (0, 100) such that the whisker ends are at the minimum and maximum of the data.
es_es: Cuando `True` y los datos se distribuyen de tal forma que los percentiles 25 y 75 son iguales, ``whis`` está establecido en (0, 100) tal que los extremos del whisker son al mínimo y máximo de los datos.

source: Returns
es_es: Devuelve

source: list of dict
es_es: lista de dictado

source: A list of dictionaries containing the results for each column of data. Keys of each dictionary are the following:
es_es: Una lista de diccionarios que contienen los resultados de cada columna de datos. Las claves de cada diccionario son las siguientes:

source: Key
es_es: Clave

source: Value Description
es_es: Descripción del valor

source: label
es_es: etiqueta

source: tick label for the boxplot
es_es: etiqueta de tick para el boxplot

source: mean
es_es: media

source: arithmetic mean value
es_es: valor medio aritmético

source: 50th percentile
es_es: Percentil 50

source: first quartile (25th percentile)
es_es: primer cuartil (percentil 25)

source: third quartile (75th percentile)
es_es: tercer cuartil (75º percentile)

source: lower notch around the median
es_es: nitidez inferior alrededor de la media

source: upper notch around the median
es_es: muelle superior alrededor de la media

source: end of the lower whisker
es_es: extremo de la batidora inferior

source: end of the upper whisker
es_es: extremo de la batidora superior

source: fliers
es_es: plumas

source: outliers
es_es: atípicos

source: Non-bootstrapping approach to confidence interval uses Gaussian-based asymptotic approximation:
es_es: La aproximación asíntotica basada en Gaussiano no es el método de arranque para el intervalo de confianza:

source: Return a list of (ind0, ind1) such that ``mask[ind0:ind1].all()`` is True and we cover all such regions.
es_es: Devuelve una lista de (ind0, ind1) tales que ``mask[ind0:ind1].all()`` es True y cubrimos todas esas regiones.

source: Find all masked and/or non-finite points in a set of arguments, and return the arguments with only the unmasked points remaining.
es_es: Encontrar todos los puntos enmascarados y/o no finitos en un conjunto de argumentos, y devolver los argumentos con sólo los puntos sin enmascarar restantes.

source: Arguments can be in any of 5 categories:
es_es: Los argumentos pueden estar en cualquiera de 5 categorías:

source: 1-D masked arrays
es_es: Arreglos enmascarados 1-D

source: ndarrays with more than one dimension
es_es: ndarrays con más de una dimensión

source: other non-string iterables
es_es: otros iterables que no son cadenas

source: anything else
es_es: cualquier otra cosa

source: The first argument must be in one of the first four categories; any argument with a length differing from that of the first argument (and hence anything in category 5) then will be passed through unchanged.
es_es: El primer argumento debe ser en una de las cuatro primeras categorías; cualquier argumento con una longitud diferente de la del primer argumento (y por lo tanto cualquier argumento de la categoría 5) entonces será pasado sin cambios.

source: Masks are obtained from all arguments of the correct length in categories 1, 2, and 4; a point is bad if masked in a masked array or if it is a nan or inf. No attempt is made to extract a mask from categories 2, 3, and 4 if `numpy.isfinite` does not yield a Boolean array.
es_es: Las máscaras se obtienen de todos los argumentos de la longitud correcta en las categorías 1, 2 y 4; un punto es malo si está enmascarado en una matriz enmascarada o si es un nan o inf. No se intenta extraer una máscara de las categorías 2, 3 y 4 si `numpy.isfinite` no produce una matriz booleana.

source: All input arguments that are not passed unchanged are returned as ndarrays after removing the points or rows corresponding to masks in any of the arguments.
es_es: Todos los argumentos de entrada que no se pasan sin cambios se devuelven como ndarrays después de eliminar los puntos o filas correspondientes a las máscaras en cualquiera de los argumentos.

source: A vastly simpler version of this function was originally written as a helper for Axes.scatter().
es_es: Una versión mucho más simple de esta función fue escrita originalmente como un ayudante para Axes.scatter().

source: Return whether the given writable file-like object requires Unicode to be written to it.
es_es: Devuelve si el objeto de tipo archivo escribible requiere Unicode para escribirlo.

source: Return a generator of flattened nested containers.
es_es: Devuelve un generador de contenedores anidados aplanados.

source: For example:
es_es: Por ejemplo:

source: By: Composite of Holger Krekel and Luther Blissett From: https://code.activestate.com/recipes/121294/ and Recipe 1.12 in cookbook
es_es: Por: Compuesto de Holger Krekel y Luther Blissett De: https://code.activestate.com/recipes/121294/ y Receta 1.12 en libro de cocina

source: Return a sample data file. *fname* is a path relative to the :file:`mpl-data/sample_data` directory. If *asfileobj* is `True` return a file object, otherwise just a file path.
es_es: Devuelve un archivo de datos de ejemplo. *fname* es una ruta relativa al directorio :file:`mpl-data/sample_data`. Si *asfileobj* es `True` devuelve un objeto de archivo, de lo contrario sólo una ruta de archivo.

source: Sample data files are stored in the 'mpl-data/sample_data' directory within the Matplotlib package.
es_es: Los archivos de datos de ejemplo se almacenan en el directorio 'mpl-data/sample_data' dentro del paquete Matplotlib.

source: If the filename ends in .gz, the file is implicitly ungzipped. If the filename ends with .npy or .npz, *asfileobj* is True, and *np_load* is True, the file is loaded with `numpy.load`. *np_load* currently defaults to False but will default to True in a future release.
es_es: Si el nombre del archivo termina en .gz, el archivo se desgziped implícitamente. pz, *asfileobj* es True, y *np_load* es True, el archivo está cargado con `numpy.load`. *np_load* actualmente está por defecto en False pero por defecto será True en una versión futura.

source: A helper function to create reasonable x values for the given *y*.
es_es: Una función de ayuda para crear valores x razonables para el *y* dado.

source: This is used for plotting (x, y) if x values are not explicitly given.
es_es: Esto se usa para trazar (x, y) si los valores x no se dan explícitamente.

source: First try ``y.index`` (assuming *y* is a `pandas.Series`), if that fails, use ``range(len(y))``.
es_es: Primero intente ``y.index`` (asumiendo que *y* es un `pandas.Series`), si eso falla, use ``range(len(y))``.

source: This will be extended in the future to deal with more types of labeled data.
es_es: Esto se ampliará en el futuro para tratar con más tipos de datos etiquetados.

source: float or array-like
es_es: flotante o matriz

source: The x and y values to plot.
es_es: Los valores x e y a trazar.

source: Return whether the string *s* contains math expressions.
es_es: Devuelve si la cadena *s* contiene expresiones matemáticas.

source: This is done by checking whether *s* contains an even number of non-escaped dollar signs.
es_es: Esto se hace comprobando si *s* contiene un número par de signos en dólares no escapados.

source: Return whether the given object is a scalar or string like.
es_es: Devuelve si el objeto dado es escalar o como una cadena.

source: Return whether *obj* looks like a file object with a *write* method.
es_es: Devuelve si *obj* se parece a un objeto de archivo con un método de *escritura*.

source: Maps short codes for line style to their full name used by backends.
es_es: Mapea códigos cortos para el estilo de línea a su nombre completo utilizado por los backends.

source: Maps full names for line styles used by backends to their short codes.
es_es: Mapa los nombres completos de los estilos de línea utilizados por los backends a sus códigos cortos.

source: A dictionary with a maximum size.
es_es: Un diccionario con un tamaño máximo.

source: This doesn't override all the relevant methods to constrain the size, just ``__setitem__``, so use with caution.
es_es: Esto no anula todos los métodos relevantes para restringir el tamaño, solo ``__setitem__``, así que usa con precaución.

source: Helper function to normalize kwarg inputs.
es_es: Función de ayuda para normalizar las entradas de kwarg.

source: dict or None
es_es: dict o None

source: A dict of keyword arguments. None is explicitly supported and treated as an empty dict, to support functions with an optional parameter of the form ``props=None``.
es_es: Un dictado de argumentos de palabras clave. Ninguno es explícitamente soportado y tratado como un dictado vacío, para soportar funciones con un parámetro opcional de la forma ``props=Every``.

source: **alias_mapping**
es_es: **alias_mapeo**

source: dict or Artist subclass or Artist instance, optional
es_es: dictar o subclase del artista o instancia del artista, opcional

source: A mapping between a canonical name to a list of aliases, in order of precedence from lowest to highest.
es_es: Un mapeo entre un nombre canónico a una lista de alias, en orden de precedencia de menor a mayor.

source: If the canonical value is not in the list it is assumed to have the highest priority.
es_es: Si el valor canónico no está en la lista, se asume que tiene la máxima prioridad.

source: If an Artist subclass or instance is passed, use its properties alias mapping.
es_es: Si se pasa una subclase o instancia del Artista, utilice el mapeo de alias de sus propiedades.

source: To match what Python raises if invalid arguments/keyword arguments are passed to a callable.
es_es: Para hacer coincidir lo que Python plantea si se pasan argumentos no válidos/palabra clave a una llamada.

source: Pass through file objects and context-manage path-likes.
es_es: Pasar a través de objetos de archivo y archivos de gestión de rutas similares.

source: Print loops of cyclic references in the given *objects*.
es_es: Imprime bucles de referencias cíclicas en los *objetos* dados.

source: It is often useful to pass in ``gc.garbage`` to find the cycles that are preventing some objects from being garbage collected.
es_es: A menudo es útil pasar en ``gc.garbage`` para encontrar los ciclos que impiden que algunos objetos sean recolectados en basura.

source: **objects**
es_es: **objetos**

source: A list of objects to find cycles in.
es_es: Una lista de objetos en los que encontrar ciclos.

source: The stream for output.
es_es: El flujo de salida.

source: **show_progress**
es_es: **mostrar_progreso**

source: If True, print the number of objects reached as they are found.
es_es: Si es verdadero, imprima el número de objetos alcanzados como se encuentran.

source: Convert continuous line to mid-steps.
es_es: Convierte línea continua a pasos intermedios.

source: Given a set of ``N`` points convert to ``2N`` points which when connected linearly give a step function which changes values at the middle of the intervals.
es_es: Dado un conjunto de puntos ``N`` convertir a puntos ``2N`` que cuando se conectan linealmente dan una función de paso que cambia los valores en medio de los intervalos.

source: The x location of the steps. May be empty.
es_es: La posición x de los pasos. Puede estar vacía.

source: y arrays to be turned into steps; all must be the same length as ``x``.
es_es: arrays y se convertirán en pasos; todos deben ser de la misma longitud que ``x``.

source: The x and y values converted to steps in the same order as the input; can be unpacked as ``x_out, y1_out, ..., yp_out``. If the input is length ``N``, each of these arrays will be length ``2N``.
es_es: Los valores x e y convertidos a pasos en el mismo orden que la entrada; pueden ser desempaquetados como ``x_out, y1_out, . ., yp_out``. Si la entrada es longitud ``N``, cada una de estas matrices será de longitud ``2N``.

source: Convert continuous line to post-steps.
es_es: Convierte línea continua a pasos posteriores.

source: Given a set of ``N`` points convert to ``2N + 1`` points, which when connected linearly give a step function which changes values at the end of the intervals.
es_es: Dado un conjunto de puntos ``N`` convertidos a puntos ``2N + 1``, que cuando se conecta linealmente dan una función de paso que cambia los valores al final de los intervalos.

source: The x and y values converted to steps in the same order as the input; can be unpacked as ``x_out, y1_out, ..., yp_out``. If the input is length ``N``, each of these arrays will be length ``2N + 1``. For ``N=0``, the length will be 0.
es_es: Los valores x e y convertidos a pasos en el mismo orden que la entrada; pueden ser desempaquetados como ``x_out, y1_out, ..., yp_out``. Si la entrada es longitud ``N``, cada una de estas matrices será de longitud ``2N + 1``. Para ``N=0``, la longitud será 0.

source: Convert continuous line to pre-steps.
es_es: Convierte línea continua a pasos previos.

source: Given a set of ``N`` points, convert to ``2N - 1`` points, which when connected linearly give a step function which changes values at the beginning of the intervals.
es_es: Dado un conjunto de puntos ``N``, convertir a puntos ``2N - 1``. que cuando se conecta linealmente dan una función de paso que cambia los valores al principio de los intervalos.

source: [*Deprecated*] Return the memory consumed by the process.
es_es: [*Obsoleto*] Devuelve la memoria consumida por el proceso.

source: Return the first element in *obj*.
es_es: Devuelve el primer elemento en *obj*.

source: This is an type-independent way of obtaining the first element, supporting both index access and the iterator protocol.
es_es: Esta es una forma independiente de obtener el primer elemento, que apoya tanto el acceso al índice como el protocolo del iterador.

source: Convert dictview objects to list. Other inputs are returned unchanged.
es_es: Convierte objetos dictview a la lista. Otras entradas son devueltas sin cambios.

source: A list with a short ``repr()``.
es_es: Una lista con un breve ``repr()``.
