Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/collections_api.po
Languages: es_es

source: Return a `.BrokenBarHCollection` that plots horizontal bars from over the regions in *x* where *where* is True. The bars range on the y-axis from *ymin* to *ymax*
es_es: Devuelve un `.BrokenBarHCollection` que traza barras horizontales de las regiones en *x* donde *donde* es verdadero. El rango de barras en el eje Y va de *ymin* a *ymax*

source: *kwargs* are passed on to the collection.
es_es: *kwargs* son transmitidos a la colección.

source: A collection of circles, drawn using splines.
es_es: Una colección de círculos, dibujados con splines.

source: float or array-like
es_es: flotante o matriz

source: The area of each circle in points^2.
es_es: El área de cada círculo en puntos^2.

source: Base class for Collections. Must be subclassed to be usable.
es_es: Clase base para colecciones. Debe ser subclasificado para ser utilizable.

source: A Collection represents a sequence of `.Patch`\es that can be drawn more efficiently together than individually. For example, when a single path is being drawn repeatedly at different offsets, the renderer can typically execute a ``draw_marker()`` call much more efficiently than a series of repeated calls to ``draw_path()`` with the offsets put in one-by-one.
es_es: Una colección representa una secuencia de `.Patch`\es que se puede dibujar juntos de forma más eficiente que individualmente. Por ejemplo, cuando se dibuja una sola ruta repetidamente en diferentes desplazamientos, el renderizador normalmente puede ejecutar una llamada ``draw_marker()`` mucho más eficientemente que una serie de llamadas repetidas a ``draw_path()`` con los desplazamientos puestos en uno por uno.

source: Most properties of a collection can be configured per-element. Therefore, Collections have "plural" versions of many of the properties of a `.Patch` (e.g. `.Collection.get_paths` instead of `.Patch.get_path`). Exceptions are the *zorder*, *hatch*, *pickradius*, *capstyle* and *joinstyle* properties, which can only be set globally for the whole collection.
es_es: La mayoría de las propiedades de una colección se pueden configurar por elemento. Por lo tanto, las colecciones tienen versiones "plural" de muchas de las propiedades de un `.Patch` (por ejemplo, `.Collection. et_paths` en lugar de `.Patch.get_path`). Las excepciones son las propiedades *zorder*, *hatch*, *pickradius*, *capstyle* y *joinstyle*, que sólo pueden establecerse globalmente para toda la colección.

source: Besides these exceptions, all properties can be specified as single values (applying to all elements) or sequences of values. The property of the ``i``\th element of the collection is::
es_es: Además de estas excepciones, todas las propiedades pueden ser especificadas como valores únicos (aplicables a todos los elementos) o secuencias de valores. La propiedad del elemento ``i``\th de la colección es::

source: Each Collection can optionally be used as its own `.ScalarMappable` by passing the *norm* and *cmap* parameters to its constructor. If the Collection's `.ScalarMappable` matrix ``_A`` has been set (via a call to `.Collection.set_array`), then at draw time this internal scalar mappable will be used to set the ``facecolors`` and ``edgecolors``, ignoring those that were manually passed in.
es_es: Cada Colección puede ser usada opcionalmente como su propio `.ScalarMappable` pasando los parámetros *normal* y *cmap* a su constructor. Si la matriz `.ScalarMappable` de la colección ``_A`` ha sido establecida (a través de una llamada a `. ollection.set_array`), luego en el momento de dibujo, este mapeable escalar interno será usado para establecer los ``facecolors`` y ``edgecolors``, ignorando los que fueron pasados manualmente.

source: **edgecolors** : color or list of colors, default: :rc:`patch.edgecolor`
es_es: **colores** : color o lista de colores, por defecto: :rc:`patch.edgecolor`

source: color or list of colors, default:
es_es: color o lista de colores, por defecto:

source: Edge color for each patch making up the collection. The special value 'face' can be passed to make the edgecolor match the facecolor.
es_es: Color del borde para cada parche que integra la colección. El valor especial 'cara' se puede pasar para hacer que el color del borde coincida con el color de facecolor.

source: **facecolors** : color or list of colors, default: :rc:`patch.facecolor`
es_es: **facecolors** : color o lista de colores, por defecto: :rc:`patch.facecolor`

source: Face color for each patch making up the collection.
es_es: Color de cara para cada parche que integra la colección.

source: **linewidths** : float or list of floats, default: :rc:`patch.linewidth`
es_es: **widths** : float o lista de floats, por defecto: :rc:`patch.linewidth`

source: float or list of floats, default:
es_es: flotante o lista de flotantes, por defecto:

source: Line width for each patch making up the collection.
es_es: Ancho de línea para cada parche que integra la colección.

source: str or tuple or list thereof, default: 'solid'
es_es: str o tuple o lista de ellos, por defecto: 'sólid'

source: Valid strings are ['solid', 'dashed', 'dashdot', 'dotted', '-', '--', '-.', ':']. Dash tuples should be of the form::
es_es: Las cadenas válidas son ['sólidas', 'guiones', 'guiones', 'punto', '-', '--', '-.', ':']. Las tuplas de guión deben ser de la forma::

source: where *onoffseq* is an even length tuple of on and off ink lengths in points. For examples, see :doc:`/gallery/lines_bars_and_markers/linestyles`.
es_es: donde *onoffseq* es una tupla de longitud uniforme de longitudes de tinta en y en puntos de tinta. Por ejemplo, vea :doc:`/gallery/lines_bars_and_markers/linestyles`.

source: CapStyle-like, default: rcParams["patch.capstyle"]
es_es: CapStyle-like por defecto: rcParams["patch.capstyle"]

source: Style to use for capping lines for all paths in the collection. Allowed values are {'butt', 'projecting', 'round'}.
es_es: Estilo a usar para líneas de tope para todas las rutas de la colección. Los valores permitidos son {'butt', 'projecting', 'round'}.

source: Style to use for joining lines for all paths in the collection. Allowed values are {'miter', 'round', 'bevel'}.
es_es: Estilo a usar para unir líneas para todas las rutas de la colección. Los valores permitidos son {'miter', 'round', 'bevel'}.

source: **antialiaseds** : bool or list of bool, default: :rc:`patch.antialiased`
es_es: **antialiaseds** : bool o lista de bool, por defecto: :rc:`patch.antialiased`

source: bool or list of bool, default:
es_es: libro o lista de bool, por defecto:

source: Whether each patch in the collection should be drawn with antialiasing.
es_es: Si cada parche en la colección debe ser dibujado con antialiasing.

source: (float, float) or list thereof, default: (0, 0)
es_es: (flotante, flotante) o lista de ellos, por defecto: (0, 0)

source: A vector by which to translate each patch after rendering (default is no translation). The translation is performed in screen (pixel) coordinates (i.e. after the Artist's transform is applied).
es_es: Un vector por el que traducir cada parche después de renderizado (por defecto no es traducción). La traducción se realiza en coordenadas de pantalla (píxeles) (es decir, después de la transformación del Artista).

source: **transOffset** : `~.transforms.Transform`, default: `.IdentityTransform`
es_es: **transOffset** : `~.transforms.Transform`, por defecto: `.IdentityTransform`

source: Transform, default: IdentityTransform
es_es: Transforma, por defecto: IdentityTransform

source: A single transform which will be applied to each *offsets* vector before it is used.
es_es: Una única transformación que se aplicará a cada vector *offsets* antes de ser usado.

source: **norm** : `~.colors.Normalize`, optional
es_es: **normal** : `~.colors.Normalize`, opcional

source: Normalize, optional
es_es: Normalizar, opcional

source: Forwarded to `.ScalarMappable`. The default of ``None`` means that the first draw call will set ``vmin`` and ``vmax`` using the minimum and maximum values of the data.
es_es: Reenviado a `.ScalarMappable`. El valor por defecto de ``Ninguno`` significa que la primera llamada de dibujo establecerá ``vmin`` y ``vmax`` usando los valores mínimos y máximos de los datos.

source: **cmap** : `~.colors.Colormap`, optional
es_es: **cmap** : `~.colors.Colormap`, opcional

source: Colormap, optional
es_es: Mapa de colores, opcional

source: Forwarded to `.ScalarMappable`. The default of ``None`` will result in :rc:`image.cmap` being used.
es_es: Reenviado a `.ScalarMappable`. El valor predeterminado de ``Ninguno`` dará como resultado el uso de :rc:`image.cmap`.

source: **hatch**
es_es: **sombreo**

source: str, optional
es_es: str, opcional

source: Hatching pattern to use in filled paths, if any. Valid strings are ['/', '\', '|', '-', '+', 'x', 'o', 'O', '.', '*']. See :doc:`/gallery/shapes_and_collections/hatch_style_reference` for the meaning of each hatch type.
es_es: Patrón de eclosión para usar en rutas rellenas, si las hay. Las cadenas válidas son ['/', '\', '|', '-', '+', 'x', 'o', 'O', '. , '*']. Ver :doc:`/gallery/shapes_and_collections/hatch_style_reference` para ver el significado de cada tipo de colchón.

source: float, default: 5.0
es_es: float, por defecto: 5.0

source: If ``pickradius <= 0``, then `.Collection.contains` will return ``True`` whenever the test point is inside of one of the polygons formed by the control points of a Path in the Collection. On the other hand, if it is greater than 0, then we instead check if the test point is contained in a stroke of width ``2*pickradius`` following any of the Paths in the Collection.
es_es: Si ``pickradius <= 0``, entonces `.Collection. ontains` devolverá ``True`` cada vez que el punto de prueba esté dentro de uno de los polígonos formados por los puntos de control de una ruta en la colección. Por otra parte, si es mayor que 0, entonces comprobamos si el punto de prueba está contenido en un trazo de ancho ``2*pickradius`` siguiendo cualquiera de las rutas de la colección.

source: list of str, default: None
es_es: lista de str, por defecto: Ninguna

source: A URL for each patch to link to once drawn. Currently only works for the SVG backend. See :doc:`/gallery/misc/hyperlinks_sgskip` for examples.
es_es: Una URL para cada parche a la que vincular una vez que se dibuje. Actualmente solo funciona para el backend SVG. Vea :doc:`/gallery/misc/hyperlinks_sgskip` para ejemplos.

source: The drawing order, shared by all Patches in the Collection. See :doc:`/gallery/misc/zorder_demo` for all defaults and examples.
es_es: El orden de dibujo, compartido por todos los parches en la distribución. Vea :doc:`/gallery/misc/zorder_demo` para todos los valores predeterminados y ejemplos.

source: :meth:`antialiased <matplotlib.collections.Collection.set_antialiased>`
es_es: :meth:`antialias <matplotlib.collections.Collection.set_antialiased>`

source: A collection of ellipses, drawn using splines.
es_es: Una colección de elipses dibujados con splines.

source: The lengths of the first axes (e.g., major axis lengths).
es_es: Las longitudes de los primeros ejes (por ejemplo, las mayores longitudes del eje).

source: **heights**
es_es: **alturas**

source: The lengths of second axes.
es_es: Las longitudes de los ejes segundos.

source: **angles**
es_es: **Ángulos**

source: The angles of the first axes, degrees CCW from the x-axis.
es_es: Los ángulos de los primeros ejes, grados CCW del eje x.

source: **units**
es_es: **Unidades**

source: The units in which majors and minors are given; 'width' and 'height' refer to the dimensions of the axes, while 'x' and 'y' refer to the *offsets* data units. 'xy' differs from all others in that the angle as plotted varies with the aspect ratio, and equals the specified angle only when the aspect ratio is unity. Hence it behaves the same as the `~.patches.Ellipse` with ``axes.transData`` as its transform.
es_es: Las unidades en las que se dan los mayores y los menores; 'ancho' y 'altura' se refieren a las dimensiones de los ejes, mientras que 'x' y 'y' se refieren a las unidades de datos *offsets*. 'xy' difiere de todos los demás en que el ángulo como dibujado varía con la relación de aspecto, y equivale al ángulo especificado sólo cuando la relación de aspecto es unidad. Por lo tanto, se comporta lo mismo que el `~.patches.Ellipse` con ``axes.transData`` como su transforma.

source: Forwarded to `Collection`.
es_es: Reenviado a `Collection`.

source: A collection of locations along a single axis at which an "event" occurred.
es_es: Colección de ubicaciones a lo largo de un único eje en el que se produjo un "evento".

source: The events are given by a 1-dimensional array. They do not have an amplitude and are displayed as parallel lines.
es_es: Los eventos son dados por una matriz 1-dimensional, no tienen amplitud y se muestran como líneas paralelas.

source: **positions**
es_es: **posiciones**

source: Each value is an event.
es_es: Cada valor es un evento.

source: **orientation**
es_es: **orientación**

source: {'horizontal', 'vertical'}, default: 'horizontal'
es_es: {'horizontal', 'vertical'}, por defecto: 'horizontal'

source: The sequence of events is plotted along this direction. The marker lines of the single events are along the orthogonal direction.
es_es: La secuencia de acontecimientos está trazada a lo largo de esta dirección, las líneas marcadoras de los acontecimientos individuales van en la dirección ortogonal.

source: The offset of the center of the markers from the origin, in the direction orthogonal to *orientation*.
es_es: La compensación del centro de los marcadores desde el origen, en la dirección ortogonal a la *orientación*.

source: **linelength**
es_es: **longitud**

source: The total height of the marker (i.e. the marker stretches from ``lineoffset - linelength/2`` to ``lineoffset + linelength/2``).
es_es: La altura total del marcador (es decir, el marcador estira desde ``lineoffset - linelength/2`` hasta ``lineoffset + linelength/2``).

source: **linewidth** : float or list thereof, default: :rc:`lines.linewidth`
es_es: **ancho de línea** : float o lista de ellos, por defecto: :rc:`lines.linewidth`

source: float or list thereof, default:
es_es: flotante o lista de ellos, por defecto:

source: The line width of the event lines, in points.
es_es: El ancho de la línea de las líneas del evento, en puntos.

source: **color** : color or list of colors, default: :rc:`lines.color`
es_es: **color** : color o lista de colores, por defecto: :rc:`lines.color`

source: The color of the event lines.
es_es: El color de las líneas de eventos.

source: **linestyle**
es_es: **estilo de línea**

source: where *onoffseq* is an even length tuple of on and off ink in points.
es_es: donde *onoffseq* es una tupla de longitud uniforme de tinta encendida y apagada en puntos.

source: **antialiased** : bool or list thereof, default: :rc:`lines.antialiased`
es_es: **antialiased** : bool o lista de ellos, por defecto: :rc:`lines.antialiased`

source: bool or list thereof, default:
es_es: libro o lista de ellos, por defecto:

source: Whether to use antialiasing for drawing the lines.
es_es: Si usar antialiasing para dibujar las líneas.

source: Forwarded to `.LineCollection`.
es_es: Reenviado a `.LineCollection`.

source: (`Source code <../gallery/lines_bars_and_markers/eventcollection_demo.py>`__, `png <../gallery/lines_bars_and_markers/eventcollection_demo.png>`__, `pdf <../gallery/lines_bars_and_markers/eventcollection_demo.pdf>`__)
es_es: (`Código fuente <../gallery/lines_bars_and_markers/eventcollection_demo.py>`__, `png <../gallery/lines_bars_and_markers/eventcollection_demo.png>`__, `pdf <../gallery/lines_bars_and_markers/eventcollection_demo.pdf>`__)

source: Add one or more events at the specified positions.
es_es: Añadir uno o más eventos en las posiciones especificadas.

source: Return the color of the lines used to mark each event.
es_es: Devuelve el color de las líneas utilizadas para marcar cada evento.

source: Return the length of the lines used to mark each event.
es_es: Devuelve la longitud de las líneas utilizadas para marcar cada evento.

source: Return the offset of the lines used to mark each event.
es_es: Devuelve el desplazamiento de las líneas utilizadas para marcar cada evento.

source: Get the width of the lines used to mark each event.
es_es: Obtener el ancho de las líneas utilizadas para marcar cada evento.

source: Return the orientation of the event line ('horizontal' or 'vertical').
es_es: Devuelve la orientación de la línea de evento ('horizontal' o 'vertical').

source: Return an array containing the floating-point values of the positions.
es_es: Devuelve una matriz que contiene los valores de coma flotante de las posiciones.

source: list
es_es: lista

source: List of segments in the LineCollection. Each list item contains an array of vertices.
es_es: Lista de segmentos en la Colección de líneas. Cada elemento de lista contiene una matriz de vértices.

source: True if the eventcollection is horizontal, False if vertical.
es_es: Verdadero si la colección de eventos es horizontal, False si vertical.

source: :meth:`colors <matplotlib.collections.LineCollection.set_color>`
es_es: :meth:`colores <matplotlib.collections.LineCollection.set_color>`

source: :meth:`linelength <matplotlib.collections.EventCollection.set_linelength>`
es_es: :meth:`longitud de línea <matplotlib.collections.EventCollection.set_linelength>`

source: :meth:`orientation <matplotlib.collections.EventCollection.set_orientation>`
es_es: :meth:`Orientación <matplotlib.collections.EventCollection.set_orientation>`

source: :meth:`paths <matplotlib.collections.LineCollection.set_segments>`
es_es: :meth:`rutas <matplotlib.collections.LineCollection.set_segments>`

source: :meth:`positions <matplotlib.collections.EventCollection.set_positions>`
es_es: :meth:`posiciones <matplotlib.collections.EventCollection.set_positions>`

source: Set the edgecolor(s) of the LineCollection.
es_es: Establece el color(es) del borde de la Colección Line.

source: Single color (all lines have same color), or a sequence of rgba tuples; if it is a sequence the lines will cycle through the sequence.
es_es: Un solo color (todas las líneas tienen el mismo color), o una secuencia de tubos rgba; si es una secuencia, las líneas circularán a través de la secuencia.

source: Set the length of the lines used to mark each event.
es_es: Establece la longitud de las líneas utilizadas para marcar cada evento.

source: Set the offset of the lines used to mark each event.
es_es: Establece el desplazamiento de las líneas utilizadas para marcar cada evento.

source: Set the orientation of the event line.
es_es: Establecer la orientación de la línea de eventos.

source: Set the positions of the events.
es_es: Establecer las posiciones de los eventos.

source: Switch the orientation of the event line, either from vertical to horizontal or vice versus.
es_es: Cambie la orientación de la línea de eventos, ya sea de vertical a horizontal o viceversa.

source: Represents a sequence of `.Line2D`\s that should be drawn together.
es_es: Representa una secuencia de `.Line2D`\s que debe ser dibujada juntos.

source: This class extends `.Collection` to represent a sequence of `.Line2D`\s instead of just a sequence of `.Patch`\s. Just as in `.Collection`, each property of a *LineCollection* may be either a single value or a list of values. This list is then used cyclically for each element of the LineCollection, so the property of the ``i``\th element of the collection is::
es_es: Esta clase extiende `.Collection` para representar una secuencia de `.Line2D`\s en lugar de solo una secuencia de `.Patch`\s. Al igual que en `.Collection`, cada propiedad de una *LineCollection* puede ser un solo valor o una lista de valores. Esta lista se utiliza cíclicamente para cada elemento de la Colección Line, por lo que la propiedad del elemento ``i``\th de la colección es::

source: The properties of each member of a *LineCollection* default to their values in :rc:`lines.*` instead of :rc:`patch.*`, and the property *colors* is added in place of *edgecolors*.
es_es: Las propiedades de cada miembro de una *LineCollection* predeterminada a sus valores en :rc:`lines. ` en lugar de :rc:`patch.*`, y la propiedad *colores* es añadida en lugar de *colores*.

source: **segments**
es_es: **segmentos**

source: A sequence of (*line0*, *line1*, *line2*), where::
es_es: Una secuencia de (*linea0*, *línea1*, *línea2*), dónde::

source: or the equivalent numpy array with two columns. Each line can have a different number of segments.
es_es: o la matriz numpy equivalente con dos columnas. Cada línea puede tener un número diferente de segmentos.

source: **linewidths** : float or list of float, default: :rc:`lines.linewidth`
es_es: **widths** : float o lista de float, por defecto: :rc:`lines.linewidth`

source: float or list of float, default:
es_es: flotante o lista de flotante, por defecto:

source: The width of each line in points.
es_es: El ancho de cada línea en puntos.

source: **colors** : color or list of color, default: :rc:`lines.color`
es_es: **colores** : color o lista de color, por defecto: :rc:`lines.color`

source: color or list of color, default:
es_es: color o lista de colores, por defecto:

source: A sequence of RGBA tuples (e.g., arbitrary color strings, etc, not allowed).
es_es: Una secuencia de tubos RGBA (por ejemplo, cadenas de color arbitrarias, etc, no permitidas).

source: **antialiaseds** : bool or list of bool, default: :rc:`lines.antialiased`
es_es: **antialiaseds** : bool o lista de bool, por defecto: :rc:`lines.antialiased`

source: Whether to use antialiasing for each line.
es_es: Si se utiliza el suavizado de bordes para cada línea.

source: zorder of the lines once drawn.
es_es: zorder de las líneas una vez dibujado.

source: color or list of color, default: 'none'
es_es: color o lista de color, por defecto: 'ninguno'

source: When setting *facecolors*, each line is interpreted as a boundary for an area, implicitly closing the path from the last point to the first point. The enclosed area is filled with *facecolor*. In order to manually specify what should count as the "interior" of each line, please use `.PathCollection` instead, where the "interior" can be specified by appropriate usage of `~.path.Path.CLOSEPOLY`.
es_es: Cuando se establecen *colores facecolors*, cada línea se interpreta como un límite para un área, cerrando implícitamente el camino desde el último punto hasta el primer punto. El área cerrada está llena de *facecolor*. Para especificar manualmente lo que debe contar como el "interior" de cada línea, por favor use `. athCollection` en su lugar, donde el "interior" puede ser especificado por el uso apropiado de `~.path.Path.CLOSEPOLY`.

source: A generic collection of patches.
es_es: Una colección genérica de parches.

source: This makes it easier to assign a colormap to a heterogeneous collection of patches.
es_es: Esto facilita la asignación de un mapa de colores a una colección heterogénea de parches.

source: This also may improve plotting speed, since PatchCollection will draw faster than a large number of patches.
es_es: Esto también puede mejorar la velocidad de trazado, ya que PatchCollection dibujará más rápido que un gran número de parches.

source: *patches*
es_es: *parches*

source: a sequence of Patch objects. This list may include a heterogeneous assortment of different patch types.
es_es: Una secuencia de objetos parches. Esta lista puede incluir una variedad heterogenea de diferentes tipos de parches.

source: *match_original*
es_es: *coincide con el original*
