Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/collections_api.po
Languages: es_es

source: If True, use the colors and linewidths of the original patches. If False, new colors may be assigned by providing the standard collection arguments, facecolor, edgecolor, linewidths, norm or cmap.
es_es: Si es verdadero, use los colores y el ancho de línea de los parches originales. Si False, se pueden asignar nuevos colores proporcionando los argumentos de la colección estándar, color cara, borde, ancho de línea, norma o mapa.

source: If any of *edgecolors*, *facecolors*, *linewidths*, *antialiaseds* are None, they default to their `.rcParams` patch setting, in sequence form.
es_es: Si alguno de los *edgecolors*, *facecolors*, *lineas*, *antialiaseds* no son Ninguno, ellos por defecto a su parche `.rcParams`, en forma secuencia.

source: The use of `~matplotlib.cm.ScalarMappable` functionality is optional. If the `~matplotlib.cm.ScalarMappable` matrix ``_A`` has been set (via a call to `~.ScalarMappable.set_array`), at draw time a call to scalar mappable will be made to set the face colors.
es_es: El uso de la funcionalidad `~matplotlib.cm.ScalarMappable` es opcional. Si se ha establecido la matriz `~matplotlib.cm.ScalarMappable` ``_A`` (a través de una llamada a `~. calarMappable.set_array`), en el momento del dibujo, se hará una llamada al mapeable escalar para establecer los colores de la cara.

source: :meth:`paths <matplotlib.collections.PatchCollection.set_paths>`
es_es: :meth:`rutas <matplotlib.collections.PatchCollection.set_paths>`

source: A collection of `~.path.Path`\s, as created by e.g. `~.Axes.scatter`.
es_es: Una colección de `~.path.Path`\s, creada por ej. `~.Axes.scatter`.

source: **paths** : list of `.path.Path`
es_es: **rutas** : lista de `.path.Path`

source: list of
es_es: lista de

source: The paths that will make up the `.Collection`.
es_es: Los caminos que compondrán el `.Collection`.

source: The factor by which to scale each drawn `~.path.Path`. One unit squared in the Path's data space is scaled to be ``sizes**2`` points when rendered.
es_es: El factor por el que escalar cada uno dibujado `~.path.Path`. Una unidad cuadrada en el espacio de datos de la Ruta es escalada para ser ``tamaños**2`` puntos cuando se procesa.

source: Create legend handles and labels for a PathCollection.
es_es: Crea asas y etiquetas de leyenda para una Colección de Rutas.

source: Each legend handle is a `.Line2D` representing the Path that was drawn, and each label is a string what each Path represents.
es_es: Cada nombre de leyenda es un `.Line2D` que representa la ruta que fue dibujada, y cada etiqueta es una cadena de lo que representa cada ruta.

source: This is useful for obtaining a legend for a `~.Axes.scatter` plot; e.g.::
es_es: Esto es útil para obtener una leyenda para una gráfica `~.Axes.scatter`; e.g.::

source: creates three legend elements, one for each color with the numerical values passed to *c* as the labels.
es_es: crea tres elementos de leyenda, uno para cada color con los valores numéricos pasados a *c* como las etiquetas.

source: Also see the :ref:`automatedlegendcreation` example.
es_es: También vea el ejemplo de :ref:`automatedlegendcreation`.

source: {"colors", "sizes"}, default: "colors"
es_es: {"colores", "tamaños"}, por defecto: "colores"

source: If "colors", the legend handles will show the different colors of the collection. If "sizes", the legend will show the different sizes. To set both, use *kwargs* to directly edit the `.Line2D` properties.
es_es: Si "colores", la leyenda maneja los diferentes colores de la colección. Si "tamaños", la leyenda mostrará los diferentes tamaños. Para establecer ambos, use *kwargs* para editar directamente las propiedades `.Line2D`.

source: **num** : int, None, "auto" (default), array-like, or `~.ticker.Locator`
es_es: **num** : int, ninguno, "auto" (por defecto), array-like o `~.ticker.Locator`

source: int, None, "auto" (default), array-like, or
es_es: int, Ninguno, "auto" (por defecto), tipo array o

source: Target number of elements to create. If None, use all unique elements of the mappable array. If an integer, target to use *num* elements in the normed range. If *"auto"*, try to determine which option better suits the nature of the data. The number of created elements may slightly deviate from *num* due to a `~.ticker.Locator` being used to find useful locations. If a list or array, use exactly those elements for the legend. Finally, a `~.ticker.Locator` can be provided.
es_es: Número de elementos objetivo a crear. Si Ninguno, use todos los elementos únicos de la matriz mapeable. Si un entero, el objetivo para usar elementos *num* en el rango normalizado. Si *"auto"*, trate de determinar qué opción se ajusta mejor a la naturaleza de los datos. El número de elementos creados puede desviar ligeramente de *num* debido a que `~.ticker.Locator` se utiliza para encontrar ubicaciones útiles. Si una lista o matriz, usa exactamente esos elementos para la leyenda. Finalmente, un `~.ticker.Locator` puede ser proporcionado.

source: **fmt** : str, `~matplotlib.ticker.Formatter`, or None (default)
es_es: **fmt** : str, `~matplotlib.ticker.Formatter`, o Ninguno (por defecto)

source: The format or formatter to use for the labels. If a string must be a valid input for a `.StrMethodFormatter`. If None (the default), use a `.ScalarFormatter`.
es_es: El formato o formato a utilizar para las etiquetas. Si una cadena debe ser una entrada válida para un `. trMethodFormatter`. Si Ninguno (el predeterminado), utilice un `.ScalarFormatter`.

source: function, default:
es_es: función, por defecto:

source: Function to calculate the labels. Often the size (or color) argument to `~.Axes.scatter` will have been pre-processed by the user using a function ``s = f(x)`` to make the markers visible; e.g. ``size = np.log10(x)``. Providing the inverse of this function here allows that pre-processing to be inverted, so that the legend labels have the correct values; e.g. ``func = lambda x: 10**x``.
es_es: Función para calcular las etiquetas. A menudo el argumento de tamaño (o color) a `~.Axes. catter` será preprocesado por el usuario usando una función ``s = f(x)`` para hacer que los marcadores sean visibles; p. ej. ``size = np.log10(x)``. Proveer aquí el reverso de esta función permite que se invierta ese preprocesamiento, para que las etiquetas de la leyenda tengan los valores correctos; . ``func = lambda x: 10**x``.

source: Allowed keyword arguments are *color* and *size*. E.g. it may be useful to set the color of the markers if *prop="sizes"* is used; similarly to set the size of the markers if *prop="colors"* is used. Any further parameters are passed onto the `.Line2D` instance. This may be useful to e.g. specify a different *markeredgecolor* or *alpha* for the legend handles.
es_es: Los argumentos de palabra clave permitidos son de *color* y *tamaño*. puede ser útil establecer el color de los marcadores si se utiliza *prop="sizes"*; del mismo modo para ajustar el tamaño de los marcadores si se utiliza *prop="colores"*. Cualquier parámetro adicional se pasa a la instancia `.Line2D`. Esto puede ser útil para por ejemplo especificar un *markeredgecolor* diferente o *alpha* para los asientos de la leyenda.

source: **handles** : list of `.Line2D`
es_es: **handles** : lista de `.Line2D`

source: Visual representation of each element of the legend.
es_es: Representación visual de cada elemento de la leyenda.

source: list of str
es_es: lista de str

source: The string labels for elements of the legend.
es_es: Las etiquetas de cuerda para elementos de la leyenda.

source: :meth:`paths <matplotlib.collections.PathCollection.set_paths>`
es_es: :meth:`rutas <matplotlib.collections.PathCollection.set_paths>`

source: array-like, default: None
es_es: como array-like, default: ninguno

source: Squared scaling factors for the polygons. The coordinates of each polygon *verts_i* are multiplied by the square-root of the corresponding entry in *sizes* (i.e., *sizes* specify the scaling of areas). The scaling is applied before the Artist master transform.
es_es: Los factores de escala cuadrados para los polígonos. Las coordenadas de cada polígono *verts_i* se multiplican por la raíz cuadrada de la entrada correspondiente en *tamaños* (i. ., *sizes* especifica la escala de áreas. La escala se aplica antes de la transforma maestra del artista.

source: Class for the efficient drawing of a quadrilateral mesh.
es_es: Clase para el dibujo eficiente de una malla cuadrilateral.

source: A quadrilateral mesh is a grid of M by N adjacent qudrilaterals that are defined via a (M+1, N+1) grid of vertices. The quadrilateral (m, n) is defined by the vertices ::
es_es: Una malla cuadrícula cuadrilátero es una cuadrícula de M por N cuadriláteros adyacentes que se definen a través de una cuadrícula (M+1, N+1) de vértices. El cuadrilátero (m, n) está definido por los vértices ::

source: The mesh need not be regular and the polygons need not be convex.
es_es: La malla no tiene por qué ser regular y los polígonos no necesitan ser convexos.

source: **coordinates**
es_es: **coordenadas**

source: The vertices. ``coordinates[m, n]`` specifies the (x, y) coordinates of vertex (m, n).
es_es: Los vértices. ``coordenadas[m, n]`` especifica las coordenadas (x, y) del vértice (m, n).

source: **antialiased**
es_es: **antialias**

source: **shading**
es_es: **sombreando**

source: {'flat', 'gouraud'}, default: 'flat'
es_es: {'flat', 'gouraud'}, por defecto: 'plano'

source: Unlike other `.Collection`\s, the default *pickradius* of `.QuadMesh` is 0, i.e. `~.Artist.contains` checks whether the test point is within any of the mesh quadrilaterals.
es_es: A diferencia de otros `.Collection`\s, el *pickradius* predeterminado de `.QuadMesh` es 0, es decir, `~.Artist.contains` comprueba si el punto de prueba está dentro de alguno de los cuadriláteros de la malla.

source: There exists a deprecated API version ``QuadMesh(M, N, coords)``, where the dimensions are given explicitly and ``coords`` is a (M*N, 2) array-like. This has been deprecated in Matplotlib 3.5. The following describes the semantics of this deprecated API.
es_es: Existe una versión obsoleta de la API ``QuadMesh(M, N, coords)``, donde las dimensiones se dan explícitamente y ``coords`` es un array (M*N, 2) . Esto ha sido obsoleto en Matplotlib 3.5. A continuación se describen las semánticas de esta API obsoleta.

source: A quadrilateral mesh consists of a grid of vertices. The dimensions of this array are (*meshWidth* + 1, *meshHeight* + 1). Each vertex in the mesh has a different set of "mesh coordinates" representing its position in the topology of the mesh. For any values (*m*, *n*) such that 0 <= *m* <= *meshWidth* and 0 <= *n* <= *meshHeight*, the vertices at mesh coordinates (*m*, *n*), (*m*, *n* + 1), (*m* + 1, *n* + 1), and (*m* + 1, *n*) form one of the quadrilaterals in the mesh. There are thus (*meshWidth* * *meshHeight*) quadrilaterals in the mesh. The mesh need not be regular and the polygons need not be convex.
es_es: Una malla cuadrícula cuadrilátero consiste en una cuadrícula de vértices. Las dimensiones de esta matriz son (*Ancho de mesa* + 1, *altura de mesa* + 1). Cada vértice en la malla tiene un conjunto diferente de "coordenadas de malla que representan su posición en la topología de la malla. Para cualquier valor (*m*, *n*) tal que 0 <= *m* <= *meshWidth* y 0 <= *n* <= *meshHeight*, los vértices en coordenadas de malla (*m*, *n*), (*m*, *n* + 1), (*m* + 1, *n* + 1), y (*m* + 1, *n*) forman uno de los cuadriláteros de la malla. Hay así (*meshWidth* * *meshHeight*) cuadriláteros en la malla.

source: A quadrilateral mesh is represented by a (2 x ((*meshWidth* + 1) * (*meshHeight* + 1))) numpy array *coordinates*, where each row is the *x* and *y* coordinates of one of the vertices. To define the function that maps from a data point to its corresponding color, use the :meth:`set_cmap` method. Each of these arrays is indexed in row-major order by the mesh coordinates of the vertex (or the mesh coordinates of the lower left vertex, in the case of the colors).
es_es: Una malla cuadrilátero está representada por un (2 x ((*ancho de la mesa* + 1) * (*altura de la mesa* + 1))) arreglo numpy *coordenadas*, donde cada registro es las coordenadas *x* y *y* de uno de los vértices. Para definir la función que mapea de un dato a su color correspondiente, utiliza el método :meth:`set_cmap`. Cada uno de estos arreglos se indexa en orden mayor de filas por las coordenadas de malla del vértice (o las coordenadas de malla del vértice inferior izquierdo, en el caso de los colores).

source: For example, the first entry in *coordinates* is the coordinates of the vertex at mesh coordinates (0, 0), then the one at (0, 1), then at (0, 2) .. (0, meshWidth), (1, 0), (1, 1), and so on.
es_es: Por ejemplo, la primera entrada en *coordenadas* son las coordenadas del vértice en las coordenadas de la malla (0, 0), luego el de (0, 1), luego en (0, 2) . (0, meshWidth), (1, 0), (1, 1), etc.

source: Return the vertices of the mesh as an (M+1, N+1, 2) array.
es_es: Devuelve los vértices de la malla como un arreglo (M+1, N+1, 2) .

source: M, N are the number of quadrilaterals in the rows / columns of the mesh, corresponding to (M+1, N+1) vertices. The last dimension specifies the components (x, y).
es_es: M, N son el número de cuadriláteros en las filas / columnas de la malla, correspondientes a vértices (M+1, N+1). La última dimensión especifica los componentes (x, y).

source: (M, N) array-like or M*N array-like
es_es: (M, N) array-like o M*N array

source: Set the data values.
es_es: Establecer los valores de datos.

source: If the values are provided as a 2D grid, the shape must match the coordinates grid. If the values are 1D, they are reshaped to 2D. M, N follow from the coordinates grid, where the coordinates grid shape is (M, N) for 'gouraud' *shading* and (M+1, N+1) for 'flat' shading.
es_es: Si los valores se proporcionan como una cuadrícula 2D, la forma debe coincidir con la cuadrícula de coordenadas. Si los valores son 1D, se reconfiguran a 2D. M, N siguen de la cuadrícula de coordenadas, donde la forma de cuadrícula de coordenadas es (M, N) para 'gouraud' *sombreado* y (M+1, N+1) para el sombreado 'plano'.

source: A collection of n-sided regular polygons.
es_es: Una colección de polígonos regulares de su propio lado.

source: Draw a collection of regular stars with *numsides* points.
es_es: Dibuja una colección de estrellas regulares con puntos *numéricas*.

source: Class for the efficient drawing of a triangular mesh using Gouraud shading.
es_es: Clase para el dibujo eficiente de una malla triangular usando sombreado de Gouraud.

source: A triangular mesh is a `~matplotlib.tri.Triangulation` object.
es_es: Una malla triangular es un objeto `~matplotlib.tri.Triangulation`.

source: Convert a given mesh into a sequence of `.Path` objects.
es_es: Convierte una malla dada en una secuencia de objetos `.Path`.

source: This function is primarily of use to implementers of backends that do not directly support meshes.
es_es: Esta función es principalmente de uso para implementadores de backends que no soportan directamente las mallas.
