Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/collections_api.po
Languages: es_es

source: Classes for the efficient drawing of large collections of objects that share most properties, e.g., a large number of line segments or polygons.
es_es: Clases para el dibujo eficiente de grandes colecciones de objetos que comparten la mayoría de propiedades, por ejemplo, un gran número de segmentos de línea o polígonos.

source: The classes are not meant to be as flexible as their single element counterparts (e.g., you may not be able to select all line styles) but they are meant to be fast for common use cases (e.g., a large set of solid line segments).
es_es: Las clases no están pensadas para ser tan flexibles como sus contrapartes de elementos individuales (p. ej. puede que no sea capaz de seleccionar todos los estilos de línea, pero están destinados a ser rápidos para casos de uso común (e. ., un gran conjunto de segmentos de línea sólida).

source: Draw a collection of regular asterisks with *numsides* points.
es_es: Dibuja una colección de asteriscos regulares con puntos *numéricas*.

source: Parameters
es_es: Parámetros

source: The number of sides of the polygon.
es_es: El número de lados del polígono.

source: float
es_es: de punto flotante (float)

source: The rotation of the polygon in radians.
es_es: La rotación del polígono en radianes.

source: **sizes**
es_es: **tamaños**

source: tuple of float
es_es: tupla de flotante

source: The area of the circle circumscribing the polygon in points^2.
es_es: El área del círculo que rodea el polígono en puntos^2.

source: Forwarded to `.Collection`.
es_es: Reenviado a `.Collection`.

source: Examples
es_es: Ejemplos

source: See :doc:`/gallery/event_handling/lasso_demo` for a complete example::
es_es: Vea :doc:`/gallery/event_handling/lasso_demo` para un ejemplo completo::

source: Add a callback function that will be called whenever one of the `.Artist`'s properties changes.
es_es: Añade una función callback que será llamada cada vez que cambie una de las propiedades de `.Artist`.

source: callable
es_es: llamable

source: The callback function. It must have the signature::
es_es: La función callback. Debe tener la firma::

source: where *artist* is the calling `.Artist`. Return values may exist but are ignored.
es_es: donde *artist* es la llamada `.Artist`. Los valores de retorno pueden existir pero son ignorados.

source: Returns
es_es: Devuelve

source: The observer id associated with the callback. This id can be used for removing the callback with `.remove_callback` later.
es_es: El id del observador asociado con el callback. Este id puede utilizarse para eliminar el callback con `.remove_callback` más adelante.

source: Autoscale the scalar limits on the norm instance using the current array
es_es: Autoescalar los límites escalares en la instancia de la norma usando la matriz actual

source: Autoscale the scalar limits on the norm instance using the current array, changing only limits that are None
es_es: Autoescalar los límites escalares en la instancia de la norma usando la matriz actual, cambiando sólo los límites que no son ninguno

source: The `~.axes.Axes` instance the artist resides in, or *None*.
es_es: La instancia `~.axes.Axes` en la que reside el artist, o *Ninguno*.

source: Call this whenever the mappable is changed to notify all the callbackSM listeners to the 'changed' signal.
es_es: Llame esto cada vez que se cambie el mapeo para notificar a todos los oyentes de callbackSM a la señal 'cambiado'.

source: The last colorbar associated with this ScalarMappable. May be None.
es_es: La última barra de colores asociada con este ScalarMappable. Puede no ser ninguna.

source: Test whether the mouse event occurred in the collection.
es_es: Evalúa si el evento del ratón ocurrió en la colección.

source: Returns ``bool, dict(ind=itemlist)``, where every item in itemlist contains the event.
es_es: Devuelve ``bool, dict(ind=itemlist)``, donde cada elemento en la lista de elementos contiene el evento.

source: Convert *x* using the unit type of the xaxis.
es_es: Convierte *x* usando el tipo de unidad del xaxis.

source: If the artist is not in contained in an Axes or if the xaxis does not have units, *x* itself is returned.
es_es: Si el artista no está contenido en un hacha o si el xaxis no tiene unidades, *x* es devuelto.

source: Convert *y* using the unit type of the yaxis.
es_es: Convierte *y* usando el tipo de unidad del yaxis.

source: If the artist is not in contained in an Axes or if the yaxis does not have units, *y* itself is returned.
es_es: Si el artista no está contenido en un hacha o si el eje no tiene unidades, *y* en sí mismo es devuelto.

source: Draw the Artist (and its children) using the given renderer.
es_es: Dibuja el Artist (y sus hijos) usando el renderizador dado.

source: This has no effect if the artist is not visible (`.Artist.get_visible` returns False).
es_es: Esto no tiene efecto si el artist no es visible (`.Artist.get_visible` devuelve False).

source: **renderer** : `.RendererBase` subclass.
es_es: **renderer** : `.RendererBase` subclase.

source: RendererBase subclass.
es_es: Subclase RendererBase.

source: This method is overridden in the Artist subclasses.
es_es: Este método se sobrescribe en las subclases de Artist.

source: Find artist objects.
es_es: Buscar objetos de artista.

source: Recursively find all `.Artist` instances contained in the artist.
es_es: Encontrar recursivamente todas las instancias `.Artist` contenidas en el artista.

source: **match**
es_es: **coincidencia**

source: A filter criterion for the matches. This can be
es_es: Un criterio de filtro para las partidas. Esto puede ser

source: *None*: Return all objects contained in artist.
es_es: *Ninguno*: Devuelve todos los objetos contenidos en el artista.

source: A function with signature ``def match(artist: Artist) -> bool``. The result will only contain artists for which the function returns *True*.
es_es: Una función con la firma ``def match(artista: Artist) -> bool``. El resultado sólo contendrá artistas para los cuales la función devuelva *True*.

source: A class instance: e.g., `.Line2D`. The result will only contain artists of this class or its subclasses (``isinstance`` check).
es_es: Una instancia de clase: p. ej., `.Line2D`. El resultado sólo contendrá artistas de esta clase o sus subclases (comprobación ``isinstance``).

source: **include_self**
es_es: **incluye_a sí mismo**

source: Include *self* in the list to be checked for a match.
es_es: Incluye *self* en la lista para ser revisado por una partida.

source: list of `.Artist`
es_es: lista de `.Artist`

source: Return a string representation of *data*.
es_es: Devuelve una representación de cadena de *datos*.

source: This method is intended to be overridden by artist subclasses. As an end-user of Matplotlib you will most likely not call this method yourself.
es_es: Este método está pensado para ser sobreescrito por subclases de artista. Como usuario final de Matplotlib probablemente no llamará a este método usted mismo.

source: The default implementation converts ints and floats and arrays of ints and floats into a comma-separated string enclosed in square brackets, unless the artist has an associated colorbar, in which case scalar values are formatted using the colorbar's formatter.
es_es: La implementación por defecto convierte intes y flotantes y arrays de ints y floats en una cadena separada por comas entre corchetes, a menos que el artista tenga una barra de colores asociada, en cuyo caso los valores escalares se formatean usando el formateador de la barra de colores.

source: :obj:`get_cursor_data`
es_es: :obj:`obtener_datos_cursor`

source: Return filter function to be used for agg filter.
es_es: Devuelve la función de filtro que se utilizará para el filtro agg.

source: Return the alpha value used for blending - not supported on all backends.
es_es: Devuelve el valor alfa usado para mezclar - no soportado en todos los backends.

source: Return whether the artist is animated.
es_es: Devuelve si el artista está animado.

source: Return the array of values, that are mapped to colors.
es_es: Devuelve la matriz de valores que se asignan a los colores.

source: The base class `.ScalarMappable` does not make any assumptions on the dimensionality and shape of the array.
es_es: La clase base `.ScalarMappable` no hace ninguna suposición sobre la dimensión y la forma de la matriz.

source: Return a list of the child `.Artist`\s of this `.Artist`.
es_es: Devuelve una lista del hijo `.Artist`\s de este `.Artist`.

source: Return the values (min, max) that are mapped to the colormap limits.
es_es: Devuelve los valores (min, max) que se asignan a los límites del mapa de color.

source: Return the clipbox.
es_es: Devuelve el clipbox.

source: Return whether the artist uses clipping.
es_es: Devuelve si el artist utiliza el recorte.

source: Return the clip path.
es_es: Devuelve la ruta del clip.

source: Return the `.Colormap` instance.
es_es: Devuelve la instancia `.Colormap`.

source: Return the cursor data for a given event.
es_es: Devuelve los datos del cursor para un evento dado.

source: Cursor data can be used by Artists to provide additional context information for a given event. The default implementation just returns *None*.
es_es: Los datos del cursor pueden ser usados por Artistas para proporcionar información adicional de contexto para un evento determinado. La implementación por defecto sólo devuelve *Ninguno*.

source: Subclasses can override the method and return arbitrary data. However, when doing so, they must ensure that `.format_cursor_data` can convert the data to a string representation.
es_es: Las subclases pueden sobreescribir el método y devolver datos arbitrarios. Sin embargo, al hacerlo, deben asegurarse de que `. ormat_cursor_data` puede convertir los datos en una representación de cadena.

source: The only current use case is displaying the z-value of an `.AxesImage` in the status bar of a plot window, while moving the mouse.
es_es: El único caso de uso actual es mostrar el valor z-de un `.AxesImage` en la barra de estado de una ventana de parcela, mientras se mueve el ratón.

source: :obj:`format_cursor_data`
es_es: :obj:`formato_cursor_datos`

source: Alias for `get_linestyle`.
es_es: Alias para `get_linestyle`.

source: Alias for `get_edgecolor`.
es_es: Alias para `get_edgecolor`.

source: Alias for `get_facecolor`.
es_es: Alias para `get_facecolor`.

source: Return the `.Figure` instance the artist belongs to.
es_es: Devuelve la instancia `.Figure` a la que pertenece el artista.

source: Return whether face is colored.
es_es: Devuelve si la cara está colorada.

source: Return the group id.
es_es: Devuelve el id del grupo.

source: Return the current hatching pattern.
es_es: Devuelve el patrón de eclosión actual.

source: Return boolean flag, ``True`` if artist is included in layout calculations.
es_es: Devuelve la bandera booleana, ``Verdadero`` si el artista está incluido en los cálculos del diseño.

source: E.g. :doc:`/tutorials/intermediate/constrainedlayout_guide`, `.Figure.tight_layout()`, and ``fig.savefig(fname, bbox_inches='tight')``.
es_es: Por ejemplo, :doc:`/tutorials/intermediate/constrainedlayout_guide`, `.Figure.tight_layout()`, y ``fig.savefig(fname, bbox_inches='tight')``.

source: Return the label used for this artist in the legend.
es_es: Devuelve la etiqueta usada para este artista en la leyenda.

source: Alias for `get_linewidth`.
es_es: Alias para `get_linewidth`.

source: Return the `.Transform` instance used by this artist offset.
es_es: Devuelve la instancia `.Transform` usada por este desplazamiento de artista.

source: Return the offsets for the collection.
es_es: Devuelve los desplazamientos para la colección.

source: Return the picking behavior of the artist.
es_es: Devuelve el comportamiento de selección del artista.

source: The possible values are described in `.set_picker`.
es_es: Los valores posibles se describen en `.set_picker`.

source: Return whether the artist is to be rasterized.
es_es: Devuelve si el artista debe ser rasterizado.

source: Return the sizes ('areas') of the elements in the collection.
es_es: Devuelve los tamaños ('áreas') de los elementos de la colección.

source: The 'area' of each element.
es_es: La "zona" de cada elemento.

source: Return the sketch parameters for the artist.
es_es: Devuelve los parámetros del croquis para el artista.

source: tuple or None
es_es: tupla o ninguno

source: A 3-tuple with the following elements:
es_es: Una 3 tupla con los siguientes elementos:

source: *scale*: The amplitude of the wiggle perpendicular to the source line.
es_es: *escala*: La amplitud de la peluca perpendicular a la línea de origen.

source: *length*: The length of the wiggle along the line.
es_es: *longitud*: La longitud de la peluca a lo largo de la línea.

source: *randomness*: The scale factor by which the length is shrunken or expanded.
es_es: *aleatoria*: El factor de escala por el cual la longitud es reducida o ampliada.

source: Returns *None* if no sketch parameters were set.
es_es: Devuelve *nunca* si no se han establecido parámetros de croquis.

source: Return the snap setting.
es_es: Devuelve la configuración del snap.

source: See `.set_snap` for details.
es_es: Vea `.set_snap` para más detalles.

source: Like `.Artist.get_window_extent`, but includes any clipping.
es_es: Como `.Artist.get_window_extent`, pero incluye cualquier recorte.

source: **renderer** : `.RendererBase` subclass
es_es: **renderer** : subclase `.RendererBase`

source: RendererBase subclass
es_es: Subclase RendererBase

source: renderer that will be used to draw the figures (i.e. ``fig.canvas.get_renderer()``)
es_es: renderizador que se utilizará para dibujar las figuras (es decir, ``fig.canvas.get_renderer()``)

source: The enclosing bounding box (in figure pixel coordinates).
es_es: La caja delimitadora (en coordenadas de píxeles de la figura).

source: Return the `.Transform` instance used by this artist.
es_es: Devuelve la instancia `.Transform` usada por este artista.

source: Return the clip path with the non-affine part of its transformation applied, and the remaining affine part of its transformation.
es_es: Devuelve la ruta del clip con la parte no afectada de su transformación aplicada, y la parte afectada restante de su transformación.

source: Return the url.
es_es: Devuelve la url.

source: Return a list of URLs, one for each element of the collection.
es_es: Devuelve una lista de URLs, una para cada elemento de la colección.

source: The list contains *None* for elements without a URL. See :doc:`/gallery/misc/hyperlinks_sgskip` for an example.
es_es: La lista contiene *nunca* para elementos sin una URL. Vea :doc:`/gallery/misc/hyperlinks_sgskip` para un ejemplo.

source: Return the visibility.
es_es: Devuelve la visibilidad.

source: Get the artist's bounding box in display space.
es_es: Obtenga la caja delimitadora del artist en el espacio de visualización.

source: The bounding box' width and height are nonnegative.
es_es: La anchura y la altura de la caja delimitadora son no negativas.

source: Subclasses should override for inclusion in the bounding box "tight" calculation. Default is to return an empty bounding box at 0, 0.
es_es: Las subclases deben anularlo para incluirlo en el cálculo de la caja delimitadora "ajustada". Por defecto devuelve una caja delimitadora vacía en 0, 0.

source: Be careful when using this function, the results will not update if the artist window extent of the artist changes. The extent can change due to any changes in the transform stack, such as changing the axes limits, the figure size, or the canvas used (as is done when saving a figure). This can lead to unexpected behavior where interactive figures will look fine on the screen, but will save incorrectly.
es_es: Ten cuidado cuando uses esta función, los resultados no se actualizarán si la extensión de la ventana del artist cambia. La extensión puede cambiar debido a cualquier cambio en la pila de transformaciones, como cambiar los límites de los ejes, el tamaño de la figura o el lienzo utilizado (como se hace al guardar una figura). Esto puede llevar a un comportamiento inesperado donde las figuras interactivas se verán bien en la pantalla, pero se guardarán incorrectamente.

source: Return the artist's zorder.
es_es: Devuelve el zorder del artista.

source: Return whether units are set on any axis.
es_es: Devuelve si las unidades están definidas en cualquier eje.

source: Return whether the Artist has an explicitly set transform.
es_es: Devuelve si el Artista tiene una transforma definida explícitamente.

source: This is *True* after `.set_transform` has been called.
es_es: Esto es *True* después de que `.set_transform` haya sido llamado.

source: If this property is set to *True*, the artist will be queried for custom context information when the mouse cursor moves over it.
es_es: Si esta propiedad está establecida a *True*, el artist será consultado para obtener información de contexto personalizada cuando el cursor del ratón se mueva sobre él.

source: See also :meth:`get_cursor_data`, :class:`.ToolCursorPosition` and :class:`.NavigationToolbar2`.
es_es: Vea también :meth:`get_cursor_data`, :class:`.ToolCursorPosition` y :class:`.NavigationToolbar2`.

source: Call all of the registered callbacks.
es_es: Llama a todos los callbacks registrados.

source: This function is triggered internally when a property is changed.
es_es: Esta función se activa internamente cuando se cambia una propiedad.

source: Process a pick event.
es_es: Procesar un evento de selección.

source: Each child artist will fire a pick event if *mouseevent* is over the artist and the artist has picker set.
es_es: Cada artista infantil lanzará un evento de elegir si *mouseevent* ha terminado el artista y el artista ha seleccionado el selector de objetos.

source: Return whether the artist is pickable.
es_es: Devuelve si el artist es seleccionable.

source: Return a dictionary of all the properties of the artist.
es_es: Devuelve un diccionario con todas las propiedades del artist.

source: Remove the artist from the figure if possible.
es_es: Quite al artista de la figura si es posible.

source: The effect will not be visible until the figure is redrawn, e.g., with `.FigureCanvasBase.draw_idle`. Call `~.axes.Axes.relim` to update the axes limits if desired.
es_es: El efecto no será visible hasta que la figura sea redibujada, por ejemplo, con `.FigureCanvasBase.draw_idle`. Llame `~.axes.Axes.relim` para actualizar los límites de ejes si lo desea.

source: Note: `~.axes.Axes.relim` will not see collections even if the collection was added to the axes with *autolim* = True.
es_es: Nota: `~.axes.Axes.relim` no verá colecciones incluso si la colección fue añadida a los ejes con *autolim* = True.

source: Note: there is no support for removing the artist's legend entry.
es_es: Nota: no hay soporte para eliminar la entrada de la leyenda del artista.

source: Remove a callback based on its observer id.
es_es: Eliminar una devolución de llamada basada en su id de observador.

source: Set multiple properties at once.
es_es: Establece varias propiedades a la vez.

source: Supported properties are
es_es: Las propiedades admitidas son

source: Property
es_es: Propiedad

source: Description
es_es: Descripción

source: a filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array
es_es: una función de filtro, que toma un arreglo de puntos flotantes (m, n, 3) y un valor de dpi, y devuelve un arreglo (m, n, 3)

source: array-like or scalar or None
es_es: como matriz o escalar o ninguno

source: :meth:`antialiased <matplotlib.collections.Collection.set_antialiased>` or aa or antialiaseds
es_es: :meth:`antialias <matplotlib.collections.Collection.set_antialiased>` o aa o antialiaseds

source: bool or list of bools
es_es: libro o lista de bools

source: array-like or None
es_es: tipo array o ninguno

source: `.CapStyle` or {'butt', 'projecting', 'round'}
es_es: `.CapStyle` o {'butt', 'projecting', 'round'}

source: (vmin: float, vmax: float)
es_es: (vmin: flotante, vmax: flotante)

source: Patch or (Path, Transform) or None
es_es: Patch o (Path, Transform) o None

source: `.Colormap` or str or None
es_es: `.Colormap` o str o ninguno

source: color or list of rgba tuples
es_es: color o lista de tubos rgba

source: :meth:`edgecolor <matplotlib.collections.Collection.set_edgecolor>` or ec or edgecolors
es_es: :meth:`edgecolor <matplotlib.collections.Collection.set_edgecolor>` o ec o aristas colores

source: color or list of colors or 'face'
es_es: color o lista de colores o 'cara'

source: :meth:`facecolor <matplotlib.collections.Collection.set_facecolor>` or facecolors or fc
es_es: :meth:`carecolor <matplotlib.collections.Collection.set_facecolor>` o colores de caras o fc

source: color or list of colors
es_es: color o lista de colores

source: :meth:`hatch <matplotlib.collections.Collection.set_hatch>`
es_es: :meth:`colgante <matplotlib.collections.Collection.set_hatch>`

source: `.JoinStyle` or {'miter', 'round', 'bevel'}
es_es: `.JoinStyle` o {'miter', 'round', 'bevel'}

source: :meth:`linestyle <matplotlib.collections.Collection.set_linestyle>` or dashes or linestyles or ls
es_es: :meth:`linestyle <matplotlib.collections.Collection.set_linestyle>` o guiones o estilos de línea o ls

source: str or tuple or list thereof
es_es: str o tuple o lista de ellos

source: :meth:`linewidth <matplotlib.collections.Collection.set_linewidth>` or linewidths or lw
es_es: :meth:`ancho de línea <matplotlib.collections.Collection.set_linewidth>o ancho de línea o lw

source: float or list of floats
es_es: flotante o lista de flotantes

source: `.Normalize` or None
es_es: `.normalize` o Ninguno

source: (N, 2) or (2,) array-like
es_es: ((N, 2) o (2,) array-like

source: None or bool or float or callable
es_es: None o bool o float o callable

source: :meth:`sizes <matplotlib.collections._CollectionWithSizes.set_sizes>`
es_es: :meth:`tamaños <matplotlib.collections._CollectionWithSizes.set_sizes>`

source: ndarray or None
es_es: ndarray o ninguno

source: list of str or None
es_es: lista de str o ninguno

source: Alias for `set_antialiased`.
es_es: Alias para `set_antialiased`.

source: Set the agg filter.
es_es: Establece el filtro de agg.

source: **filter_func**
es_es: **filtro_función**

source: A filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array.
es_es: Una función de filtro, que toma un array (m, n, 3) flotante y un valor dpi, y devuelve un array (m, n, 3).

source: Set the alpha value used for blending - not supported on all backends.
es_es: Establece el valor alfa usado para mezclar - no soportado en todos los backends.

source: **alpha**
es_es: **alfa**

source: All values must be within the 0-1 range, inclusive. Masked values and nans are not supported.
es_es: Todos los valores deben estar dentro del rango 0-1, inclusive. Los valores enmascarados y nans no son compatibles.

source: Set whether the artist is intended to be used in an animation.
es_es: Establecer si el artista está destinado a ser utilizado en una animación.

source: If True, the artist is excluded from regular drawing of the figure. You have to call `.Figure.draw_artist` / `.Axes.draw_artist` explicitly on the artist. This appoach is used to speed up animations using blitting.
es_es: Si es verdadero, el artista está excluido del dibujo normal de la figura. Tienes que llamar a `.Figure.draw_artist` / `. xes.draw_artist` explícitamente sobre el artista. Este appoach se utiliza para acelerar las animaciones usando chupando.

source: See also `matplotlib.animation` and :doc:`/tutorials/advanced/blitting`.
es_es: Vea también `matplotlib.animation` y :doc:`/tutorials/advanced/blitting`.
