Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/collections_api.po
Languages: es_es

source: Set the antialiasing state for rendering.
es_es: Establece el estado de antialiasing para renderizar.

source: Set the value array from array-like *A*.
es_es: Establece la matriz de valor de la matriz *A*.

source: The values that are mapped to colors.
es_es: Los valores que se asignan a los colores.

source: The base class `.ScalarMappable` does not make any assumptions on the dimensionality and shape of the value array *A*.
es_es: La clase base `.ScalarMappable` no hace ninguna suposición sobre la dimensión y forma del array de valores *A*.

source: Set the `.CapStyle` for the collection (for all its elements).
es_es: Establece el `.CapStyle` para la colección (para todos sus elementos).

source: **cs** : `.CapStyle` or {'butt', 'projecting', 'round'}
es_es: **cs** : `.CapStyle` o {'butt', 'projecting', 'round'}

source: CapStyle or {'butt', 'projecting', 'round'}
es_es: CapEstilo o {'butt', 'projecting', 'round'}

source: Set the norm limits for image scaling.
es_es: Establece los límites de la norma para el escalado de la imagen.

source: The limits.
es_es: Los límites.

source: The limits may also be passed as a tuple (*vmin*, *vmax*) as a single positional argument.
es_es: Los límites también se pueden pasar como una tupla (*vmin*, *vmax*) como un único argumento posicional.

source: Set the artist's clip `.Bbox`.
es_es: Establecer el clip del artista `.Bbox`.

source: Set whether the artist uses clipping.
es_es: Establecer si el artista utiliza el recorte.

source: When False artists will be visible outside of the axes which can lead to unexpected results.
es_es: Cuando es False los artistas serán visibles fuera de los ejes lo que puede llevar a resultados inesperados.

source: Set the artist's clip path.
es_es: Establecer la ruta del clip del artista.

source: **path** : `.Patch` or `.Path` or `.TransformedPath` or None
es_es: **ruta** : `.Patch` o `.Path` o `.TransformedPath` o None

source: Patch or Path or TransformedPath or None
es_es: Patch o Path o TransformedPath o None

source: The clip path. If given a `.Path`, *transform* must be provided as well. If *None*, a previously set clip path is removed.
es_es: La ruta del clip. Si se le da un `.Path`, se debe proporcionar también *transform*. Si *None*, se elimina la ruta de recorte previamente establecida.

source: **transform** : `~matplotlib.transforms.Transform`, optional
es_es: **transformación** : `~matplotlib.transforms.Transform`, opcional

source: Transform, optional
es_es: Transformación, opcional

source: Only used if *path* is a `.Path`, in which case the given `.Path` is converted to a `.TransformedPath` using *transform*.
es_es: Sólo se utiliza si *path* es un `.Path`, en cuyo caso el `.Path` dado se convierte en un `.TransformedPath` utilizando *transform*.

source: For efficiency, if *path* is a `.Rectangle` this method will set the clipping box to the corresponding rectangle and set the clipping path to ``None``.
es_es: Por eficiencia, si *ruta* es un `.Rectángulo` este método establecerá la caja de recorte al rectángulo correspondiente y establecerá la ruta de recorte a ``Ninguna``.

source: For technical reasons (support of `~.Artist.set`), a tuple (*path*, *transform*) is also accepted as a single positional parameter.
es_es: Por razones técnicas (soporte de `~.Artist.set`), también se acepta una tupla (*ruta*, *transformación*) como parámetro posicional único.

source: Set the colormap for luminance data.
es_es: Establece el mapa de colores para los datos de la luminancia.

source: **cmap** : `.Colormap` or str or None
es_es: **cmap** : `.Colormap` o str o None

source: Colormap or str or None
es_es: Colormap o str o ninguno

source: Set both the edgecolor and the facecolor.
es_es: Establece tanto el color del borde como el color del rostro.

source: For setting the edge or face color individually.
es_es: Para ajustar el borde o el color de la cara individualmente.

source: Alias for `set_linestyle`.
es_es: Alias para `set_linestyle`.

source: Alias for `set_edgecolor`.
es_es: Alias para `set_edgecolor`.

source: Set the edgecolor(s) of the collection.
es_es: Establecer los colores del borde (los) de la colección.

source: The collection edgecolor(s). If a sequence, the patches cycle through it. If 'face', match the facecolor.
es_es: Los colores de los bordes de la colección. Si una secuencia, los parches circulan a través de ella. Si 'cara', concuerda con el color facecolor.

source: Set the facecolor(s) of the collection. *c* can be a color (all patches have same color), or a sequence of colors; if it is a sequence the patches will cycle through the sequence.
es_es: Establece el color cara(s) de la colección. *c* puede ser un color (todos los parches tienen el mismo color), o una secuencia de colores; si se trata de una secuencia, los parches circularán a través de la secuencia.

source: If *c* is 'none', the patch will not be filled.
es_es: Si *c* es 'ninguno', el parche no será llenado.

source: Alias for `set_facecolor`.
es_es: Alias para `set_facecolor`.

source: Set the `.Figure` instance the artist belongs to.
es_es: Establece la instancia `.Figure` a la que pertenece el artist.

source: Figure
es_es: Figura

source: Set the (group) id for the artist.
es_es: Establece el id (grupo) para el artista.

source: Set the hatching pattern
es_es: Establecer el patrón de eclosión

source: *hatch* can be one of::
es_es: *hatch* puede ser uno de::

source: Letters can be combined, in which case all the specified hatchings are done. If same letter repeats, it increases the density of hatching of that pattern.
es_es: Las letras se pueden combinar, en cuyo caso todas las eclosiones especificadas se hacen. Si se repite la misma letra, aumenta la densidad de eclosión de ese patrón.

source: Hatching is supported in the PostScript, PDF, SVG and Agg backends only.
es_es: El incubamiento sólo se admite en los backends de PostScript, PDF, SVG y Agg.

source: Unlike other properties such as linewidth and colors, hatching can only be specified for the collection as a whole, not separately for each member.
es_es: A diferencia de otras propiedades, como el ancho de línea y los colores, el eclosionado sólo se puede especificar para la colección en su conjunto, no por separado para cada miembro.

source: Set if artist is to be included in layout calculations, E.g. :doc:`/tutorials/intermediate/constrainedlayout_guide`, `.Figure.tight_layout()`, and ``fig.savefig(fname, bbox_inches='tight')``.
es_es: Establece si el artista debe ser incluido en los cálculos del diseño, por ejemplo, :doc:`/tutorials/intermediate/constrainedlayout_guide`, `.Figure.tight_layout()`, y ``fig.savefig(fname, bbox_inches='tight')``.

source: **in_layout**
es_es: **en_diseño**

source: Set the `.JoinStyle` for the collection (for all its elements).
es_es: Establece el `.JoinStyle` para la colección (para todos sus elementos).

source: **js** : `.JoinStyle` or {'miter', 'round', 'bevel'}
es_es: **js** : `.JoinStyle` o {'miter', 'round', 'bevel'}

source: JoinStyle or {'miter', 'round', 'bevel'}
es_es: Estilo de registro o {'miter', 'round', 'bevel'}

source: Set a label that will be displayed in the legend.
es_es: Establece una etiqueta que se mostrará en la leyenda.

source: *s* will be converted to a string by calling `str`.
es_es: *s* se convertirá en una cadena llamando a `str`.

source: Set the linestyle(s) for the collection.
es_es: Establece el(los) linestyle(s) para la colección.

source: linestyle
es_es: estilo de línea

source: description
es_es: descripción

source: ``'-'`` or ``'solid'``
es_es: ``'-'`` o ``'sólid'``

source: solid line
es_es: línea sólida

source: ``'--'`` or ``'dashed'``
es_es: ``'--'`` o ``'guionado'``

source: dashed line
es_es: línea de guiones

source: ``'-.'`` or ``'dashdot'``
es_es: ``'-.'`` o ``'dashdot'``

source: dash-dotted line
es_es: línea punteada en guión

source: ``':'`` or ``'dotted'``
es_es: ``':'`` o ``'dotted'``

source: dotted line
es_es: línea de puntos

source: Alternatively a dash tuple of the following form can be provided::
es_es: Alternativamente se puede proporcionar una tupla de guión de la siguiente forma::

source: where ``onoffseq`` is an even length tuple of on and off ink in points.
es_es: donde ``onoffseq`` es una tupla de longitud uniforme de la tinta de encendido y apagado en puntos.

source: Valid values for individual linestyles include {'-', '--', '-.', ':', '', (offset, on-off-seq)}. See `.Line2D.set_linestyle` for a complete description.
es_es: Los valores válidos para los estilos de línea individuales incluyen {'-', '--', '-.', ':', '', (offset, on-off-seq)}. Vea `.Line2D.set_linestyle` para una descripción completa.

source: Set the linewidth(s) for the collection. *lw* can be a scalar or a sequence; if it is a sequence the patches will cycle through the sequence
es_es: Establecer el ancho(s) de línea(s) para la colección. *lw* puede ser un escalar o una secuencia; si es una secuencia, los parches circularán a través de la secuencia

source: Alias for `set_linewidth`.
es_es: Alias para `set_linewidth`.

source: Set the normalization instance.
es_es: Establece la instancia de normalización.

source: **norm** : `.Normalize` or None
es_es: **norma** : `.Normalize` o Ninguno

source: Normalize or None
es_es: Normalizar o ninguno

source: If there are any colorbars using the mappable for this norm, setting the norm of the mappable will reset the norm, locator, and formatters on the colorbar to default.
es_es: Si hay alguna barra de colores usando el mapeable para esta norma, establecer la norma del mapeable restablecerá la norma, localización y formateadores de la barra de colores por defecto.

source: Set the artist offset transform.
es_es: Establece la transforma de desplazamiento del artista.

source: Transform
es_es: Transformar

source: Set the offsets for the collection.
es_es: Establecer los desplazamientos para la colección.

source: Set the path effects.
es_es: Establecer los efectos de la ruta.

source: AbstractPathEffect
es_es: Efecto de ruta abstracta

source: Define the picking behavior of the artist.
es_es: Definir el comportamiento de selección del artista.

source: **picker**
es_es: **seleccionador**

source: This can be one of the following:
es_es: Esto puede ser uno de los siguientes:

source: *None*: Picking is disabled for this artist (default).
es_es: *Ninguno*: La selección está deshabilitada para este artista (por defecto).

source: A boolean: If *True* then picking will be enabled and the artist will fire a pick event if the mouse event is over the artist.
es_es: Un booleano: Si *Verdadero* entonces se habilitará la selección y el artista disparará un evento de elegir si el evento del ratón está sobre el artista.

source: A float: If picker is a number it is interpreted as an epsilon tolerance in points and the artist will fire off an event if its data is within epsilon of the mouse event. For some artists like lines and patch collections, the artist may provide additional data to the pick event that is generated, e.g., the indices of the data within epsilon of the pick event
es_es: Un float: Si el selector es un número, se interpreta como una tolerancia de epsilones en los puntos y el artista lanzará un evento si sus datos se encuentran dentro del epsilón del evento del ratón. Para algunos artistas como líneas y colecciones de parches, el artista puede proporcionar datos adicionales al evento de selección que se genere. ., los índices de los datos dentro del epsilón del evento de elección

source: A function: If picker is callable, it is a user supplied function which determines whether the artist is hit by the mouse event::
es_es: Una función: Si el selector es llamable, es una función suministrada por el usuario que determina si el artista es golpeado por el evento del ratón::

source: to determine the hit test. if the mouse event is over the artist, return *hit=True* and props is a dictionary of properties you want added to the PickEvent attributes.
es_es: para determinar la prueba de éxito. si el evento del ratón está sobre el artista, devuelve *hit=True* y props es un diccionario de propiedades que desea añadir a los atributos de PickEvent.

source: Set the pick radius used for containment tests.
es_es: Establece el radio de selección utilizado para las pruebas de contención.

source: Pick radius, in points.
es_es: Elegir el radio, en puntos.

source: Force rasterized (bitmap) drawing for vector graphics output.
es_es: Forzar dibujo rasterizado (mapa de bits) para salida de gráficos vectoriales.

source: Rasterized drawing is not supported by all artists. If you try to enable this on an artist that does not support it, the command has no effect and a warning will be issued.
es_es: El dibujo asterizado no es apoyado por todos los artistas. Si intenta activar esto en un artista que no lo soporta, el comando no tiene efecto y se emitirá una advertencia.

source: This setting is ignored for pixel-based output.
es_es: Este ajuste se ignora para la salida basada en píxeles.

source: See also :doc:`/gallery/misc/rasterization_demo`.
es_es: Vea también :doc:`/gallery/misc/rasterization_demo`.

source: **rasterized**
es_es: **rasterizó**

source: Set the sizes of each member of the collection.
es_es: Establecer los tamaños de cada miembro de la colección.

source: The size to set for each element of the collection. The value is the 'area' of the element.
es_es: El tamaño a definir para cada elemento de la colección. El valor es el 'área' del elemento.

source: float, default: 72
es_es: float, por defecto: 72

source: The dpi of the canvas.
es_es: El dpi del lienzo.

source: Set the sketch parameters.
es_es: Establecer los parámetros del croquis.

source: **scale**
es_es: **escala**

source: float, optional
es_es: float, opcional

source: The amplitude of the wiggle perpendicular to the source line, in pixels. If scale is `None`, or not provided, no sketch filter will be provided.
es_es: La amplitud de la muñeca perpendicular a la línea de origen, en píxeles. Si la escala es `Ninguno`, o no proporcionada, no se proporcionará ningún filtro de croquis.

source: The length of the wiggle along the line, in pixels (default 128.0)
es_es: La longitud del muñeco a lo largo de la línea, en píxeles (por defecto 128.0)

source: **randomness**
es_es: **aleatoria**

source: The scale factor by which the length is shrunken or expanded (default 16.0)
es_es: El factor de escala por el cual la longitud está reducida o expandida (por defecto 16.0)

source: The PGF backend uses this argument as an RNG seed and not as described above. Using the same seed yields the same random shape.
es_es: El backend de PGF utiliza este argumento como semilla de RNG y no como se describe anteriormente. Usar la misma semilla produce la misma forma aleatoria.

source: Set the snapping behavior.
es_es: Establece el comportamiento de desguace.

source: Snapping aligns positions with the pixel grid, which results in clearer images. For example, if a black line of 1px width was defined at a position in between two pixels, the resulting image would contain the interpolated value of that line in the pixel grid, which would be a grey value on both adjacent pixel positions. In contrast, snapping will move the line to the nearest integer pixel value, so that the resulting image will really contain a 1px wide black line.
es_es: Ajustando posiciones altas con la cuadrícula de píxeles, lo que resulta en imágenes más claras. Por ejemplo, si una línea negra de 1px de ancho fue definida en una posición entre dos píxeles, la imagen resultante contendría el valor interpolado de esa línea en la cuadrícula de píxeles, que sería un valor gris en ambas posiciones de píxeles adyacentes. En contraste, el snapping moverá la línea al valor entero de píxel más cercano. para que la imagen resultante contenga realmente una línea negra de 1px.

source: Snapping is currently only supported by the Agg and MacOSX backends.
es_es: El ajuste sólo está soportado actualmente por los backends Agg y MacOSX.

source: Possible values:
es_es: Valores posibles:

source: *True*: Snap vertices to the nearest pixel center.
es_es: *Verdadero*: Ajustar los vértices al centro de píxeles más cercano.

source: *False*: Do not modify vertex positions.
es_es: *Falso*: No modifique las posiciones de los vértices.

source: *None*: (auto) If the path contains only rectilinear line segments, round to the nearest pixel center.
es_es: *Ninguno*: (auto) Si la ruta contiene sólo segmentos rectilineales, redondea al centro de píxeles más cercano.

source: Set the artist transform.
es_es: Establece la transformación del artista.

source: Set the url for the artist.
es_es: Establecer la url para el artista.

source: URLs are currently only implemented by the SVG backend. They are ignored by all other backends.
es_es: Las URLs actualmente sólo están implementadas por el backend SVG. Son ignoradas por todos los demás backends.

source: Set the artist's visibility.
es_es: Establecer la visibilidad del artista.

source: Set the zorder for the artist. Artists with lower zorder values are drawn first.
es_es: Establecer el zorder para el artista. Los artistas con valores de zorder más bajos se dibujan primero.

source: **level**
es_es: **nivel**

source: Whether the artist is 'stale' and needs to be re-drawn for the output to match the internal state of the artist.
es_es: Si el artista es 'stale' y necesita ser redibujado para que la salida coincida con el estado interno del artista.

source: ``x`` and ``y`` sticky edge lists for autoscaling.
es_es: ``x`` y ``y`` listas de bordes pegajosos para autoescalado.

source: When performing autoscaling, if a data limit coincides with a value in the corresponding sticky_edges list, then no margin will be added--the view limit "sticks" to the edge. A typical use case is histograms, where one usually expects no margin on the bottom edge (0) of the histogram.
es_es: Al realizar autoescalado, si un límite de datos coincide con un valor en la lista de bordes de stickys correspondiente. entonces no se añadirá ningún margen --el límite de vista "pega" al borde. Un caso de uso típico son los histogramas, donde normalmente no se espera margen en el borde inferior (0) del histograma.

source: Moreover, margin expansion "bumps" against sticky edges and cannot cross them. For example, if the upper data limit is 1.0, the upper view limit computed by simple margin application is 1.2, but there is a sticky edge at 1.1, then the actual upper view limit will be 1.1.
es_es: Además, la expansión del margen "bumps" contra bordes pegajosos y no pueden cruzarlos. Por ejemplo, si el límite superior de datos es 1. , el límite de la vista superior calculado por una aplicación de margen simple es 1. , pero hay un borde fijo en 1.1, entonces el límite real de la vista superior será 1.1.

source: This attribute cannot be assigned to; however, the ``x`` and ``y`` lists can be modified in place as needed.
es_es: Este atributo no se puede asignar; sin embargo, las listas ``x`` y ``y`` pueden ser modificadas en su lugar según sea necesario.

source: Return a normalized rgba array corresponding to *x*.
es_es: Devuelve una matriz rgba normalizada correspondiente a *x*.

source: In the normal case, *x* is a 1D or 2D sequence of scalars, and the corresponding ndarray of rgba values will be returned, based on the norm and colormap set for this ScalarMappable.
es_es: En el caso normal, *x* es una secuencia 1D o 2D de escalares, y el ndarray correspondiente de valores rgba será retornado, basado en la norma y el mapa de colores establecido para este ScalarMappable.

source: There is one special case, for handling images that are already rgb or rgba, such as might have been read from an image file. If *x* is an ndarray with 3 dimensions, and the last dimension is either 3 or 4, then it will be treated as an rgb or rgba array, and no mapping will be done. The array can be uint8, or it can be floating point with values in the 0-1 range; otherwise a ValueError will be raised. If it is a masked array, the mask will be ignored. If the last dimension is 3, the *alpha* kwarg (defaulting to 1) will be used to fill in the transparency. If the last dimension is 4, the *alpha* kwarg is ignored; it does not replace the pre-existing alpha. A ValueError will be raised if the third dimension is other than 3 or 4.
es_es: Hay un caso especial para el manejo de imágenes que ya son rgb o rgba, como podría haber sido leído desde un archivo de imagen. Si *x* es un ndarray con 3 dimensiones, y la última dimensión es 3 o 4, entonces se tratará como una matriz rgb o rgba, y no se hará mapeo. La matriz puede ser uint8, o puede ser un punto flotante con valores en el rango 0-1; de lo contrario, se levantará un ValueError . Si es una matriz enmascarada, la máscara será ignorada. Si la última dimensión es 3, el kwarg *alpha* (predeterminado a 1) se utilizará para rellenar la transparencia. Si la última dimensión es 4, el kwarg *alpha* es ignorado; no reemplaza el alfa preexistente. Se levantará un ValueError si la tercera dimensión es distinta a 3 o 4.

source: In either case, if *bytes* is *False* (default), the rgba array will be floats in the 0-1 range; if it is *True*, the returned rgba array will be uint8 in the 0 to 255 range.
es_es: En cualquier caso, si *bytes* es *False* (por defecto), la matriz rgba estará flotando en el rango 0-1; si es *True*, el array rgba devuelto será uint8 en el rango 0 a 255.

source: If norm is False, no normalization of the input data is performed, and it is assumed to be in the range (0-1).
es_es: Si la norma es False, no se realiza ninguna normalización de los datos de entrada, y se asume que está en el rango (0-1).

source: Update this artist's properties from the dict *props*.
es_es: Actualizar las propiedades de este artista desde el dict *props*.

source: Copy properties from other to self.
es_es: Copiar propiedades de otro a uno mismo.

source: Update colors from the scalar mappable array, if any.
es_es: Actualizar colores de la matriz escalar, si los hay.

source: Assign colors to edges and faces based on the array and/or colors that were directly set, as appropriate.
es_es: Asigna colores a bordes y caras basados en la matriz y/o colores que se establecieron directamente, según corresponda.

source: A collection of horizontal bars spanning *yrange* with a sequence of *xranges*.
es_es: Una colección de barras horizontales que abarcan *yrange* con una secuencia de *xranges*.

source: list of (float, float)
es_es: lista de (flotante, flotante)

source: The sequence of (left-edge-position, width) pairs for each bar.
es_es: La secuencia de pares (izquierda-posición, ancho) para cada barra.

source: The (lower-edge, height) common to all bars.
es_es: El (borde inferior, altura) común a todas las barras.

source: :meth:`paths <matplotlib.collections.PolyCollection.set_verts>`
es_es: :meth:`rutas <matplotlib.collections.PolyCollection.set_verts>`

source: list of array-like
es_es: lista de matriz

source: unknown
es_es: desconocido

source: Set the vertices of the polygons.
es_es: Establece los vértices de los polígonos.

source: The sequence of polygons [*verts0*, *verts1*, ...] where each element *verts_i* defines the vertices of polygon *i* as a 2D array-like of shape (M, 2).
es_es: La secuencia de polígonos [*verts0*, *verts1*, donde cada elemento *verts_i* define los vértices del polígono *i* como una matriz 2D de forma (M, 2).

source: bool, default: True
es_es: bool, por defecto: True

source: Whether the polygon should be closed by adding a CLOSEPOLY connection at the end.
es_es: Si el polígono debe cerrarse añadiendo una conexión CLOSEPOLY al final.

source: Initialize vertices with path codes.
es_es: Inicializa vértices con códigos de ruta.
