Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/colorbar_api.po
Languages: es_es

source: Colorbars are a visualization of the mapping from scalar values to colors. In Matplotlib they are drawn into a dedicated `~.axes.Axes`.
es_es: Las barras de color son una visualización del mapeo de valores escalares a colores. En Matplotlib se dibujan en un `~.axes.Axes`.

source: Colorbars are typically created through `.Figure.colorbar` or its pyplot wrapper `.pyplot.colorbar`, which internally use `.Colorbar` together with `.make_axes_gridspec` (for `.GridSpec`-positioned axes) or `.make_axes` (for non-`.GridSpec`-positioned axes).
es_es: Las barras de colores se crean normalmente a través de `.Figure.colorbar` o su envoltorio pyplot `.pyplot.colorbar`, que internamente usan `. olorbar` junto con `.make_axes_gridspec` (para `.GridSpec`- ejes posicionados) o `.make_axes` (para ejes no `.GridSpec`).

source: End-users most likely won't need to directly use this module's API.
es_es: Es muy probable que los usuarios finales no necesiten usar directamente la API de este módulo.

source: Draw a colorbar in an existing axes.
es_es: Dibuja una barra de colores en los ejes existentes.

source: Typically, colorbars are created using `.Figure.colorbar` or `.pyplot.colorbar` and associated with `.ScalarMappable`\s (such as an `.AxesImage` generated via `~.axes.Axes.imshow`).
es_es: Por lo general, las barras de colores se crean usando `.Figure.colorbar` o `.pyplot.colorbar` y se asocian con `.ScalarMappable`\s (como un `.AxesImage` generado a través de `~.axes.Axes.imshow`).

source: In order to draw a colorbar not associated with other elements in the figure, e.g. when showing a colormap by itself, one can create an empty `.ScalarMappable`, or directly pass *cmap* and *norm* instead of *mappable* to `Colorbar`.
es_es: Para dibujar una barra de colores no asociada con otros elementos en la figura, e. cuando se muestra un mapa de colores por sí mismo, se puede crear un `. calarMappable`, o pasar directamente *cmap* y *normal* en lugar de *mappable* a `Colorbar`.

source: Useful public methods are :meth:`set_label` and :meth:`add_lines`.
es_es: Los métodos públicos útiles son :meth:`set_label` y :meth:`add_lines`.

source: Parameters
es_es: Parámetros

source: Axes
es_es: Ejes

source: The `~.axes.Axes` instance in which the colorbar is drawn.
es_es: La instancia `~.axes.Axes` en la que se dibuja la barra de colores.

source: **mappable** : `.ScalarMappable`
es_es: **mapeable** : `.ScalarMappable`

source: ScalarMappable
es_es: EscalarMappable

source: The mappable whose colormap and norm will be used.
es_es: El mapeable cuyo mapa de color y norma será utilizado.

source: To show the under- and over- value colors, the mappable's norm should be specified as ::
es_es: Para mostrar los colores sub-y sobre- valores, la norma del mapeo debe especificarse como ::

source: To show the colors versus index instead of on a 0-1 scale, use::
es_es: Para mostrar los colores versus índice en lugar de en una escala 0-1, use::

source: Colormap, default: rcParams["image.cmap"] (default: 'viridis')
es_es: Colormap, por defecto: rcParams["image.cmap"] (por defecto: 'viridis')

source: The colormap to use. This parameter is ignored, unless *mappable* is None.
es_es: El mapa de colores a utilizar. Este parámetro es ignorado, a menos que *mapeable* no sea Ninguno.

source: **norm** : `~matplotlib.colors.Normalize`
es_es: **norma** : `~matplotlib.colors.Normalize`

source: The normalization to use. This parameter is ignored, unless *mappable* is None.
es_es: La normalización a utilizar. Este parámetro es ignorado, a menos que *mapeable* no sea Ninguno.

source: **alpha**
es_es: **alfa**

source: The colorbar transparency between 0 (transparent) and 1 (opaque).
es_es: La transparencia de la barra de color entre 0 (transparente) y 1 (opaco).

source: **values, boundaries**
es_es: **valores, límites**

source: If unset, the colormap will be displayed on a 0-1 scale.
es_es: Si no se activa, el mapa de colores se mostrará en una escala 0-1.

source: **orientation**
es_es: **orientación**

source: **extend**
es_es: **extensión**

source: {'neither', 'both', 'min', 'max'}
es_es: {'ninguno de los dos', 'ambos', 'min', 'max'}

source: **spacing**
es_es: **Interlineado**

source: **ticks** : `~matplotlib.ticker.Locator` or array-like of float
es_es: **ticks** : `~matplotlib.ticker.Locator` o array-like de float

source: Locator or array-like of float
es_es: Localizador o matriz en flotante

source: **format** : str or `~matplotlib.ticker.Formatter`
es_es: **formato** : str o `~matplotlib.ticker.Formatter`

source: str or
es_es: str o

source: **drawedges**
es_es: **dibujos**

source: **filled**
es_es: **llenado**

source: **extendrec**
es_es: **extensión**

source: **label**
es_es: **etiqueta**

source: Attributes
es_es: Atributos

source: **lines**
es_es: **líneas**

source: list
es_es: lista

source: A list of `.LineCollection` (empty if no lines were drawn).
es_es: Una lista de `.LineCollection` (vacía si no se dibujaban líneas).

source: **dividers** : `.LineCollection`
es_es: **separadores** : `.LineCollection`

source: A LineCollection (empty if *drawedges* is ``False``).
es_es: Una Colección de Lineas (vacía si *dibujos* es ``False``).

source: Draw lines on the colorbar.
es_es: Dibuja líneas en la barra de colores.

source: The lines are appended to the list :attr:`lines`.
es_es: Las líneas se añaden a la lista :attr:`líneas`.

source: **levels**
es_es: **Niveles**

source: The positions of the lines.
es_es: Las posiciones de las líneas.

source: **colors**
es_es: **colores**

source: color or list of colors
es_es: color o lista de colores

source: Either a single color applying to all lines or one color value for each line.
es_es: Un solo color aplicado a todas las líneas o un valor de color para cada línea.

source: float or array-like
es_es: flotante o matriz

source: Either a single linewidth applying to all lines or one linewidth for each line.
es_es: Un único ancho de línea que se aplique a todas las líneas o un ancho de línea para cada línea.

source: bool, default: True
es_es: bool, por defecto: True

source: Whether to remove any previously added lines.
es_es: Si desea eliminar cualquier línea añadida previamente.

source: Alternatively, this method can also be called with the signature ``colorbar.add_lines(contour_set, erase=True)``, in which case *levels*, *colors*, and *linewidths* are taken from *contour_set*.
es_es: Alternativamente, este método también puede ser llamado con la firma ``colorbar.add_lines(contour_set, erase=True)``, en cuyo caso *levels*, *colors*, y *linewidths* son tomados de *contour_set*.

source: Calculate any free parameters based on the current cmap and norm, and do all the drawing.
es_es: Calcular cualquier parámetro libre basado en el cmap actual y la norma, y hacer todos los dibujos.

source: Return the ticks as a list of locations.
es_es: Devuelve los ticks como una lista de ubicaciones.

source: boolean, default: False
es_es: booleano, por defecto: False

source: if True return the minor ticks.
es_es: si verdadero devuelve los ticks menores.

source: Turn the minor ticks of the colorbar off.
es_es: Desactiva los ticks menores de la barra de color.

source: Turn on colorbar minor ticks.
es_es: Activar ticks menores en la barra de colores.

source: Remove this colorbar from the figure.
es_es: Eliminar esta barra de colores de la figura.

source: If the colorbar was created with ``use_gridspec=True`` the previous gridspec is restored.
es_es: Si la barra de colores fue creada con ``use_gridspec=True`` la anterior gridspec es restaurada.

source: Set the transparency between 0 (transparent) and 1 (opaque).
es_es: Establece la transparencia entre 0 (transparente) y 1 (opaco).

source: If an array is provided, *alpha* will be set to None to use the transparency values associated with the colormap.
es_es: Si se proporciona una matriz, *alpha* se establecerá en Ninguno para usar los valores de transparencia asociados con el mapa de colores.

source: Add a label to the long axis of the colorbar.
es_es: Agrega una etiqueta al eje largo de la barra de colores.

source: The label text.
es_es: Texto de la etiqueta.

source: str, optional
es_es: str, opcional

source: The location of the label.
es_es: La ubicación de la etiqueta.

source: For horizontal orientation one of {'left', 'center', 'right'}
es_es: Para la orientación horizontal uno de {'left', 'center', 'right'}

source: For vertical orientation one of {'bottom', 'center', 'top'}
es_es: Para la orientación vertical uno de {'bottom', 'center', 'top'}

source: Defaults to :rc:`xaxis.labellocation` or :rc:`yaxis.labellocation` depending on the orientation.
es_es: Por defecto es :rc:`xaxis.labellocation` o :rc:`yaxis.labellocation` dependiendo de la orientación.

source: Keyword arguments are passed to `~.Axes.set_xlabel` / `~.Axes.set_ylabel`. Supported keywords are *labelpad* and `.Text` properties.
es_es: Los argumentos de palabra clave se pasan a `~.Axes.set_xlabel` / `~.Axes.set_ylabel`. Las palabras clave soportadas son propiedades *labelpad* y `.Text`.

source: Set tick labels.
es_es: Definir etiquetas de tick.

source: Discouraged
es_es: Desanimado

source: The use of this method is discouraged, because of the dependency on tick positions. In most cases, you'll want to use ``set_ticks(positions, labels=labels)`` instead.
es_es: El uso de este método está desaconsejado, debido a la dependencia de las posiciones de tick. En la mayoría de los casos, querrá usar ``set_ticks(positions, labels=labels)`` en su lugar.

source: If you are using this method, you should always fix the tick positions before, e.g. by using `.Colorbar.set_ticks` or by explicitly setting a `~.ticker.FixedLocator` on the long axis of the colorbar. Otherwise, ticks are free to move and the labels may end up in unexpected positions.
es_es: Si está utilizando este método, siempre debe arreglar las posiciones de tick antes, por ejemplo, usando `.Colorbar.set_ticks` o estableciendo explícitamente un `~. icker.FixedLocator` en el eje largo de la barra de colores. De lo contrario, los ticks son libres de moverse y las etiquetas pueden terminar en posiciones inesperadas.

source: **ticklabels** : sequence of str or of `.Text`
es_es: **etiquetas** : secuencia de str o de `.Text`

source: sequence of str or of
es_es: secuencia de str o de

source: Texts for labeling each tick location in the sequence set by `.Colorbar.set_ticks`; the number of labels must match the number of locations.
es_es: Textos para etiquetar la ubicación de cada tick en la secuencia establecida por `.Colorbar.set_ticks`; el número de etiquetas debe coincidir con el número de ubicaciones.

source: **update_ticks**, default: True
es_es: **update_ticks**, por defecto: Verdadero

source: This keyword argument is ignored and will be be removed. Deprecated
es_es: Este argumento de palabra clave es ignorado y será eliminado. Obsoleto

source: minor
es_es: menor

source: If True, set minor ticks instead of major ticks.
es_es: Si es verdad, establezca ticks menores en lugar de ticks mayores.

source: `.Text` properties for the labels.
es_es: Propiedades `.Text` para las etiquetas.

source: Set tick locations.
es_es: Establecer ubicaciones de tick.

source: list of floats
es_es: lista de flotantes

source: List of tick locations.
es_es: Lista de ubicaciones de tick.

source: list of str, optional
es_es: lista de str, opcional

source: List of tick labels. If not set, the labels show the data value.
es_es: Lista de etiquetas de tick. Si no se establece, las etiquetas muestran el valor de los datos.

source: bool, default: False
es_es: bool, por defecto: False

source: If ``False``, set the major ticks; if ``True``, the minor ticks.
es_es: Si es ``False``, establezca los ticks principales; si es ``True``, los ticks menores.

source: `.Text` properties for the labels. These take effect only if you pass *labels*. In other cases, please use `~.Axes.tick_params`.
es_es: Propiedades `.Text` para las etiquetas. Estas tienen efecto sólo si pasas *etiquetas*. En otros casos, por favor usa `~.Axes.tick_params`.

source: Update solid patches, lines, etc.
es_es: Actualizar parches sólidos, líneas, etc.

source: This is meant to be called when the norm of the image or contour plot to which this colorbar belongs changes.
es_es: Esto está pensado para ser llamado cuando la norma de la imagen o la gráfica de contorno al que pertenece esta barra de color.

source: If the norm on the mappable is different than before, this resets the locator and formatter for the axis, so if these have been customized, they will need to be customized again. However, if the norm only changes values of *vmin*, *vmax* or *cmap* then the old formatter and locator will be preserved.
es_es: Si la norma en el mapeable es diferente de la anterior, esto restablece el localizador y el formato para el eje, así que si estos han sido personalizados, tendrán que ser personalizados de nuevo. Sin embargo, si la norma sólo cambia los valores de *vmin*, *vmax* o *cmap* entonces el antiguo formateador y localizador se conservarán.

source: Setup the ticks and ticklabels. This should not be needed by users.
es_es: Configurar los ticks y ticklabels. Esto no debería ser necesario para los usuarios.

source: [*Deprecated*] Create a colorbar on the given axes for the given mappable.
es_es: [*Obsoleto*] Crea una barra de colores en los ejes dados para el mapeable dado.

source: This is a low-level function to turn an existing axes into a colorbar axes. Typically, you'll want to use `~.Figure.colorbar` instead, which automatically handles creation and placement of a suitable axes as well.
es_es: Esta es una función de bajo nivel para convertir los ejes existentes en ejes de la barra de color. Normalmente, querrás usar `~. igure.colorbar` en su lugar, que automáticamente maneja la creación y colocación de ejes adecuados.

source: The `~.axes.Axes` to turn into a colorbar.
es_es: El `~.axes.Axes` para convertirse en una barra de colores.

source: The mappable to be described by the colorbar.
es_es: El mapeable a ser descrito por la barra de colores.

source: Keyword arguments are passed to the respective colorbar class.
es_es: Los argumentos de palabra clave se pasan a la clase correspondiente de la barra de colores.

source: Returns
es_es: Devuelve

source: The created colorbar instance.
es_es: La instancia de la barra de colores creada.

source: Create an `~.axes.Axes` suitable for a colorbar.
es_es: Crea un `~.axes.Axes` adecuado para una barra de colores.

source: The axes is placed in the figure of the *parents* axes, by resizing and repositioning *parents*.
es_es: Los ejes se colocan en la figura de los ejes *padres*, al redimensionar y reposicionar *padres*.

source: **parents** : `~.axes.Axes` or list of `~.axes.Axes`
es_es: **padres** : `~.axes.Axes` o lista de `~.axes.Axes`

source: Axes or list of Axes
es_es: Ejes o lista de ejes

source: The Axes to use as parents for placing the colorbar.
es_es: Los ejes a usar como padres para colocar la barra de colores.

source: **location**
es_es: **ubicación**

source: None or {'left', 'right', 'top', 'bottom'}
es_es: Ninguno o {'izquierda', 'derecha', 'arriba', 'abajo'}

source: The location, relative to the parent axes, where the colorbar axes is created. It also determines the *orientation* of the colorbar (colorbars on the left and right are vertical, colorbars at the top and bottom are horizontal). If None, the location will come from the *orientation* if it is set (vertical colorbars on the right, horizontal ones at the bottom), or default to 'right' if *orientation* is unset.
es_es: La ubicación, relativa a los ejes superiores, donde se crean los ejes de color. También determina la *orientación* de la barra de colores (las barras de colores de la izquierda y la derecha son verticales, las barras de colores de la parte superior e inferior son horizontales). Si Ninguno, la ubicación vendrá de la *orientación* si se establece (barras de color verticales a la derecha, los horizontales en la parte inferior), o por defecto a 'derecha' si la *orientación* no está definida.

source: None or {'vertical', 'horizontal'}
es_es: Ninguno o {'vertical', 'horizontal'}

source: The orientation of the colorbar. It is preferable to set the *location* of the colorbar, as that also determines the *orientation*; passing incompatible values for *location* and *orientation* raises an exception.
es_es: La orientación de la barra de colores. Es preferible establecer la *ubicación* de la barra de colores, ya que esto también determina la *orientación*; pasar valores incompatibles para *ubicación* y *orientación* eleva una excepción.

source: **fraction**
es_es: **fracción **

source: float, default: 0.15
es_es: float, por defecto: 0.15

source: Fraction of original axes to use for colorbar.
es_es: Fracción de los ejes originales a usar para la barra de colores.

source: **shrink**
es_es: **encoger**

source: float, default: 1.0
es_es: float, por defecto: 1.0

source: Fraction by which to multiply the size of the colorbar.
es_es: Fracción por la cual multiplicar el tamaño de la barra de color.

source: **aspect**
es_es: **Aspecto**

source: float, default: 20
es_es: float, por defecto: 20

source: Ratio of long to short dimensions.
es_es: Ratio de dimensiones largas a cortas.

source: The child axes.
es_es: Los ejes secundarios.

source: The reduced keyword dictionary to be passed when creating the colorbar instance.
es_es: El diccionario de palabras clave reducido a ser pasado al crear la instancia de la barra de colores.

source: Other Parameters
es_es: Otros Parámetros

source: float, default: 0.05 if vertical, 0.15 if horizontal
es_es: flotante, por defecto: 0.05 si es vertical, 0.15 si es horizontal

source: Fraction of original axes between colorbar and new image axes.
es_es: Fracción de los ejes originales entre la barra de colores y los nuevos ejes de imagen.

source: **anchor**
es_es: **ancla**

source: (float, float), optional
es_es: (flotante, flotante), opcional

source: The anchor point of the colorbar axes. Defaults to (0.0, 0.5) if vertical; (0.5, 1.0) if horizontal.
es_es: El punto de anclaje de los ejes de la barra de color. Por defecto es (0.0, 0.5) si es vertical; (0.5, 1.0) si es horizontal.

source: **panchor** : (float, float), or *False*, optional
es_es: **panchor** : (flotante, flotante), o *False*, opcional

source: (float, float), or
es_es: (flotante, flotante) o

source: The anchor point of the colorbar parent axes. If *False*, the parent axes' anchor will be unchanged. Defaults to (1.0, 0.5) if vertical; (0.5, 0.0) if horizontal.
es_es: El punto de anclaje de los ejes padre de la barra de color. Si *False*, el ancla de los ejes padre no se modificará. Por defecto es (1.0, 0.5) si es vertical; (0.5, 0.0) si es horizontal.

source: Create a `.SubplotBase` suitable for a colorbar.
es_es: Crea un `.SubplotBase` adecuado para una barra de colores.

source: The axes is placed in the figure of the *parent* axes, by resizing and repositioning *parent*.
es_es: Los ejes se colocan en la figura de los ejes *padres*, al redimensionar y reposicionar *padre*.

source: This function is similar to `.make_axes`. Primary differences are
es_es: Esta función es similar a `.make_axes`. Las diferencias principales son

source: `.make_axes_gridspec` should only be used with a `.SubplotBase` parent.
es_es: `.make_axes_gridspec` solo debe ser usado con un padre `.SubplotBase`.

source: `.make_axes` creates an `~.axes.Axes`; `.make_axes_gridspec` creates a `.SubplotBase`.
es_es: `.make_axes` crea un `~.axes.Axes`; `.make_axes_gridspec` crea un `.SubplotBase`.

source: `.make_axes` updates the position of the parent. `.make_axes_gridspec` replaces the ``grid_spec`` attribute of the parent with a new one.
es_es: `.make_axes` actualiza la posición del padre. `.make_axes_gridspec` reemplaza el atributo ``grid_spec`` del padre con uno nuevo.

source: While this function is meant to be compatible with `.make_axes`, there could be some minor differences.
es_es: Aunque esta función está pensada para ser compatible con `.make_axes`, puede haber algunas diferencias menores.

source: **parent** : `~.axes.Axes`
es_es: **padre** : `~.axes.Axes`

source: The Axes to use as parent for placing the colorbar.
es_es: Los ejes a usar como padre para colocar la barra de colores.
