Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/container_api.po
Languages: es_es

source: Container for the artists of bar plots (e.g. created by `.Axes.bar`).
es_es: Contenedor para los artistas de las parcelas de barras (por ejemplo, creado por `.Axes.bar`).

source: The container can be treated as a tuple of the *patches* themselves. Additionally, you can access these and further parameters by the attributes.
es_es: El contenedor puede ser tratado como una tupla de los *parches*. Además, puede acceder a estos y otros parámetros mediante los atributos.

source: Attributes
es_es: Atributos

source: **patches** : list of :class:`~matplotlib.patches.Rectangle`
es_es: **parches** : lista de :class:`~matplotlib.patches.Rectangle`

source: list of
es_es: lista de

source: The artists of the bars.
es_es: Los artistas de los bares.

source: **errorbar** : None or :class:`~matplotlib.container.ErrorbarContainer`
es_es: **errorbar** : Ninguno o :class:`~matplotlib.container.ErrorbarContainer`

source: None or
es_es: None o

source: A container for the error bar artists if error bars are present. *None* otherwise.
es_es: Un contenedor para los artistas de la barra de error si las barras de error están presentes.

source: None or array-like
es_es: Ninguno o matriz

source: The underlying data values corresponding to the bars.
es_es: Los valores de datos subyacentes correspondientes a las barras.

source: **orientation**
es_es: **orientación**

source: {'vertical', 'horizontal'}, default: None
es_es: {'vertical', 'horizontal'}, por defecto: ninguno

source: If 'vertical', the bars are assumed to be vertical. If 'horizontal', the bars are assumed to be horizontal.
es_es: Si es 'vertical', se asume que las barras son verticales. Si 'horizontal', las barras son asumidas como horizontales.

source: Base class for containers.
es_es: Clase base para contenedores.

source: Containers are classes that collect semantically related Artists such as the bars of a bar plot.
es_es: Los contenedores son clases que recogen artistas semánticamente relacionados como las barras de una parcela de barras.

source: Add a callback function that will be called whenever one of the `.Artist`'s properties changes.
es_es: Añade una función callback que será llamada cada vez que cambie una de las propiedades de `.Artist`.

source: Parameters
es_es: Parámetros

source: callable
es_es: llamable

source: The callback function. It must have the signature::
es_es: La función callback. Debe tener la firma::

source: where *artist* is the calling `.Artist`. Return values may exist but are ignored.
es_es: donde *artist* es la llamada `.Artist`. Los valores de retorno pueden existir pero son ignorados.

source: Returns
es_es: Devuelve

source: The observer id associated with the callback. This id can be used for removing the callback with `.remove_callback` later.
es_es: El id del observador asociado con el callback. Este id puede utilizarse para eliminar el callback con `.remove_callback` más adelante.

source: Return the label used for this artist in the legend.
es_es: Devuelve la etiqueta usada para este artista en la leyenda.

source: Call all of the registered callbacks.
es_es: Llama a todos los callbacks registrados.

source: This function is triggered internally when a property is changed.
es_es: Esta función se activa internamente cuando se cambia una propiedad.

source: Remove a callback based on its observer id.
es_es: Eliminar una devolución de llamada basada en su id de observador.

source: Set a label that will be displayed in the legend.
es_es: Establece una etiqueta que se mostrará en la leyenda.

source: *s* will be converted to a string by calling `str`.
es_es: *s* se convertirá en una cadena llamando a `str`.

source: Container for the artists of error bars (e.g. created by `.Axes.errorbar`).
es_es: Contenedor para los artistas de las barras de error (por ejemplo, creado por `.Axes.errorbar`).

source: The container can be treated as the *lines* tuple itself. Additionally, you can access these and further parameters by the attributes.
es_es: El contenedor puede ser tratado como la tupla de *líneas*. Además, puede acceder a estos y otros parámetros mediante los atributos.

source: **lines**
es_es: **líneas**

source: tuple
es_es: tupla

source: Tuple of ``(data_line, caplines, barlinecols)``.
es_es: Tuple de ``(data_line, caplinas, barlinecols)``.

source: data_line : :class:`~matplotlib.lines.Line2D` instance of x, y plot markers and/or line.
es_es: data_line : :class:instancia `~matplotlib.lines.Line2D` de x, y plot markers y/o línea.

source: caplines : tuple of :class:`~matplotlib.lines.Line2D` instances of the error bar caps.
es_es: caplinas : tupla de :class:instancias `~matplotlib.lines.Line2D` de las capas de la barra de error.

source: barlinecols : list of :class:`~matplotlib.collections.LineCollection` with the horizontal and vertical error ranges.
es_es: barlinecols : lista de :class:`~matplotlib.collections.LineCollection` con los rangos de errores horizontales y verticales.

source: ``True`` if the errorbar has x/y errors.
es_es: ``Verdadero`` si la barra de error tiene errores x/y.

source: Container for the artists created in a :meth:`.Axes.stem` plot.
es_es: Contenedor para los artistas creados en una gráfica :meth:`.Axes.stem`.

source: The container can be treated like a namedtuple ``(markerline, stemlines, baseline)``.
es_es: El contenedor puede ser tratado como un nombre ``(markerline, stemlines, baseline)``.

source: The artist of the markers at the stem heads.
es_es: El artista de los marcadores en la cabeza del tallo.

source: **stemlines** : list of :class:`~matplotlib.lines.Line2D`
es_es: **líneas** : lista de :class:`~matplotlib.lines.Line2D`

source: The artists of the vertical lines for all stems.
es_es: Los artistas de las líneas verticales para todos los tallos.

source: The artist of the horizontal baseline.
es_es: El artista de la línea de base horizontal.

source: Tuple of ``(markerline, stemlines, baseline)``. ``markerline`` contains the `.LineCollection` of the markers, ``stemlines`` is a `.LineCollection` of the main lines, ``baseline`` is the `.Line2D` of the baseline.
es_es: Tuple de ``(markerline, stemlines, baseline)``. ``markerline`` contiene el `.LineCollection` de los marcadores, ``stemlines`` es un `. ineCollection` de las líneas principales, ``baseline`` es el `.Line2D` de la línea base.
