Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/contour_api.po
Languages: es_es

source: Classes to support contour plotting and labelling for the Axes class.
es_es: Clases para apoyar el trazado de contornos y el etiquetado para la clase Axes.

source: Unlike the ordinary text, the get_rotation returns an updated angle in the pixel coordinate assuming that the input rotation is an angle in data coordinate (or whatever transform set).
es_es: A diferencia del texto ordinario, el get_rotation devuelve un ángulo actualizado en la coordenada de píxeles asumiendo que la rotación de entrada es un ángulo en las coordenadas de datos (o cualquier otro conjunto de transformación).

source: Create a `.Text` instance at *x*, *y* with string *text*.
es_es: Crea una instancia `.Text` en *x*, *y* con la cadena *text*.

source: Valid keyword arguments are:
es_es: Los argumentos válidos de la palabra clave son:

source: Property
es_es: Propiedad

source: Description
es_es: Descripción

source: a filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array
es_es: una función de filtro, que toma un arreglo de puntos flotantes (m, n, 3) y un valor de dpi, y devuelve un arreglo (m, n, 3)

source: scalar or None
es_es: escalar o None

source: dict with properties for `.patches.FancyBboxPatch`
es_es: dict con propiedades para `.patches.FancyBboxPatch`

source: unknown
es_es: desconocido

source: :meth:`fontfamily <matplotlib.text.Text.set_fontfamily>` or family
es_es: :meth:`fontfamily <matplotlib.text.Text.set_fontfamily>` o familia

source: :meth:`fontproperties <matplotlib.text.Text.set_fontproperties>` or font or font_properties
es_es: :meth:`fontproperties <matplotlib.text.Text.set_fontproperties>` o font o font_properties

source: `.font_manager.FontProperties` or `str` or `pathlib.Path`
es_es: `.font_manager.FontProperties` o `str` o `pathlib.Path`

source: :meth:`fontsize <matplotlib.text.Text.set_fontsize>` or size
es_es: :meth:`fontsize <matplotlib.text.Text.set_fontsize>` o size

source: {a numeric value in range 0-1000, 'ultra-condensed', 'extra-condensed', 'condensed', 'semi-condensed', 'normal', 'semi-expanded', 'expanded', 'extra-expanded', 'ultra-expanded'}
es_es: {un valor numérico en el rango 0-1000, 'ultra-condensed', 'extra-condensed', 'condensed', 'semi-condensed', 'normal', 'semi-expanded', 'expanded', 'extra-expanded', 'ultra-expanded'}

source: :meth:`fontstyle <matplotlib.text.Text.set_fontstyle>` or style
es_es: :meth:`fontstyle <matplotlib.text.Text.set_fontstyle>` o style

source: :meth:`fontvariant <matplotlib.text.Text.set_fontvariant>` or variant
es_es: :meth:`fontvariant <matplotlib.text.Text.set_fontvariant>` o variant

source: {a numeric value in range 0-1000, 'ultralight', 'light', 'normal', 'regular', 'book', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'}
es_es: {un valor numérico en el rango 0-1000, 'ultralight', 'light', 'normal', 'regular', 'book', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'}

source: float (multiple of font size)
es_es: float (múltiplo del tamaño de la fuente)

source: :meth:`multialignment <matplotlib.text.Text.set_multialignment>` or ma
es_es: :meth:`multialignment <matplotlib.text.Text.set_multialignment>` o ma

source: None or bool or float or callable
es_es: None o bool o float o callable

source: float or {'vertical', 'horizontal'}
es_es: float o {'vertical', 'horizontal'}

source: float
es_es: de punto flotante (float)

source: Return the text angle in degrees between 0 and 360.
es_es: Devuelve el ángulo del texto en grados entre 0 y 360.

source: Set multiple properties at once.
es_es: Establece varias propiedades a la vez.

source: Supported properties are
es_es: Las propiedades admitidas son

source: Patch or (Path, Transform) or None
es_es: Patch o (Path, Transform) o None

source: Mixin to provide labelling capability to `.ContourSet`.
es_es: Mezcla para proporcionar capacidad de etiquetado a `.ContourSet`.

source: Add contour label using :class:`~matplotlib.text.Text` class.
es_es: Añade etiqueta de contorno usando la clase :class:`~matplotlib.text.Text`.

source: Add contour label using :class:`ClabelText` class.
es_es: Añade etiqueta de contorno usando la clase :class:`ClabelText`.

source: Add a label near the point ``(x, y)``.
es_es: Agrega una etiqueta cerca del punto ``(x, y)``.

source: Parameters
es_es: Parámetros

source: The approximate location of the label.
es_es: Ubicación aproximada de la etiqueta.

source: **inline**
es_es: **en línea**

source: bool, default: True
es_es: bool, por defecto: True

source: If *True* remove the segment of the contour beneath the label.
es_es: Si *Verdadero* remover el segmento del contorno debajo de la etiqueta.

source: **inline_spacing**
es_es: **espacio_en línea**

source: int, default: 5
es_es: int, por defecto: 5

source: Space in pixels to leave on each side of label when placing inline. This spacing will be exact for labels at locations where the contour is straight, less so for labels on curved contours.
es_es: Espacio en píxeles para dejar en cada lado de la etiqueta cuando se coloca en línea. Este espaciado será exacto para las etiquetas en lugares donde el contorno es recto, menos para las etiquetas en contornos curvos.

source: **transform** : `.Transform` or `False`, default: ``self.axes.transData``
es_es: **transform** : `.Transform` o `False`, por defecto: ``self.axes.transData``

source: Transform or False, default: self.axes.transData
es_es: Transforma o False, por defecto: self.axes.transData

source: A transform applied to ``(x, y)`` before labeling. The default causes ``(x, y)`` to be interpreted as data coordinates. `False` is a synonym for `.IdentityTransform`; i.e. ``(x, y)`` should be interpreted as display coordinates.
es_es: Una transformación aplicada a ``(x, y)`` antes de etiquetar. El valor predeterminado hace que ``(x, y)`` sea interpretado como coordenadas de datos. `False` es un sinónimo de `.IdentityTransform`; es decir, ``(x, y)`` debe interpretarse como coordenadas de pantalla.

source: Calculate the appropriate label rotation given the linecontour coordinates in screen units, the index of the label location and the label width.
es_es: Calcula la rotación adecuada de la etiqueta, dadas las coordenadas de la línea en unidades de pantalla, el índice de la ubicación de la etiqueta y el ancho de la etiqueta.

source: If *lc* is not None or empty, also break contours and compute inlining.
es_es: Si *lc* no es Ninguno o vacío, también rompe contornos y calcula el incrustado.

source: *spacing* is the empty space to leave around the label, in pixels.
es_es: *espacio* es el espacio vacío para dejar alrededor de la etiqueta, en píxeles.

source: Both tasks are done together to avoid calculating path lengths multiple times, which is relatively costly.
es_es: Ambas tareas se realizan juntas para evitar calcular las longitudes de las rutas múltiples veces, lo que es relativamente costoso.

source: The method used here involves computing the path length along the contour in pixel coordinates and then looking approximately (label width / 2) away from central point to determine rotation and then to break contour if desired.
es_es: El método utilizado aquí consiste en calcular la longitud de la ruta a lo largo del contorno en coordenadas de píxeles y luego mirar aproximadamente (ancho de la etiqueta / 2) lejos del punto central para determinar la rotación y luego romper el contorno si se desea.

source: Label a contour plot.
es_es: Etiqueta una parcela de contorno.

source: Adds labels to line contours in this `.ContourSet` (which inherits from this mixin class).
es_es: Añade etiquetas a los contornos de línea en este `.ContourSet` (que hereda de esta clase mixin).

source: **levels**
es_es: **Niveles**

source: array-like, optional
es_es: tipo arreglo, opcional

source: A list of level values, that should be labeled. The list must be a subset of ``cs.levels``. If not given, all levels are labeled.
es_es: Una lista de valores de nivel, que debe ser etiquetada. La lista debe ser un subconjunto de ``cs.levels``. Si no se proporciona, todos los niveles están etiquetados.

source: str or float, default:
es_es: str o float, por defecto:

source: Size in points or relative size e.g., 'smaller', 'x-large'. See `.Text.set_size` for accepted string values.
es_es: Tamaño en puntos o tamaño relativo, por ejemplo, 'smaller', 'x-large'. Vea `.Text.set_size` para valores aceptados de cadena.

source: **colors**
es_es: **colores**

source: color or colors or None, default: None
es_es: color o colores o ninguno, por defecto: ninguno

source: The label colors:
es_es: Los colores de la etiqueta:

source: If *None*, the color of each label matches the color of the corresponding contour.
es_es: Si *nunca*, el color de cada etiqueta coincide con el color del contorno correspondiente.

source: If one string color, e.g., *colors* = 'r' or *colors* = 'red', all labels will be plotted in this color.
es_es: Si un color de cadena, por ejemplo, *colores* = 'r' o *colores* = 'rojo', todas las etiquetas se trazarán en este color.

source: If a tuple of colors (string, float, rgb, etc), different labels will be plotted in different colors in the order specified.
es_es: Si una tupla de colores (cadena, flotante, rgb, etc), diferentes etiquetas se trazarán en diferentes colores en el orden especificado.

source: If ``True`` the underlying contour is removed where the label is placed.
es_es: Si es ``True`` se elimina el contorno subyacente donde se coloca la etiqueta.

source: float, default: 5
es_es: float, por defecto: 5

source: Space in pixels to leave on each side of label when placing inline.
es_es: Espacio en píxeles para dejar en cada lado de la etiqueta cuando se coloca en línea.

source: This spacing will be exact for labels at locations where the contour is straight, less so for labels on curved contours.
es_es: Este espaciado será exacto para las etiquetas en lugares donde el contorno es recto, menos para las etiquetas en contornos curvos.

source: **fmt** : `.Formatter` or str or callable or dict, optional
es_es: **fmt** : `.Formatter` o str o callable o dictamen, opcional

source: Formatter or str or callable or dict, optional
es_es: Formatear o str o callable o diccionario, opcional

source: How the levels are formatted:
es_es: Cómo se formatean los niveles:

source: If a `.Formatter`, it is used to format all levels at once, using its `.Formatter.format_ticks` method.
es_es: Si es un `.Formatter`, se utiliza para formatear todos los niveles a la vez, utilizando su método `.Formatter.format_ticks`.

source: If a str, it is interpreted as a %-style format string.
es_es: Si una str, se interpreta como una cadena de formato de tipo %-s.

source: If a callable, it is called with one level at a time and should return the corresponding label.
es_es: Si es llamable, se llama con un nivel a la vez y debe devolver la etiqueta correspondiente.

source: If a dict, it should directly map levels to labels.
es_es: Si un dictamen, debe asignar directamente los niveles a las etiquetas.

source: The default is to use a standard `.ScalarFormatter`.
es_es: El valor por defecto es utilizar un `.ScalarFormatter`.

source: bool or iterable, default: False
es_es: libro o iterable, por defecto: False

source: If ``True``, contour labels will be placed manually using mouse clicks. Click the first button near a contour to add a label, click the second button (or potentially both mouse buttons at once) to finish adding labels. The third button can be used to remove the last label added, but only if labels are not inline. Alternatively, the keyboard can be used to select label locations (enter to end label placement, delete or backspace act like the third mouse button, and any other key will select a label location).
es_es: Si es ``Verdadero``, las etiquetas de contorno se colocarán manualmente usando clic del ratón. Haga clic en el primer botón cerca de un contorno para añadir una etiqueta, haga clic en el segundo botón (o posiblemente en ambos botones del ratón a la vez) para terminar de añadir etiquetas. El tercer botón se puede utilizar para eliminar la última etiqueta añadida, pero sólo si las etiquetas no están en línea. Alternativamente, el teclado puede utilizarse para seleccionar ubicaciones de la etiqueta (introduzca para la posición final de la etiqueta, borrar o retroceder actuar como el tercer botón del ratón, y cualquier otra tecla seleccionará una ubicación de etiqueta).

source: *manual* can also be an iterable object of (x, y) tuples. Contour labels will be created as if mouse is clicked at each (x, y) position.
es_es: *manual* también puede ser un objeto iterable de (x, y). Las etiquetas de contorno se crearán como si el ratón se haga clic en cada posición (x, Y).

source: **rightside_up**
es_es: **derecha_arriba**

source: If ``True``, label rotations will always be plus or minus 90 degrees from level.
es_es: Si es ``True``, las rotaciones de la etiqueta siempre serán más o menos 90 grados desde el nivel.

source: **use_clabeltext**
es_es: **usar_clabeltext**

source: bool, default: False
es_es: bool, por defecto: False

source: If ``True``, `.ClabelText` class (instead of `.Text`) is used to create labels. `ClabelText` recalculates rotation angles of texts during the drawing time, therefore this can be used if aspect of the axes changes.
es_es: Si es ``True``, la clase `.ClabelText` (en lugar de `.Text`) es usada para crear etiquetas. `ClabelText` recalcula los ángulos de rotación de los textos durante el tiempo de dibujo, por lo tanto se puede utilizar si el aspecto de los ejes cambia.

source: **zorder** : float or None, default: ``(2 + contour.get_zorder())``
es_es: **zorder** : flotante o ninguno, por defecto: ``(2 + contour.get_zorder())``

source: float or None, default:
es_es: flotante o ninguno, por defecto:

source: zorder of the contour labels.
es_es: zorder de las etiquetas de contorno.

source: Returns
es_es: Devuelve

source: labels
es_es: etiquetas

source: A list of `.Text` instances for the labels.
es_es: Una lista de instancias `.Text` para las etiquetas.

source: [*Deprecated*] Return x, y, and the index of a label location.
es_es: [*Desaprobado*] Devuelve x, y, y el índice de una ubicación de la etiqueta.

source: Labels are plotted at a location with the smallest deviation of the contour from a straight line unless there is another label nearby, in which case the next best place on the contour is picked up. If all such candidates are rejected, the beginning of the contour is chosen.
es_es: Las etiquetas se trazan en una ubicación con la menor desviación del contorno de una línea recta a menos que haya otra etiqueta cerca, en cuyo caso se recogerá el siguiente mejor lugar en el contorno. Si se rechaza a todos esos candidatos, se elige el comienzo del contorno.

source: [*Deprecated*] Return the width of the label in points.
es_es: [*Obsoleto*] Devuelve el ancho de la etiqueta en puntos.

source: Get the text of the label.
es_es: Obtener el texto de la etiqueta.

source: Find good place to draw a label (relatively flat part of the contour).
es_es: Encuentra un buen lugar para dibujar una etiqueta (parte relativamente plana del contorno).

source: Defaults to removing last label, but any index can be supplied
es_es: Por defecto se elimina la última etiqueta, pero se puede suministrar cualquier índice

source: Return whether a contour is long enough to hold a label.
es_es: Devuelve si un contorno es lo suficientemente largo como para mantener una etiqueta.

source: Set the label properties - color, fontsize, text.
es_es: Establece las propiedades de la etiqueta - color, tamaño de fuente, texto.

source: Return whether a label is already near this location.
es_es: Devuelve si una etiqueta ya está cerca de esta ubicación.

source: Store a set of contour lines or filled regions.
es_es: Almacena un conjunto de líneas de contorno o regiones llenas.

source: User-callable method: `~.Axes.clabel`
es_es: Método llamable de usuario: `~.Axes.clabel`

source: **ax** : `~.axes.Axes`
es_es: **eje** : `~.axes.Axes`

source: Axes
es_es: Ejes

source: [level0, level1, ..., leveln]
es_es: [nivel0, nivel1, ..., nivel]

source: A list of floating point numbers indicating the contour levels.
es_es: Una lista de números de punto flotante que indican los niveles de contorno.

source: List of all the polygon segments for all the *levels*. For contour lines ``len(allsegs) == len(levels)``, and for filled contour regions ``len(allsegs) = len(levels)-1``. The lists should look like ::
es_es: Lista de todos los segmentos de polígono para todos los *niveles*. Para las líneas de contorno ``len(allsegs) == len(levels)``, y para las regiones de contorno rellenadas ``len(allsegs) = len(levels)-1``. Las listas deben verse como ::

source: **allkinds** : ``None`` or [level0kinds, level1kinds, ...]
es_es: **todos** : ``Ninguno`` o [nivel0clases, nivel1clases,

source: None or [level0kinds, level1kinds, ...]
es_es: Ninguno o [nivel0clases, nivel1clases,

source: Optional list of all the polygon vertex kinds (code types), as described and used in Path. This is used to allow multiply- connected paths such as holes within filled polygons. If not ``None``, ``len(allkinds) == len(allsegs)``. The lists should look like ::
es_es: Lista opcional de todos los tipos de vértices de polígono (tipos de código), como se describe y utiliza en la ruta. Esto se utiliza para permitir rutas multiples conectadas como agujeros dentro de policones llenos. Si no, ``len(allkinds) == len(allsegs)``. Las listas deben verse como ::

source: If *allkinds* is not ``None``, usually all polygons for a particular contour level are grouped together so that ``level0segs = [polygon0]`` and ``level0kinds = [polygon0kinds]``.
es_es: Si *todos* no es ``ninguno``, normalmente todos los polígonos para un nivel de contorno particular están agrupados de manera que ``level0segs = [polygon0]`` y ``level0kinds = [polygon0kinds]``.

source: Keyword arguments are as described in the docstring of `~.Axes.contour`.
es_es: Los argumentos de palabra clave son como se describe en la docstring de `~.Axes.contour`.

source: Attributes
es_es: Atributos

source: The Axes object in which the contours are drawn.
es_es: El objeto Axes en el que se dibujan los contornos.

source: **collections** : `.silent_list` of `.PathCollection`\s
es_es: **colecciones** : `.silent_list` of `.PathCollection`s

source: silent_list of PathCollections
es_es: silent_list de PathCollections

source: The `.Artist`\s representing the contour. This is a list of `.PathCollection`\s for both line and filled contours.
es_es: Los `.Artist`s que representan el contorno. Se trata de una lista de `.PathCollection`s para los contornos de línea y de relleno.

source: The values of the contour levels.
es_es: Los valores de los niveles de contorno.

source: **layers**
es_es: **Los niveles**

source: Same as levels for line contours; half-way between levels for filled contours. See ``ContourSet._process_colors``.
es_es: Igual que los niveles para los contornos lineales; la mitad de los niveles para los contornos rellenos. Ver ``ContourSet._process_colors``.

source: Draw contour lines or filled regions, depending on whether keyword arg *filled* is ``False`` (default) or ``True``.
es_es: Dibujar líneas de contorno o regiones llenadas, dependiendo de si el argumento de palabra clave *llenado* es ``False`` (por defecto) o ``True``.

source: Call signature::
es_es: Firma de llamada::

source: The `~.axes.Axes` object to draw on.
es_es: El objeto `~.axes.Axes` en el que dibujar.

source: **allkinds**
es_es: **todos**

source: [level0kinds, level1kinds, ...], optional
es_es: [nivel0clases, nivel1tipo, ...], opcional

source: Call this whenever the mappable is changed to notify all the callbackSM listeners to the 'changed' signal.
es_es: Llame esto cada vez que se cambie el mapeo para notificar a todos los oyentes de callbackSM a la señal 'cambiado'.

source: Find the point in the contour plot that is closest to ``(x, y)``.
es_es: Encuentre el punto en la parcela de contorno más cercana a ``(x, y)``.

source: The reference point.
es_es: El punto de referencia.

source: list of int or None, default: None
es_es: lista de int o ninguno, por defecto: ninguno

source: Indices of contour levels to consider. If None (the default), all levels are considered.
es_es: Indices de los niveles de contorno al más alto. Si ninguno (el predeterminado), todos los niveles son considerados.

source: **pixel**
es_es: **píxel**

source: If *True*, measure distance in pixel (screen) space, which is useful for manual contour labeling; else, measure distance in axes space.
es_es: Si es *True*, mide la distancia en el espacio pixel (pantalla), lo que es útil para la etiqueta de contorno manual; por otro lado, mide la distancia en el espacio de los ejes.

source: **contour** : `.Collection`
es_es: **contorno** : `.Collection`

source: Collection
es_es: Colección

source: The contour that is closest to ``(x, y)``.
es_es: El contorno más cercano a ``(x, y)``.

source: **segment**
es_es: **segmento**

source: The index of the `.Path` in *contour* that is closest to ``(x, y)``.
es_es: El índice del `.Path` en *contorno* que es más cercano a ``(x, y)``.

source: **index**
es_es: **índice**

source: The index of the path segment in *segment* that is closest to ``(x, y)``.
es_es: El índice del segmento de ruta en *segment* que es más cercano a ``(x, y)``.

source: The point in the contour plot that is closest to ``(x, y)``.
es_es: El punto en la trama de contorno que es más cercana a ``(x, y)``.

source: The squared distance from ``(xmin, ymin)`` to ``(x, y)``.
es_es: La distancia cuadrada de ``(xmin, ymin)`` a ``(x, y)``.

source: Return alpha to be applied to all ContourSet artists.
es_es: Retorna alfa para ser aplicada a todos los artistas de ContourSet .

source: Return the :class:`~matplotlib.transforms.Transform` instance used by this ContourSet.
es_es: Devuelve la instancia :class:`~matplotlib.transforms.Transform` usada por este ContourSet.

source: Return a list of artists and labels suitable for passing through to `~.Axes.legend` which represent this ContourSet.
es_es: Devuelve una lista de artistas y etiquetas adecuadas para pasar a `~.Axes.legend` que representan este ContourSet.

source: The labels have the form "0 < x <= 1" stating the data ranges which the artists represent.
es_es: Las etiquetas tienen el formulario "0 < x <= 1" indicando los rangos de datos que representan los artistas.

source: **variable_name**
es_es: **nombre_variable**

source: The string used inside the inequality used on the labels.
es_es: La cadena usada dentro de la desigualdad usada en las etiquetas.

source: function: float -> str
es_es: función: float -> str

source: Function used to format the numbers in the labels.
es_es: Función utilizada para formatear los números en las etiquetas.

source: **artists** : list[`.Artist`]
es_es: **artistas** : lista[`.Artist`]

source: list[
es_es: lista[

source: A list of the artists.
es_es: Una lista de los artistas.

source: list[str]
es_es: lista[str]

source: A list of the labels.
es_es: Una lista de las etiquetas.

source: Set the alpha blending value for all ContourSet artists. *alpha* must be between 0 (transparent) and 1 (opaque).
es_es: Establece el valor de mezcla alfa para todos los artistas ContourSet. *alpha* debe estar entre 0 (transparente) y 1 (opaque).

source: Create and store a set of contour lines or filled regions.
es_es: Crea y almacena un conjunto de líneas de contorno o regiones llenas.
