Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/contour_api.po
Languages: es_es

source: This class is typically not instantiated directly by the user but by `~.Axes.contour` and `~.Axes.contourf`.
es_es: Esta clase normalmente no es instanciada directamente por el usuario, sino por `~.Axes.contour` y `~.Axes.contourf`.
