Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/dates_api.po
Languages: es_es

source: Matplotlib provides sophisticated date plotting capabilities, standing on the shoulders of python :mod:`datetime` and the add-on module :mod:`dateutil`.
es_es: Matplotlib proporciona sofisticadas capacidades de trazado de fechas, de pie en los hombros de python :mod:`datetime` y el módulo de complemento :mod:`dateutil`.

source: By default, Matplotlib uses the units machinery described in `~matplotlib.units` to convert `datetime.datetime`, and `numpy.datetime64` objects when plotted on an x- or y-axis. The user does not need to do anything for dates to be formatted, but dates often have strict formatting needs, so this module provides many axis locators and formatters. A basic example using `numpy.datetime64` is::
es_es: Por defecto, Matplotlib utiliza la maquinaria de unidades descrita en `~matplotlib.units` para convertir `datetime.datetime`, y los objetos `numpy.datetime64` cuando se grafica en un eje x o y-. El usuario no necesita hacer nada para las fechas a formatear, pero las fechas a menudo tienen necesidades de formato estrictas, por lo que este módulo proporciona muchos localizadores y formateadores de ejes. Un ejemplo básico usando `numpy.datetime64` es::

source: Matplotlib represents dates using floating point numbers specifying the number of days since a default epoch of 1970-01-01 UTC; for example, 1970-01-01, 06:00 is the floating point number 0.25. The formatters and locators require the use of `datetime.datetime` objects, so only dates between year 0001 and 9999 can be represented. Microsecond precision is achievable for (approximately) 70 years on either side of the epoch, and 20 microseconds for the rest of the allowable range of dates (year 0001 to 9999). The epoch can be changed at import time via `.dates.set_epoch` or :rc:`dates.epoch` to other dates if necessary; see :doc:`/gallery/ticks/date_precision_and_epochs` for a discussion.
es_es: Matplotlib representa fechas usando números de punto flotante que especifican el número de días desde un epoch predeterminado de 1970-01-01 UTC; por ejemplo, 1970-01-01, 06:00 es el número de punto flotante 0. 5. Los formateadores y localizadores requieren el uso de objetos `datetime.datetime`, así que solo las fechas entre el año 0001 y 9999 pueden ser representadas. La precisión microsegunda es alcanzable durante (aproximadamente) 70 años a ambos lados del époco, y 20 microsegundos para el resto de las fechas permitidas (año 0001 a 9999). El epoch puede cambiarse en hora de importación a través de `.dates.set_epoch` o :rc:`dates. poch` a otras fechas si es necesario; vea :doc:`/gallery/ticks/date_precision_and_epochs` para una discusión.

source: Before Matplotlib 3.3, the epoch was 0000-12-31 which lost modern microsecond precision and also made the default axis limit of 0 an invalid datetime. In 3.3 the epoch was changed as above. To convert old ordinal floats to the new epoch, users can do::
es_es: Antes de Matplotlib 3.3, el epoch era 0000-12-31 que perdió la moderna precisión de microsegundos y también hizo del eje predeterminado el límite de 0 una fecha no válida. En 3.3 el epoch se cambió como arriba. Para convertir viejos floats ordinales al nuevo epoch, los usuarios pueden hacer::

source: There are a number of helper functions to convert between :mod:`datetime` objects and Matplotlib dates:
es_es: Hay un número de funciones de ayuda para convertir entre los objetos :mod:`datetime` y las fechas de Matplotlib:

source: Convert a date string to a datenum using `dateutil.parser.parse`.
es_es: Convierte una cadena de fecha a un datenum usando `dateutil.parser.parse`.

source: Convert datetime objects to Matplotlib dates.
es_es: Convierte objetos de fecha a fechas de Matplotlib.

source: Convert Matplotlib dates to `~datetime.datetime` objects.
es_es: Convierte las fechas de Matplotlib a objetos `~datetime.datetime`.

source: Convert number of days to a `~datetime.timedelta` object.
es_es: Convierte el número de días a un objeto `~datetime.timedelta`.

source: Return a sequence of equally spaced Matplotlib dates.
es_es: Devuelve una secuencia de fechas de Matplotlib igualmente espaciadas.

source: Set the epoch (origin for dates) for datetime calculations.
es_es: Establece el epoco (origen para las fechas) para los cálculos de la fecha/hora.

source: Get the epoch used by `.dates`.
es_es: Obtener el epoch usado por `.dates`.

source: Like Python's `datetime.datetime`, Matplotlib uses the Gregorian calendar for all conversions between dates and floating point numbers. This practice is not universal, and calendar differences can cause confusing differences between what Python and Matplotlib give as the number of days since 0001-01-01 and what other software and databases yield. For example, the US Naval Observatory uses a calendar that switches from Julian to Gregorian in October, 1582. Hence, using their calculator, the number of days between 0001-01-01 and 2006-04-01 is 732403, whereas using the Gregorian calendar via the datetime module we find::
es_es: Al igual que el `datetime.datetime` de Python, Matplotlib utiliza el calendario Gregorio para todas las conversiones entre fechas y números de coma flotante. Esta práctica no es universal, y las diferencias de calendario pueden causar diferencias confusas entre lo que Python y Matplotlib dan como el número de días desde el 0001-01-01 y lo que otros programas y bases de datos nos proporcionan. Por ejemplo, el Observatorio Naval de los Estados Unidos utiliza un calendario que cambia de Julian a Gregoriano en octubre de 1582. Por lo tanto, utilizando su calculadora, el número de días entre 0001-01-01 y 2006-04-01 es 732403, mientras que usamos el calendario Gregoriano a través del módulo datetime que encontramos::

source: All the Matplotlib date converters, tickers and formatters are timezone aware. If no explicit timezone is provided, :rc:`timezone` is assumed. If you want to use a custom time zone, pass a `datetime.tzinfo` instance with the tz keyword argument to `num2date`, `.Axis.axis_date`, and any custom date tickers or locators you create.
es_es: Todos los convertidores de fecha, etiquetas y formateadores de Matplotlib son conscientes de la zona horaria. Si no se proporciona una zona horaria explícita, se asume :rc:'zona horaria'. Si quieres usar una zona horaria personalizada, pasa una instancia `datetime.tzinfo` con el argumento de la palabra clave tz a `num2date`, `. xis.axis_date`, y cualquier dato o localizador personalizado que cree.

source: A wide range of specific and general purpose date tick locators and formatters are provided in this module. See :mod:`matplotlib.ticker` for general information on tick locators and formatters. These are described below.
es_es: En este módulo se proporciona una amplia gama de localizadores y formatos de fecha de uso general específicos. Vea :mod:`matplotlib.ticker` para obtener información general sobre los localizadores de ticks y formatters. Estos se describen a continuación.

source: The dateutil_ module provides additional code to handle date ticking, making it easy to place ticks on any kinds of dates. See examples below.
es_es: El módulo dateutil_ proporciona código adicional para manejar la marca de fecha, haciendo fácil colocar ticks en cualquier tipo de fecha. Ver ejemplos a continuación.

source: Date tickers
es_es: Marcadores de fecha

source: Most of the date tickers can locate single or multiple values. For example::
es_es: La mayoría de los tickers de fecha pueden encontrar valores individuales o múltiples. Por ejemplo::

source: In addition, most of the constructors take an interval argument::
es_es: Además, la mayoría de los constructores toman un argumento intervalo::

source: The rrule locator allows completely general date ticking::
es_es: El localizador de reglas permite marcar fecha completamente general::

source: The available date tickers are:
es_es: Los tickers de fecha disponibles son:

source: `MicrosecondLocator`: Locate microseconds.
es_es: `MicrosecondLocator`: Localiza microsegundos.

source: `SecondLocator`: Locate seconds.
es_es: `SegundoLocator`: Localiza segundos.

source: `HourLocator`: Locate hours.
es_es: `HourLocator`: Localiza horas.

source: `DayLocator`: Locate specified days of the month.
es_es: `DayLocator`: Localiza los días especificados del mes.

source: `WeekdayLocator`: Locate days of the week, e.g., MO, TU.
es_es: `WeekdayLocator`: Localice los días de la semana, por ejemplo, MO, UT.

source: `MonthLocator`: Locate months, e.g., 7 for July.
es_es: `MonthLocator`: Localice meses, por ejemplo, el 7 de julio.

source: `YearLocator`: Locate years that are multiples of base.
es_es: `AñoLocator`: Localice años que son múltiplos de base.

source: `RRuleLocator`: Locate using a `matplotlib.dates.rrulewrapper`. `.rrulewrapper` is a simple wrapper around dateutil_'s `dateutil.rrule` which allow almost arbitrary date tick specifications. See :doc:`rrule example </gallery/ticks/date_demo_rrule>`.
es_es: `RuleLocator`: Localiza usando un `matplotlib.dates.rrulewrapper`. `.rrulewrapper` es un envoltorio simple alrededor de dateutil_'s `dateutil. rule` que permite especificaciones de tick de fecha casi arbitrarias. Vea :doc:`rrule example </gallery/ticks/date_demo_rrule>`.

source: `AutoDateLocator`: On autoscale, this class picks the best `DateLocator` (e.g., `RRuleLocator`) to set the view limits and the tick locations. If called with ``interval_multiples=True`` it will make ticks line up with sensible multiples of the tick intervals. E.g. if the interval is 4 hours, it will pick hours 0, 4, 8, etc as ticks. This behaviour is not guaranteed by default.
es_es: `AutoDateLocator`: En autoescala, esta clase elige la mejor `DateLocator` (por ejemplo, `RuleLocator`) para establecer los límites de la vista y las ubicaciones de tick. Si se llama con ``interval_multiples=True`` hará que los ticks alineen con múltiplos sensatos de los intervalos de tick. E. . Si el intervalo es de 4 horas, recogerá horas 0, 4, 8, etc como ticks. Este comportamiento no está garantizado por defecto.

source: Date formatters
es_es: Formateadores de fecha

source: The available date formatters are:
es_es: Los formatos de fecha disponibles son:

source: `AutoDateFormatter`: attempts to figure out the best format to use. This is most useful when used with the `AutoDateLocator`.
es_es: `AutoDateFormatter`: intenta averiguar el mejor formato a utilizar. Esto es más útil cuando se utiliza con el `AutoDateLocator`.

source: `ConciseDateFormatter`: also attempts to figure out the best format to use, and to make the format as compact as possible while still having complete date information. This is most useful when used with the `AutoDateLocator`.
es_es: `ConciseDateFormatter`: también intenta averiguar el mejor formato a usar y hacer que el formato sea lo más compacto posible mientras todavía tiene información completa de la fecha. Esto es más útil cuando se utiliza con el `AutoDateLocator`.

source: `DateFormatter`: use `~datetime.datetime.strftime` format strings.
es_es: `DateFormatter`: usa las cadenas de formato `~datetime.datetime.strftime`.

source: A `.Formatter` which attempts to figure out the best format to use. This is most useful when used with the `AutoDateLocator`.
es_es: Un `.Formatter` que intenta averiguar el mejor formato a utilizar. Esto es más útil cuando se utiliza con el `AutoDateLocator`.

source: `.AutoDateFormatter` has a ``.scale`` dictionary that maps tick scales (the interval in days between one major tick) to format strings; this dictionary defaults to ::
es_es: `.AutoDateFormatter` tiene un diccionario ``.scale`` que mapea escalas (el intervalo en días entre un tick) para formatear cadenas; este diccionario por defecto a ::

source: The formatter uses the format string corresponding to the lowest key in the dictionary that is greater or equal to the current scale. Dictionary entries can be customized::
es_es: El formateador utiliza la cadena de formato correspondiente a la clave más baja del diccionario que es mayor o igual a la escala actual. Las entradas del diccionario pueden ser personalizadas::

source: Custom callables can also be used instead of format strings. The following example shows how to use a custom format function to strip trailing zeros from decimal seconds and adds the date to the first ticklabel::
es_es: Las llamadas personalizadas también se pueden utilizar en lugar de cadenas de formato. El siguiente ejemplo muestra cómo utilizar una función de formato personalizado para eliminar ceros finales de segundos decimales y añadir la fecha a la primera etiqueta::

source: Autoformat the date labels.
es_es: Autoformatear las etiquetas de fecha.

source: Parameters
es_es: Parámetros

source: **locator** : `.ticker.Locator`
es_es: **localizador** : `.ticker.Locator`

source: Locator that this axis is using.
es_es: Localizador que está utilizando este eje.

source: str, optional
es_es: str, opcional

source: Passed to `.dates.date2num`.
es_es: Pasado a `.dates.date2num`.

source: **defaultfmt**
es_es: **por defecto**

source: The default format to use if none of the values in ``self.scaled`` are greater than the unit returned by ``locator._get_unit()``.
es_es: El formato predeterminado a usar si ninguno de los valores en ``self.scaled`` son mayores que la unidad devuelta por ``locator._get_unit()``.

source: **usetex** : bool, default: :rc:`text.usetex`
es_es: **usetex** : bool, por defecto: :rc:`text.usetex`

source: To enable/disable the use of TeX's math mode for rendering the results of the formatter. If any entries in ``self.scaled`` are set as functions, then it is up to the customized function to enable or disable TeX's math mode itself.
es_es: Para activar/desactivar el uso del modo matemático de TeX para renderizar los resultados del formateador. Si hay entradas en ``self'. caled`` se configuran como funciones, entonces depende de la función personalizada para activar o desactivar el modo matemático de TeX en sí.

source: On autoscale, this class picks the best `DateLocator` to set the view limits and the tick locations.
es_es: En la escala automática, esta clase elige el mejor `DateLocator` para establecer los límites de la vista y las ubicaciones del tick.

source: Attributes
es_es: Atributos

source: **intervald**
es_es: **intervalo**

source: Mapping of tick frequencies to multiples allowed for that ticking. The default is ::
es_es: Mapeo de frecuencias de ticks a múltiplos permitidos para ese ticking. El valor predeterminado es ::

source: where the keys are defined in `dateutil.rrule`.
es_es: donde las claves se definen en `dateutil.rrule`.

source: The interval is used to specify multiples that are appropriate for the frequency of ticking. For instance, every 7 days is sensible for daily ticks, but for minutes/seconds, 15 or 30 make sense.
es_es: El intervalo se utiliza para especificar múltiplos que son apropiados para la frecuencia de tick. Por ejemplo, cada 7 días es sensible para los ticks diarios, pero por minutos, 15 o 30 tienen sentido.

source: When customizing, you should only modify the values for the existing keys. You should not add or delete entries.
es_es: Al personalizar, sólo debe modificar los valores de las claves existentes. No debe añadir o eliminar entradas.

source: Example for forcing ticks every 3 hours::
es_es: Ejemplo para forzar ticks cada 3 horas::

source: Ticks timezone.
es_es: Marca zona horaria.

source: The minimum number of ticks desired; controls whether ticks occur yearly, monthly, etc.
es_es: El número mínimo de ticks deseado; controla si los ticks ocurren anualmente, mensualmente, etc.

source: **maxticks**
es_es: **maxticas**

source: The maximum number of ticks desired; controls the interval between ticks (ticking every other, every 3, etc.). For fine-grained control, this can be a dictionary mapping individual rrule frequency constants (YEARLY, MONTHLY, etc.) to their own maximum number of ticks. This can be used to keep the number of ticks appropriate to the format chosen in `AutoDateFormatter`. Any frequency not specified in this dictionary is given a default value.
es_es: El número máximo de ticks deseado; controla el intervalo entre ticks (marcando cada 3, etc.). Para un control fino, esto puede ser un diccionario que mapea constantes individuales de frecuencia de las reglas (ANUALMENTE MONTHLY, etc.). a su propio número máximo de ticks. Esto puede utilizarse para mantener el número de ticks apropiados para el formato elegido en `AutoDateFormatter`. Cualquier frecuencia no especificada en este diccionario tiene un valor predeterminado.

source: **interval_multiples**
es_es: **intervalo_múltiples**

source: bool, default: True
es_es: bool, por defecto: True

source: Whether ticks should be chosen to be multiple of the interval, locking them to 'nicer' locations. For example, this will force the ticks to be at hours 0, 6, 12, 18 when hourly ticking is done at 6 hour intervals.
es_es: Si los ticks deben ser seleccionados para ser múltiples del intervalo, bloqueándolos a ubicaciones 'más agradables'. Por ejemplo, esto obligará a los ticks a estar en horas 0, 6, 12, 18 cuando la hora de la marca se realice a intervalos de 6 horas.

source: Pick the best locator based on a distance.
es_es: Elija el mejor localizador basado en una distancia.

source: Given the proposed upper and lower extent, adjust the range if it is too close to being singular (i.e. a range of ~0).
es_es: Dado el alcance superior y inferior propuesto, ajuste el rango si está demasiado cerca de ser singular (es decir, un rango de ~0).

source: Return the values of the located ticks given **vmin** and **vmax**.
es_es: Devuelve los valores de los marcadores localizados dados **vmin** y **vmax**.

source: To get tick locations with the vmin and vmax values defined automatically for the associated :attr:`axis` simply call the Locator instance::
es_es: Para obtener las ubicaciones de los marcadores con los valores vmin y vmax definidos automáticamente para el :attr:`eje` asociado, simplemente llame a la instancia Locator::

source: Return the `~matplotlib.units.AxisInfo` for *unit*.
es_es: Devuelve el `~matplotlib.units.AxisInfo` para *unit*.

source: *unit* is a tzinfo instance or None. The *axis* argument is required but not used.
es_es: *unit* es una instancia tzinfo o ninguna. El argumento *axis* es necesario pero no se utiliza.

source: A `.Formatter` which attempts to figure out the best format to use for the date, and to make it as compact as possible, but still be complete. This is most useful when used with the `AutoDateLocator`::
es_es: Un `.Formatter` que intenta averiguar el mejor formato para la fecha, y para hacerlo lo más compacto posible, pero aún así estar completo. Esto es más útil cuando se utiliza con el `AutoDateLocator`::

source: **formats**
es_es: **formatos**

source: list of 6 strings, optional
es_es: lista de 6 cadenas, opcional

source: Format strings for 6 levels of tick labelling: mostly years, months, days, hours, minutes, and seconds. Strings use the same format codes as `~datetime.datetime.strftime`. Default is ``['%Y', '%b', '%d', '%H:%M', '%H:%M', '%S.%f']``
es_es: Formatear cadenas para 6 niveles de etiquetado de tick: principalmente años, meses, días, horas, minutos y segundos. Las cadenas utilizan los códigos del mismo formato que `~datetime. atetime.strftime`. Por defecto es ``['%Y', '%b', '%d', '%H:%M', '%H:%M', '%S.%f']``

source: **zero_formats**
es_es: **cero formatos**

source: Format strings for tick labels that are "zeros" for a given tick level. For instance, if most ticks are months, ticks around 1 Jan 2005 will be labeled "Dec", "2005", "Feb". The default is ``['', '%Y', '%b', '%b-%d', '%H:%M', '%H:%M']``
es_es: Formatear cadenas para etiquetas de marcas que son "ceros" para un determinado nivel de tick. Por ejemplo, si la mayoría de ticks son meses, los ticks alrededor del 1 de enero de 2005 serán etiquetados como "Dec", "2005", "Feb". Por defecto es ``['', '%Y', '%b', '%b-%d', '%H:%M', '%H:%M']``

source: Format strings for the 6 levels that is applied to the "offset" string found on the right side of an x-axis, or top of a y-axis. Combined with the tick labels this should completely specify the date. The default is::
es_es: Formatear cadenas para los 6 niveles que se aplican a la cadena "offset" encontrada en el lado derecho de un eje x, o superior de un eje y. Combinado con las etiquetas de marca, esto debe especificar completamente la fecha. Por defecto es::

source: **show_offset**
es_es: **mostrar_desplazamiento**

source: Whether to show the offset or not.
es_es: Si mostrar el desplazamiento o no.

source: To enable/disable the use of TeX's math mode for rendering the results of the formatter.
es_es: Para activar/desactivar el uso del modo matemático de TeX para renderizar los resultados del formateador.

source: Examples
es_es: Ejemplos

source: See :doc:`/gallery/ticks/date_concise_formatter`
es_es: Ver :doc:`/gallery/ticks/date_concise_formatter`

source: (`Source code <../api/dates_api-1.py>`__, `png <../api/dates_api-1.png>`__, `pdf <../api/dates_api-1.pdf>`__)
es_es: (`Código fuente <../api/dates_api-1.py>`__, `png <../api/dates_api-1.png>`__, `pdf <../api/dates_api-1.pdf>`__)

source: Autoformat the date labels. The default format is used to form an initial string, and then redundant elements are removed.
es_es: Autoformatear las etiquetas de fecha. El formato por defecto se utiliza para formar una cadena inicial, y luego los elementos redundantes se eliminan.

source: Return a short string version of the tick value.
es_es: Devuelve una versión de cadena corta del valor del marcador.

source: Defaults to the position-independent long value.
es_es: Por defecto, el valor largo independiente de la posición.

source: Return the tick labels for all the ticks at once.
es_es: Devuelve las etiquetas de los marcadores de todos los ticks a la vez.

source: Converter for `datetime.date` and `datetime.datetime` data, or for date/time data represented as it would be converted by `date2num`.
es_es: Convierte los datos `datetime.date` y `datetime.datetime`, o los datos de fecha/hora representados ya que serían convertidos por `date2num`.

source: The 'unit' tag for such data is None or a tzinfo instance.
es_es: La etiqueta 'unit' para estos datos es Ninguno o una instancia tzinfo.

source: If *value* is not already a number or sequence of numbers, convert it with `date2num`.
es_es: Si *valor* no es ya un número o secuencia de números, conviértalo con `date2num`.

source: The *unit* and *axis* arguments are not used.
es_es: Los argumentos *unidad* y *eje* no se utilizan.

source: Return the tzinfo instance of *x* or of its first element, or None
es_es: Devuelve la instancia tzinfo de *x* o de su primer elemento, o Ninguno

source: Format a tick (in days since the epoch) with a `~datetime.datetime.strftime` format string.
es_es: Formar un tick (en días desde el epoch) con una cadena de formato `~datetime.datetime.strftime`.

source: `~datetime.datetime.strftime` format string
es_es: `~datetime.datetime.strftime` formato cadena

source: **tz** : `datetime.tzinfo`, default: :rc:`timezone`
es_es: **tz** : `datetime.tzinfo`, por defecto: :rc:`timezone`

source: datetime.tzinfo, default: rcParams["timezone"] (default: 'UTC')
es_es: datetime.tzinfo, por defecto: rcParams["timezone"] (por defecto: 'UTC')

source: Determines the tick locations when plotting dates.
es_es: Determina las ubicaciones de ticks al trazar fechas.

source: This class is subclassed by other Locators and is not meant to be used on its own.
es_es: Esta clase está subclasificada por otros Localizadores y no está pensada para ser utilizada por sí sola.

source: Convert axis data interval to datetime objects.
es_es: Convierte el intervalo de datos del eje a objetos de fecha/hora.
