Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/dates_api.po
Languages: es_es

source: Set time zone info.
es_es: Establecer información de zona horaria.

source: Convert the view interval to datetime objects.
es_es: Convierte el intervalo de la vista a objetos de fecha/hora.

source: Bases: :py:class:`matplotlib.dates.RRuleLocator`
es_es: Bases: :py:class:`matplotlib.dates.RuleLocator`

source: Make ticks on occurrences of each day of the month. For example, 1, 15, 30.
es_es: Haga ticks en las ocurrencias de cada día del mes. Por ejemplo, 1, 15, 30.

source: Mark every day in *bymonthday*; *bymonthday* can be an int or sequence.
es_es: Marcar todos los días en *por mes*; *por mes* puede ser un int o secuencia.

source: Default is to tick every day of the month: ``bymonthday=range(1, 32)``.
es_es: Por defecto es marcar todos los días del mes: ``bymonthday=range(1, 32)``.

source: Make ticks on occurrences of each hour.
es_es: Crea ticks en ocurrencias de cada hora.

source: Mark every hour in *byhour*; *byhour* can be an int or sequence. Default is to tick every hour: ``byhour=range(24)``
es_es: Marcar cada hora en *por hora*; *por hora* puede ser una señal o secuencia. Por defecto marca cada hora: ``byhour=range(24)``

source: *interval* is the interval between each iteration. For example, if ``interval=2``, mark every second occurrence.
es_es: *interval* es el intervalo entre cada iteración. Por ejemplo, si es ``interval=2``, marque cada segundo acontecimiento.

source: Make ticks on regular intervals of one or more microsecond(s).
es_es: Hacer ticks en intervalos regulares de uno o más micro(s).

source: By default, Matplotlib uses a floating point representation of time in days since the epoch, so plotting data with microsecond time resolution does not work well for dates that are far (about 70 years) from the epoch (check with `~.dates.get_epoch`).
es_es: Por defecto, Matplotlib utiliza una representación de punto flotante del tiempo en días desde el époco, por lo que trazar datos con resolución microsegunda vez no funciona bien para fechas que están lejos (alrededor de 70 años) de la epoch (consulte con `~. ates.get_epoch`).

source: If you want sub-microsecond resolution time plots, it is strongly recommended to use floating point seconds, not datetime-like time representation.
es_es: Si desea gráficos de tiempo de resolución sub-microsegundos, se recomienda usar segundos de punto flotante, no de fecha como la representación.

source: If you really must use datetime.datetime() or similar and still need microsecond precision, change the time origin via `.dates.set_epoch` to something closer to the dates being plotted. See :doc:`/gallery/ticks/date_precision_and_epochs`.
es_es: Si realmente debe usar datetime.datetime() o similar y todavía necesita precisión de microsegundo, cambie el origen de la hora a través de `. ates.set_epoch` a algo más cercano a las fechas que se están trazando. Mira :doc:`/gallery/ticks/date_precision_and_epochs`.

source: *interval* is the interval between each iteration. For example, if ``interval=2``, mark every second microsecond.
es_es: *interval* es el intervalo entre cada iteración. Por ejemplo, si es ``interval=2``, marque cada segundo microsegundo.

source: Make ticks on occurrences of each minute.
es_es: Hacer ticks en las ocurrencias de cada minuto.

source: Mark every minute in *byminute*; *byminute* can be an int or sequence. Default is to tick every minute: ``byminute=range(60)``
es_es: Marca cada minuto en *byminute*; *byminute* puede ser una int o secuencia. Por defecto marca cada minuto: ``byminute=range(60)``

source: Make ticks on occurrences of each month, e.g., 1, 3, 12.
es_es: Hacer ticks en las ocurrencias de cada mes, por ejemplo, 1, 3, 12.

source: Mark every month in *bymonth*; *bymonth* can be an int or sequence. Default is ``range(1, 13)``, i.e. every month.
es_es: Marcar cada mes en *por mes*; *por mes* puede ser una señal o secuencia. Por defecto es ``range(1, 13)``, es decir, cada mes.

source: Make ticks on occurrences of each second.
es_es: Crea ticks en las ocurrencias de cada segundo.

source: Mark every second in *bysecond*; *bysecond* can be an int or sequence. Default is to tick every second: ``bysecond = range(60)``
es_es: Marcar cada segundo en *bysecond*; *bysecond* puede ser una int o secuencia. Por defecto marca cada segundo: ``bysecond = range(60)``

source: Make ticks on occurrences of each weekday.
es_es: Hacer ticks en las ocurrencias de cada día de la semana.

source: Mark every weekday in *byweekday*; *byweekday* can be a number or sequence.
es_es: Marcar todos los días de la semana en *por semana*; *por semana* puede ser un número o secuencia.

source: Elements of *byweekday* must be one of MO, TU, WE, TH, FR, SA, SU, the constants from :mod:`dateutil.rrule`, which have been imported into the :mod:`matplotlib.dates` namespace.
es_es: Los elementos de *por semana* deben ser uno de MO, TU, WE, TH, FR, SA, SU, las constantes de :mod:`dateutil. rule`, que han sido importados en el namespace `matplotlib.dates` de :mod:.

source: *interval* specifies the number of weeks to skip. For example, ``interval=2`` plots every second week.
es_es: *interval* especifica el número de semanas a saltar. Por ejemplo, las gráficas ``interval=2`` cada segunda semana.

source: Make ticks on a given day of each year that is a multiple of base.
es_es: Hacer garrapatos en un día determinado de cada año que es un múltiplo de base.

source: Examples::
es_es: Ejemplos::

source: Mark years that are multiple of base on a given month and day (default jan 1).
es_es: Marque años que son múltiples de base en un mes y día determinado (por defecto jan 1).

source: **d** : `datetime.datetime` or `numpy.datetime64` or sequences of these
es_es: **d** : `datetime.datetime` o `numpy.datetime64` o secuencias de estas

source: datetime.datetime or numpy.datetime64 or sequences of these
es_es: datetime.datetime o numpy.datetime64 o secuencias de estos

source: Returns
es_es: Devuelve

source: float or sequence of floats
es_es: flotante o secuencia de flotantes

source: Number of days since the epoch. See `.get_epoch` for the epoch, which can be changed by :rc:`date.epoch` or `.set_epoch`. If the epoch is "1970-01-01T00:00:00" (default) then noon Jan 1 1970 ("1970-01-01T12:00:00") returns 0.5.
es_es: Número de días desde el epoch. Vea `.get_epoch` para el epoch, que puede ser cambiado por :rc:`date.epoch` o `. Si el epoch es "1970-01-01-01T00:00:00" (predeterminado), entonces al mediodía Enan 1 1970 ("1970-01-01T12:00:00") devuelve 0.5.

source: The Gregorian calendar is assumed; this is not universal practice. For details see the module docstring.
es_es: El calendario gregoriano está asumido; esto no es práctica universal. Para más detalles vea el módulo docstring.

source: str or sequence of str
es_es: str o secuencia de str

source: The dates to convert.
es_es: Las fechas a convertir.

source: **default**
es_es: **por defecto**

source: datetime.datetime, optional
es_es: datetime.datetime, opcional

source: The default date to use when fields are missing in *d*.
es_es: La fecha por defecto a usar cuando los campos no están en *d*.

source: The dates start at *dstart* and reach up to, but not including *dend*. They are spaced by *delta*.
es_es: Las fechas comienzan en *dstart* y alcanzan para, pero no incluyen *dend*, están espaciadas por *delta*.

source: datetime
es_es: fecha

source: The date limits.
es_es: Los límites de fecha.

source: Spacing of the dates.
es_es: Espaciado de las fechas.

source: A list floats representing Matplotlib dates.
es_es: Una lista de flotantes que representan las fechas de Matplotlib.

source: [*Deprecated*] Convert UNIX time to days since Matplotlib epoch.
es_es: [*Deprecado*] Convierte UNIX vez a días desde Matplotlib epoch.

source: list of floats
es_es: lista de flotantes

source: Time in seconds since 1970-01-01.
es_es: Tiempo en segundos desde 1970-01-01.

source: Time in days since Matplotlib epoch (see `~.dates.get_epoch()`).
es_es: Tiempo en días desde que Matplotlib epoch (ver `~.dates.get_epoch()`).

source: Number of days (fraction part represents hours, minutes, seconds) since the epoch. See `.get_epoch` for the epoch, which can be changed by :rc:`date.epoch` or `.set_epoch`.
es_es: Número de días (parte de la fracción representa horas, minutos, segundos) desde el époco. Ver `. et_epoch` para el epoch, que puede ser cambiado por :rc:`date.epoch` o `.set_epoch`.

source: **tz** : str, default: :rc:`timezone`
es_es: **tz** : str, por defecto: :rc:`timezone`

source: str, default:
es_es: str, por defecto:

source: Timezone of *x*.
es_es: Zona horaria de *x*.

source: `~datetime.datetime` or sequence of `~datetime.datetime`
es_es: `~datetime.datetime` o secuencia de `~datetime.datetime`

source: Dates are returned in timezone *tz*.
es_es: Las fechas son devueltas en la zona horaria *tz*.

source: If *x* is a sequence, a sequence of `~datetime.datetime` objects will be returned.
es_es: Si *x* es una secuencia, se retornará una secuencia de objetos `~datetime.datetime`.

source: The addition of one here is a historical artifact. Also, note that the Gregorian calendar is assumed; this is not universal practice. For details, see the module docstring.
es_es: La adición de uno aquí es un artefacto histórico. Además, tenga en cuenta que el calendario Gregoriano está asumido; esto no es práctica universal. Para más detalles, consulte la cadena de documentación del módulo.

source: [*Deprecated*] Convert days since Matplotlib epoch to UNIX time.
es_es: [*Deprecado*] Convierte días desde la época de Matplotlib a la de UNIX.

source: If *x* is a sequence, a sequence of `~datetime.timedelta` objects will be returned.
es_es: Si *x* es una secuencia, se retornará una secuencia de objetos `~datetime.timedelta`.

source: float, sequence of floats
es_es: flotante, secuencia de flotantes

source: Number of days. The fraction part represents hours, minutes, seconds.
es_es: Número de días. La parte de la fracción representa horas, minutos, segundos.

source: `datetime.timedelta` or list[`datetime.timedelta`]
es_es: `datetime.timedelta` o lista[`datetime.timedelta`]

source: The relativedelta type is designed to be applied to an existing datetime and can replace specific components of that datetime, or represents an interval of time.
es_es: El tipo relativedelta está diseñado para ser aplicado a una fecha actual y puede reemplazar componentes específicos de esa fecha, o representa un intervalo de tiempo.

source: It is based on the specification of the excellent work done by M.-A. Lemburg in his `mx.DateTime <https://www.egenix.com/products/python/mxBase/mxDateTime/>`_ extension. However, notice that this type does *NOT* implement the same algorithm as his work. Do *NOT* expect it to behave like mx.DateTime's counterpart.
es_es: Se basa en la especificación del excelente trabajo realizado por M.-A. Lemburg en su extensión `mx.DateTime <https://www.egenix.com/products/python/mxBase/mxDateTime/>`_. Sin embargo, ten en cuenta que este tipo *NOT* implementa el mismo algoritmo que su trabajo. *NOT* espera que se comporte como la contraparte de mx.DateTime.

source: There are two different ways to build a relativedelta instance. The first one is passing it two date/datetime classes::
es_es: Hay dos maneras diferentes de construir una instancia relativedelta. La primera es pasar dos clases fecha/fecha::

source: The second one is passing it any number of the following keyword arguments::
es_es: La segunda es pasar cualquier número de los siguientes argumentos de palabra clave::

source: There are relative and absolute forms of the keyword arguments. The plural is relative, and the singular is absolute. For each argument in the order below, the absolute form is applied first (by setting each attribute to that value) and then the relative form (by adding the value to the attribute).
es_es: Hay formas relativas y absolutas de los argumentos de palabras clave, el plural es relativo, y el singular es absoluto. Para cada argumento en el orden de abajo, el formulario absoluto se aplica primero (estableciendo cada atributo a ese valor) y luego el formulario relativo (añadiendo el valor al atributo).

source: The order of attributes considered when this relativedelta is added to a datetime is:
es_es: El orden de los atributos considerados cuando se agrega este relativedelta a una fecha es:

source: Year
es_es: Año

source: Month
es_es: Mes

source: Day
es_es: Día

source: Hours
es_es: Horas

source: Minutes
es_es: Minutos

source: Seconds
es_es: Segundos

source: Microseconds
es_es: Microsegundos

source: Finally, weekday is applied, using the rule described above.
es_es: Finalmente, el día de la semana se aplica, utilizando la regla descrita anteriormente.

source: For example
es_es: Por ejemplo

source: First, the day is set to 1 (the first of the month), then 25 hours are added, to get to the 2nd day and 14th hour, finally the weekday is applied, but since the 2nd is already a Monday there is no effect.
es_es: Primero, el día está fijado en 1 (el primero del mes), entonces se añaden 25 horas para llegar al segundo día y a la 14ª hora, finalmente el día de la semana se aplica, pero dado que el segundo es ya un lunes no hay ningún efecto.

source: Return a version of this object represented entirely using integer values for the relative attributes.
es_es: Devuelve una versión de este objeto representada enteramente usando valores enteros para los atributos relativos.

source: Returns a :class:`dateutil.relativedelta.relativedelta` object.
es_es: Devuelve un objeto :class:`dateutil.relativedelta.relativedelta`.

source: That's the base of the rrule operation. It accepts all the keywords defined in the RFC as its constructor parameters (except byday, which was renamed to byweekday) and more. The constructor prototype is::
es_es: Esa es la base de la operación de reglas. Acepta todas las palabras clave definidas en el RFC como sus parámetros de constructor (excepto por día, que fue renombrado por semana) y más. El prototipo del constructor es::

source: Where freq must be one of YEARLY, MONTHLY, WEEKLY, DAILY, HOURLY, MINUTELY, or SECONDLY.
es_es: Donde freq debe ser uno de AÑO, MONTHLY, WEEKLY, DAILY, HOURLY, MINUTELY, or SECONDLY.

source: Per RFC section 3.3.10, recurrence instances falling on invalid dates and times are ignored rather than coerced:
es_es: Por sección 3.3.10 RFC, las instancias de repetición que caen en fechas y horas no válidas son ignoradas en lugar de ser forzadas:

source: Recurrence rules may generate recurrence instances with an invalid date (e.g., February 30) or nonexistent local time (e.g., 1:30 AM on a day where the local time is moved forward by an hour at 1:00 AM). Such recurrence instances MUST be ignored and MUST NOT be counted as part of the recurrence set.
es_es: Las reglas de recurrencia pueden generar instancias de repetición con una fecha no válida (por ejemplo, el 30 de febrero) o una hora local no existente (p. ej. 1:30 AM en un día en el que la hora local se mueve hacia adelante una hora a las 1:00 AM). Tales instancias de repetición DEBEN ser ignoradas y NO DEBE ser contadas como parte del conjunto de repeticiones.

source: This can lead to possibly surprising behavior when, for example, the start date occurs at the end of the month:
es_es: Esto puede llevar a un comportamiento posiblemente sorprendente cuando, por ejemplo, la fecha de inicio ocurre al final del mes:

source: Additionally, it supports the following keyword arguments:
es_es: Además, soporta los siguientes argumentos de palabra clave:

source: The recurrence start. Besides being the base for the recurrence, missing parameters in the final recurrence instances will also be extracted from this date. If not given, datetime.now() will be used instead.
es_es: Además de ser la base de la recurrencia, los parámetros faltantes en las instancias finales de recurrencia también se extraerán de esta fecha. Si no se proporciona, datetime.now() se usará en su lugar.

source: The interval between each freq iteration. For example, when using YEARLY, an interval of 2 means once every two years, but with HOURLY, it means once every two hours. The default interval is 1.
es_es: El intervalo entre cada iteración freq. Por ejemplo, al usar AÑO, un intervalo de 2 significa una vez cada dos años, pero con HORLY, significa una vez cada dos horas. El intervalo por defecto es 1.

source: The week start day. Must be one of the MO, TU, WE constants, or an integer, specifying the first day of the week. This will affect recurrences based on weekly periods. The default week start is got from calendar.firstweekday(), and may be modified by calendar.setfirstweekday().
es_es: El día de inicio de la semana. Debe ser una de las constantes de MO, UT, WE o un entero, especificando el primer día de la semana. Esto afectará a las recurrencias basadas en periodos semanales. El inicio por defecto de la semana se obtiene de calendar.firstweekday(), y puede ser modificado por calendar.setfirstweekday().

source: If given, this determines how many occurrences will be generated. .. note:: As of version 2.5.0, the use of the keyword ``until`` in conjunction with ``count`` is deprecated, to make sure ``dateutil`` is fully compliant with `RFC-5545 Sec. 3.3.10 <https://tools.ietf.org/ html/rfc5545#section-3.3.10>`_. Therefore, ``until`` and ``count`` **must not** occur in the same call to ``rrule``.
es_es: Si se proporciona, esto determina cuántas ocurrencias se generarán. .. nota:: A partir de la versión 2.5. , el uso de la palabra clave ``until`` junto con ``count`` está obsoleto, para asegurarse de que ``dateutil`` es totalmente compatible con `RFC-5545 Sec. 3.3.10 <https://tools.ietf.org/ html/rfc5545#section-3.3.10>`_. Por lo tanto, ``until`` y ``count`` **no** deben ocurrir en la misma llamada a ``rrule``.

source: If given, this determines how many occurrences will be generated.
es_es: Si se proporciona, esto determina cuántas ocurrencias se generarán.

source: As of version 2.5.0, the use of the keyword ``until`` in conjunction with ``count`` is deprecated, to make sure ``dateutil`` is fully compliant with `RFC-5545 Sec. 3.3.10 <https://tools.ietf.org/ html/rfc5545#section-3.3.10>`_. Therefore, ``until`` and ``count`` **must not** occur in the same call to ``rrule``.
es_es: A partir de la versión 2.5. , el uso de la palabra clave ``until`` junto con ``count`` está obsoleto, para asegurarse de que ``dateutil`` es totalmente compatible con `RFC-5545 Sec. 3.3.10 <https://tools.ietf.org/ html/rfc5545#section-3.3.10>`_. Por lo tanto, ``until`` y ``count`` **no** deben ocurrir en la misma llamada a ``rrule``.

source: If given, this must be a datetime instance specifying the upper-bound limit of the recurrence. The last recurrence in the rule is the greatest datetime that is less than or equal to the value specified in the ``until`` parameter. .. note:: As of version 2.5.0, the use of the keyword ``until`` in conjunction with ``count`` is deprecated, to make sure ``dateutil`` is fully compliant with `RFC-5545 Sec. 3.3.10 <https://tools.ietf.org/ html/rfc5545#section-3.3.10>`_. Therefore, ``until`` and ``count`` **must not** occur in the same call to ``rrule``.
es_es: Si se proporciona, debe ser una instancia de fecha que especifique el límite máximo de la recurrencia. La última repetición en la regla es la fecha más grande que es menor o igual al valor especificado en el parámetro ``hasta``. .. nota:: A partir de la versión 2.5. , el uso de la palabra clave ``until`` junto con ``count`` está obsoleto, para asegurarse de que ``dateutil`` es totalmente compatible con `RFC-5545 Sec. 3.3.10 <https://tools.ietf.org/ html/rfc5545#section-3.3.10>`_. Por lo tanto, ``until`` y ``count`` **no** deben ocurrir en la misma llamada a ``rrule``.

source: If given, this must be a datetime instance specifying the upper-bound limit of the recurrence. The last recurrence in the rule is the greatest datetime that is less than or equal to the value specified in the ``until`` parameter.
es_es: Si se proporciona, debe ser una instancia de fecha que especifique el límite máximo de la recurrencia. La última repetición en la regla es la fecha más grande que es menor o igual al valor especificado en el parámetro ``hasta``.

source: If given, it must be either an integer, or a sequence of integers, positive or negative. Each given integer will specify an occurrence number, corresponding to the nth occurrence of the rule inside the frequency period. For example, a bysetpos of -1 if combined with a MONTHLY frequency, and a byweekday of (MO, TU, WE, TH, FR), will result in the last work day of every month.
es_es: Si se proporciona, debe ser un entero, o una secuencia de enteros, positivo o negativo. Cada entero especificado especificará un número de ocurrencia, correspondiente a la novena ocurrencia de la regla dentro del período de frecuencia. Por ejemplo, un bysetpos de -1 si se combina con una frecuencia MONTHLY, y un día por semana de (MO, UT, WE, TH, FR), resultará en el último día laboral de cada mes.

source: If given, it must be either an integer, or a sequence of integers, meaning the months to apply the recurrence to.
es_es: Si se proporciona, debe ser un entero, o una secuencia de enteros, lo que significa que los meses a los que aplicar la recurrencia a.

source: If given, it must be either an integer, or a sequence of integers, meaning the month days to apply the recurrence to.
es_es: Si se proporciona, debe ser un entero, o una secuencia de enteros, lo que significa que los días de mes a los que aplicar la recurrencia.

source: If given, it must be either an integer, or a sequence of integers, meaning the year days to apply the recurrence to.
es_es: Si se proporciona, debe ser un entero, o una secuencia de enteros, lo que significa que los días de año a los que aplicar la recurrencia.

source: If given, it must be either an integer, or a sequence of integers, positive or negative. Each integer will define an offset from the Easter Sunday. Passing the offset 0 to byeaster will yield the Easter Sunday itself. This is an extension to the RFC specification.
es_es: Si se proporciona, debe ser un entero, o una secuencia de enteros, positivo o negativo. Cada entero definirá un desplazamiento del domingo de Pascua. Pasar el offset 0 a byeaster producirá el propio domingo de Pascua. Esta es una extensión de la especificación RFC.

source: If given, it must be either an integer, or a sequence of integers, meaning the week numbers to apply the recurrence to. Week numbers have the meaning described in ISO8601, that is, the first week of the year is that containing at least four days of the new year.
es_es: Si se proporciona, debe ser un entero, o una secuencia de enteros, lo que significa que los números de semana a los que aplicar la recurrencia. Los números de semana tienen el significado descrito en ISO8601, es decir, la primera semana del año es la que contiene al menos cuatro días del año nuevo.
