Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/dates_api.po
Languages: es_es

source: If given, it must be either an integer (0 == MO), a sequence of integers, one of the weekday constants (MO, TU, etc), or a sequence of these constants. When given, these variables will define the weekdays where the recurrence will be applied. It's also possible to use an argument n for the weekday instances, which will mean the nth occurrence of this weekday in the period. For example, with MONTHLY, or with YEARLY and BYMONTH, using FR(+1) in byweekday will specify the first friday of the month where the recurrence happens. Notice that in the RFC documentation, this is specified as BYDAY, but was renamed to avoid the ambiguity of that keyword.
es_es: Si se proporciona, debe ser un entero (0 == MO), una secuencia de enteros, una de las constantes del día de la semana (MO, UT, etc), o una secuencia de estas constantes. Cuando se proporciona, estas variables definirán los días de semana donde se aplicará la recurrencia. También es posible usar un argumento n para las instancias del día de semana, lo que significará la novena ocurrencia de este día de semana en el período. Por ejemplo, con MONTHLY, o con AÑO y MONTE, usando FR(+1) en el día de la semana especificará el primer viernes del mes en que ocurra la recurrencia. Tenga en cuenta que en la documentación RFC, esto se especifica como BYDAY, pero fue renombrado para evitar la ambigüedad de esa palabra clave.

source: If given, it must be either an integer, or a sequence of integers, meaning the hours to apply the recurrence to.
es_es: Si se proporciona, debe ser un entero, o una secuencia de enteros, lo que significa las horas a las que aplicar la recurrencia.

source: If given, it must be either an integer, or a sequence of integers, meaning the minutes to apply the recurrence to.
es_es: Si se proporciona, debe ser un entero, o una secuencia de enteros, lo que significa que los minutos a los que aplicar la recurrencia a.

source: If given, it must be either an integer, or a sequence of integers, meaning the seconds to apply the recurrence to.
es_es: Si se proporciona, debe ser un entero, o una secuencia de enteros, lo que significa los segundos a los que aplicar la recurrencia.

source: If given, it must be a boolean value specifying to enable or disable caching of results. If you will use the same rrule instance multiple times, enabling caching will improve the performance considerably.
es_es: Si se proporciona, debe ser un valor booleano que especifique para activar o desactivar la caché de resultados. Si usará la misma instancia de rrule varias veces, habilitar la caché mejorará el rendimiento considerablemente.

source: Return new rrule with same attributes except for those attributes given new values by whichever keyword arguments are specified.
es_es: Devuelve una nueva regla con los mismos atributos, excepto aquellos atributos dados nuevos valores por los que se especifiquen los argumentos de palabras clave.

source: The default epoch is :rc:`dates.epoch` (by default 1970-01-01T00:00).
es_es: El epoch por defecto es :rc:`dates.epoch` (por defecto 1970-01-01T00:00).

source: If microsecond accuracy is desired, the date being plotted needs to be within approximately 70 years of the epoch. Matplotlib internally represents dates as days since the epoch, so floating point dynamic range needs to be within a factor of 2^52.
es_es: Si se desea una precisión de microsegundos, la fecha que se está trazando debe estar dentro de aproximadamente 70 años a partir de la epoque. Matplotlib representa internamente las fechas como días desde el epoch, por lo que el rango dinámico de punto flotante tiene que estar dentro de un factor de 2^52.

source: `~.dates.set_epoch` must be called before any dates are converted (i.e. near the import section) or a RuntimeError will be raised.
es_es: `~.dates.set_epoch` debe ser llamado antes de que cualquier fecha sea convertida (es decir, cerca de la sección de importación) o se levantará un RuntimeError.

source: See also :doc:`/gallery/ticks/date_precision_and_epochs`.
es_es: Vea también :doc:`/gallery/ticks/date_precision_and_epochs`.

source: valid UTC date parsable by `numpy.datetime64` (do not include timezone).
es_es: fecha UTC válida analizable por `numpy.datetime64` (no incluya zona horaria).
