Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/dviread.po
Languages: es_es

source: A module for reading dvi files output by TeX. Several limitations make this not (currently) useful as a general-purpose dvi preprocessor, but it is currently used by the pdf backend for processing usetex text.
es_es: Un módulo para leer la salida de archivos dvi por TeX. Varias limitaciones hacen que esto no sea (actualmente) útil como preprocesador dvi de propósito general, pero actualmente es usado por el backend pdf para procesar el texto usetex.

source: Interface::
es_es: Interfaz::

source: A reader for a dvi ("device-independent") file, as produced by TeX.
es_es: Un lector para un archivo dvi ("device-independent") producido por TeX.

source: The current implementation can only iterate through pages in order, and does not even attempt to verify the postamble.
es_es: La implementación actual sólo puede iterar a través de páginas en orden, y ni siquiera intenta verificar el postamble.

source: This class can be used as a context manager to close the underlying file upon exit. Pages can be read via iteration. Here is an overly simple way to extract text without trying to detect whitespace::
es_es: Esta clase puede ser usada como un gestor de contexto para cerrar el archivo subyacente al salir. Las páginas se pueden leer mediante iteración. Esta es una forma demasiado sencilla de extraer texto sin intentar detectar espacios en blanco::

source: Read the data from the file named *filename* and convert TeX's internal units to units of *dpi* per inch. *dpi* only sets the units and does not limit the resolution. Use None to return TeX's internal units.
es_es: Lee los datos del archivo llamado *filename* y convierte las unidades internas de TeX en unidades de *dpi* por pulgada. *dpi* sólo establece las unidades y no limita la resolución. Use ninguno para devolver las unidades internas de TeX.

source: Close the underlying file if it is open.
es_es: Cerrar el archivo subyacente si está abierto.

source: Encapsulation of a font that a DVI file can refer to.
es_es: Capsulación de una fuente a la que un archivo DVI puede referirse.

source: This class holds a font's texname and size, supports comparison, and knows the widths of glyphs in the same units as the AFM file. There are also internal attributes (for use by dviread.py) that are *not* used for comparison.
es_es: Esta clase contiene el nombre de texto y el tamaño de una fuente, soporta la comparación y conoce los anchos de los glifos en las mismas unidades que el archivo AFM. También hay atributos internos (para el uso de dviread.py) que *no* son utilizados para la comparación.

source: The size is in Adobe points (converted from TeX points).
es_es: El tamaño es en puntos de Adobe (convertidos a partir de puntos TeX).

source: Parameters
es_es: Parámetros

source: **scale**
es_es: **escala**

source: Factor by which the font is scaled from its natural size.
es_es: Factor por el cual la fuente es escalada de su tamaño natural.

source: TeX font metrics for this font
es_es: Métricas de fuente TeX para esta fuente

source: Name of the font as used internally by TeX and friends, as an ASCII bytestring. This is usually very different from any external font names; `PsfontsMap` can be used to find the external name of the font.
es_es: Nombre de la fuente usada internamente por TeX y amigos, como un bytestring ASCII. Normalmente esto es muy diferente de cualquier nombre de fuente externa; `PsfontsMap` se puede utilizar para encontrar el nombre externo de la fuente.

source: A TeX "virtual font" file, or None if this font is not virtual.
es_es: Un archivo "fuente virtual" de TeX, o Ninguno si esta fuente no es virtual.

source: Attributes
es_es: Atributos

source: Size of the font in Adobe points, converted from the slightly smaller TeX points.
es_es: Tamaño de la fuente en puntos de Adobe, convertida a partir de los puntos TeX ligeramente más pequeños.

source: list
es_es: lista

source: Widths of glyphs in glyph-space units, typically 1/1000ths of the point size.
es_es: Anchura de los glifos en las unidades de espacio de glifos, típicamente 1/1000th del tamaño del punto.

source: Create new instance of PsFont(texname, psname, effects, encoding, filename)
es_es: Crear nueva instancia de PsFont(nombre de texto, psname, efectos, codificación, nombre de archivo)

source: Alias for field number 2
es_es: Alias para el campo número 2

source: Alias for field number 3
es_es: Alias para el campo número 3

source: Alias for field number 4
es_es: Alias para el campo número 4

source: Alias for field number 1
es_es: Alias para el campo número 1

source: Alias for field number 0
es_es: Alias para el número de campo 0

source: A psfonts.map formatted file, mapping TeX fonts to PS fonts.
es_es: Un archivo con formato psfonts.map, mapeando fuentes TeX a fuentes PS.

source: **filename**
es_es: **nombre de archivo**

source: str or path-like
es_es: str o como ruta

source: For historical reasons, TeX knows many Type-1 fonts by different names than the outside world. (For one thing, the names have to fit in eight characters.) Also, TeX's native fonts are not Type-1 but Metafont, which is nontrivial to convert to PostScript except as a bitmap. While high-quality conversions to Type-1 format exist and are shipped with modern TeX distributions, we need to know which Type-1 fonts are the counterparts of which native fonts. For these reasons a mapping is needed from internal font names to font file names.
es_es: Por razones históricas, TeX conoce muchas fuentes Type-1 por diferentes nombres que el mundo exterior. (Para empezar, los nombres tienen que encajar en ocho caracteres. Además, las fuentes nativas de TeX no son Type-1 sino Metafont, que no es trivial para convertir a PostScript excepto como un mapa de bits. Mientras que las conversiones de alta calidad al formato Type-1 existen y se envían con distribuciones modernas de TeX, necesitamos saber qué fuentes Type-1 son las contrapartes de las cuales fuentes nativas. Por estas razones se necesita un mapeo de nombres de fuentes internos a nombres de archivos.

source: A texmf tree typically includes mapping files called e.g. :file:`psfonts.map`, :file:`pdftex.map`, or :file:`dvipdfm.map`. The file :file:`psfonts.map` is used by :program:`dvips`, :file:`pdftex.map` by :program:`pdfTeX`, and :file:`dvipdfm.map` by :program:`dvipdfm`. :file:`psfonts.map` might avoid embedding the 35 PostScript fonts (i.e., have no filename for them, as in the Times-Bold example above), while the pdf-related files perhaps only avoid the "Base 14" pdf fonts. But the user may have configured these files differently.
es_es: Un árbol texmf normalmente incluye archivos de mapeo llamados por ejemplo :file:`psfonts.map`, :file:`pdftex.map`, o :file:`dvipdfm.map`. El archivo :file:`psfonts.map` es usado por :program:`dvips`, :file:`pdftex. ap` por :program:`pdfTeX`, y :file:`dvipdfm.map` por :program:`dvipdfm`. :file:`psfonts.map` podría evitar incrustar las 35 fuentes PostScript (i.e. no tienen nombre de archivo para ellos, como en el ejemplo Times-Bold de arriba), mientras que los archivos relacionados con pdf tal vez sólo eviten las fuentes pdf "Base 14". Pero el usuario puede haber configurado estos archivos de forma diferente.

source: Examples
es_es: Ejemplos

source: A TeX Font Metric file.
es_es: Un archivo métrico de fuente TeX.

source: This implementation covers only the bare minimum needed by the Dvi class.
es_es: Esta implementación sólo cubre el mínimo necesario para la clase Dvii.

source: **checksum**
es_es: **suma de comprobación**

source: Used for verifying against the dvi file.
es_es: Utilizado para verificar contra el archivo dvi.

source: **design_size**
es_es: **tamaño_diseño**

source: Design size of the font (unknown units)
es_es: Tamaño del diseño de la fuente (unidades desconocidas)

source: **width, height, depth**
es_es: **anchura, altura, profundidad**

source: Dimensions of each character, need to be scaled by the factor specified in the dvi file. These are dicts because indexing may not start from 0.
es_es: Las dimensiones de cada carácter, deben ser escaladas por el factor especificado en el archivo dvi. Estas son sentencias porque la indexación no puede comenzar a partir de 0.

source: A virtual font (\*.vf file) containing subroutines for dvi files.
es_es: Una fuente virtual (archivo \*.vf) que contiene subrutinas para archivos dvi.

source: The virtual font format is a derivative of dvi: http://mirrors.ctan.org/info/knuth/virtual-fonts This class reuses some of the machinery of `Dvi` but replaces the `_read` loop and dispatch mechanism.
es_es: El formato de fuente virtual es un derivado de dvi: http://mirrors.ctan. rg/info/knuth/virtual-fonts Esta clase reutiliza parte de la maquinaria de `Dvi` pero reemplaza el bucle `_read` y el mecanismo de despacho.

source: Find a file in the texmf tree.
es_es: Encuentra un archivo en el árbol texmf.

source: Calls :program:`kpsewhich` which is an interface to the kpathsea library [Ra043a4f19cd5-1]_. Most existing TeX distributions on Unix-like systems use kpathsea. It is also available as part of MikTeX, a popular distribution on Windows.
es_es: Llama a :program:`kpsewhich` que es una interfaz a la librería kpathsea [Ra043a4f19cd5-1]_. La mayoría de las distribuciones TeX existentes en sistemas similares a Unix usan kpathsea. También está disponible como parte de MikTeX, una distribución popular en Windows.

source: *If the file is not found, an empty string is returned*.
es_es: *Si el archivo no se encuentra, se retorna una cadena vacía*.

source: **format**
es_es: **formato**

source: str or bytes
es_es: str o bytes

source: Used as the value of the ``--format`` option to :program:`kpsewhich`. Could be e.g. 'tfm' or 'vf' to limit the search to that type of files. Deprecated.
es_es: Utilizado como el valor de la opción ``--format`` a :program:`kpsewhich`. Podría ser e. . 'tfm' o 'vf' para limitar la búsqueda a ese tipo de archivos.

source: References
es_es: Referencias

source: `Kpathsea documentation <http://www.tug.org/kpathsea/>`_ The library that :program:`kpsewhich` is part of.
es_es: `Kpathsea documentation <http://www.tug.org/kpathsea/>`_ La biblioteca de la que :program:`kpsewhich` es parte.
