Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/figure_api.po
Languages: es_es

source: `matplotlib.figure` implements the following classes:
es_es: `matplotlib.figure` implementa las siguientes clases:

source: Top level `~matplotlib.artist.Artist`, which holds all plot elements. Many methods are implemented in `FigureBase`.
es_es: Nivel superior `~matplotlib.artist.Artist`, que contiene todos los elementos de la plot. Muchos métodos se implementan en `FigureBase`.

source: `SubFigure`
es_es: `Subfigura`

source: A logical figure inside a figure, usually added to a figure (or parent `SubFigure`) with `Figure.add_subfigure` or `Figure.subfigures` methods (provisional API v3.4).
es_es: Una figura lógica dentro de una figura, habitualmente añadida a una figura (o a `SubFigure`) con los métodos `Figure.add_subfigure` o `Figure.subfigures` (API provisional v3.4).

source: Control the default spacing between subplots.
es_es: Controla el espaciado por defecto entre subparcelas.

source: The top level container for all the plot elements.
es_es: El contenedor de nivel superior para todos los elementos de la parcela.

source: The Figure instance supports callbacks through a *callbacks* attribute which is a `.CallbackRegistry` instance. The events you can connect to are 'dpi_changed', and the callback will be called with ``func(fig)`` where fig is the `Figure` instance.
es_es: La instancia de Figure soporta callbacks a través de un atributo *callbacks* que es una instancia de `.CallbackRegistry`. Los eventos a los que puedes conectar son 'dpi_changed', y el callback será llamado con ``func(fig)`` donde fig es la instancia de `Figure`.

source: Attributes
es_es: Atributos

source: **patch**
es_es: **parche**

source: The `.Rectangle` instance representing the figure background patch.
es_es: La instancia `.Rectangle` que representa el parche de fondo de la figura.

source: **suppressComposite**
es_es: **SupressComposite**

source: For multiple images, the figure will make composite images depending on the renderer option_image_nocomposite function. If *suppressComposite* is a boolean, this will override the renderer.
es_es: Para múltiples imágenes, la figura hará imágenes compuestas dependiendo de la función renderer option_image_nocomposite. Si *suppressComposite* es un valor booleano, esto anulará el renderizador.

source: Parameters
es_es: Parámetros

source: **figsize** : 2-tuple of floats, default: :rc:`figure.figsize`
es_es: **tamaño de figura** : 2 tuplas de floats, por defecto: :rc:`figure.figsize`

source: 2-tuple of floats, default:
es_es: 2-tuple de flotantes, por defecto:

source: Figure dimension ``(width, height)`` in inches.
es_es: Dimensión de la figura ``(anchura, altura)`` en pulgadas.

source: **dpi** : float, default: :rc:`figure.dpi`
es_es: **dpi** : float, por defecto: :rc:`figure.dpi`

source: float, default:
es_es: flotante, por defecto:

source: Dots per inch.
es_es: Puntos por pulgada.

source: **facecolor** : default: :rc:`figure.facecolor`
es_es: **facecolor** : por defecto: :rc:`figure.facecolor`

source: default:
es_es: por defecto:

source: The figure patch facecolor.
es_es: El parche de figura facecolor.

source: The figure patch edge color.
es_es: El color del parche de figura.

source: float
es_es: de punto flotante (float)

source: The linewidth of the frame (i.e. the edge linewidth of the figure patch).
es_es: El ancho de línea del marco (es decir, el ancho de línea del parche de figura).

source: **frameon** : bool, default: :rc:`figure.frameon`
es_es: **frameon** : bool, por defecto: :rc:`figure.frameon`

source: If ``False``, suppress drawing the figure background patch.
es_es: Si es ``False``, reprime el dibujo del parche de fondo de la figura.

source: Subplot parameters. If not given, the default subplot parameters :rc:`figure.subplot.*` are used.
es_es: Parámetros de subplot. Si no se proporcionan, se utilizan los parámetros de subplot :rc:`figure.subplot.*`.

source: **tight_layout** : bool or dict, default: :rc:`figure.autolayout`
es_es: **tight_layout** : bool o dict, por defecto: :rc:`figure.autolayout`

source: bool or dict, default:
es_es: libro o diccionario, por defecto:

source: Whether to use the tight layout mechanism. See `.set_tight_layout`.
es_es: Si usar el mecanismo de diseño apretado. Vea `.set_tight_layout`.

source: Discouraged
es_es: Desanimado

source: The use of this parameter is discouraged. Please use ``layout='tight'`` instead for the common case of ``tight_layout=True`` and use `.set_tight_layout` otherwise.
es_es: El uso de este parámetro no es recomendado. Por favor, use ``layout='tight'`` en su lugar para el caso común de ``tight_layout=True`` y use `.set_tight_layout` de otro modo.

source: This is equal to ``layout='constrained'``.
es_es: Esto es igual a ``layout='restringido'``.

source: The use of this parameter is discouraged. Please use ``layout='constrained'`` instead.
es_es: El uso de este parámetro está desaconsejado. Por favor use ``layout='restringido'`` en su lugar.

source: **layout**
es_es: **diseño**

source: {'constrained', 'tight'}, optional
es_es: {'constrained', 'tight'}, opcional

source: The layout mechanism for positioning of plot elements. Supported values:
es_es: Mecanismo de distribución para posicionar los elementos de la gráfica. Valores soportados:

source: 'constrained': The constrained layout solver usually gives the best layout results and is thus recommended. However, it is computationally expensive and can be slow for complex figures with many elements.
es_es: 'restringido': El solucionador de diseño restringido normalmente da los mejores resultados de diseño y por lo tanto se recomienda. Sin embargo, es computacionalmente caro y puede ser lento para figuras complejas con muchos elementos.

source: See :doc:`/tutorials/intermediate/constrainedlayout_guide` for examples.
es_es: Vea :doc:`/tutorials/intermediate/constrainedlayout_guide` para ver ejemplos.

source: 'tight': Use the tight layout mechanism. This is a relatively simple algorithm, that adjusts the subplot parameters so that decorations like tick labels, axis labels and titles have enough space. See `.Figure.set_tight_layout` for further details.
es_es: 'tight': Utilice el mecanismo de diseño apretado. Este es un algoritmo relativamente simple, que ajusta los parámetros de la subparcela, de modo que las decoraciones como etiquetas de tick, etiquetas de ejes y títulos tienen suficiente espacio. Vea `.Figure.set_tight_layout` para más detalles.

source: If not given, fall back to using the parameters *tight_layout* and *constrained_layout*, including their config defaults :rc:`figure.autolayout` and :rc:`figure.constrained_layout.use`.
es_es: Si no se proporciona, vuelve a usar los parámetros *tight_layout* y *constrained_layout*, incluyendo su configuración predeterminada :rc:`figure.autolayout` y :rc:`figure.constrained_layout.use`.

source: Other Parameters
es_es: Otros Parámetros

source: **\*\*kwargs** : `.Figure` properties, optional
es_es: **\*\*kwargs** : propiedades `.Figure`, opcional

source: Figure properties, optional
es_es: Propiedades de la Figura, opcional

source: Property
es_es: Propiedad

source: Description
es_es: Descripción

source: a filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array
es_es: una función de filtro, que toma un arreglo de puntos flotantes (m, n, 3) y un valor de dpi, y devuelve un arreglo (m, n, 3)

source: scalar or None
es_es: escalar o None

source: :meth:`canvas <matplotlib.figure.Figure.set_canvas>`
es_es: :meth:`lienzo <matplotlib.figure.Figure.set_canvas>`

source: FigureCanvas
es_es: Lienzo de figura

source: Patch or (Path, Transform) or None
es_es: Patch o (Path, Transform) o None

source: bool or dict or None
es_es: libro o dictado o ninguno

source: float, default: :rc:`figure.constrained_layout.w_pad`
es_es: float, por defecto: :rc:`figure.constrained_layout.w_pad`

source: :meth:`figheight <matplotlib.figure.Figure.set_figheight>`
es_es: :meth:`fighocho <matplotlib.figure.Figure.set_figheight>`

source: number
es_es: número

source: None or bool or float or callable
es_es: None o bool o float o callable

source: :meth:`size_inches <matplotlib.figure.Figure.set_size_inches>`
es_es: :meth:`tamaño_pulgadas <matplotlib.figure.Figure.set_size_inches>`

source: (float, float) or float
es_es: (flotante, flotante) o flotante

source: bool or dict with keys "pad", "w_pad", "h_pad", "rect" or None
es_es: libro o dictado con teclas "pad", "w_pad", "h_pad", "rect" o ninguno

source: Add an `.Artist` to the figure.
es_es: Agrega un `.Artist` a la figura.

source: Usually artists are added to Axes objects using `.Axes.add_artist`; this method can be used in the rare cases where one needs to add artists directly to the figure instead.
es_es: Normalmente los artistas se añaden a objetos de ejes usando `.Axes. dd_artist`; este método se puede utilizar en los casos raros donde se necesita añadir artistas directamente a la figura en su lugar.

source: The artist to add to the figure. If the added artist has no transform previously set, its transform will be set to ``figure.transSubfigure``.
es_es: El artista a añadir a la figura. Si el artista añadido no tiene ninguna transformación previamente establecida, su transformación se establecerá en ``figure.transSubfigure``.

source: bool, default: False
es_es: bool, por defecto: False

source: Whether the added artist should be clipped by the figure patch.
es_es: Si el artista añadido debe ser recortado por el parche de figura.

source: Returns
es_es: Devuelve

source: The added artist.
es_es: El artista añadido.

source: Add an Axes to the figure.
es_es: Agrega un ejes a la figura.

source: Call signatures::
es_es: Firma de llamadas::

source: sequence of float
es_es: secuencia de decimales

source: The dimensions [left, bottom, width, height] of the new Axes. All quantities are in fractions of figure width and height.
es_es: Las dimensiones [izquierda, inferior, anchura, altura] de los nuevos ejes. Todas las cantidades son en fracciones de anchura y altura de la figura.

source: **projection**
es_es: **proyección**

source: {None, 'aitoff', 'hammer', 'lambert', 'mollweide', 'polar', 'rectilinear', str}, optional
es_es: {None, 'aitoff', 'martillo', 'lambert', 'mollweide', 'polar', 'rectilinear', str}, opcional

source: The projection type of the `~.axes.Axes`. *str* is the name of a custom projection, see `~matplotlib.projections`. The default None results in a 'rectilinear' projection.
es_es: El tipo de proyección del `~.axes.Axes`. *str* es el nombre de una proyección personalizada, vea `~matplotlib.projections`. El valor predeterminado Ninguno da como resultado una proyección 'rectilinear'.

source: If True, equivalent to projection='polar'.
es_es: Si es verdadero, equivalente a la proyección='polar'.

source: **axes_class** : subclass type of `~.axes.Axes`, optional
es_es: **axes_class** : tipo de subclase de `~.axes.Axes`, opcional

source: subclass type of
es_es: tipo de subclase de

source: The `.axes.Axes` subclass that is instantiated. This parameter is incompatible with *projection* and *polar*. See :ref:`axisartist_users-guide-index` for examples.
es_es: La subclase `.axes.Axes` que está instanciada. Este parámetro es incompatible con *proyección* y *polar*. Vea :ref:`axisartist_users-guide-index` para ver ejemplos.

source: **sharex, sharey** : `~.axes.Axes`, optional
es_es: **sharex, compartir** : `~.axes.Axes`, opcional

source: Axes, optional
es_es: Ejes, opcional

source: Share the x or y `~matplotlib.axis` with sharex and/or sharey. The axis will have the same limits, ticks, and scale as the axis of the shared axes.
es_es: Comparte el x o y `~matplotlib.axis` con sharex y/o sharey. El eje tendrá los mismos límites, ticks y escala que el eje de los ejes compartidos.

source: **label**
es_es: **etiqueta**

source: A label for the returned Axes.
es_es: Una etiqueta para los ejes devueltos.

source: `~.axes.Axes`, or a subclass of `~.axes.Axes`
es_es: `~.axes.Axes`, o una subclase de `~.axes.Axes`

source: The returned axes class depends on the projection used. It is `~.axes.Axes` if rectilinear projection is used and `.projections.polar.PolarAxes` if polar projection is used.
es_es: La clase de ejes devueltos depende de la proyección utilizada. Es `~.axes.Axes` si se utiliza proyección rectilineal y `.projections.polar.PolarAxes` si se utiliza proyección polar.

source: This method also takes the keyword arguments for the returned Axes class. The keyword arguments for the rectilinear Axes class `~.axes.Axes` can be found in the following table but there might also be other keyword arguments if another projection is used, see the actual Axes class.
es_es: Este método también toma los argumentos de palabra clave para la clase devuelta Axes. Los argumentos de palabra clave para la clase Axes rectilinear `~.axes. xes` se puede encontrar en la siguiente tabla, pero también puede haber otros argumentos de palabra clave si se utiliza otra proyección ver la clase Axes real.

source: (float, float) or {'C', 'SW', 'S', 'SE', 'E', 'NE', ...}
es_es: (float, float) o {'C', 'SW', 'S', 'SE', 'E', 'NE', ...}

source: float or None
es_es: float o None

source: :meth:`facecolor <matplotlib.axes.Axes.set_facecolor>` or fc
es_es: :meth:`facecolor <matplotlib.axes.Axes.set_facecolor>` o fc

source: unknown
es_es: desconocido

source: [left, bottom, width, height] or `~matplotlib.transforms.Bbox`
es_es: [left, bottom, width, height] o `~matplotlib.transforms.Bbox`

source: float greater than -0.5
es_es: float mayor que -0,5

source: {"linear", "log", "symlog", "logit", ...} or `.ScaleBase`
es_es: {"linear", "log", "symlog", "logit", ...} o `.ScaleBase`

source: In rare circumstances, `.add_axes` may be called with a single argument, an Axes instance already created in the present figure but not in the figure's list of Axes.
es_es: En raras circunstancias, `. dd_axes` puede llamarse con un solo argumento, una instancia de ejes ya creada en la figura actual pero no en la lista de ejes de la figura.

source: Examples
es_es: Ejemplos

source: Some simple examples::
es_es: Algunos ejemplos simples::

source: Whenever the Axes state change, ``func(self)`` will be called.
es_es: Siempre que el estado de los ejes cambie, ``func(self)`` será llamado.

source: Add a callback function that will be called whenever one of the `.Artist`'s properties changes.
es_es: Añade una función callback que será llamada cada vez que cambie una de las propiedades de `.Artist`.

source: callable
es_es: llamable

source: The callback function. It must have the signature::
es_es: La función callback. Debe tener la firma::

source: where *artist* is the calling `.Artist`. Return values may exist but are ignored.
es_es: donde *artist* es la llamada `.Artist`. Los valores de retorno pueden existir pero son ignorados.

source: The observer id associated with the callback. This id can be used for removing the callback with `.remove_callback` later.
es_es: El id del observador asociado con el callback. Este id puede utilizarse para eliminar el callback con `.remove_callback` más adelante.

source: Return a `.GridSpec` that has this figure as a parent. This allows complex layout of Axes in the figure.
es_es: Devuelve un `.GridSpec` que tiene esta figura como padre. Esto permite una disposición compleja de ejes en la figura.

source: **nrows**
es_es: **nnfilas**

source: int, default: 1
es_es: int, por defecto: 1

source: Number of rows in grid.
es_es: Número de filas en cuadrícula.

source: **ncols**
es_es: **ncoles**

source: Number or columns in grid.
es_es: Número o columnas en la cuadrícula.

source: Keyword arguments are passed to `.GridSpec`.
es_es: Los argumentos de palabra clave se pasan a `.GridSpec`.

source: Adding a subplot that spans two rows::
es_es: Añadir una subtrama que abarca dos filas::

source: Add a `~.figure.SubFigure` to the figure as part of a subplot arrangement.
es_es: Agrega un `~.figure.SubFigure` a la figura como parte de un arreglo de subparcela.

source: Defines the region in a parent gridspec where the subfigure will be placed.
es_es: Define la región en una cuadrícula padre donde se colocará la subfigura.

source: `.figure.SubFigure`
es_es: `.figure.Subfigura`

source: Are passed to the `~.figure.SubFigure` object.
es_es: Se pasan al objeto `~.figure.SubFigure`.

source: :obj:`.Figure.subfigures`
es_es: :obj:`.Figure.subfiguras`

source: Add an `~.axes.Axes` to the figure as part of a subplot arrangement.
es_es: Agrega un `~.axes.Axes` a la figura como parte de un arreglo de subplot.

source: **\*args** : int, (int, int, *index*), or `.SubplotSpec`, default: (1, 1, 1)
es_es: **\*args** : int, (int, int, *index*), o `.SubplotSpec`, por defecto: (1, 1, 1)

source: int, (int, int,
es_es: int, (int, int, int,

source: The position of the subplot described by one of
es_es: La posición de la subparcela descrita por uno de

source: Three integers (*nrows*, *ncols*, *index*). The subplot will take the *index* position on a grid with *nrows* rows and *ncols* columns. *index* starts at 1 in the upper left corner and increases to the right. *index* can also be a two-tuple specifying the (*first*, *last*) indices (1-based, and including *last*) of the subplot, e.g., ``fig.add_subplot(3, 1, (1, 2))`` makes a subplot that spans the upper 2/3 of the figure.
es_es: Tres enteros (*nrows*, *ncols*, *índice*). El subgráfico tomará la posición de *índice* en una cuadrícula con *nrows* filas y columnas *ncols*. *índice* comienza en 1 en la esquina superior izquierda y aumenta a la derecha. *índice* también puede ser una doble tupla que especifique los (*primero*, *últimos*) índices (1 basada, e incluyendo *último*) de la subparcela, e. ., ``fig.add_subplot(3, 1, (1, 2))`` hace una subparcela que abarca la parte superior 2/3 de la figura.

source: A 3-digit integer. The digits are interpreted as if given separately as three single-digit integers, i.e. ``fig.add_subplot(235)`` is the same as ``fig.add_subplot(2, 3, 5)``. Note that this can only be used if there are no more than 9 subplots.
es_es: Un entero de 3 dígitos. Los dígitos se interpretan como si se dieran por separado como tres enteros de un solo dígito, es decir, ``fig. dd_subplot(235)`` es lo mismo que ``fig.add_subplot(2, 3, 5)``. Tenga en cuenta que esto sólo puede utilizarse si no hay más de 9 subplots.

source: In rare circumstances, `.add_subplot` may be called with a single argument, a subplot Axes instance already created in the present figure but not in the figure's list of Axes.
es_es: En raras circunstancias, `. dd_subplot` puede ser llamado con un solo argumento, una instancia de ejes subplotados ya creada en la figura actual pero no en la lista de ejes de la figura.

source: The projection type of the subplot (`~.axes.Axes`). *str* is the name of a custom projection, see `~matplotlib.projections`. The default None results in a 'rectilinear' projection.
es_es: El tipo de proyección de la subparcela (`~.axes.Axes`). *str* es el nombre de una proyección personalizada, vea `~matplotlib.projections`. El valor predeterminado Ninguno da como resultado una proyección 'rectilinear'.

source: `.axes.SubplotBase`, or another subclass of `~.axes.Axes`
es_es: `.axes.SubplotBase`, u otra subclase de `~.axes.Axes`

source: The Axes of the subplot. The returned Axes base class depends on the projection used. It is `~.axes.Axes` if rectilinear projection is used and `.projections.polar.PolarAxes` if polar projection is used. The returned Axes is then a subplot subclass of the base class.
es_es: Los ejes de la subparcela. La clase base de los ejes devueltos depende de la proyección utilizada. Es `~.axes.Axes` si se utiliza la proyección rectilineal y `. rojections.polar.PolarAxes` si se utiliza la proyección polar.

source: This method also takes the keyword arguments for the returned Axes base class; except for the *figure* argument. The keyword arguments for the rectilinear base class `~.axes.Axes` can be found in the following table but there might also be other keyword arguments if another projection is used.
es_es: Este método también toma los argumentos de palabra clave para la clase base devuelta Axes, excepto el argumento *figure*. Los argumentos de palabra clave para la clase base rectilinear `~. xes.Axes` se puede encontrar en la siguiente tabla, pero también puede haber otros argumentos de palabras clave si se utiliza otra proyección.

source: :obj:`.Figure.add_axes`
es_es: :obj:`.Figure.añadir ejes`

source: Align the xlabels and ylabels of subplots with the same subplots row or column (respectively) if label alignment is being done automatically (i.e. the label position is not manually set).
es_es: Alinear las etiquetas xlabels y las etiquetas de las subparcelas con la misma fila de subparcelas o columna (respectivamente) si la alineación de la etiqueta se hace automáticamente (i. . la posición de la etiqueta no se ha establecido manualmente).

source: Alignment persists for draw events after this is called.
es_es: La alineación persiste para los eventos de dibujo después de que esto sea llamado.

source: **axs** : list of `~matplotlib.axes.Axes`
es_es: **ejes** : lista de `~matplotlib.axes.Axes`

source: list of
es_es: lista de

source: Optional list (or ndarray) of `~matplotlib.axes.Axes` to align the labels. Default is to align all Axes on the figure.
es_es: Lista opcional (o ndarray) de `~matplotlib.axes.Axes` para alinear las etiquetas. Por defecto alinea todos los ejes en la figura.

source: Align the xlabels of subplots in the same subplot column if label alignment is being done automatically (i.e. the label position is not manually set).
es_es: Alinear las etiquetas xlabels de subplots en la misma columna de subplot si la alineación de la etiqueta se hace automáticamente (es decir, la posición de la etiqueta no se establece manualmente).

source: If a label is on the bottom, it is aligned with labels on Axes that also have their label on the bottom and that have the same bottom-most subplot row. If the label is on the top, it is aligned with labels on Axes with the same top-most row.
es_es: Si una etiqueta está en la parte inferior, está alineada con etiquetas en ejes que también tienen su etiqueta en la parte inferior y que tienen la misma fila de fondo más subparcela. Si la etiqueta está en la parte superior, está alineada con etiquetas en ejes con la misma fila más arriba.

source: Optional list of (or ndarray) `~matplotlib.axes.Axes` to align the xlabels. Default is to align all Axes on the figure.
es_es: Lista opcional de `~matplotlib.axes.Axes` (o ndarray) para alinear los xlabels. Por defecto es alinear todos los ejes en la figura.

source: This assumes that ``axs`` are from the same `.GridSpec`, so that their `.SubplotSpec` positions correspond to figure positions.
es_es: Esto asume que los ``ejes`` son del mismo `.GridSpec`, de modo que sus posiciones `.SubplotSpec` corresponden a posiciones de figura.

source: Example with rotated xtick labels::
es_es: Ejemplo con etiquetas xtick rotadas::

source: Align the ylabels of subplots in the same subplot column if label alignment is being done automatically (i.e. the label position is not manually set).
es_es: Alinear las etiquetas de subparcelas en la misma columna de subparcela si la alineación de la etiqueta se hace automáticamente (es decir, la posición de la etiqueta no se establece manualmente).
