Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/figure_api.po
Languages: es_es

source: This method is intended to be overridden by artist subclasses. As an end-user of Matplotlib you will most likely not call this method yourself.
es_es: Este método está pensado para ser sobreescrito por subclases de artista. Como usuario final de Matplotlib probablemente no llamará a este método usted mismo.

source: The default implementation converts ints and floats and arrays of ints and floats into a comma-separated string enclosed in square brackets, unless the artist has an associated colorbar, in which case scalar values are formatted using the colorbar's formatter.
es_es: La implementación por defecto convierte intes y flotantes y arrays de ints y floats en una cadena separada por comas entre corchetes, a menos que el artista tenga una barra de colores asociada, en cuyo caso los valores escalares se formatean usando el formateador de la barra de colores.

source: :obj:`get_cursor_data`
es_es: :obj:`obtener_datos_cursor`

source: Return the figure's background patch visibility, i.e. whether the figure background will be drawn. Equivalent to ``Figure.patch.get_visible()``.
es_es: Devuelve la visibilidad del parche de fondo de la figura, es decir, si el fondo de la figura será dibujado. Equivalente a ``Figure.patch.get_visible()``.

source: Get the current Axes.
es_es: Obtener los ejes actuales.

source: If there is currently no Axes on this Figure, a new one is created using `.Figure.add_subplot`. (To test whether there is currently an Axes on a Figure, check whether ``figure.axes`` is empty. To test whether there is currently a Figure on the pyplot figure stack, check whether `.pyplot.get_fignums()` is empty.)
es_es: Si actualmente no hay ejes en esta figura, se crea uno nuevo usando `.Figure.add_subplot`. (Para comprobar si actualmente hay ejes en una figura, compruebe si ``figure. xes`` está vacío. Para comprobar si hay actualmente una Figura en la pila de figuras de pyplot, compruebe si `.pyplot.get_fignums()` está vacío.)

source: The following kwargs are supported for ensuring the returned Axes adheres to the given projection etc., and for Axes creation if the active Axes does not exist:
es_es: Los siguientes kwargs son soportados para asegurar que los ejes devueltos se adhieran a la proyección dada, etc. y para creación de ejes si los ejes activos no existen:

source: Return filter function to be used for agg filter.
es_es: Devuelve la función de filtro que se utilizará para el filtro agg.

source: Return the alpha value used for blending - not supported on all backends.
es_es: Devuelve el valor alfa usado para mezclar - no soportado en todos los backends.

source: Return whether the artist is animated.
es_es: Devuelve si el artista está animado.

source: Get a list of artists contained in the figure.
es_es: Obtén una lista de artistas contenidos en la figura.

source: Return the clipbox.
es_es: Devuelve el clipbox.

source: Return whether the artist uses clipping.
es_es: Devuelve si el artist utiliza el recorte.

source: Return the clip path.
es_es: Devuelve la ruta del clip.

source: Return whether constrained layout is being used.
es_es: Devuelve si se está utilizando un diseño restringido.

source: See :doc:`/tutorials/intermediate/constrainedlayout_guide`.
es_es: Vea :doc:`/tutorials/intermediate/constrainedlayout_guide`.

source: Get padding for ``constrained_layout``.
es_es: Obtener relleno para ``constrained_layout``.

source: Returns a list of ``w_pad, h_pad`` in inches and ``wspace`` and ``hspace`` as fractions of the subplot.
es_es: Devuelve una lista de ``w_pad, h_pad`` en pulgadas y ``wspace`` y ``hspace`` como fracciones de la subparcela.

source: **relative**
es_es: **relativo**

source: If `True`, then convert from inches to figure relative.
es_es: Si `True`, entonces convertir de pulgadas a figura relativa.

source: Return the cursor data for a given event.
es_es: Devuelve los datos del cursor para un evento dado.

source: Cursor data can be used by Artists to provide additional context information for a given event. The default implementation just returns *None*.
es_es: Los datos del cursor pueden ser usados por Artistas para proporcionar información adicional de contexto para un evento determinado. La implementación por defecto sólo devuelve *Ninguno*.

source: Subclasses can override the method and return arbitrary data. However, when doing so, they must ensure that `.format_cursor_data` can convert the data to a string representation.
es_es: Las subclases pueden sobreescribir el método y devolver datos arbitrarios. Sin embargo, al hacerlo, deben asegurarse de que `. ormat_cursor_data` puede convertir los datos en una representación de cadena.

source: The only current use case is displaying the z-value of an `.AxesImage` in the status bar of a plot window, while moving the mouse.
es_es: El único caso de uso actual es mostrar el valor z-de un `.AxesImage` en la barra de estado de una ventana de parcela, mientras se mueve el ratón.

source: :obj:`format_cursor_data`
es_es: :obj:`formato_cursor_datos`

source: Return the resolution in dots per inch as a float.
es_es: Devuelve la resolución en puntos por pulgada como flotante.

source: Get the edge color of the Figure rectangle.
es_es: Obtener el color del borde del rectángulo Figura.

source: Get the face color of the Figure rectangle.
es_es: Obtener el color de la cara del rectángulo Figura.

source: Return the figure height in inches.
es_es: Devuelve la altura de la figura en pulgadas.

source: Return the `.Figure` instance the artist belongs to.
es_es: Devuelve la instancia `.Figure` a la que pertenece el artista.

source: Return the figure width in inches.
es_es: Devuelve el ancho de la figura en pulgadas.

source: Return the group id.
es_es: Devuelve el id del grupo.

source: Return boolean flag, ``True`` if artist is included in layout calculations.
es_es: Devuelve la bandera booleana, ``Verdadero`` si el artista está incluido en los cálculos del diseño.

source: E.g. :doc:`/tutorials/intermediate/constrainedlayout_guide`, `.Figure.tight_layout()`, and ``fig.savefig(fname, bbox_inches='tight')``.
es_es: Por ejemplo, :doc:`/tutorials/intermediate/constrainedlayout_guide`, `.Figure.tight_layout()`, y ``fig.savefig(fname, bbox_inches='tight')``.

source: Return the label used for this artist in the legend.
es_es: Devuelve la etiqueta usada para este artista en la leyenda.

source: Get the line width of the Figure rectangle.
es_es: Obtener el ancho de línea del rectángulo Figura.

source: Return the picking behavior of the artist.
es_es: Devuelve el comportamiento de selección del artista.

source: The possible values are described in `.set_picker`.
es_es: Los valores posibles se describen en `.set_picker`.

source: Return whether the artist is to be rasterized.
es_es: Devuelve si el artista debe ser rasterizado.

source: Return the current size of the figure in inches.
es_es: Devuelve el tamaño actual de la figura en pulgadas.

source: The size (width, height) of the figure in inches.
es_es: El tamaño (anchura, altura) de la figura en pulgadas.

source: The size in pixels can be obtained by multiplying with `Figure.dpi`.
es_es: El tamaño en píxeles se puede obtener multiplicando con `Figure.dpi`.

source: Return the sketch parameters for the artist.
es_es: Devuelve los parámetros del croquis para el artista.

source: tuple or None
es_es: tupla o ninguno

source: A 3-tuple with the following elements:
es_es: Una 3 tupla con los siguientes elementos:

source: *scale*: The amplitude of the wiggle perpendicular to the source line.
es_es: *escala*: La amplitud de la peluca perpendicular a la línea de origen.

source: *length*: The length of the wiggle along the line.
es_es: *longitud*: La longitud de la peluca a lo largo de la línea.

source: *randomness*: The scale factor by which the length is shrunken or expanded.
es_es: *aleatoria*: El factor de escala por el cual la longitud es reducida o ampliada.

source: Returns *None* if no sketch parameters were set.
es_es: Devuelve *nunca* si no se han establecido parámetros de croquis.

source: Return the snap setting.
es_es: Devuelve la configuración del snap.

source: See `.set_snap` for details.
es_es: Vea `.set_snap` para más detalles.

source: Return whether `.tight_layout` is called when drawing.
es_es: Devuelve si `.tight_layout` es llamado al dibujar.

source: Return a (tight) bounding box of the figure *in inches*.
es_es: Devuelve un (fuerte) cuadro delimitador de la figura *en pulgadas*.

source: Note that `.FigureBase` differs from all other artists, which return their `.Bbox` in pixels.
es_es: Ten en cuenta que `.FigureBase` difiere de todos los otros artistas, que devuelven su `.Bbox` en píxeles.

source: Artists that have ``artist.set_in_layout(False)`` are not included in the bbox.
es_es: Los artistas que tienen ``artist.set_in_layout(False)`` no están incluidos en el cuadro.

source: **renderer** : `.RendererBase` subclass
es_es: **renderer** : subclase `.RendererBase`

source: RendererBase subclass
es_es: Subclase RendererBase

source: renderer that will be used to draw the figures (i.e. ``fig.canvas.get_renderer()``)
es_es: renderizador que se utilizará para dibujar las figuras (es decir, ``fig.canvas.get_renderer()``)

source: **bbox_extra_artists** : list of `.Artist` or ``None``
es_es: **bbox_extra_artistas** : lista de `.Artist` o ``None ``

source: List of artists to include in the tight bounding box. If ``None`` (default), then all artist children of each Axes are included in the tight bounding box.
es_es: Lista de artistas a incluir en la caja de límites ajustada. Si ``Ninguno`` (por defecto), entonces todos los hijos de los artistas de cada ejes están incluidos en la caja de límites ajustada.

source: containing the bounding box (in figure inches).
es_es: conteniendo el cuadro delimitador (en pulgadas de figura).

source: Return the `.Transform` instance used by this artist.
es_es: Devuelve la instancia `.Transform` usada por este artista.

source: Return the clip path with the non-affine part of its transformation applied, and the remaining affine part of its transformation.
es_es: Devuelve la ruta del clip con la parte no afectada de su transformación aplicada, y la parte afectada restante de su transformación.

source: Return the url.
es_es: Devuelve la url.

source: Return the visibility.
es_es: Devuelve la visibilidad.

source: Get the artist's bounding box in display space.
es_es: Obtenga la caja delimitadora del artist en el espacio de visualización.

source: The bounding box' width and height are nonnegative.
es_es: La anchura y la altura de la caja delimitadora son no negativas.

source: Subclasses should override for inclusion in the bounding box "tight" calculation. Default is to return an empty bounding box at 0, 0.
es_es: Las subclases deben anularlo para incluirlo en el cálculo de la caja delimitadora "ajustada". Por defecto devuelve una caja delimitadora vacía en 0, 0.

source: Be careful when using this function, the results will not update if the artist window extent of the artist changes. The extent can change due to any changes in the transform stack, such as changing the axes limits, the figure size, or the canvas used (as is done when saving a figure). This can lead to unexpected behavior where interactive figures will look fine on the screen, but will save incorrectly.
es_es: Ten cuidado cuando uses esta función, los resultados no se actualizarán si la extensión de la ventana del artist cambia. La extensión puede cambiar debido a cualquier cambio en la pila de transformaciones, como cambiar los límites de los ejes, el tamaño de la figura o el lienzo utilizado (como se hace al guardar una figura). Esto puede llevar a un comportamiento inesperado donde las figuras interactivas se verán bien en la pantalla, pero se guardarán incorrectamente.

source: Return the artist's zorder.
es_es: Devuelve el zorder del artista.

source: Blocking call to interact with a figure.
es_es: Bloquear llamada para interactuar con una figura.

source: Wait until the user clicks *n* times on the figure, and return the coordinates of each click in a list.
es_es: Espere hasta que el usuario haga clic en *n* veces en la figura, y devuelva las coordenadas de cada clic en una lista.

source: There are three possible interactions:
es_es: Hay tres interacciones posibles:

source: Add a point.
es_es: Añadir un punto.

source: Remove the most recently added point.
es_es: Eliminar el punto añadido más recientemente.

source: Stop the interaction and return the points added so far.
es_es: Detener la interacción y devolver los puntos añadidos hasta ahora.

source: The actions are assigned to mouse buttons via the arguments *mouse_add*, *mouse_pop* and *mouse_stop*.
es_es: Las acciones se asignan a los botones del ratón a través de los argumentos *mouse_add*, *mouse_pop* y *mouse_stop*.

source: Number of mouse clicks to accumulate. If negative, accumulate clicks until the input is terminated manually.
es_es: Número de pulsaciones del ratón para acumular. Si es negativo, se acumulan clics hasta que la entrada se termine manualmente.

source: **timeout**
es_es: **Tiempo de espera**

source: float, default: 30 seconds
es_es: flotante, por defecto: 30 segundos

source: Number of seconds to wait before timing out. If zero or negative will never timeout.
es_es: Número de segundos a esperar antes de agotar el tiempo de espera. Si cero o negativo nunca se agotará.

source: **show_clicks**
es_es: **mostrar_clic**

source: bool, default: True
es_es: bool, por defecto: True

source: If True, show a red cross at the location of each click.
es_es: Si es verdadero, mostrar una cruz roja en la ubicación de cada clic.

source: **mouse_add** : `.MouseButton` or None, default: `.MouseButton.LEFT`
es_es: **mouse_add** : `.MouseButton` o Ninguno, por defecto: `.MouseButton.LEFT`

source: MouseButton or None, default: MouseButton.LEFT
es_es: MouseButton o Ninguno, por defecto: MouseButton.LEFT

source: Mouse button used to add points.
es_es: Botón del ratón utilizado para añadir puntos.

source: **mouse_pop** : `.MouseButton` or None, default: `.MouseButton.RIGHT`
es_es: **mouse_pop** : `.MouseButton` o ninguno, por defecto: `.MouseButton.RIGHT`

source: MouseButton or None, default: MouseButton.RIGHT
es_es: MouseButton o Ninguno, por defecto: MouseButton.RIGHT

source: Mouse button used to remove the most recently added point.
es_es: Botón del ratón usado para eliminar el punto añadido más recientemente.

source: **mouse_stop** : `.MouseButton` or None, default: `.MouseButton.MIDDLE`
es_es: **mouse_stop** : `.MouseButton` o ninguno, por defecto: `.MouseButton.MIDDLE`

source: MouseButton or None, default: MouseButton.MIDDLE
es_es: MouseButton o Ninguno, por defecto: MouseButton.MIDDLE

source: Mouse button used to stop input.
es_es: Botón del ratón usado para detener la entrada.

source: list of tuples
es_es: lista de tubos

source: A list of the clicked (x, y) coordinates.
es_es: Una lista de las coordenadas pulsadas (x, Y).

source: The keyboard can also be used to select points in case your mouse does not have one or more of the buttons. The delete and backspace keys act like right clicking (i.e., remove last point), the enter key terminates input and any other key (not already used by the window manager) selects a point.
es_es: El teclado también se puede utilizar para seleccionar puntos en caso de que el ratón no tenga uno o más de los botones. Las teclas de borrar y backspace actúan como un clic derecho (i. ., eliminar el último punto), la tecla enter termina la entrada y cualquier otra clave (no usada por el gestor de ventanas) selecciona un punto.

source: Return whether units are set on any axis.
es_es: Devuelve si las unidades están definidas en cualquier eje.

source: Return whether the Artist has an explicitly set transform.
es_es: Devuelve si el Artista tiene una transforma definida explícitamente.

source: This is *True* after `.set_transform` has been called.
es_es: Esto es *True* después de que `.set_transform` haya sido llamado.

source: Place a legend on the figure.
es_es: Coloca una leyenda en la figura.

source: The call signatures correspond to the following different ways to use this method:
es_es: Las firmas de llamada corresponden a las siguientes formas diferentes de usar este método:

source: **1. Automatic detection of elements to be shown in the legend**
es_es: **1. Detección automática de elementos a mostrar en la leyenda**

source: The elements to be added to the legend are automatically determined, when you do not pass in any extra arguments.
es_es: Los elementos a añadir a la leyenda se determinan automáticamente, cuando no se pasa ningún argumento extra.

source: In this case, the labels are taken from the artist. You can specify them either at artist creation or by calling the :meth:`~.Artist.set_label` method on the artist::
es_es: En este caso, las etiquetas son tomadas del artista. Puedes especificarlos ya sea en la creación del artista o llamando al método :meth:`~.Artist.set_label` en el artista::

source: or::
es_es: o::

source: Specific lines can be excluded from the automatic legend element selection by defining a label starting with an underscore. This is default for all artists, so calling `.Figure.legend` without any arguments and without setting the labels manually will result in no legend being drawn.
es_es: Líneas específicas pueden ser excluidas de la selección automática de elementos de leyenda definiendo una etiqueta que comience con un guión bajo. Esto es por defecto para todos los artistas, así que llamar a `.Figure.legend` sin ningún argumento y sin establecer las etiquetas manualmente resultará en que no se dibuje ninguna leyenda.

source: **2. Explicitly listing the artists and labels in the legend**
es_es: **2. Listar explícitamente los artistas y etiquetas en la leyenda**

source: For full control of which artists have a legend entry, it is possible to pass an iterable of legend artists followed by an iterable of legend labels respectively::
es_es: Para un control total del cual los artistas tienen una entrada de leyenda, es posible pasar un iterable de los artistas leyendas seguido por un iterable de las etiquetas respectivamente::

source: **3. Explicitly listing the artists in the legend**
es_es: **3. Listar explícitamente los artistas en la leyenda**

source: This is similar to 2, but the labels are taken from the artists' label properties. Example::
es_es: Esto es similar a 2, pero las etiquetas se toman de las propiedades de la etiqueta de los artistas. Ejemplo::

source: **4. Labeling existing plot elements**
es_es: **4. Etiquetando elementos de parcela existentes**

source: This call signature is discouraged, because the relation between plot elements and labels is only implicit by their order and can easily be mixed up.
es_es: Esta firma de llamada se desanima, porque la relación entre los elementos de la parcela y las etiquetas sólo es implícita por su orden y se puede mezclar fácilmente.

source: To make a legend for all artists on all Axes, call this function with an iterable of strings, one for each legend item. For example::
es_es: Para hacer una leyenda para todos los artistas en todos los ejes, llama a esta función con una cadena iterable, una para cada objeto de leyenda. Por ejemplo::

source: **handles** : list of `.Artist`, optional
es_es: **handles** : lista de `.Artist`, opcional

source: A list of Artists (lines, patches) to be added to the legend. Use this together with *labels*, if you need full control on what is shown in the legend and the automatic mechanism described above is not sufficient.
es_es: Una lista de Artistas (líneas, parches) a añadir a la leyenda. Usa esto junto con *etiquetas*, si necesita un control completo sobre lo que se muestra en la leyenda y el mecanismo automático descrito anteriormente no es suficiente.

source: The length of handles and labels should be the same in this case. If they are not, they are truncated to the smaller length.
es_es: La longitud de las asas y las etiquetas debe ser la misma en este caso, si no lo son, se truncan a la menor longitud.

source: list of str, optional
es_es: lista de str, opcional

source: A list of labels to show next to the artists. Use this together with *handles*, if you need full control on what is shown in the legend and the automatic mechanism described above is not sufficient.
es_es: Una lista de etiquetas para mostrar junto a los artistas. Usa esto junto con *handles*, si necesita un control completo sobre lo que se muestra en la leyenda y el mecanismo automático descrito anteriormente no es suficiente.

source: **loc** : str or pair of floats, default: :rc:`legend.loc` ('best' for axes, 'upper right' for figures)
es_es: **loc** : str o par de floats, por defecto: :rc:`legend.loc` ('mejor' para ejes, 'superior derecha' para figuras)

source: str or pair of floats, default:
es_es: str o par de flotantes, por defecto:

source: The location of the legend.
es_es: La ubicación de la leyenda.

source: The strings ``'upper left', 'upper right', 'lower left', 'lower right'`` place the legend at the corresponding corner of the axes/figure.
es_es: Las cadenas ``'superior izquierda', 'superior derecha', 'inferior izquierda', 'inferior derecha'`` colocan la leyenda en la esquina correspondiente de los ejes/figura.

source: The strings ``'upper center', 'lower center', 'center left', 'center right'`` place the legend at the center of the corresponding edge of the axes/figure.
es_es: Las cadenas ``'centro superior', 'centro inferior', 'centro izquierda', 'centro derecha'`` colocan la leyenda en el centro del borde correspondiente de los ejes/figura.

source: The string ``'center'`` places the legend at the center of the axes/figure.
es_es: La cadena ``'center'`` coloca la leyenda en el centro de los ejes/figura.

source: The string ``'best'`` places the legend at the location, among the nine locations defined so far, with the minimum overlap with other drawn artists. This option can be quite slow for plots with large amounts of data; your plotting speed may benefit from providing a specific location.
es_es: La cadena ``'mejor'`` coloca la leyenda en la ubicación, entre los nueve lugares definidos hasta ahora, con la superposición mínima con otros artistas dibujados. Esta opción puede ser bastante lenta para parcelas con grandes cantidades de datos; su velocidad de trazado puede beneficiarse al proporcionar una ubicación específica.

source: The location can also be a 2-tuple giving the coordinates of the lower-left corner of the legend in axes coordinates (in which case *bbox_to_anchor* will be ignored).
es_es: La ubicación también puede ser una doble tupla dando las coordenadas de la esquina inferior izquierda de la leyenda en las coordenadas de los ejes (en cuyo caso se ignorará *bbox_to_anchor*).

source: For back-compatibility, ``'center right'`` (but no other location) can also be spelled ``'right'``, and each "string" locations can also be given as a numeric value:
es_es: Para back-compatibility, ``'center right'`` (pero ninguna otra ubicación) también puede ser escrita ``'right'``, y cada ubicación "string" también puede ser dada como un valor numérico:

source: Location String
es_es: Cadena de ubicación

source: Location Code
es_es: Código de ubicación

source: 'best'
es_es: "Mejor"

source: 'upper right'
es_es: "superior derecha"

source: 'upper left'
es_es: 'superior izquierda'

source: 'lower left'
es_es: 'inferior izquierda'

source: 'lower right'
es_es: "bajar derecha"

source: 'right'
es_es: "derecha"

source: 'center left'
es_es: 'centro izquierda'

source: 'center right'
es_es: 'centro derecha'

source: 'lower center'
es_es: 'centro inferior'

source: 'upper center'
es_es: 'centro superior'

source: 'center'
es_es: 'centro'
