Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/figure_api.po
Languages: es_es

source: Set multiple properties at once.
es_es: Establece varias propiedades a la vez.

source: Supported properties are
es_es: Las propiedades admitidas son

source: Set the agg filter.
es_es: Establece el filtro de agg.

source: **filter_func**
es_es: **filtro_función**

source: A filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array.
es_es: Una función de filtro, que toma un array (m, n, 3) flotante y un valor dpi, y devuelve un array (m, n, 3).

source: Set the alpha value used for blending - not supported on all backends.
es_es: Establece el valor alfa usado para mezclar - no soportado en todos los backends.

source: *alpha* must be within the 0-1 range, inclusive.
es_es: *alpha* debe estar dentro del rango 0-1, inclusive.

source: Set whether the artist is intended to be used in an animation.
es_es: Establecer si el artista está destinado a ser utilizado en una animación.

source: If True, the artist is excluded from regular drawing of the figure. You have to call `.Figure.draw_artist` / `.Axes.draw_artist` explicitly on the artist. This appoach is used to speed up animations using blitting.
es_es: Si es verdadero, el artista está excluido del dibujo normal de la figura. Tienes que llamar a `.Figure.draw_artist` / `. xes.draw_artist` explícitamente sobre el artista. Este appoach se utiliza para acelerar las animaciones usando chupando.

source: See also `matplotlib.animation` and :doc:`/tutorials/advanced/blitting`.
es_es: Vea también `matplotlib.animation` y :doc:`/tutorials/advanced/blitting`.

source: Set the canvas that contains the figure
es_es: Define el lienzo que contiene la figura

source: Set the artist's clip `.Bbox`.
es_es: Establecer el clip del artista `.Bbox`.

source: Set whether the artist uses clipping.
es_es: Establecer si el artista utiliza el recorte.

source: When False artists will be visible outside of the axes which can lead to unexpected results.
es_es: Cuando es False los artistas serán visibles fuera de los ejes lo que puede llevar a resultados inesperados.

source: Set the artist's clip path.
es_es: Establecer la ruta del clip del artista.

source: **path** : `.Patch` or `.Path` or `.TransformedPath` or None
es_es: **ruta** : `.Patch` o `.Path` o `.TransformedPath` o None

source: Patch or Path or TransformedPath or None
es_es: Patch o Path o TransformedPath o None

source: The clip path. If given a `.Path`, *transform* must be provided as well. If *None*, a previously set clip path is removed.
es_es: La ruta del clip. Si se le da un `.Path`, se debe proporcionar también *transform*. Si *None*, se elimina la ruta de recorte previamente establecida.

source: **transform** : `~matplotlib.transforms.Transform`, optional
es_es: **transformación** : `~matplotlib.transforms.Transform`, opcional

source: Transform, optional
es_es: Transformación, opcional

source: Only used if *path* is a `.Path`, in which case the given `.Path` is converted to a `.TransformedPath` using *transform*.
es_es: Sólo se utiliza si *path* es un `.Path`, en cuyo caso el `.Path` dado se convierte en un `.TransformedPath` utilizando *transform*.

source: For efficiency, if *path* is a `.Rectangle` this method will set the clipping box to the corresponding rectangle and set the clipping path to ``None``.
es_es: Por eficiencia, si *ruta* es un `.Rectángulo` este método establecerá la caja de recorte al rectángulo correspondiente y establecerá la ruta de recorte a ``Ninguna``.

source: For technical reasons (support of `~.Artist.set`), a tuple (*path*, *transform*) is also accepted as a single positional parameter.
es_es: Por razones técnicas (soporte de `~.Artist.set`), también se acepta una tupla (*ruta*, *transformación*) como parámetro posicional único.

source: Set whether ``constrained_layout`` is used upon drawing. If None, :rc:`figure.constrained_layout.use` value will be used.
es_es: Establece si ``constrained_layout`` es usado al dibujar. Si no, se usará el valor :rc:`figure.constrained_layout.use`.

source: When providing a dict containing the keys `w_pad`, `h_pad` the default ``constrained_layout`` paddings will be overridden. These pads are in inches and default to 3.0/72.0. ``w_pad`` is the width padding and ``h_pad`` is the height padding.
es_es: Cuando se proporciona un dictado que contiene las claves `w_pad`, `h_pad` los repuestos ``constrained_layout`` por defecto serán anulados. Estos pads están en pulgadas y por defecto en 3.0/72.0. ``w_pad`` es el relleno de ancho y ``h_pad`` es el relleno de altura.

source: **constrained**
es_es: **restringido**

source: Set padding for ``constrained_layout``.
es_es: Establecer relleno para ``constrained_layout``.

source: Tip: The parameters can be passed from a dictionary by using ``fig.set_constrained_layout(**pad_dict)``.
es_es: Sugerencia: Los parámetros se pueden pasar desde un diccionario usando ``fig.set_constrained_layout(**pad_dict)``.

source: **w_pad** : float, default: :rc:`figure.constrained_layout.w_pad`
es_es: **w_pad** : float, por defecto: :rc:`figure.constrained_layout.w_pad`

source: Width padding in inches. This is the pad around Axes and is meant to make sure there is enough room for fonts to look good. Defaults to 3 pts = 0.04167 inches
es_es: Relleno ancho en pulgadas. Esta es la almohadilla alrededor de los ejes y está destinada a asegurarse de que haya suficiente espacio para que las fuentes luzcan bien. Por defecto es 3 pts = 0.04167 pulgadas

source: **h_pad** : float, default: :rc:`figure.constrained_layout.h_pad`
es_es: **h_pad** : float, por defecto: :rc:`figure.constrained_layout.h_pad`

source: Height padding in inches. Defaults to 3 pts.
es_es: Relleno alto en pulgadas. Por defecto es de 3 pts.

source: Width padding between subplots, expressed as a fraction of the subplot width. The total padding ends up being w_pad + wspace.
es_es: Relleno de ancho entre subparcelas, expresado como una fracción de la anchura de la parcela.

source: **hspace** : float, default: :rc:`figure.constrained_layout.hspace`
es_es: **hspace** : float, por defecto: :rc:`figure.constrained_layout.hspace`

source: Height padding between subplots, expressed as a fraction of the subplot width. The total padding ends up being h_pad + hspace.
es_es: Relleno alto entre subparcelas, expresado como una fracción del ancho de la parcela.

source: Set the resolution of the figure in dots-per-inch.
es_es: Establece la resolución de la figura en los puntos porini.

source: Set the edge color of the Figure rectangle.
es_es: Define el color del borde del rectángulo Figura.

source: Set the face color of the Figure rectangle.
es_es: Define el color de la cara del rectángulo de la Figura.

source: Set the height of the figure in inches.
es_es: Define la altura de la figura en pulgadas.

source: **forward**
es_es: **Adelante**

source: See `set_size_inches`.
es_es: Vea `set_size_inches`.

source: Set the `.Figure` instance the artist belongs to.
es_es: Establece la instancia `.Figure` a la que pertenece el artist.

source: Figure
es_es: Figura

source: Set the width of the figure in inches.
es_es: Define el ancho de la figura en pulgadas.

source: Set the figure's background patch visibility, i.e. whether the figure background will be drawn. Equivalent to ``Figure.patch.set_visible()``.
es_es: Establece la visibilidad del parche de fondo de la figura, es decir, si el fondo de la figura será dibujado. Equivalente a ``Figure.patch.set_visible()``.

source: Set the (group) id for the artist.
es_es: Establece el id (grupo) para el artista.

source: Set if artist is to be included in layout calculations, E.g. :doc:`/tutorials/intermediate/constrainedlayout_guide`, `.Figure.tight_layout()`, and ``fig.savefig(fname, bbox_inches='tight')``.
es_es: Establece si el artista debe ser incluido en los cálculos del diseño, por ejemplo, :doc:`/tutorials/intermediate/constrainedlayout_guide`, `.Figure.tight_layout()`, y ``fig.savefig(fname, bbox_inches='tight')``.

source: **in_layout**
es_es: **en_diseño**

source: Set a label that will be displayed in the legend.
es_es: Establece una etiqueta que se mostrará en la leyenda.

source: *s* will be converted to a string by calling `str`.
es_es: *s* se convertirá en una cadena llamando a `str`.

source: Set the line width of the Figure rectangle.
es_es: Define el ancho de línea del rectángulo Figura.

source: Set the path effects.
es_es: Establecer los efectos de la ruta.

source: AbstractPathEffect
es_es: Efecto de ruta abstracta

source: Define the picking behavior of the artist.
es_es: Definir el comportamiento de selección del artista.

source: **picker**
es_es: **seleccionador**

source: This can be one of the following:
es_es: Esto puede ser uno de los siguientes:

source: *None*: Picking is disabled for this artist (default).
es_es: *Ninguno*: La selección está deshabilitada para este artista (por defecto).

source: A boolean: If *True* then picking will be enabled and the artist will fire a pick event if the mouse event is over the artist.
es_es: Un booleano: Si *Verdadero* entonces se habilitará la selección y el artista disparará un evento de elegir si el evento del ratón está sobre el artista.

source: A float: If picker is a number it is interpreted as an epsilon tolerance in points and the artist will fire off an event if its data is within epsilon of the mouse event. For some artists like lines and patch collections, the artist may provide additional data to the pick event that is generated, e.g., the indices of the data within epsilon of the pick event
es_es: Un float: Si el selector es un número, se interpreta como una tolerancia de epsilones en los puntos y el artista lanzará un evento si sus datos se encuentran dentro del epsilón del evento del ratón. Para algunos artistas como líneas y colecciones de parches, el artista puede proporcionar datos adicionales al evento de selección que se genere. ., los índices de los datos dentro del epsilón del evento de elección

source: A function: If picker is callable, it is a user supplied function which determines whether the artist is hit by the mouse event::
es_es: Una función: Si el selector es llamable, es una función suministrada por el usuario que determina si el artista es golpeado por el evento del ratón::

source: to determine the hit test. if the mouse event is over the artist, return *hit=True* and props is a dictionary of properties you want added to the PickEvent attributes.
es_es: para determinar la prueba de éxito. si el evento del ratón está sobre el artista, devuelve *hit=True* y props es un diccionario de propiedades que desea añadir a los atributos de PickEvent.

source: Force rasterized (bitmap) drawing for vector graphics output.
es_es: Forzar dibujo rasterizado (mapa de bits) para salida de gráficos vectoriales.

source: Rasterized drawing is not supported by all artists. If you try to enable this on an artist that does not support it, the command has no effect and a warning will be issued.
es_es: El dibujo asterizado no es apoyado por todos los artistas. Si intenta activar esto en un artista que no lo soporta, el comando no tiene efecto y se emitirá una advertencia.

source: This setting is ignored for pixel-based output.
es_es: Este ajuste se ignora para la salida basada en píxeles.

source: See also :doc:`/gallery/misc/rasterization_demo`.
es_es: Vea también :doc:`/gallery/misc/rasterization_demo`.

source: **rasterized**
es_es: **rasterizó**

source: Set the figure size in inches.
es_es: Establece el tamaño de la figura en pulgadas.

source: Width and height in inches (if height not specified as a separate argument) or width.
es_es: Ancho y altura en pulgadas (si la altura no se especifica como un argumento separado) o ancho.

source: Height in inches.
es_es: Altura en pulgadas.

source: If ``True``, the canvas size is automatically updated, e.g., you can resize the figure window from the shell.
es_es: Si es ``True``, el tamaño del lienzo se actualiza automáticamente, por ejemplo, puede cambiar el tamaño de la ventana de figura desde el shell.

source: To transform from pixels to inches divide by `Figure.dpi`.
es_es: Para transformar de píxeles a pulgadas dividir por `Figure.dpi`.

source: Set the sketch parameters.
es_es: Establecer los parámetros del croquis.

source: **scale**
es_es: **escala**

source: float, optional
es_es: float, opcional

source: The amplitude of the wiggle perpendicular to the source line, in pixels. If scale is `None`, or not provided, no sketch filter will be provided.
es_es: La amplitud de la muñeca perpendicular a la línea de origen, en píxeles. Si la escala es `Ninguno`, o no proporcionada, no se proporcionará ningún filtro de croquis.

source: The length of the wiggle along the line, in pixels (default 128.0)
es_es: La longitud del muñeco a lo largo de la línea, en píxeles (por defecto 128.0)

source: **randomness**
es_es: **aleatoria**

source: The scale factor by which the length is shrunken or expanded (default 16.0)
es_es: El factor de escala por el cual la longitud está reducida o expandida (por defecto 16.0)

source: The PGF backend uses this argument as an RNG seed and not as described above. Using the same seed yields the same random shape.
es_es: El backend de PGF utiliza este argumento como semilla de RNG y no como se describe anteriormente. Usar la misma semilla produce la misma forma aleatoria.

source: Set the snapping behavior.
es_es: Establece el comportamiento de desguace.

source: Snapping aligns positions with the pixel grid, which results in clearer images. For example, if a black line of 1px width was defined at a position in between two pixels, the resulting image would contain the interpolated value of that line in the pixel grid, which would be a grey value on both adjacent pixel positions. In contrast, snapping will move the line to the nearest integer pixel value, so that the resulting image will really contain a 1px wide black line.
es_es: Ajustando posiciones altas con la cuadrícula de píxeles, lo que resulta en imágenes más claras. Por ejemplo, si una línea negra de 1px de ancho fue definida en una posición entre dos píxeles, la imagen resultante contendría el valor interpolado de esa línea en la cuadrícula de píxeles, que sería un valor gris en ambas posiciones de píxeles adyacentes. En contraste, el snapping moverá la línea al valor entero de píxel más cercano. para que la imagen resultante contenga realmente una línea negra de 1px.

source: Snapping is currently only supported by the Agg and MacOSX backends.
es_es: El ajuste sólo está soportado actualmente por los backends Agg y MacOSX.

source: Possible values:
es_es: Valores posibles:

source: *True*: Snap vertices to the nearest pixel center.
es_es: *Verdadero*: Ajustar los vértices al centro de píxeles más cercano.

source: *False*: Do not modify vertex positions.
es_es: *Falso*: No modifique las posiciones de los vértices.

source: *None*: (auto) If the path contains only rectilinear line segments, round to the nearest pixel center.
es_es: *Ninguno*: (auto) Si la ruta contiene sólo segmentos rectilineales, redondea al centro de píxeles más cercano.

source: Set whether and how `.tight_layout` is called when drawing.
es_es: Establece si y cómo se llama a `.tight_layout` al dibujar.

source: **tight**
es_es: **endurecido**

source: If a bool, sets whether to call `.tight_layout` upon drawing. If ``None``, use :rc:`figure.autolayout` instead. If a dict, pass it as kwargs to `.tight_layout`, overriding the default paddings.
es_es: Si un bool, establece si llamar a `.tight_layout` al dibujar. Si es ``nunca``, usa :rc:`figure. En su lugar, utolayout`. Si un dictamen, pasarlo como kwargs a `.tight_layout`, anulando los repuestos predeterminados.

source: Set the artist transform.
es_es: Establece la transformación del artista.

source: Transform
es_es: Transformar

source: Set the url for the artist.
es_es: Establecer la url para el artista.

source: Set the artist's visibility.
es_es: Establecer la visibilidad del artista.

source: Set the zorder for the artist. Artists with lower zorder values are drawn first.
es_es: Establecer el zorder para el artista. Los artistas con valores de zorder más bajos se dibujan primero.

source: **level**
es_es: **nivel**

source: If using a GUI backend with pyplot, display the figure window.
es_es: Si se usa un backend GUI con pyplot, se mostrará la ventana de figura.

source: If the figure was not created using `~.pyplot.figure`, it will lack a `~.backend_bases.FigureManagerBase`, and this method will raise an AttributeError.
es_es: Si la figura no fue creada usando `~.pyplot.figure`, faltará un `~.backend_bases.FigureManagerBase`, y este método generará un AttributeError.

source: This does not manage an GUI event loop. Consequently, the figure may only be shown briefly or not shown at all if you or your environment are not managing an event loop.
es_es: Esto no administra un bucle de eventos GUI. En consecuencia, la figura sólo puede mostrarse brevemente o no mostrarse en absoluto si usted o su entorno no están gestionando un bucle de eventos.

source: Proper use cases for `.Figure.show` include running this from a GUI application or an IPython shell.
es_es: Los casos de uso adecuados para `.Figure.show` incluyen ejecutarlo desde una aplicación GUI o una shell IPython.

source: If you're running a pure python shell or executing a non-GUI python script, you should use `matplotlib.pyplot.show` instead, which takes care of managing the event loop for you.
es_es: Si está ejecutando una shell python pura o ejecutando un script python no GUI, debería usar `matplotlib. yplot.show` en su lugar, que se encarga de gestionar el ciclo de eventos para usted.

source: **warn**
es_es: **advertir**

source: If ``True`` and we are not running headless (i.e. on Linux with an unset DISPLAY), issue warning when called on a non-GUI backend.
es_es: Si es ``True`` y no estamos ejecutando headless (es decir, en Linux con un DISPLAY sin definir), emite una advertencia cuando se llama en un backend que no sea GUI.

source: Whether the artist is 'stale' and needs to be re-drawn for the output to match the internal state of the artist.
es_es: Si el artista es 'stale' y necesita ser redibujado para que la salida coincida con el estado interno del artista.

source: ``x`` and ``y`` sticky edge lists for autoscaling.
es_es: ``x`` y ``y`` listas de bordes pegajosos para autoescalado.

source: When performing autoscaling, if a data limit coincides with a value in the corresponding sticky_edges list, then no margin will be added--the view limit "sticks" to the edge. A typical use case is histograms, where one usually expects no margin on the bottom edge (0) of the histogram.
es_es: Al realizar autoescalado, si un límite de datos coincide con un valor en la lista de bordes de stickys correspondiente. entonces no se añadirá ningún margen --el límite de vista "pega" al borde. Un caso de uso típico son los histogramas, donde normalmente no se espera margen en el borde inferior (0) del histograma.

source: Moreover, margin expansion "bumps" against sticky edges and cannot cross them. For example, if the upper data limit is 1.0, the upper view limit computed by simple margin application is 1.2, but there is a sticky edge at 1.1, then the actual upper view limit will be 1.1.
es_es: Además, la expansión del margen "bumps" contra bordes pegajosos y no pueden cruzarlos. Por ejemplo, si el límite superior de datos es 1. , el límite de la vista superior calculado por una aplicación de margen simple es 1. , pero hay un borde fijo en 1.1, entonces el límite real de la vista superior será 1.1.

source: This attribute cannot be assigned to; however, the ``x`` and ``y`` lists can be modified in place as needed.
es_es: Este atributo no se puede asignar; sin embargo, las listas ``x`` y ``y`` pueden ser modificadas en su lugar según sea necesario.

source: Add a subfigure to this figure or subfigure.
es_es: Agrega una subfigura a esta figura o subfigura.

source: A subfigure has the same artist methods as a figure, and is logically the same as a figure, but cannot print itself. See :doc:`/gallery/subplots_axes_and_figures/subfigures`.
es_es: Una subfigura tiene los mismos métodos de artista que una figura, y es lógica igual que una figura, pero no puede imprimirse por sí misma. Vea :doc:`/gallery/subplots_axes_and_figures/subfiguras`.

source: **nrows, ncols**
es_es: **nfilas, ncoles**

source: Number of rows/columns of the subfigure grid.
es_es: Número de filas/columnas de la cuadrícula de subfiguras.

source: If True, extra dimensions are squeezed out from the returned array of subfigures.
es_es: Si es verdadero, las dimensiones extra se exprimen del array devuelto de subfiguras.

source: The amount of width/height reserved for space between subfigures, expressed as a fraction of the average subfigure width/height. If not given, the values will be inferred from a figure or rcParams when necessary.
es_es: La cantidad de anchura/altura reservada para el espacio entre subfiguras, expresada como una fracción de la anchura/altura promedio de la subfigura. Si no se indica, los valores serán inferiores de una figura o rcParams cuando sea necesario.

source: **width_ratios** : array-like of length *ncols*, optional
es_es: **width_ratios** : array-like de longitud *ncols*, opcional

source: array-like of length
es_es: longitud del array

source: Defines the relative widths of the columns. Each column gets a relative width of ``width_ratios[i] / sum(width_ratios)``. If not given, all columns will have the same width.
es_es: Define el ancho relativo de las columnas. Cada columna obtiene un ancho relativo de ``width_ratios[i] / suma(width_ratios)``. Si no se dan, todas las columnas tendrán el mismo anchura.

source: **height_ratios** : array-like of length *nrows*, optional
es_es: **altura_ratios** : tipo matriz de longitud *nrows*, opcional

source: Defines the relative heights of the rows. Each row gets a relative height of ``height_ratios[i] / sum(height_ratios)``. If not given, all rows will have the same height.
es_es: Define las alturas relativas de las filas. Cada fila tiene una altura relativa de ``height_ratios[i] / suma(height_ratios)``. Si no se da, todos los registros tendrán la misma altura.

source: Build a layout of Axes based on ASCII art or nested lists.
es_es: Construye un diseño de ejes basado en arte ASCII o listas anidadas.

source: This is a helper function to build complex GridSpec layouts visually.
es_es: Esta es una función de ayuda para construir diseños complejos de GridSpec visualmente.

source: This API is provisional and may be revised in the future based on early user feedback.
es_es: Esta API es provisional y puede ser revisada en el futuro basándose en la retroalimentación temprana del usuario.

source: list of list of {hashable or nested} or str
es_es: lista de {hashable or nested} o str

source: A visual layout of how you want your Axes to be arranged labeled as strings. For example ::
es_es: Un diseño visual de cómo quieres que tus ejes se organicen etiquetados como cadenas. Por ejemplo ::

source: produces 4 Axes:
es_es: produce 4 ejes:

source: 'A panel' which is 1 row high and spans the first two columns
es_es: 'Un panel' que tiene 1 fila de alto y abarca las dos primeras columnas

source: 'edge' which is 2 rows high and is on the right edge
es_es: 'borde' que tiene 2 filas de alto y está en el borde derecho

source: 'C panel' which in 1 row and 1 column wide in the bottom left
es_es: 'Panel C' que en 1 fila y 1 columna de ancho en la parte inferior izquierda

source: a blank space 1 row and 1 column wide in the bottom center
es_es: un espacio en blanco 1 fila y 1 columna de ancho en el centro inferior
