Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/figure_api.po
Languages: es_es

source: Any of the entries in the layout can be a list of lists of the same form to create nested layouts.
es_es: Cualquiera de las entradas en el diseño puede ser una lista de listas de la misma forma para crear diseños anidados.

source: If input is a str, then it can either be a multi-line string of the form ::
es_es: Si la entrada es una str, entonces puede ser una cadena de múltiples líneas de la forma ::

source: where each character is a column and each line is a row. Or it can be a single-line string where rows are separated by ``;``::
es_es: donde cada carácter es una columna y cada línea es una fila. O puede ser una cadena de una sola línea donde las filas están separadas por ``;``::

source: The string notation allows only single character Axes labels and does not support nesting but is very terse.
es_es: La notación de cadena sólo permite etiquetas de ejes de un solo carácter y no soporta anidaciones pero es muy terno.

source: **sharex, sharey**
es_es: **sharex, compartir**

source: If True, the x-axis (*sharex*) or y-axis (*sharey*) will be shared among all subplots. In that case, tick label visibility and axis units behave as for `subplots`. If False, each subplot's x- or y-axis will be independent.
es_es: Si es verdadero, el eje x (*sharex*) o eje y-(*sharey*) se compartirá entre todos los subtrazos. En ese caso, la visibilidad de las etiquetas y las unidades de ejes se comportan como en los «subplots». Si False, cada subplot será independiente.

source: Dictionary with keywords passed to the `.Figure.add_subplot` call used to create each subplot.
es_es: Diccionario con palabras clave pasadas a la llamada `.Figure.add_subplot` usada para crear cada subplot.

source: Dictionary with keywords passed to the `.GridSpec` constructor used to create the grid the subplots are placed on.
es_es: Diccionario con palabras clave pasadas al constructor `.GridSpec` usado para crear la cuadrícula en la que se colocan las subparcelas.

source: **empty_sentinel**
es_es: **número vacío**

source: object, optional
es_es: objeto, opcional

source: Entry in the layout to mean "leave this space empty". Defaults to ``'.'``. Note, if *layout* is a string, it is processed via `inspect.cleandoc` to remove leading white space, which may interfere with using white-space as the empty sentinel.
es_es: Entrada en el diseño para significar "dejar este espacio vacío". Por defecto es ``'.'``. Tenga en cuenta, si *layout* es una cadena, es procesada a través de `inspect. leandoc` para eliminar el espacio blanco inicial, que puede interferir con el uso del espacio blanco como el centinel vacío.

source: dict[label, Axes]
es_es: dictar[etiqueta, ejes]

source: A dictionary mapping the labels to the Axes objects. The order of the axes is left-to-right and top-to-bottom of their position in the total layout.
es_es: Un diccionario que mapea las etiquetas a los objetos de los ejes. El orden de los ejes es de izquierda a derecha y arriba a abajo de su posición en el diseño total.

source: Add a set of subplots to this figure.
es_es: Agrega un conjunto de subparcelas a esta figura.

source: This utility wrapper makes it convenient to create common layouts of subplots in a single call.
es_es: Este envoltorio de utilidades hace conveniente crear diseños comunes de subparcelas en una sola llamada.

source: Number of rows/columns of the subplot grid.
es_es: Número de filas/columnas de la cuadrícula de subgráfico.

source: bool or {'none', 'all', 'row', 'col'}, default: False
es_es: bool o {'None ', 'all', 'row', 'col'}, por defecto: False

source: Controls sharing of x-axis (*sharex*) or y-axis (*sharey*):
es_es: Controla la compartición del eje x (*sharex*) o eje y-(*sharey*):

source: True or 'all': x- or y-axis will be shared among all subplots.
es_es: Verdadero o 'todo': x o Y se compartirán entre todas las subparcelas.

source: False or 'none': each subplot x- or y-axis will be independent.
es_es: False o 'ninguno': cada subparcela x o eje Y será independiente.

source: 'row': each subplot row will share an x- or y-axis.
es_es: 'fila': cada fila de subparcelas compartirá un eje x o y-.

source: 'col': each subplot column will share an x- or y-axis.
es_es: 'col': cada columna de la subparcela compartirá un eje x o y-.

source: When subplots have a shared x-axis along a column, only the x tick labels of the bottom subplot are created. Similarly, when subplots have a shared y-axis along a row, only the y tick labels of the first column subplot are created. To later turn other subplots' ticklabels on, use `~matplotlib.axes.Axes.tick_params`.
es_es: Cuando las subparcelas tienen un eje x compartido a lo largo de una columna, sólo se crean las etiquetas x del subgrafico inferior. De la misma manera, cuando las subparcelas tienen un eje compartido a lo largo de una fila, sólo se crean las etiquetas de tick y de la subparcela de la primera columna. Para activar más tarde otras etiquetas de subplots, use `~matplotlib.axes.Axes.tick_params`.

source: When subplots have a shared axis that has units, calling `.Axis.set_units` will update each axis with the new units.
es_es: Cuando las subparcelas tienen un eje compartido que tiene unidades, llamar a `.Axis.set_units` actualizará cada eje con las nuevas unidades.

source: If True, extra dimensions are squeezed out from the returned array of Axes:
es_es: Si es verdadero, las dimensiones extra se exprimen de la matriz devuelta de ejes:

source: if only one subplot is constructed (nrows=ncols=1), the resulting single Axes object is returned as a scalar.
es_es: si sólo se construye un subplano (nrows=ncols=1), el objeto de ejes individuales resultante se devuelve como escalar.

source: for Nx1 or 1xM subplots, the returned object is a 1D numpy object array of Axes objects.
es_es: para subparcelas Nx1 o 1xM, el objeto devuelto es una matriz de objetos numpy 1D de objetos Ejes.

source: for NxM, subplots with N>1 and M>1 are returned as a 2D array.
es_es: para NxM, las subparcelas con N>1 y M>1 se devuelven como una matriz 2D.

source: If False, no squeezing at all is done: the returned Axes object is always a 2D array containing Axes instances, even if it ends up being 1x1.
es_es: Si False, no se hace ninguna exprimencia: el objeto devuelto de los ejes es siempre una matriz 2D que contiene instancias de ejes, incluso si termina siendo 1x1.

source: Dict with keywords passed to the `.Figure.add_subplot` call used to create each subplot.
es_es: Dicta con palabras clave pasadas a la llamada `.Figure.add_subplot` usada para crear cada subplot.

source: Dict with keywords passed to the `~matplotlib.gridspec.GridSpec` constructor used to create the grid the subplots are placed on.
es_es: Dicta con palabras clave pasadas al constructor `~matplotlib.gridspec.GridSpec` usado para crear la cuadrícula en la que se colocan las subparcelas.

source: `~.axes.Axes` or array of Axes
es_es: `~.axes.Ejes` o array de ejes

source: Either a single `~matplotlib.axes.Axes` object or an array of Axes objects if more than one subplot was created. The dimensions of the resulting array can be controlled with the *squeeze* keyword, see above.
es_es: O bien un solo objeto `~matplotlib.axes.Axes` o un array de objetos de ejes si se ha creado más de un subgráfico. Las dimensiones del array resultante pueden ser controladas con la palabra clave *squeeze*, ver arriba.

source: Adjust the subplot layout parameters.
es_es: Ajuste los parámetros de diseño de subplotes.

source: Unset parameters are left unmodified; initial values are given by :rc:`figure.subplot.[name]`.
es_es: Los parámetros desestablecidos quedan sin modificar; los valores iniciales son dados por :rc:`figure.subplot.[name]`.

source: The position of the left edge of the subplots, as a fraction of the figure width.
es_es: La posición del borde izquierdo de las subparcelas, como una fracción del ancho de la figura.

source: **right**
es_es: **derecha**

source: The position of the right edge of the subplots, as a fraction of the figure width.
es_es: La posición del borde derecho de las subparcelas, como una fracción del ancho de la figura.

source: The position of the bottom edge of the subplots, as a fraction of the figure height.
es_es: La posición del borde inferior de las subparcelas, como una fracción de la altura de la figura.

source: **top**
es_es: **arriba**

source: The position of the top edge of the subplots, as a fraction of the figure height.
es_es: La posición del borde superior de las subparcelas, como una fracción de la altura de la figura.

source: The width of the padding between subplots, as a fraction of the average Axes width.
es_es: La anchura del relleno entre subparcelas, como una fracción de la anchura media de los ejes.

source: The height of the padding between subplots, as a fraction of the average Axes height.
es_es: La altura del relleno entre subparcelas, como una fracción de la altura media de los ejes.

source: Add a centered suptitle to the figure.
es_es: Agrega un suptítulo centrado a la figura.

source: The suptitle text.
es_es: El texto de sutítulo.

source: The x location of the text in figure coordinates.
es_es: La posición x del texto en coordenadas de figura.

source: float, default: 0.98
es_es: float, por defecto: 0.98

source: The y location of the text in figure coordinates.
es_es: La ubicación y del texto en coordenadas de figura.

source: **horizontalalignment, ha**
es_es: **horizontalalineamiento, ha**

source: {'center', 'left', 'right'}, default: center
es_es: {'center', 'left', 'right'}, por defecto: centro

source: The horizontal alignment of the text relative to (*x*, *y*).
es_es: La alineación horizontal del texto relativo a (*x*, *y*).

source: **verticalalignment, va**
es_es: **alineación vertical, va**

source: {'top', 'center', 'bottom', 'baseline'}, default: top
es_es: {'top', 'center', 'bottom', 'baseline'}, por defecto: superior

source: The vertical alignment of the text relative to (*x*, *y*).
es_es: La alineación vertical del texto relativa a (*x*, *y*).

source: The font size of the text. See `.Text.set_size` for possible values.
es_es: El tamaño de fuente del texto. Consulte `.Text.set_size` para ver los valores posibles.

source: **fontweight, weight** : default: :rc:`figure.titleweight`
es_es: **fontweight, weight** : por defecto: :rc:`figure.titleweight`

source: The font weight of the text. See `.Text.set_weight` for possible values.
es_es: El peso de la fuente del texto. Consulte `.Text.set_weight` para ver los valores posibles.

source: text
es_es: texto

source: The `.Text` instance of the suptitle.
es_es: La instancia `.Text` del suptítulo.

source: None or dict, optional
es_es: Ninguno o dictado opcional

source: A dict of font properties. If *fontproperties* is given the default values for font size and weight are taken from the `.FontProperties` defaults. :rc:`figure.titlesize` and :rc:`figure.titleweight` are ignored in this case.
es_es: Un dictado de propiedades de la fuente. Si se da a *fontproperties* los valores por defecto para el tamaño y peso de la fuente son tomados del `. ontProperties` por defecto. :rc:`figure.titlesize` y :rc:`figure.titleweight` son ignorados en este caso.

source: Additional kwargs are `matplotlib.text.Text` properties.
es_es: Los kwargs adicionales son propiedades `matplotlib.text.Text`.

source: Add a centered supxlabel to the figure.
es_es: Agrega una etiqueta supxlabel centrada a la figura.

source: The supxlabel text.
es_es: El texto de suxetiqueta.

source: float, default: 0.01
es_es: float, por defecto: 0.01

source: {'top', 'center', 'bottom', 'baseline'}, default: bottom
es_es: {'top', 'center', 'bottom', 'baseline'}, por defecto: inferior

source: The `.Text` instance of the supxlabel.
es_es: La instancia `.Text` de la etiqueta supxlabel.

source: Add a centered supylabel to the figure.
es_es: Agrega una etiqueta supylabel centrada a la figura.

source: The supylabel text.
es_es: El texto supylabel.

source: float, default: 0.02
es_es: float, por defecto: 0.02

source: {'center', 'left', 'right'}, default: left
es_es: {'center', 'left', 'right'}, por defecto: izquierda

source: {'top', 'center', 'bottom', 'baseline'}, default: center
es_es: {'top', 'center', 'bottom', 'baseline'}, por defecto: centro

source: The `.Text` instance of the supylabel.
es_es: La instancia `.Text` de la etiqueta supylabel.

source: Add text to figure.
es_es: Añadir texto a la figura.

source: The position to place the text. By default, this is in figure coordinates, floats in [0, 1]. The coordinate system can be changed using the *transform* keyword.
es_es: La posición para colocar el texto. De forma predeterminada, esto está en coordenadas de figura, flotan en [0, 1]. El sistema de coordenadas se puede cambiar usando la palabra clave *transform*.

source: The text string.
es_es: La cadena de texto.

source: A dictionary to override the default text properties. If not given, the defaults are determined by :rc:`font.*`. Properties passed as *kwargs* override the corresponding ones given in *fontdict*.
es_es: Un diccionario para sobrescribir las propiedades de texto predeterminadas. Si no se proporciona, los valores predeterminados son determinados por :rc:`font. `. Propiedades pasadas como *kwargs* sobreescribir las correspondientes dadas en *fontdict*.

source: `~.text.Text`
es_es: `~.text.Texto`

source: **\*\*kwargs** : `~matplotlib.text.Text` properties
es_es: **\*\*kwargs** : propiedades `~matplotlib.text.Text`

source: Text properties
es_es: Propiedades del texto

source: Other miscellaneous text parameters.
es_es: Otros parámetros de texto variados.

source: dict with properties for `.patches.FancyBboxPatch`
es_es: dict con propiedades para `.patches.FancyBboxPatch`

source: :meth:`fontfamily <matplotlib.text.Text.set_fontfamily>` or family
es_es: :meth:`fontfamily <matplotlib.text.Text.set_fontfamily>` o familia

source: :meth:`fontproperties <matplotlib.text.Text.set_fontproperties>` or font or font_properties
es_es: :meth:`fontproperties <matplotlib.text.Text.set_fontproperties>` o font o font_properties

source: `.font_manager.FontProperties` or `str` or `pathlib.Path`
es_es: `.font_manager.FontProperties` o `str` o `pathlib.Path`

source: :meth:`fontsize <matplotlib.text.Text.set_fontsize>` or size
es_es: :meth:`fontsize <matplotlib.text.Text.set_fontsize>` o size

source: {a numeric value in range 0-1000, 'ultra-condensed', 'extra-condensed', 'condensed', 'semi-condensed', 'normal', 'semi-expanded', 'expanded', 'extra-expanded', 'ultra-expanded'}
es_es: {un valor numérico en el rango 0-1000, 'ultra-condensed', 'extra-condensed', 'condensed', 'semi-condensed', 'normal', 'semi-expanded', 'expanded', 'extra-expanded', 'ultra-expanded'}

source: :meth:`fontstyle <matplotlib.text.Text.set_fontstyle>` or style
es_es: :meth:`fontstyle <matplotlib.text.Text.set_fontstyle>` o style

source: :meth:`fontvariant <matplotlib.text.Text.set_fontvariant>` or variant
es_es: :meth:`fontvariant <matplotlib.text.Text.set_fontvariant>` o variant

source: {a numeric value in range 0-1000, 'ultralight', 'light', 'normal', 'regular', 'book', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'}
es_es: {un valor numérico en el rango 0-1000, 'ultralight', 'light', 'normal', 'regular', 'book', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'}

source: float (multiple of font size)
es_es: float (múltiplo del tamaño de la fuente)

source: :meth:`multialignment <matplotlib.text.Text.set_multialignment>` or ma
es_es: :meth:`multialignment <matplotlib.text.Text.set_multialignment>` o ma

source: float or {'vertical', 'horizontal'}
es_es: float o {'vertical', 'horizontal'}

source: :obj:`.Axes.text`
es_es: :obj:`.Ejes.text`

source: Adjust the padding between and around subplots.
es_es: Ajuste el relleno entre subparcelas y alrededores.

source: To exclude an artist on the Axes from the bounding box calculation that determines the subplot parameters (i.e. legend, or annotation), set ``a.set_in_layout(False)`` for that artist.
es_es: excluir a un artista en los ejes del cálculo de la caja de límites que determina los parámetros de subplot (i. . leyenda, o anotación), establezca ``a.set_in_layout(False)`` para ese artista.

source: float, default: 1.08
es_es: float, por defecto: 1.08

source: Padding between the figure edge and the edges of subplots, as a fraction of the font size.
es_es: Relleno entre el borde de la figura y los bordes de los subplots, como fracción del tamaño de la fuente.

source: **h_pad, w_pad** : float, default: *pad*
es_es: **h_pad, w_pad** : flotante, por defecto: *pad*

source: Padding (height/width) between edges of adjacent subplots, as a fraction of the font size.
es_es: Relleno (altura/ancho) entre bordes de subparcelas adyacentes, como una fracción del tamaño de la fuente.

source: tuple (left, bottom, right, top), default: (0, 0, 1, 1)
es_es: tupla (izquierda, inferior, derecha, arriba), por defecto: (0, 0, 1, 1)

source: A rectangle in normalized figure coordinates into which the whole subplots area (including labels) will fit.
es_es: Un rectángulo en coordenadas normalizadas en las que caben todas las subparcelas (incluyendo etiquetas).

source: Update this artist's properties from the dict *props*.
es_es: Actualizar las propiedades de este artista desde el dict *props*.

source: Copy properties from *other* to *self*.
es_es: Copiar propiedades de *otro* a *self*.

source: Blocking call to interact with the figure.
es_es: Bloquear llamada para interactuar con la figura.

source: Wait for user input and return True if a key was pressed, False if a mouse button was pressed and None if no input was given within *timeout* seconds. Negative values deactivate *timeout*.
es_es: Esperar a la entrada del usuario y devolver True si se presionó una tecla, False si un botón del ratón fue presionado y Ninguno si no se dio ninguna entrada dentro de *timeout* segundos. Valores negativos desactivan *timeout*.

source: Base class for `.figure.Figure` and `.figure.SubFigure` containing the methods that add artists to the figure or subfigure, create Axes, etc.
es_es: Clase base para `.figure.Figure` y `.figure.SubFigure` conteniendo los métodos que agregan artistas a la figura o subfigura, crear ejes, etc.

source: The `~.axes.Axes` instance the artist resides in, or *None*.
es_es: La instancia `~.axes.Axes` en la que reside el artist, o *Ninguno*.

source: Logical figure that can be placed inside a figure.
es_es: Figura lógica que puede colocarse dentro de una figura.

source: Typically instantiated using `.Figure.add_subfigure` or `.SubFigure.add_subfigure`, or `.SubFigure.subfigures`. A subfigure has the same methods as a figure except for those particularly tied to the size or dpi of the figure, and is confined to a prescribed region of the figure. For example the following puts two subfigures side-by-side::
es_es: Normalmente instanciado usando `.Figure.add_subfigure` o `.SubFigure.add_subfigure`, o `.SubFigure.subfigures`. Una subfigura tiene los mismos métodos que una figura excepto aquellos que están particularmente vinculados al tamaño o dpi de la figura, y se limita a una región prescrita de la figura. Por ejemplo, lo siguiente pone dos subfiguras lado a lado::

source: See :doc:`/gallery/subplots_axes_and_figures/subfigures`
es_es: Ver :doc:`/gallery/subplots_axes_and_figures/subfiguras`

source: **parent** : `.figure.Figure` or `.figure.SubFigure`
es_es: **padre** : `.figure.Figure` o `.figure.SubFigure`

source: figure.Figure or figure.SubFigure
es_es: figure. Figura o figure. SubFigura

source: Figure or subfigure that contains the SubFigure. SubFigures can be nested.
es_es: Figura o subfigura que contiene la subfigura. Las subfiguras pueden ser anidadas.

source: The figure patch face color.
es_es: El parche de la figura se enfrenta al color.

source: **\*\*kwargs** : `.SubFigure` properties, optional
es_es: **\*\*kwargs** : Propiedades `.SubFigure`, opcional

source: SubFigure properties, optional
es_es: Propiedades de subFigura, opcional

source: List of Axes in the SubFigure. You can access and modify the Axes in the SubFigure through this list.
es_es: Lista de ejes en la subfigura. Puede acceder y modificar los ejes en la subFigura a través de esta lista.

source: Do not modify the list itself. Instead, use `~.SubFigure.add_axes`, `~.SubFigure.add_subplot` or `~.SubFigure.delaxes` to add or remove an Axes.
es_es: No modifiques la lista en sí. En su lugar, usa `~.SubFigure.add_axes`, `~.SubFigure.add_subplot` o `~.SubFigure.delaxes` para agregar o quitar un eje.

source: Note: The `.SubFigure.axes` property and `~.SubFigure.get_axes` method are equivalent.
es_es: Nota: La propiedad `.SubFigure.axes` y el método `~.SubFigure.get_axes` son equivalentes.

source: A class to hold the parameters for a subplot.
es_es: Una clase para mantener los parámetros de una subplot.

source: Defaults are given by :rc:`figure.subplot.[name]`.
es_es: Los valores por defecto son dados por :rc:`figure.subplot.[name]`.

source: Update the dimensions of the passed parameters. *None* means unchanged.
es_es: Actualizar las dimensiones de los parámetros pasados. *nunca* significa sin cambios.

source: Calculate the width and height for a figure with a specified aspect ratio.
es_es: Calcula el ancho y la altura de una figura con una relación de aspecto especificada.

source: While the height is taken from :rc:`figure.figsize`, the width is adjusted to match the desired aspect ratio. Additionally, it is ensured that the width is in the range [4., 16.] and the height is in the range [2., 16.]. If necessary, the default height is adjusted to ensure this.
es_es: Mientras que la altura se toma de :rc:`figure.figsize`, el ancho se ajusta para que coincida con la relación de aspecto deseada. Además, se asegura que el ancho está en el rango [4., 16.] y que la altura está en el rango [2. Si es necesario, la altura por defecto se ajusta para asegurar esto.

source: float or 2D array
es_es: array decimal o 2D

source: If a float, this defines the aspect ratio (i.e. the ratio height / width). In case of an array the aspect ratio is number of rows / number of columns, so that the array could be fitted in the figure undistorted.
es_es: Si un flotante, define la relación de aspecto (es decir, la altura / anchura). En caso de una matriz, la relación de aspecto es el número de filas / número de columnas, para que la matriz pueda ser instalada en la figura sin distorsiones.

source: The figure size in inches.
es_es: El tamaño de la figura en pulgadas.

source: If you want to create an Axes within the figure, that still preserves the aspect ratio, be sure to create it with equal width and height. See examples below.
es_es: Si quieres crear un hacha dentro de la figura, que aún conserva la relación de aspecto, asegúrese de crearlo con la misma anchura y altura. Ver ejemplos a continuación.

source: Thanks to Fernando Perez for this function.
es_es: Gracias a Fernando Pérez por esta función.

source: Make a figure twice as tall as it is wide::
es_es: Hacer una cifra dos veces más alta que la ancho::

source: Make a figure with the proper aspect for an array::
es_es: Hacer una figura con el aspecto adecuado para una matriz::
