Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/figure_api.po
Languages: es_es

source: If a label is on the left, it is aligned with labels on Axes that also have their label on the left and that have the same left-most subplot column. If the label is on the right, it is aligned with labels on Axes with the same right-most column.
es_es: Si una etiqueta está a la izquierda, está alineada con etiquetas en ejes que también tienen su etiqueta a la izquierda y que tienen la misma columna de subparcela a la izquierda. Si la etiqueta está a la derecha, está alineada con etiquetas en ejes con la misma columna más derecha.

source: Optional list (or ndarray) of `~matplotlib.axes.Axes` to align the ylabels. Default is to align all Axes on the figure.
es_es: Lista opcional (o ndarray) de `~matplotlib.axes.Axes` para alinear las etiquetas. Por defecto alinea todos los ejes en la figura.

source: Example with large yticks labels::
es_es: Ejemplo con grandes etiquetas de texto::

source: Date ticklabels often overlap, so it is useful to rotate them and right align them. Also, a common use case is a number of subplots with shared x-axis where the x-axis is date data. The ticklabels are often long, and it helps to rotate them on the bottom subplot and turn them off on other subplots, as well as turn off xlabels.
es_es: Etiquetas de fecha a menudo se superponen, por lo que es útil rotarlas y alinearlas. También, un caso de uso común es un número de subparcelas con eje x compartido donde el eje x son datos de fecha. Las etiquetas son a menudo largas, y ayuda a rotarlos en la subparcela inferior y a desactivarlos en otras subparcelas, así como a desactivar xlabels.

source: **bottom**
es_es: **inferior**

source: float, default: 0.2
es_es: float, por defecto: 0.2

source: The bottom of the subplots for `subplots_adjust`.
es_es: La parte inferior de las subparcelas para `subplots_adjust`.

source: float, default: 30 degrees
es_es: flotante, por defecto: 30 grados

source: The rotation angle of the xtick labels in degrees.
es_es: El ángulo de rotación de las etiquetas xtick en grados.

source: {'left', 'center', 'right'}, default: 'right'
es_es: {'left', 'center', 'right'}, predeterminado: 'derecha'

source: The horizontal alignment of the xticklabels.
es_es: La alineación horizontal de las etiquetas xticklabels.

source: **which**
es_es: **qué**

source: {'major', 'minor', 'both'}, default: 'major'
es_es: {'major', 'minor', 'both'}, por defecto: 'major'

source: Selects which ticklabels to rotate.
es_es: Selecciona qué etiquetas rotar.

source: List of Axes in the Figure. You can access and modify the Axes in the Figure through this list.
es_es: Lista de ejes en la figura. Puede acceder y modificar los ejes en la Figura a través de esta lista.

source: Do not modify the list itself. Instead, use `~Figure.add_axes`, `~.Figure.add_subplot` or `~.Figure.delaxes` to add or remove an Axes.
es_es: No modifiques la lista en sí. En su lugar, usa `~Figure.add_axes`, `~.Figure.add_subplot` o `~.Figure.delaxes` para agregar o quitar un eje.

source: Note: The `.Figure.axes` property and `~.Figure.get_axes` method are equivalent.
es_es: Nota: La propiedad `.Figure.axes` y el método `~.Figure.get_axes` son equivalentes.

source: Clear the figure -- synonym for `clf`.
es_es: Elimina la figura -- sinónimo para `clf`.

source: Clear the figure.
es_es: Elimina la figura.

source: Set *keep_observers* to True if, for example, a gui widget is tracking the Axes in the figure.
es_es: Establezca *keep_observers* en True si, por ejemplo, un widget gui está rastreando los ejes en la figura.

source: Add a colorbar to a plot.
es_es: Agregue una barra de colores a una parcela.

source: **mappable**
es_es: **mapeable**

source: The `matplotlib.cm.ScalarMappable` (i.e., `~matplotlib.image.AxesImage`, `~matplotlib.contour.ContourSet`, etc.) described by this colorbar. This argument is mandatory for the `.Figure.colorbar` method but optional for the `.pyplot.colorbar` function, which sets the default to the current image.
es_es: El `matplotlib.cm.ScalarMappable` (i.e., `~matplotlib.image.AxesImage`, `~matplotlib.contour.ContourSet`, etc.) descrito por esta barra de colores. Este argumento es obligatorio para el método `.Figure.colorbar` pero opcional para la función `.pyplot.colorbar`, que establece el valor predeterminado para la imagen actual.

source: Note that one can create a `.ScalarMappable` "on-the-fly" to generate colorbars not attached to a previously drawn artist, e.g. ::
es_es: Tenga en cuenta que uno puede crear un `.ScalarMappable` "al vuelo" para generar barras de colores no conectadas a un artista previamente dibujado, p. ej., ::

source: **cax** : `~matplotlib.axes.Axes`, optional
es_es: **cax** : `~matplotlib.axes.Axes`, opcional

source: Axes into which the colorbar will be drawn.
es_es: Ejes en los que se dibuja la barra de colores.

source: **ax** : `~matplotlib.axes.Axes`, list of Axes, optional
es_es: **ax** : `~matplotlib.axes.Axes`, lista de ejes, opcional

source: Axes, list of Axes, optional
es_es: Ejes, lista de ejes, opcional

source: One or more parent axes from which space for a new colorbar axes will be stolen, if *cax* is None. This has no effect if *cax* is set.
es_es: Uno o más ejes padre de los cuales se robará el espacio para los nuevos ejes de la barra de color, si *cax* no es ninguno. Esto no tiene efecto si *cax* está definido.

source: **use_gridspec**
es_es: **usar_gridspec**

source: If *cax* is ``None``, a new *cax* is created as an instance of Axes. If *ax* is an instance of Subplot and *use_gridspec* is ``True``, *cax* is created as an instance of Subplot using the :mod:`.gridspec` module.
es_es: Si *cax* es ``Ninguno``, se crea un nuevo *cax* como una instancia de ejes. Si *ax* es una instancia de Subplot y *use_gridspec* es ``True``, *cax* es creado como una instancia de Subplot usando el :mod:`. módulo ridspec`.

source: **colorbar** : `~matplotlib.colorbar.Colorbar`
es_es: **barra de color** : `~matplotlib.colorbar.Colorbar`

source: Colorbar
es_es: Barra de colores

source: Additional keyword arguments are of two kinds:
es_es: Los argumentos adicionales de palabras clave son de dos tipos:

source: axes properties:
es_es: propiedades de ejes:

source: location
es_es: ubicación

source: None or {'left', 'right', 'top', 'bottom'}
es_es: Ninguno o {'izquierda', 'derecha', 'arriba', 'abajo'}

source: The location, relative to the parent axes, where the colorbar axes is created. It also determines the *orientation* of the colorbar (colorbars on the left and right are vertical, colorbars at the top and bottom are horizontal). If None, the location will come from the *orientation* if it is set (vertical colorbars on the right, horizontal ones at the bottom), or default to 'right' if *orientation* is unset.
es_es: La ubicación, relativa a los ejes superiores, donde se crean los ejes de color. También determina la *orientación* de la barra de colores (las barras de colores de la izquierda y la derecha son verticales, las barras de colores de la parte superior e inferior son horizontales). Si Ninguno, la ubicación vendrá de la *orientación* si se establece (barras de color verticales a la derecha, los horizontales en la parte inferior), o por defecto a 'derecha' si la *orientación* no está definida.

source: orientation
es_es: orientación

source: None or {'vertical', 'horizontal'}
es_es: Ninguno o {'vertical', 'horizontal'}

source: The orientation of the colorbar. It is preferable to set the *location* of the colorbar, as that also determines the *orientation*; passing incompatible values for *location* and *orientation* raises an exception.
es_es: La orientación de la barra de colores. Es preferible establecer la *ubicación* de la barra de colores, ya que esto también determina la *orientación*; pasar valores incompatibles para *ubicación* y *orientación* eleva una excepción.

source: fraction
es_es: fracción

source: float, default: 0.15
es_es: float, por defecto: 0.15

source: Fraction of original axes to use for colorbar.
es_es: Fracción de los ejes originales a usar para la barra de colores.

source: shrink
es_es: reducir

source: float, default: 1.0
es_es: float, por defecto: 1.0

source: Fraction by which to multiply the size of the colorbar.
es_es: Fracción por la cual multiplicar el tamaño de la barra de color.

source: aspect
es_es: aspecto

source: float, default: 20
es_es: float, por defecto: 20

source: Ratio of long to short dimensions.
es_es: Ratio de dimensiones largas a cortas.

source: float, default: 0.05 if vertical, 0.15 if horizontal
es_es: flotante, por defecto: 0.05 si es vertical, 0.15 si es horizontal

source: Fraction of original axes between colorbar and new image axes.
es_es: Fracción de los ejes originales entre la barra de colores y los nuevos ejes de imagen.

source: anchor
es_es: ancla

source: (float, float), optional
es_es: (flotante, flotante), opcional

source: The anchor point of the colorbar axes. Defaults to (0.0, 0.5) if vertical; (0.5, 1.0) if horizontal.
es_es: El punto de anclaje de los ejes de la barra de color. Por defecto es (0.0, 0.5) si es vertical; (0.5, 1.0) si es horizontal.

source: panchor : (float, float), or *False*, optional
es_es: panchor : (flotante, flotante), o *False*, opcional

source: (float, float), or
es_es: (flotante, flotante) o

source: The anchor point of the colorbar parent axes. If *False*, the parent axes' anchor will be unchanged. Defaults to (1.0, 0.5) if vertical; (0.5, 0.0) if horizontal.
es_es: El punto de anclaje de los ejes padre de la barra de color. Si *False*, el ancla de los ejes padre no se modificará. Por defecto es (1.0, 0.5) si es vertical; (0.5, 0.0) si es horizontal.

source: colorbar properties:
es_es: propiedades de la barra de colores:

source: *extend*
es_es: *extensión*

source: {'neither', 'both', 'min', 'max'} If not 'neither', make pointed end(s) for out-of- range values. These are set for a given colormap using the colormap set_under and set_over methods.
es_es: {'ninguna de las dos cosas', 'ambos', 'min', 'max'} Si no 'ninguna de las dos, hacer punto(s) para los valores fuera de rango. Estos se establecen para un mapa de colores determinado usando los métodos set_under y set_over del mapa de colores.

source: {*None*, 'auto', length, lengths} If set to *None*, both the minimum and maximum triangular colorbar extensions with have a length of 5% of the interior colorbar length (this is the default setting). If set to 'auto', makes the triangular colorbar extensions the same lengths as the interior boxes (when *spacing* is set to 'uniform') or the same lengths as the respective adjacent interior boxes (when *spacing* is set to 'proportional'). If a scalar, indicates the length of both the minimum and maximum triangular colorbar extensions as a fraction of the interior colorbar length. A two-element sequence of fractions may also be given, indicating the lengths of the minimum and maximum colorbar extensions respectively as a fraction of the interior colorbar length.
es_es: {*Ninguno*, 'auto', longitud, longitud} Si se establece en *Ninguno*, las extensiones mínimas y máximas triangulares de color con una longitud del 5% de la longitud de la barra de color interior (esta es la configuración predeterminada). Si se establece en 'auto', hace que las extensiones de la barra de colores triangular sean las mismas longitudes que las cajas interiores (cuando *espaciamiento* está establecido en 'uniforme') o las mismas longitudes que las respectivas cajas adyacentes (cuando *espacio* se establece en 'proporcional'). Si un escalar, indica la longitud de las extensiones mínimas y máximas de la barra de color triangular como una fracción de la longitud de la barra de color interior. También se puede dar una secuencia de dos elementos, indica las longitudes de las extensiones mínimas y máximas de color respectivamente como una fracción de la longitud de la barra de colores interior.

source: *extendrect*
es_es: *extensión*

source: bool If *False* the minimum and maximum colorbar extensions will be triangular (the default). If *True* the extensions will be rectangular.
es_es: bool Si *False* las extensiones mínimas y máximas de la barra de color serán triangulares (el valor por defecto). Si *Verdadero* las extensiones serán rectangulares.

source: *spacing*
es_es: *espacio*

source: {'uniform', 'proportional'} Uniform spacing gives each discrete color the same space; proportional makes the space proportional to the data interval.
es_es: {'uniform', 'proportional'} El espaciado uniforme da a cada color discreto el mismo espacio; proporcional hace el espacio proporcional al intervalo de datos.

source: *None* or list of ticks or Locator If None, ticks are determined automatically from the input.
es_es: *nunca* o lista de ticks o localizador si ninguno de ellos, los ticks se determinan automáticamente a partir de la entrada.

source: *format*
es_es: *formato*

source: None or str or Formatter If None, `~.ticker.ScalarFormatter` is used. If a format string is given, e.g., '%.3f', that is used. An alternative `~.ticker.Formatter` may be given instead.
es_es: Ninguno o str o Formatter Si Ninguno, se utiliza `~.ticker.ScalarFormatter`. Si se da una cadena de formato, e. ., '%.3f', que está en uso. En su lugar se puede dar un `~.ticker.Formatter` alternativo.

source: *drawedges*
es_es: *dibujos*

source: bool Whether to draw lines at color boundaries.
es_es: bool Si dibujar líneas en los límites de color.

source: *label*
es_es: *etiqueta*

source: str The label on the colorbar's long axis.
es_es: str La etiqueta en el eje largo de la barra de color.

source: The following will probably be useful only in the context of indexed colors (that is, when the mappable has norm=NoNorm()), or other unusual circumstances.
es_es: Lo siguiente probablemente será útil sólo en el contexto de colores indexados (es decir, cuando el mapeable tiene norma=NoNorm()), u otras circunstancias inusuales.

source: *boundaries*
es_es: *límites*

source: None or a sequence
es_es: Ninguna o una secuencia

source: *values*
es_es: *valores*

source: None or a sequence which must be of length 1 less than the sequence of *boundaries*. For each region delimited by adjacent entries in *boundaries*, the colormapped to the corresponding value in values will be used.
es_es: Ninguno o una secuencia que debe ser de longitud 1 menos que la secuencia de *límites*. Para cada región delimitada por entradas adyacentes en *límites*, se utilizará el colormapeado al valor correspondiente en valores.

source: If *mappable* is a `~.contour.ContourSet`, its *extend* kwarg is included automatically.
es_es: Si *mappable* es un `~.contour.ContourSet`, su *extensión* kwarg se incluye automáticamente.

source: The *shrink* kwarg provides a simple way to scale the colorbar with respect to the axes. Note that if *cax* is specified, it determines the size of the colorbar and *shrink* and *aspect* kwargs are ignored.
es_es: El kwarg *encogido* proporciona una manera sencilla de escalar la barra de colores con respecto a los ejes. Tenga en cuenta que si se especifica *cax*, determina el tamaño de la barra de colores y los kwargs *encogido* y *aspecto* son ignorados.

source: For more precise control, you can manually specify the positions of the axes objects in which the mappable and the colorbar are drawn. In this case, do not use any of the axes properties kwargs.
es_es: Para un control más preciso, puede especificar manualmente las posiciones de los ejes en los que se dibuja el mapeable y la barra de colores. En este caso, no utilice ninguno de los ejes de propiedades kwargs.

source: It is known that some vector graphics viewers (svg and pdf) renders white gaps between segments of the colorbar. This is due to bugs in the viewers, not Matplotlib. As a workaround, the colorbar can be rendered with overlapping segments::
es_es: Se sabe que algunos visores vectoriales (svg y pdf) renderizan huecos blancos entre segmentos de la barra de colores. Esto se debe a errores en los espectadores, no en Matplotlib. Como un workaround, la barra de colores puede ser procesada con segmentos superpuestos::

source: However this has negative consequences in other circumstances, e.g. with semi-transparent images (alpha < 1) and colorbar extensions; therefore, this workaround is not used by default (see issue #1188).
es_es: Sin embargo, esto tiene consecuencias negativas en otras circunstancias, p. ej. con imágenes semitransparentes (alpha < 1) y extensiones de la barra de color; por lo tanto, esta solución no se utiliza por defecto (ver número 1188).

source: Test whether the mouse event occurred on the figure.
es_es: Evalúa si el evento del ratón ocurrió en la figura.

source: Convert *x* using the unit type of the xaxis.
es_es: Convierte *x* usando el tipo de unidad del xaxis.

source: If the artist is not in contained in an Axes or if the xaxis does not have units, *x* itself is returned.
es_es: Si el artista no está contenido en un hacha o si el xaxis no tiene unidades, *x* es devuelto.

source: Convert *y* using the unit type of the yaxis.
es_es: Convierte *y* usando el tipo de unidad del yaxis.

source: If the artist is not in contained in an Axes or if the yaxis does not have units, *y* itself is returned.
es_es: Si el artista no está contenido en un hacha o si el eje no tiene unidades, *y* en sí mismo es devuelto.

source: Remove the `~.axes.Axes` *ax* from the figure; update the current Axes.
es_es: Elimina el `~.axes.Axes` *ax* de la figura; actualiza los ejes actuales.

source: The resolution in dots per inch.
es_es: La resolución en puntos por pulgada.

source: Draw the Artist (and its children) using the given renderer.
es_es: Dibuja el Artist (y sus hijos) usando el renderizador dado.

source: This has no effect if the artist is not visible (`.Artist.get_visible` returns False).
es_es: Esto no tiene efecto si el artist no es visible (`.Artist.get_visible` devuelve False).

source: **renderer** : `.RendererBase` subclass.
es_es: **renderer** : `.RendererBase` subclase.

source: RendererBase subclass.
es_es: Subclase RendererBase.

source: This method is overridden in the Artist subclasses.
es_es: Este método se sobrescribe en las subclases de Artist.

source: Draw `.Artist` *a* only.
es_es: Dibujar `.Artist` *a* solamente.

source: This method can only be used after an initial draw of the figure, because that creates and caches the renderer needed here.
es_es: Este método sólo se puede utilizar después de un dibujo inicial de la figura, porque esto crea y almacena en caché el renderizador necesario aquí.

source: Draw the figure with no output. Useful to get the final size of artists that require a draw before their size is known (e.g. text).
es_es: Dibuja la figura sin salida. Útil para obtener el tamaño final de los artistas que requieren un sorteo antes de que se conozca su tamaño (por ejemplo, texto).

source: Use ``layoutgrid`` to determine pos positions within Axes.
es_es: Usa ``layoutgrid`` para determinar las posturas dentro de los ejes.

source: See also `.set_constrained_layout_pads`.
es_es: Vea también `.set_constrained_layout_pads`.

source: private debugging object
es_es: objeto de depuración privado

source: Add a non-resampled image to the figure.
es_es: Agrega una imagen no remuestreada a la figura.

source: The image is attached to the lower or upper left corner depending on *origin*.
es_es: La imagen está conectada a la esquina inferior o superior izquierda, dependiendo del *origen*.

source: The image data. This is an array of one of the following shapes:
es_es: Los datos de la imagen. Esta es una matriz de una de las siguientes formas:

source: MxN: luminance (grayscale) values
es_es: MxN: valores de luminancia (escala de grises)

source: MxNx3: RGB values
es_es: MxNx3: valores RVA

source: MxNx4: RGBA values
es_es: MxNx4: Valores RGBA

source: The *x*/*y* image offset in pixels.
es_es: El desplazamiento de imagen *x*/*y* en píxeles.

source: **alpha**
es_es: **alfa**

source: None or float
es_es: Ninguno o flotante

source: The alpha blending value.
es_es: El valor de mezcla alfa.

source: **norm** : `matplotlib.colors.Normalize`
es_es: **norma** : `matplotlib.colors.Normalize`

source: matplotlib.colors.Normalize
es_es: normalizar matplotlib.colors.

source: A `.Normalize` instance to map the luminance to the interval [0, 1].
es_es: Una instancia `.Normalize` para mapear la luminancia al intervalo [0, 1].

source: **cmap** : str or `matplotlib.colors.Colormap`, default: :rc:`image.cmap`
es_es: **cmap** : str o `matplotlib.colors.Colormap`, por defecto: :rc:`image.cmap`

source: str or
es_es: str o

source: The colormap to use.
es_es: El mapa de colores a utilizar.

source: If *norm* is not given, these values set the data limits for the colormap.
es_es: Si no se da *norma*, estos valores establecen los límites de datos para el mapa de colores.

source: **origin** : {'upper', 'lower'}, default: :rc:`image.origin`
es_es: **origin** : {'upper', 'lower'}, por defecto: :rc:`image.origin`

source: {'upper', 'lower'}, default:
es_es: {'upper', 'lower'}por defecto:

source: Indicates where the [0, 0] index of the array is in the upper left or lower left corner of the axes.
es_es: Indica dónde el índice [0, 0] de la matriz está en la esquina superior izquierda o inferior izquierda de los ejes.

source: If *True*, resize the figure to match the given image size.
es_es: Si es *True*, cambiar el tamaño de la figura para que coincida con el tamaño de la imagen dada.

source: Additional kwargs are `.Artist` kwargs passed on to `.FigureImage`.
es_es: Los kwargs adicionales son `.Artist` kwargs transmitidos a `.FigureImage`.

source: figimage complements the Axes image (`~matplotlib.axes.Axes.imshow`) which will be resampled to fit the current Axes. If you want a resampled image to fill the entire figure, you can define an `~matplotlib.axes.Axes` with extent [0, 0, 1, 1].
es_es: figimage complementa la imagen de los ejes (`~matplotlib.axes.Axes.imshow`) que será remuestreado para ajustarse a los ejes actuales. Si quieres que una imagen de nuevo muestreo llene toda la figura, puedes definir un `~matplotlib.axes.Axes` con extensión [0, 0, 1, 1].

source: Find artist objects.
es_es: Buscar objetos de artista.

source: Recursively find all `.Artist` instances contained in the artist.
es_es: Encontrar recursivamente todas las instancias `.Artist` contenidas en el artista.

source: **match**
es_es: **coincidencia**

source: A filter criterion for the matches. This can be
es_es: Un criterio de filtro para las partidas. Esto puede ser

source: *None*: Return all objects contained in artist.
es_es: *Ninguno*: Devuelve todos los objetos contenidos en el artista.

source: A function with signature ``def match(artist: Artist) -> bool``. The result will only contain artists for which the function returns *True*.
es_es: Una función con la firma ``def match(artista: Artist) -> bool``. El resultado sólo contendrá artistas para los cuales la función devuelva *True*.

source: A class instance: e.g., `.Line2D`. The result will only contain artists of this class or its subclasses (``isinstance`` check).
es_es: Una instancia de clase: p. ej., `.Line2D`. El resultado sólo contendrá artistas de esta clase o sus subclases (comprobación ``isinstance``).

source: **include_self**
es_es: **incluye_a sí mismo**

source: Include *self* in the list to be checked for a match.
es_es: Incluye *self* en la lista para ser revisado por una partida.

source: list of `.Artist`
es_es: lista de `.Artist`

source: Return a string representation of *data*.
es_es: Devuelve una representación de cadena de *datos*.
