Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/figure_api.po
Languages: es_es

source: **bbox_to_anchor** : `.BboxBase`, 2-tuple, or 4-tuple of floats
es_es: **bbox_to_anchor** : `.BboxBase`, 2-tuple, o 4-tuple de puntos flotantes (floats)

source: BboxBase, 2-tuple, or 4-tuple of floats
es_es: BboxBase, 2-tuple, o 4-tuple de puntos flotantes (floats)

source: Box that is used to position the legend in conjunction with *loc*. Defaults to `axes.bbox` (if called as a method to `.Axes.legend`) or `figure.bbox` (if `.Figure.legend`). This argument allows arbitrary placement of the legend.
es_es: Caja que se utiliza para colocar la leyenda en conjunto con *loc*. Por defecto es `axes.bbox` (si se llama como método a `. xes.legend`) o `figure.bbox` (si `.Figure.legend`). Este argumento permite la colocación arbitraria de la leyenda.

source: Bbox coordinates are interpreted in the coordinate system given by *bbox_transform*, with the default transform Axes or Figure coordinates, depending on which ``legend`` is called.
es_es: Las coordenadas de la caja se interpretan en el sistema de coordenadas dado por *bbox_transform*, con las coordenadas de transformación por defecto de los ejes o Figuras, dependiendo de qué ``leyend``.

source: If a 4-tuple or `.BboxBase` is given, then it specifies the bbox ``(x, y, width, height)`` that the legend is placed in. To put the legend in the best location in the bottom right quadrant of the axes (or figure)::
es_es: Si se da un 4-tuple o `.BboxBase`, entonces especifica el bbox ``(x, y, anchura, altura)`` en el que se coloca la leyenda. Poner la leyenda en la mejor ubicación en el cuadrante inferior derecho de los ejes (o figura)::

source: A 2-tuple ``(x, y)`` places the corner of the legend specified by *loc* at x, y. For example, to put the legend's upper right-hand corner in the center of the axes (or figure) the following keywords can be used::
es_es: Una 2-tupla ``(x, y)`` coloca la esquina de la leyenda especificada por *loc* en x, y. Por ejemplo, para colocar la esquina superior derecha de la leyenda en el centro de los ejes (o figura) se pueden utilizar las siguientes palabras clave::

source: The number of columns that the legend has.
es_es: El número de columnas que tiene la leyenda.

source: **prop** : None or `matplotlib.font_manager.FontProperties` or dict
es_es: **prop** : Ninguno o `matplotlib.font_manager.FontProperties` o dictado

source: None or
es_es: None o

source: The font properties of the legend. If None (default), the current :data:`matplotlib.rcParams` will be used.
es_es: Las propiedades de fuente de la leyenda. Si ninguna (por defecto), se utilizará el :data:actual `matplotlib.rcParams`.

source: int or {'xx-small', 'x-small', 'small', 'medium', 'large', 'x-large', 'xx-large'}
es_es: int o {'xx-small', 'x-small', 'small', 'medium', 'large', 'x-large', 'xx-large'}

source: The font size of the legend. If the value is numeric the size will be the absolute font size in points. String values are relative to the current default font size. This argument is only used if *prop* is not specified.
es_es: El tamaño de fuente de la leyenda. Si el valor es numérico el tamaño será el tamaño absoluto de la fuente en puntos. Los valores de cadena son relativos al tamaño de fuente predeterminado actual. Este argumento sólo se utiliza si *prop* no se especifica.

source: **labelcolor** : str or list, default: :rc:`legend.labelcolor`
es_es: **labelcolor** : str o lista, por defecto: :rc:`legend.labelcolor`

source: str or list, default:
es_es: str o lista, por defecto:

source: The color of the text in the legend. Either a valid color string (for example, 'red'), or a list of color strings. The labelcolor can also be made to match the color of the line or marker using 'linecolor', 'markerfacecolor' (or 'mfc'), or 'markeredgecolor' (or 'mec').
es_es: El color del texto en la leyenda. Una cadena de color válida (por ejemplo, 'rojo'), o una lista de cadenas de colores. El color de la etiqueta también puede ser hecho para que coincida con el color de la línea o marcador usando 'color lineal', 'color marcador' (o 'mfc'), o 'color marcador' (o 'mec').

source: Labelcolor can be set globally using :rc:`legend.labelcolor`. If None, use :rc:`text.color`.
es_es: El color de etiqueta puede establecerse globalmente usando :rc:`legend.labelcolor`. Si no, utilice :rc:`text.color`.

source: **numpoints** : int, default: :rc:`legend.numpoints`
es_es: **numpoints** : int, por defecto: :rc:`legend.numpoints`

source: int, default:
es_es: int, por defecto:

source: The number of marker points in the legend when creating a legend entry for a `.Line2D` (line).
es_es: El número de puntos de marcador en la leyenda al crear una entrada de leyenda para un `.Line2D` (línea).

source: **scatterpoints** : int, default: :rc:`legend.scatterpoints`
es_es: **scatterpoints** : int, por defecto: :rc:`legend.scatterpoints`

source: The number of marker points in the legend when creating a legend entry for a `.PathCollection` (scatter plot).
es_es: El número de puntos marcadores en la leyenda cuando se crea una entrada de leyenda para un `.PathCollection` (diagrama de dispersión).

source: **scatteryoffsets** : iterable of floats, default: ``[0.375, 0.5, 0.3125]``
es_es: **scatteryoffsets** : iterable de flotantes, por defecto: ``[0.375, 0.5, 0.3125]``

source: iterable of floats, default:
es_es: iterable de flotantes, por defecto:

source: The vertical offset (relative to the font size) for the markers created for a scatter plot legend entry. 0.0 is at the base the legend text, and 1.0 is at the top. To draw all markers at the same height, set to ``[0.5]``.
es_es: El desplazamiento vertical (relativo al tamaño de la fuente) para los marcadores creados para una entrada de leyenda de diapositivas scatter. está en la base del texto de la leyenda, y 1.0 está en la parte superior. Para dibujar todos los marcadores a la misma altura, ajusta a ``[0.5]``.

source: **markerscale** : float, default: :rc:`legend.markerscale`
es_es: **markerscale** : float, por defecto: :rc:`legend.markerscale`

source: The relative size of legend markers compared with the originally drawn ones.
es_es: El tamaño relativo de los marcadores de leyenda en comparación con los originalmente dibujados.

source: If *True*, legend marker is placed to the left of the legend label. If *False*, legend marker is placed to the right of the legend label.
es_es: Si *Verdadero*, el marcador de leyenda se coloca a la izquierda de la etiqueta de leyenda. Si *False*, el marcador de leyenda se coloca a la derecha de la etiqueta de la leyenda.

source: **frameon** : bool, default: :rc:`legend.frameon`
es_es: **frameon** : bool, por defecto: :rc:`legend.frameon`

source: Whether the legend should be drawn on a patch (frame).
es_es: Si la leyenda debe ser dibujada en un parche (fotograma).

source: Whether round edges should be enabled around the `.FancyBboxPatch` which makes up the legend's background.
es_es: Si los bordes redondos deben estar habilitados alrededor del `.FancyBboxPatch` que forma el fondo de la leyenda.

source: Whether to draw a shadow behind the legend.
es_es: Dibujar una sombra detrás de la leyenda.

source: **framealpha** : float, default: :rc:`legend.framealpha`
es_es: **framealpha** : float, por defecto: :rc:`legend.framealpha`

source: The alpha transparency of the legend's background. If *shadow* is activated and *framealpha* is ``None``, the default value is ignored.
es_es: La transparencia alfa del fondo de la leyenda. Si *sombra* está activado y *framealpha* es ``Ninguno``, el valor por defecto es ignorado.

source: **facecolor** : "inherit" or color, default: :rc:`legend.facecolor`
es_es: **facecolor** : "hereda" o color, por defecto: :rc:`legend.facecolor`

source: "inherit" or color, default:
es_es: "hereda" o color, por defecto:

source: The legend's background color. If ``"inherit"``, use :rc:`axes.facecolor`.
es_es: Color de fondo de la leyenda. Si es ``"hereda"``, usa :rc:`axes.facecolor`.

source: **edgecolor** : "inherit" or color, default: :rc:`legend.edgecolor`
es_es: **edgecolor** : "hereda" o color, por defecto: :rc:`legend.edgecolor`

source: The legend's background patch edge color. If ``"inherit"``, use take :rc:`axes.edgecolor`.
es_es: Color del borde del parche de fondo de la leyenda. Si es ``"heredad"``, usa tomar :rc:`axes.edgecolor`.

source: {"expand", None}
es_es: {"expandido" (expandido)}

source: If *mode* is set to ``"expand"`` the legend will be horizontally expanded to fill the axes area (or *bbox_to_anchor* if defines the legend's size).
es_es: Si *mode* está establecido en ``"ampliar"`` la leyenda se expandirá horizontalmente para llenar el área de los ejes (o *bbox_to_anchor* si define el tamaño de la leyenda).

source: **bbox_transform** : None or `matplotlib.transforms.Transform`
es_es: **bbox_transform** : None o `matplotlib.transforms.Transform`

source: The transform for the bounding box (*bbox_to_anchor*). For a value of ``None`` (default) the Axes' :data:`~matplotlib.axes.Axes.transAxes` transform will be used.
es_es: La transformación para la caja de límites (*bbox_to_anchor*). Para un valor de ``Ninguno`` (por defecto) se usarán los ejes :data:`~matplotlib.axes.Axes.transAxes` transformación.

source: **title**
es_es: **título**

source: str or None
es_es: str o None

source: The legend's title. Default is no title (``None``).
es_es: Título de la leyenda. Por defecto no es ningún título (``Ninguno``).

source: **title_fontproperties** : None or `matplotlib.font_manager.FontProperties` or dict
es_es: **title_fontproperties** : Ninguno o `matplotlib.font_manager.FontProperties` o dictado

source: The font properties of the legend's title. If None (default), the *title_fontsize* argument will be used if present; if *title_fontsize* is also None, the current :rc:`legend.title_fontsize` will be used.
es_es: Las propiedades de la fuente del título de la leyenda. Si Ninguno (predeterminado), se utilizará el argumento *title_fontsize* si está presente; si *title_fontsize* también es Ninguno, se usará el :rc:`legend.title_fontsize` actual.

source: **title_fontsize** : int or {'xx-small', 'x-small', 'small', 'medium', 'large', 'x-large', 'xx-large'}, default: :rc:`legend.title_fontsize`
es_es: **title_fontsize** : int o {'xx-small', 'x-small', 'small', 'medium', 'large', 'x-large', 'xx-large'}, por defecto: :rc:`legend.title_fontsize`

source: int or {'xx-small', 'x-small', 'small', 'medium', 'large', 'x-large', 'xx-large'}, default:
es_es: int o {'xx-small', 'x-small', 'small', 'medium', 'large', 'x-large', 'xx-large'}, por defecto:

source: The font size of the legend's title. Note: This cannot be combined with *title_fontproperties*. If you want to set the fontsize alongside other font properties, use the *size* parameter in *title_fontproperties*.
es_es: El tamaño de la fuente del título de la leyenda. Nota: Esto no puede combinarse con *title_fontproperties*. Si desea establecer el tamaño de la fuente junto con otras propiedades de la fuente, utilice el parámetro *size* en *title_fontproperties*.

source: **borderpad** : float, default: :rc:`legend.borderpad`
es_es: **borderpad** : float, por defecto: :rc:`legend.borderpad`

source: The fractional whitespace inside the legend border, in font-size units.
es_es: El espacio en blanco fraccional dentro del borde de la leyenda, en unidades de tamaño de fuente.

source: **labelspacing** : float, default: :rc:`legend.labelspacing`
es_es: **espacio de etiquetas** : flotante, por defecto: :rc:`legend.labelspacing`

source: The vertical space between the legend entries, in font-size units.
es_es: El espacio vertical entre las entradas de la leyenda, en unidades de tamaño fuente.

source: **handlelength** : float, default: :rc:`legend.handlelength`
es_es: **handlelength** : float, por defecto: :rc:`legend.handlelength`

source: The length of the legend handles, in font-size units.
es_es: La longitud de la leyenda se mantiene, en unidades de tamaño de fuente.

source: **handleheight** : float, default: :rc:`legend.handleheight`
es_es: **handleheight** : float, por defecto: :rc:`legend.handleheight`

source: The height of the legend handles, in font-size units.
es_es: La altura de la leyenda se mantiene, en unidades de tamaño fuente.

source: **handletextpad** : float, default: :rc:`legend.handletextpad`
es_es: **handletextpad** : float, por defecto: :rc:`legend.handletextpad`

source: The pad between the legend handle and text, in font-size units.
es_es: La almohadilla entre el manejador de la leyenda y el texto, en unidades de tamaño de fuente.

source: **borderaxespad** : float, default: :rc:`legend.borderaxespad`
es_es: **borderaxespad** : float, predeterminado: :rc:`legend.borderaxespad`

source: The pad between the axes and legend border, in font-size units.
es_es: La almohadilla entre los ejes y el borde de la leyenda, en unidades de tamaño fuente.

source: **columnspacing** : float, default: :rc:`legend.columnspacing`
es_es: **columnspacing** : float, por defecto: :rc:`legend.columnspacing`

source: The spacing between columns, in font-size units.
es_es: El espacio entre columnas, en unidades de tamaño de fuente.

source: dict or None
es_es: dict o None

source: Some artists are not supported by this function. See :doc:`/tutorials/intermediate/legend_guide` for details.
es_es: Algunos artistas no son soportados por esta función. Vea :doc:`/tutorials/intermediate/legend_guide` para más detalles.

source: If this property is set to *True*, the artist will be queried for custom context information when the mouse cursor moves over it.
es_es: Si esta propiedad está establecida a *True*, el artist será consultado para obtener información de contexto personalizada cuando el cursor del ratón se mueva sobre él.

source: See also :meth:`get_cursor_data`, :class:`.ToolCursorPosition` and :class:`.NavigationToolbar2`.
es_es: Vea también :meth:`get_cursor_data`, :class:`.ToolCursorPosition` y :class:`.NavigationToolbar2`.

source: Call all of the registered callbacks.
es_es: Llama a todos los callbacks registrados.

source: This function is triggered internally when a property is changed.
es_es: Esta función se activa internamente cuando se cambia una propiedad.

source: Process a pick event.
es_es: Procesar un evento de selección.

source: Each child artist will fire a pick event if *mouseevent* is over the artist and the artist has picker set.
es_es: Cada artista infantil lanzará un evento de elegir si *mouseevent* ha terminado el artista y el artista ha seleccionado el selector de objetos.

source: Return whether the artist is pickable.
es_es: Devuelve si el artist es seleccionable.

source: Return a dictionary of all the properties of the artist.
es_es: Devuelve un diccionario con todas las propiedades del artist.

source: Remove the artist from the figure if possible.
es_es: Quite al artista de la figura si es posible.

source: The effect will not be visible until the figure is redrawn, e.g., with `.FigureCanvasBase.draw_idle`. Call `~.axes.Axes.relim` to update the axes limits if desired.
es_es: El efecto no será visible hasta que la figura sea redibujada, por ejemplo, con `.FigureCanvasBase.draw_idle`. Llame `~.axes.Axes.relim` para actualizar los límites de ejes si lo desea.

source: Note: `~.axes.Axes.relim` will not see collections even if the collection was added to the axes with *autolim* = True.
es_es: Nota: `~.axes.Axes.relim` no verá colecciones incluso si la colección fue añadida a los ejes con *autolim* = True.

source: Note: there is no support for removing the artist's legend entry.
es_es: Nota: no hay soporte para eliminar la entrada de la leyenda del artista.

source: Remove a callback based on its observer id.
es_es: Eliminar una devolución de llamada basada en su id de observador.

source: Save the current figure.
es_es: Guardar la figura actual.

source: Call signature::
es_es: Firma de llamada::

source: The available output formats depend on the backend being used.
es_es: Los formatos de salida disponibles dependen del backend que se utilice.

source: str or path-like or binary file-like
es_es: str o como ruta o archivo binario

source: A path, or a Python file-like object, or possibly some backend-dependent object such as `matplotlib.backends.backend_pdf.PdfPages`.
es_es: Una ruta, o un objeto tipo archivo Python, o posiblemente algún objeto dependiente del backend como `matplotlib.backends.backend_pdf.PdfPages`.

source: If *format* is set, it determines the output format, and the file is saved as *fname*. Note that *fname* is used verbatim, and there is no attempt to make the extension, if any, of *fname* match *format*, and no extension is appended.
es_es: Si se establece *formato*, determina el formato de salida, y el archivo se guarda como *fname*. Ten en cuenta que *fname* se usa literalmente, y no hay intento de hacer la extensión, si existe, de *fname* coincide con *format*, y no se añade ninguna extensión.

source: If *format* is not set, then the format is inferred from the extension of *fname*, if there is one. If *format* is not set and *fname* has no extension, then the file is saved with :rc:`savefig.format` and the appropriate extension is appended to *fname*.
es_es: Si no se establece *formato*, el formato se inferirá de la extensión de *fname*, si hay uno. Si *format* no está establecido y *fname* no tiene extensión, entonces el archivo se guarda con :rc:`savefig. ormat` y la extensión apropiada se añade a *fname*.

source: **dpi** : float or 'figure', default: :rc:`savefig.dpi`
es_es: **dpi** : float o 'figure', por defecto: :rc:`savefig.dpi`

source: float or 'figure', default:
es_es: flotante o 'figura', por defecto:

source: The resolution in dots per inch. If 'figure', use the figure's dpi value.
es_es: La resolución en puntos por pulgada. Si es 'figura', utilice el valor dpi de la figura.

source: **format**
es_es: **formato**

source: The file format, e.g. 'png', 'pdf', 'svg', ... The behavior when this is unset is documented under *fname*.
es_es: El formato de archivo, p. ej., 'png', 'pdf', 'svg', ... El comportamiento cuando no está configurado está documentado bajo *fname*.

source: **metadata**
es_es: **metadatos**

source: Key/value pairs to store in the image metadata. The supported keys and defaults depend on the image format and backend:
es_es: Pares clave/valor para almacenar en los metadatos de la imagen. Las claves y valores por defecto compatibles dependen del formato de la imagen y del backend:

source: 'png' with Agg backend: See the parameter ``metadata`` of `~.FigureCanvasAgg.print_png`.
es_es: 'png' con el backend Agg: Vea el parámetro ``metadata`` de `~.FigureCanvasAgg.print_png`.

source: 'pdf' with pdf backend: See the parameter ``metadata`` of `~.backend_pdf.PdfPages`.
es_es: 'pdf' con el backend de pdf: Vea el parámetro ``metadata`` de `~.backend_pdf.PdfPages`.

source: 'svg' with svg backend: See the parameter ``metadata`` of `~.FigureCanvasSVG.print_svg`.
es_es: 'svg' con svg backend: Vea el parámetro ``metadata`` de `~.FigureCanvasSVG.print_svg`.

source: 'eps' and 'ps' with PS backend: Only 'Creator' is supported.
es_es: 'eps' y 'ps' con el backend PS: sólo 'Creador' es compatible.

source: **bbox_inches** : str or `.Bbox`, default: :rc:`savefig.bbox`
es_es: **bbox_inches** : str o `.Bbox`, por defecto: :rc:`savefig.bbox`

source: Bounding box in inches: only the given portion of the figure is saved. If 'tight', try to figure out the tight bbox of the figure.
es_es: Cuadro delimitador en pulgadas: sólo se guarda la porción dada de la figura. Si 'tight', trate de averiguar la caja apretada de la figura.

source: **pad_inches** : float, default: :rc:`savefig.pad_inches`
es_es: **pad_inches** : float, por defecto: :rc:`savefig.pad_inches`

source: Amount of padding around the figure when bbox_inches is 'tight'.
es_es: Cantidad de relleno alrededor de la figura cuando bbox_inches es 'apretado'.

source: **facecolor** : color or 'auto', default: :rc:`savefig.facecolor`
es_es: **facecolor** : color o 'auto', por defecto: :rc:`savefig.facecolor`

source: color or 'auto', default:
es_es: color o 'auto', por defecto:

source: The facecolor of the figure. If 'auto', use the current figure facecolor.
es_es: El color de cara de la figura. Si 'auto', use el color de la figura actual.

source: The edgecolor of the figure. If 'auto', use the current figure edgecolor.
es_es: El color del borde de la figura. Si 'auto', utilice el color de la figura actual.

source: str, optional
es_es: str, opcional

source: Use a non-default backend to render the file, e.g. to render a png file with the "cairo" backend rather than the default "agg", or a pdf file with the "pgf" backend rather than the default "pdf". Note that the default backend is normally sufficient. See :ref:`the-builtin-backends` for a list of valid backends for each file format. Custom backends can be referenced as "module://...".
es_es: Utilice un backend no predeterminado para renderizar el archivo, p.ej. para renderizar un archivo png con el "cairo" backend en lugar de la "agg" predeterminada o un archivo pdf con el backend "pgf" en lugar del predeterminado "pdf". Tenga en cuenta que el backend por defecto normalmente es suficiente. Vea :ref:`the-builtin-backends` para una lista de backends válidos para cada formato de archivo. Los backends personalizados pueden ser referenciados como "module://...".

source: **orientation**
es_es: **orientación**

source: Currently only supported by the postscript backend.
es_es: Actualmente sólo está soportado por el backend postscript.

source: **papertype**
es_es: **Tipo de papel**

source: One of 'letter', 'legal', 'executive', 'ledger', 'a0' through 'a10', 'b0' through 'b10'. Only supported for postscript output.
es_es: Uno de 'letter', 'legal', 'executive', 'ledger', 'a0' a 'a10', 'b0' a 'b10'. Sólo soportado para la salida postscript.

source: **transparent**
es_es: **transparente**

source: If *True*, the Axes patches will all be transparent; the Figure patch will also be transparent unless *facecolor* and/or *edgecolor* are specified via kwargs.
es_es: Si es *Verdadero*, los parches de ejes serán transparentes; el parche Figura también será transparente a menos que se especifique *color cara* y/o *borde*.

source: If *False* has no effect and the color of the Axes and Figure patches are unchanged (unless the Figure patch is specified via the *facecolor* and/or *edgecolor* keyword arguments in which case those colors are used).
es_es: Si *False* no tiene efecto y el color de los parches de Ejes y Figuras no se modificará (a menos que el parche Figura se especifique a través de los argumentos de palabra clave *cara* y/o *color* en cuyo caso se usarán esos colores).

source: The transparency of these patches will be restored to their original values upon exit of this function.
es_es: La transparencia de estos parches será restaurada a sus valores originales al salir de esta función.

source: This is useful, for example, for displaying a plot on top of a colored background on a web page.
es_es: Esto es útil, por ejemplo, para mostrar una trama encima de un fondo de color en una página web.

source: **bbox_extra_artists** : list of `~matplotlib.artist.Artist`, optional
es_es: **bbox_extra_artistas** : lista de `~matplotlib.artist.Artist`, opcional

source: A list of extra artists that will be considered when the tight bbox is calculated.
es_es: Una lista de artistas adicionales que se considerarán cuando se calcule la caja ajustada.

source: Additional keyword arguments that are passed to `PIL.Image.Image.save` when saving the figure.
es_es: Argumentos adicionales de palabras clave que se pasan a `PIL.Image.save` al guardar la figura.

source: Set the current Axes to be *a* and return *a*.
es_es: Establece los ejes actuales para ser *a* y devolver *a*.
