Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/font_manager_api.po
Languages: es_es

source: A module for finding, managing, and using fonts across platforms.
es_es: Un módulo para encontrar, administrar y usar fuentes entre plataformas.

source: This module provides a single `FontManager` instance that can be shared across backends and platforms. The `findfont` function returns the best TrueType (TTF) font file in the local or system font path that matches the specified `FontProperties` instance. The `FontManager` also handles Adobe Font Metrics (AFM) font files for use by the PostScript backend.
es_es: Este módulo proporciona una única instancia de `FontManager` que puede ser compartida entre plataformas y backends. La función `findfont` devuelve el mejor archivo de fuentes TrueType (TTF) en la ruta de fuente local o del sistema que coincida con la instancia especificada `FontProperties`. El `FontManager` también maneja los archivos de fuente de Adobe Font Metrics (AFM) para su uso en el backend de PostScript.

source: The design is based on the `W3C Cascading Style Sheet, Level 1 (CSS1) font specification <http://www.w3.org/TR/1998/REC-CSS2-19980512/>`_. Future versions may implement the Level 2 or 2.1 specifications.
es_es: El diseño está basado en la `hoja de estilo en cascada W3C, especificación de tipo de letra Nivel 1, Nivel 1, <http://www.w3.org/TR/1998/REC-CSS2-19980512/>`_. Las versiones futuras pueden implementar las especificaciones de nivel 2 o 2.1.

source: On import, the `FontManager` singleton instance creates a list of ttf and afm fonts and caches their `FontProperties`. The `FontManager.findfont` method does a nearest neighbor search to find the font that most closely matches the specification. If no good enough match is found, the default font is returned.
es_es: Al importar, el singleton `FontManager` crea una lista de fuentes ttf y afm y almacena en caché su `FontProperties`. El `FontManager. el método indfont` hace una búsqueda vecina más cercana para encontrar la fuente más cercana a la especificación. Si no se encuentra suficiente coincidencia, se devuelve la fuente predeterminada.

source: Cache the properties of the font at *path* to make it available to the `FontManager`. The type of font is inferred from the path suffix.
es_es: Almacena las propiedades de la fuente en *ruta* para que esté disponible en el `FontManager`. El tipo de fuente es inferior desde el sufijo de la ruta.

source: Parameters
es_es: Parámetros

source: **path**
es_es: **ruta**

source: str or path-like
es_es: str o como ruta

source: Find a font that most closely matches the given font properties.
es_es: Encuentre una fuente que coincida más estrechamente con las propiedades de fuentes dadas.

source: **prop** : str or `~matplotlib.font_manager.FontProperties`
es_es: **prop** : str o `~matplotlib.font_manager.FontProperties`

source: str or
es_es: str o

source: The font properties to search for. This can be either a `.FontProperties` object or a string defining a `fontconfig patterns`_.
es_es: Las propiedades de fuente a buscar. Esto puede ser un objeto `.FontProperties` o una cadena que defina los patrones `fontconfig`_.

source: **fontext**
es_es: **fuente**

source: {'ttf', 'afm'}, default: 'ttf'
es_es: {'ttf', 'afm'}por defecto: 'ttf'

source: The extension of the font file:
es_es: La extensión del archivo de fuente:

source: 'afm': Adobe Font Metrics (.afm)
es_es: 'afm': métricas de fuente de Adobe (.afm)

source: **directory**
es_es: **Directorio**

source: str, optional
es_es: str, opcional

source: If given, only search this directory and its subdirectories.
es_es: Si es dado, sólo busque este directorio y sus subdirectorios.

source: If True, will fallback to the default font family (usually "DejaVu Sans" or "Helvetica") if the first lookup hard-fails.
es_es: Si es verdadero, se retornará a la familia de fuentes por defecto (generalmente "DejaVu Sans" o "Helvetica") si la primera búsqueda falla.

source: **rebuild_if_missing**
es_es: **reconstruir_if_falta**

source: Whether to rebuild the font cache and search again if the first match appears to point to a nonexisting font (i.e., the font cache contains outdated entries).
es_es: Si reconstruir la caché de fuentes y buscar de nuevo si la primera coincidencia parece apuntar a una fuente no existente (i. ., la caché de fuentes contiene entradas desactualizadas).

source: Returns
es_es: Devuelve

source: The filename of the best matching font.
es_es: El nombre de archivo de la fuente más coincidente.

source: This performs a nearest neighbor search. Each font is given a similarity score to the target font properties. The first font with the highest score is returned. If no matches below a certain threshold are found, the default font (usually DejaVu Sans) is returned.
es_es: Esto realiza una búsqueda vecina más cercana. Cada fuente recibe una puntuación de similitud con las propiedades de la fuente objetivo. Se devuelve la primera fuente con la puntuación más alta. Si no se encuentran coincidencias por debajo de un determinado umbral, se retornará la fuente por defecto (normalmente DejaVu Sans).

source: The result is cached, so subsequent lookups don't have to perform the O(n) nearest neighbor search.
es_es: El resultado se almacena en caché, por lo que las búsquedas posteriores no tienen que realizar la búsqueda de vecino o(n) más cercana.

source: See the `W3C Cascading Style Sheet, Level 1 <http://www.w3.org/TR/1998/REC-CSS2-19980512/>`_ documentation for a description of the font finding algorithm.
es_es: Vea la `Hoja de Estilo en Cascading W3C, documentación de nivel 1 <http://www.w3.org/TR/1998/REC-CSS2-19980512/>`_ para una descripción del algoritmo de búsqueda de fuentes.

source: Return the default font size.
es_es: Devuelve el tamaño de fuente predeterminado.

source: Return the default font weight.
es_es: Devuelve el peso predeterminado de la fuente.

source: Return a match score between the list of font families in *families* and the font family name *family2*.
es_es: Devuelve una partitura entre la lista de familias de fuentes en *familias* y el nombre de la familia de fuentes *familia2*.

source: An exact match at the head of the list returns 0.0.
es_es: Una coincidencia exacta en la cabeza de la lista devuelve 0.0.

source: A match further down the list will return between 0 and 1.
es_es: Una partida más abajo de la lista regresará entre 0 y 1.

source: No match will return 1.0.
es_es: Ningún partido devolverá 1.0.

source: Return a match score between *size1* and *size2*.
es_es: Devuelve una puntuación entre *size1* y *size2*.

source: If *size2* (the size specified in the font file) is 'scalable', this function always returns 0.0, since any font size can be generated.
es_es: Si *size2* (el tamaño especificado en el archivo de fuente) es 'escalable', esta función siempre devuelve 0.0, ya que cualquier tamaño de fuente puede ser generado.

source: Otherwise, the result is the absolute distance between *size1* and *size2*, normalized so that the usual range of font sizes (6pt - 72pt) will lie between 0.0 and 1.0.
es_es: De lo contrario, el resultado es la distancia absoluta entre *size1* y *size2*, normalizado para que el rango habitual de tamaños de fuentes (6pt - 72pt) esté entre 0. y 1.0.

source: Return a match score between *stretch1* and *stretch2*.
es_es: Devuelve una puntuación de partida entre *stretch1* y *stretch2*.

source: The result is the absolute value of the difference between the CSS numeric values of *stretch1* and *stretch2*, normalized between 0.0 and 1.0.
es_es: El resultado es el valor absoluto de la diferencia entre los valores numéricos CSS de *stretch1* y *stretch2*, normalizado entre 0.0 y 1.0.

source: Return a match score between *style1* and *style2*.
es_es: Devuelve una puntuación entre *style1* y *style2*.

source: An exact match returns 0.0.
es_es: Una coincidencia exacta devuelve 0.0.

source: A match between 'italic' and 'oblique' returns 0.1.
es_es: Un partido entre 'italic' y 'oblique' devuelve 0.1.

source: No match returns 1.0.
es_es: Ningún partido devuelve 1.0.

source: Return a match score between *variant1* and *variant2*.
es_es: Devuelve una puntuación entre *variant1* y *variant2*.

source: An exact match returns 0.0, otherwise 1.0.
es_es: Una coincidencia exacta devuelve 0.0, de lo contrario 1.0.

source: Return a match score between *weight1* and *weight2*.
es_es: Devuelve una puntuación entre *peso1* y *peso2*.

source: The result is 0.0 if both weight1 and weight 2 are given as strings and have the same value.
es_es: El resultado es 0.0 si tanto el peso 1 como el peso 2 se dan como cadenas y tienen el mismo valor.

source: Otherwise, the result is the absolute value of the difference between the CSS numeric values of *weight1* and *weight2*, normalized between 0.05 and 1.0.
es_es: De lo contrario, el resultado es el valor absoluto de la diferencia entre los valores numéricos CSS de *weight1* y *weight2*, normalizado entre 0.05 y 1.0.

source: Set the default font weight. The initial value is 'normal'.
es_es: Establece el peso predeterminado. El valor inicial es 'normal'.

source: A class for storing and manipulating font properties.
es_es: Una clase para almacenar y manipular las propiedades de las fuentes.

source: The font properties are the six properties described in the `W3C Cascading Style Sheet, Level 1 <http://www.w3.org/TR/1998/REC-CSS2-19980512/>`_ font specification and *math_fontfamily* for math fonts:
es_es: Las propiedades de las fuentes son las seis propiedades descritas en la hoja de estilo en cascada `W3C, especificación de tipo de letra Nivel 1 <http://www.w3.org/TR/1998/REC-CSS2-19980512/>`_ y *math_fontfamily* para fuentes matemáticas:

source: family: A list of font names in decreasing order of priority. The items may include a generic font family name, either 'sans-serif' (default), 'serif', 'cursive', 'fantasy', or 'monospace'. In that case, the actual font to be used will be looked up from the associated rcParam.
es_es: familia: Una lista de nombres de fuentes en orden decreciente de prioridad. Los elementos pueden incluir un nombre de familia genérico de fuente, ya sea 'sans-serif' (por defecto), 'serif', 'cursive', 'fantasy', o 'monospace'. En ese caso, la fuente real a usar será buscada desde el rcParam asociado.

source: style: Either 'normal' (default), 'italic' or 'oblique'.
es_es: style: Ya sea 'normal' (por defecto), 'italic' o 'oblique'.

source: variant: Either 'normal' (default) or 'small-caps'.
es_es: : O bien 'normal' (por defecto) o 'small-caps'.

source: stretch: A numeric value in the range 0-1000 or one of 'ultra-condensed', 'extra-condensed', 'condensed', 'semi-condensed', 'normal' (default), 'semi-expanded', 'expanded', 'extra-expanded' or 'ultra-expanded'.
es_es: stretch: Un valor numérico en el rango 0-1000 o uno de 'ultracondensado', 'extra-condensado', 'condensado', 'semi-condensado', 'normal' (por defecto), 'semi-expandido', 'expandido', 'extra-ampliado' o 'ultra ampliado'.

source: weight: A numeric value in the range 0-1000 or one of 'ultralight', 'light', 'normal' (default), 'regular', 'book', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'.
es_es: peso: Un valor numérico en el rango 0-1000 o uno de 'ultralight', 'light', 'normal' (por defecto), 'regular', 'libro', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'.

source: size: Either an relative value of 'xx-small', 'x-small', 'small', 'medium', 'large', 'x-large', 'xx-large' or an absolute font size, e.g., 10 (default).
es_es: size: Un valor relativo de 'xx-small', 'x-small', 'small', 'medium', 'large', 'x-large', 'xx-large', 'xx-large' o un tamaño de fuente absoluto, por ejemplo, 10 (por defecto).

source: math_fontfamily: The family of fonts used to render math text; overrides :rc:`mathtext.fontset`. Supported values are the same as the ones supported by :rc:`mathtext.fontset`: 'dejavusans', 'dejavuserif', 'cm', 'stix', 'stixsans' and 'custom'.
es_es: math_fontfamily: La familia de fuentes utilizadas para renderizar texto matemático; anula :rc:`mathtext.fontset`. Los valores soportados son los mismos que los soportados por :rc:`mathtext.fontset`: 'dejavusans', 'dejavuserif', 'cm', 'stix', 'stixsans' y 'custom'.

source: Alternatively, a font may be specified using the absolute path to a font file, by using the *fname* kwarg. However, in this case, it is typically simpler to just pass the path (as a `pathlib.Path`, not a `str`) to the *font* kwarg of the `.Text` object.
es_es: Alternativamente, una fuente puede ser especificada usando la ruta absoluta a un archivo de fuente, usando el kwarg. Sin embargo, en este caso, es típicamente más simple pasar el camino (como un `pathlib. ath`, no un `str`) al kwarg *font* del objeto `.Text`.

source: The preferred usage of font sizes is to use the relative values, e.g., 'large', instead of absolute font sizes, e.g., 12. This approach allows all text sizes to be made larger or smaller based on the font manager's default font size.
es_es: El uso preferido de los tamaños de las fuentes es utilizar los valores relativos, por ejemplo, 'grande', en lugar de tamaños absolutos de las fuentes, p. ej. 12. Este enfoque permite que todos los tamaños de texto sean mayores o más pequeños basándose en el tamaño de fuente por defecto del gestor de fuentes.

source: This class will also accept a fontconfig_ pattern_, if it is the only argument provided. This support does not depend on fontconfig; we are merely borrowing its pattern syntax for use here.
es_es: Esta clase también aceptará un patrón_fontconfig_ si es el único argumento proporcionado. Este soporte no depende de fontconfig; estamos simplemente tomando prestada su sintaxis de patrones para su uso aquí.

source: Note that Matplotlib's internal font manager and fontconfig use a different algorithm to lookup fonts, so the results of the same pattern may be different in Matplotlib than in other applications that use fontconfig.
es_es: Tenga en cuenta que el gestor interno de fuentes y la configuración de fuentes de Matplotlib's usan un algoritmo diferente para buscar fuentes, por lo que los resultados del mismo patrón pueden ser diferentes en Matplotlib que en otras aplicaciones que usan fontconfig.

source: Return a copy of self.
es_es: Devuelve una copia de sí mismo.

source: Return a list of font names that comprise the font family.
es_es: Devuelve una lista de nombres de fuentes que componen la familia de fuentes.

source: Return the filename of the associated font.
es_es: Devuelve el nombre del archivo de la fuente asociada.

source: Get a fontconfig_ pattern_ suitable for looking up the font as specified with fontconfig's ``fc-match`` utility.
es_es: Obtener un patrón fontconfig_ adecuado para buscar la fuente como se especifica con la utilidad ``fc-match`` de fontconfig.

source: This support does not depend on fontconfig; we are merely borrowing its pattern syntax for use here.
es_es: Este soporte no depende de fontconfig; estamos simplemente tomando prestada su sintaxis de patrones para su uso aquí.

source: Return the name of the font family used for math text.
es_es: Devuelve el nombre de la familia de fuentes usada para el texto matemático.

source: The default font is :rc:`mathtext.fontset`.
es_es: La fuente predeterminada es :rc:`mathtext.fontset`.

source: Return the name of the font that best matches the font properties.
es_es: Devuelve el nombre de la fuente que mejor coincida con las propiedades de la fuente.

source: Return the font size.
es_es: Devuelve el tamaño de la fuente.

source: Return the font style. Values are: 'normal', 'italic' or 'oblique'.
es_es: Devuelve el estilo de fuente. Los valores son: 'normal', 'italic' o 'oblique'.

source: Return the font stretch or width. Options are: 'ultra-condensed', 'extra-condensed', 'condensed', 'semi-condensed', 'normal', 'semi-expanded', 'expanded', 'extra-expanded', 'ultra-expanded'.
es_es: Devuelve el flujo de fuentes o ancho. Las opciones son: 'ultra-condensado', 'extra-condensado', 'condensado', 'semi-condensado', 'normal', 'semi-ampliado', 'expandido', 'extra-expandido', 'ultra-desarrollado'.

source: Return the font variant. Values are: 'normal' or 'small-caps'.
es_es: Devuelve la variante de la fuente. Los valores son: 'normal' o 'minúsculas'.

source: Set the font weight. Options are: A numeric value in the range 0-1000 or one of 'light', 'normal', 'regular', 'book', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'
es_es: Establecer el peso de la fuente. Las opciones son: un valor numérico en el rango 0-1000 o uno de 'claro', 'normal', 'regular', 'libro', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'

source: Change the font family. May be either an alias (generic name is CSS parlance), such as: 'serif', 'sans-serif', 'cursive', 'fantasy', or 'monospace', a real font name or a list of real font names. Real font names are not supported when :rc:`text.usetex` is `True`.
es_es: Cambiar la familia de fuentes. Puede ser un alias (nombre genérico es la sala CSS), tales como: 'serif', 'sans-serif', 'cursive', 'fantasy', o 'monospace', un nombre de fuente real o una lista de nombres de fuentes reales. Los nombres de fuentes reales no son compatibles cuando :rc:`text.usetex` es `True`.

source: Set the filename of the fontfile to use. In this case, all other properties will be ignored.
es_es: Establezca el nombre del archivo de fuente a utilizar. En este caso, todas las demás propiedades serán ignoradas.

source: Set the properties by parsing a fontconfig_ *pattern*.
es_es: Establezca las propiedades analizando un patrón_ *fontconfig_.

source: Set the font family for text in math mode.
es_es: Establece la familia de fuentes para el texto en modo matemático.

source: If not set explicitly, :rc:`mathtext.fontset` will be used.
es_es: Si no se establece explícitamente, se utilizará :rc:`mathtext.fontset`.

source: The name of the font family.
es_es: El nombre de la familia de fuentes.

source: Available font families are defined in the matplotlibrc.template file :ref:`here <customizing-with-matplotlibrc-files>`
es_es: Las familias de fuentes disponibles están definidas en el archivo matplotlibrc.template :ref:`aquí <customizing-with-matplotlibrc-files>`

source: :obj:`.text.Text.get_math_fontfamily`
es_es: :obj:`.text.Texto.get_math_fontfamily`

source: Set the font size. Either an relative value of 'xx-small', 'x-small', 'small', 'medium', 'large', 'x-large', 'xx-large' or an absolute font size, e.g., 12.
es_es: Establece el tamaño de la fuente. O bien un valor relativo de 'xx-small', 'x-small', 'small', 'medium', 'large', 'x-large', 'xx-large' o un tamaño de fuente absoluto, por ejemplo, 12.

source: Set the font style. Values are: 'normal', 'italic' or 'oblique'.
es_es: Establece el estilo de fuente. Los valores son: 'normal', 'italic' o 'oblique'.

source: Set the font stretch or width. Options are: 'ultra-condensed', 'extra-condensed', 'condensed', 'semi-condensed', 'normal', 'semi-expanded', 'expanded', 'extra-expanded' or 'ultra-expanded', or a numeric value in the range 0-1000.
es_es: Ajuste la anchura de la fuente. Las opciones son: 'ultra-condensado', 'extra-condensado', 'condensado', 'semi-condensado', 'normal', 'semi-expandido', 'expandido', 'extra-expandido' o 'ultra-expandido', o un valor numérico en el rango 0-1000.

source: Set the font variant. Values are: 'normal' or 'small-caps'.
es_es: Establece la variante de la fuente. Los valores son: 'normal' o 'small-caps'.

source: Set the font weight. May be either a numeric value in the range 0-1000 or one of 'ultralight', 'light', 'normal', 'regular', 'book', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'
es_es: Establecer el peso de la fuente. Puede ser un valor numérico en el rango 0-1000 o uno de 'ultralight', 'light', 'normal', 'regular', 'libro', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'

source: Extract information from an AFM font file.
es_es: Extraer información de un archivo de fuente AFM.

source: The AFM font file from which information will be extracted.
es_es: El archivo de fuente AFM del que se extraerá la información.

source: The extracted font properties.
es_es: Las propiedades extraídas de la fuente.

source: Search for fonts in the specified font paths. If no paths are given, will use a standard set of system paths, as well as the list of fonts tracked by fontconfig if fontconfig is installed and available. A list of TrueType fonts are returned by default with AFM fonts as an option.
es_es: Buscar fuentes en las rutas de fuentes especificadas. Si no se da ninguna ruta, utilizará un conjunto estándar de rutas del sistema, así como la lista de fuentes seguidas por fontconfig si la fontconfig está instalada y disponible. Una lista de fuentes TrueType se devuelve por defecto con fuentes AFM como una opción.

source: [*Deprecated*] List font filenames known to `fc-list` having the given extension.
es_es: [*Obsoleto*] Lista de nombres de archivo de fuente conocidos por `fc-list` que tienen la extensión dada.

source: Return a list of file extensions extensions that are synonyms for the given file extension *fileext*.
es_es: Devuelve una lista de extensiones de archivo que son sinónimos para la extensión de archivo *fileext*.

source: Return whether the given font is a Postscript Compact Font Format Font embedded in an OpenType wrapper. Used by the PostScript and PDF backends that can not subset these fonts.
es_es: Devuelve si la fuente dada es un Formato de Fuente de Formato de Postscript integrado en un envoltorio OpenType. Utilizado por el PostScript y los backends PDF que no pueden subestablecer estas fuentes.

source: Dump `FontManager` *data* as JSON to the file named *filename*.
es_es: Volcar `FontManager` *datos* como JSON al archivo llamado *nombre de archivo*.

source: File paths that are children of the Matplotlib data path (typically, fonts shipped with Matplotlib) are stored relative to that data path (to remain valid across virtualenvs).
es_es: Rutas de archivos que son hijos de la ruta de datos de Matplotlib (típicamente, Las fuentes enviadas con Matplotlib) se almacenan en relación a esa ruta de datos (para permanecer válidas a través de virtualenvs).

source: This function temporarily locks the output file to prevent multiple processes from overwriting one another's output.
es_es: Esta función bloquea temporalmente el archivo de salida para evitar que múltiples procesos sobreescriban la salida de otro.

source: Load a `FontManager` from the JSON file named *filename*.
es_es: Carga un `FontManager` desde el archivo JSON llamado *filename*.

source: Return a list of all fonts matching any of the extensions, found recursively under the directory.
es_es: Devuelve una lista de todas las fuentes que coincidan con cualquiera de las extensiones, encontradas recursivamente en el directorio.

source: Extract information from a TrueType font file.
es_es: Extraer información de un archivo de fuente TrueType.

source: The TrueType font file from which information will be extracted.
es_es: El archivo de fuente TrueType del que se extraerá la información.

source: Return the user-specified font directory for Win32. This is looked up from the registry key ::
es_es: Devuelve el directorio de fuentes especificado por el usuario para Win32. Se busca desde la clave de registro ::

source: If the key is not found, ``%WINDIR%\Fonts`` will be returned.
es_es: Si la clave no se encuentra, ``%WINDIR%\Fonts`` será devuelto.
