Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/font_manager_api.po
Languages: es_es

source: [*Deprecated*] Search for fonts in the specified font directory, or use the system directories if none given. Additionally, it is searched for user fonts installed. A list of TrueType font filenames are returned by default, or AFM fonts if *fontext* == 'afm'.
es_es: [*Obsoleto*] Buscar fuentes en el directorio de fuentes especificado, o usar los directorios del sistema si no se da ninguno. Adicionalmente, se busca fuentes de usuario instaladas. Una lista de nombres de archivo de fuentes TrueType se devuelven por defecto o fuentes AFM si *fontext* == 'afm'.

source: A class for storing Font properties.
es_es: Una clase para almacenar propiedades Font.

source: It is used when populating the font lookup dictionary.
es_es: Se usa al poblar el diccionario de búsqueda de fuentes.
