Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/image_api.po
Languages: es_es

source: Load a `PIL image`_ and return it as a numpy int array.
es_es: Carga una `imagen PIL`_ y retorna como una matriz de int numpy.

source: The array shape depends on the image type:
es_es: La forma del array depende del tipo de imagen:

source: Make a thumbnail of image in *infile* with output filename *thumbfile*.
es_es: Hacer una miniatura de la imagen en *infile* con el nombre del archivo de salida *thumbnail file*.

source: See :doc:`/gallery/misc/image_thumbnail_sgskip`.
es_es: Vea :doc:`/gallery/misc/image_deletnail_sgskip`.

source: **infile**
es_es: **archivo**

source: The image file. Matplotlib relies on Pillow_ for image reading, and thus supports a wide range of file formats, including PNG, JPG, TIFF and others.
es_es: Matplotlib se basa en Pillow_ para la lectura de imágenes, por lo que soporta una amplia gama de formatos de archivo, incluyendo PNG, JPG, TIFF y otros.

source: **thumbfile**
es_es: **Fichero**

source: The thumbnail filename.
es_es: Nombre de archivo en miniatura.

source: **scale**
es_es: **escala**

source: float, default: 0.1
es_es: float, por defecto: 0.1

source: The scale factor for the thumbnail.
es_es: El factor de escala para la uña.

source: str, default: 'bilinear'
es_es: str, por defecto: 'bilinear'

source: The interpolation scheme used in the resampling. See the *interpolation* parameter of `~.Axes.imshow` for possible values.
es_es: El esquema de interpolación utilizado en el muestreo. Vea el parámetro *interpolación* de `~.Axes.imshow` para ver los valores posibles.

source: **preview**
es_es: **vista previa**

source: If True, the default backend (presumably a user interface backend) will be used which will cause a figure to be raised if `~matplotlib.pyplot.show` is called. If it is False, the figure is created using `.FigureCanvasBase` and the drawing backend is selected as `.Figure.savefig` would normally do.
es_es: Si es verdadero, se utilizará el backend por defecto (presumiblemente un backend de interfaz de usuario) que causará que se eleve una figura si `~matplotlib.pyplot. cómo` es llamado. Si es False, la figura se crea usando `.FigureCanvasBase` y el backend de dibujo se selecciona como `.Figure.savefig` lo haría normalmente.

source: The figure instance containing the thumbnail.
es_es: La instancia de figura que contiene la miniclave.
