Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/image_api.po
Languages: es_es

source: The image module supports basic image loading, rescaling and display operations.
es_es: El módulo de imagen soporta operaciones básicas de carga, reescalado y visualización.

source: An image attached to an Axes.
es_es: Una imagen adjunta a un eje.

source: Parameters
es_es: Parámetros

source: **ax** : `~.axes.Axes`
es_es: **eje** : `~.axes.Axes`

source: Axes
es_es: Ejes

source: The axes the image will belong to.
es_es: Los ejes a los que pertenecerá la imagen.

source: **cmap** : str or `~matplotlib.colors.Colormap`, default: :rc:`image.cmap`
es_es: **cmap** : str o `~matplotlib.colors.Colormap`, por defecto: :rc:`image.cmap`

source: str or
es_es: str o

source: The Colormap instance or registered colormap name used to map scalar data to colors.
es_es: La instancia de Colormap o nombre de mapa de color registrado utilizado para mapear datos escalares a colores.

source: **norm** : `~matplotlib.colors.Normalize`
es_es: **norma** : `~matplotlib.colors.Normalize`

source: Maps luminance to 0-1.
es_es: Mapas de luminancia a 0-1.

source: **interpolation** : str, default: :rc:`image.interpolation`
es_es: **interpolación** : str, por defecto: :rc:`image.interpolation`

source: str, default:
es_es: str, por defecto:

source: Supported values are 'none', 'antialiased', 'nearest', 'bilinear', 'bicubic', 'spline16', 'spline36', 'hanning', 'hamming', 'hermite', 'kaiser', 'quadric', 'catrom', 'gaussian', 'bessel', 'mitchell', 'sinc', 'lanczos', 'blackman'.
es_es: Los valores soportados son 'Ninguno', 'antialiased', 'cercano', 'bilinear', 'bicubic', 'spline16', 'spline36', 'hanning', 'hamming', 'hermite', 'kaiser', 'quadric', 'catrom', 'gaussian', 'bessel', 'mitchell', '/etc', 'lanczos', 'blackman'.

source: **interpolation_stage**
es_es: **interpolación_etapa**

source: {'data', 'rgba'}, default: 'data'
es_es: {'data', 'rgba'}por defecto: 'datos'

source: If 'data', interpolation is carried out on the data provided by the user. If 'rgba', the interpolation is carried out after the colormapping has been applied (visual interpolation).
es_es: Si 'data', la interpolación se realiza sobre los datos proporcionados por el usuario. Si 'rgba', la interpolación se lleva a cabo después de la aplicación del mapeo de colores (interpolación visual).

source: **origin** : {'upper', 'lower'}, default: :rc:`image.origin`
es_es: **origin** : {'upper', 'lower'}, por defecto: :rc:`image.origin`

source: {'upper', 'lower'}, default:
es_es: {'upper', 'lower'}por defecto:

source: Place the [0, 0] index of the array in the upper left or lower left corner of the axes. The convention 'upper' is typically used for matrices and images.
es_es: Coloca el índice [0, 0] de la matriz en la esquina superior izquierda o inferior de los ejes. La convención "superior" se utiliza típicamente para matrices e imágenes.

source: **extent**
es_es: **extensión**

source: tuple, optional
es_es: tupla, opcional

source: The data axes (left, right, bottom, top) for making image plots registered with data plots. Default is to label the pixel centers with the zero-based row and column indices.
es_es: Los ejes de datos (izquierda, derecha, abajo, arriba) para crear gráficos de imagen registrados con gráficos de datos. Por defecto es etiquetar los centros de píxeles con los índices de columna y fila de cero.

source: **filternorm**
es_es: **filtro**

source: bool, default: True
es_es: bool, por defecto: True

source: A parameter for the antigrain image resize filter (see the antigrain documentation). If filternorm is set, the filter normalizes integer values and corrects the rounding errors. It doesn't do anything with the source floating point values, it corrects only integers according to the rule of 1.0 which means that any sum of pixel weights must be equal to 1.0. So, the filter function must produce a graph of the proper shape.
es_es: Un parámetro para el filtro de redimensionamiento de imagen antigrano (ver la documentación de antigranos). Si se establece el filtro, el filtro normaliza los valores enteros y corrige los errores de redondeo. No hace nada con los valores de coma flotante de la fuente, corrige sólo enteros de acuerdo a la regla de 1. lo que significa que cualquier suma de peso de píxeles debe ser igual a 1.0. Por lo tanto, la función de filtro debe producir un gráfico de la forma adecuada.

source: float > 0, default: 4
es_es: flotante > 0, por defecto: 4

source: The filter radius for filters that have a radius parameter, i.e. when interpolation is one of: 'sinc', 'lanczos' or 'blackman'.
es_es: El radio de filtro para los filtros que tienen un parámetro de radio, es decir, cuando la interpolación es uno de: 'ías', 'lanczos' o 'blackman'.

source: bool, default: False
es_es: bool, por defecto: False

source: When True, use a full resampling method. When False, only resample when the output image is larger than the input image.
es_es: Cuando sea verdadero, utilice un método de remuestreo completo. Cuando False, sólo vuelva a mostrar cuando la imagen de salida es más grande que la imagen de entrada.

source: **\*\*kwargs** : `.Artist` properties
es_es: **\*\*kwargs** : propiedades `.Artist`

source: Artist properties
es_es: Propiedades del artista

source: **norm** : `matplotlib.colors.Normalize` (or subclass thereof)
es_es: **normal** : `matplotlib.colors.Normalize` (o subclase de ellos)

source: matplotlib.colors.Normalize (or subclass thereof)
es_es: matplotlib.colors.Normalize (o subclase de ellos)

source: The normalizing object which scales data, typically into the interval ``[0, 1]``. If *None*, *norm* defaults to a *colors.Normalize* object which initializes its scaling based on the first data processed.
es_es: El objeto normalizador que escala los datos, típicamente en el intervalo ``[0, 1]``. Si *nunca*, *normal* por defecto a *colores. ormalize* que inicializa su escalado basado en los primeros datos procesados.

source: **cmap** : str or `~matplotlib.colors.Colormap`
es_es: **cmap** : str o `~matplotlib.colors.Colormap`

source: The colormap used to map normalized data values to RGBA colors.
es_es: El mapa de colores utilizado para asignar valores de datos normalizados a colores RGBA.

source: Return the image value at the event position or *None* if the event is outside the image.
es_es: Devuelve el valor de la imagen en la posición del evento o *nunca* si el evento está fuera de la imagen.

source: Return the image extent as tuple (left, right, bottom, top).
es_es: Devuelve la extensión de la imagen como tupla (izquierda, derecha, abajo, arriba).

source: Get the artist's bounding box in display space.
es_es: Obtenga la caja delimitadora del artist en el espacio de visualización.

source: The bounding box' width and height are nonnegative.
es_es: La anchura y la altura de la caja delimitadora son no negativas.

source: Subclasses should override for inclusion in the bounding box "tight" calculation. Default is to return an empty bounding box at 0, 0.
es_es: Las subclases deben anularlo para incluirlo en el cálculo de la caja delimitadora "ajustada". Por defecto devuelve una caja delimitadora vacía en 0, 0.

source: Be careful when using this function, the results will not update if the artist window extent of the artist changes. The extent can change due to any changes in the transform stack, such as changing the axes limits, the figure size, or the canvas used (as is done when saving a figure). This can lead to unexpected behavior where interactive figures will look fine on the screen, but will save incorrectly.
es_es: Ten cuidado cuando uses esta función, los resultados no se actualizarán si la extensión de la ventana del artist cambia. La extensión puede cambiar debido a cualquier cambio en la pila de transformaciones, como cambiar los límites de los ejes, el tamaño de la figura o el lienzo utilizado (como se hace al guardar una figura). Esto puede llevar a un comportamiento inesperado donde las figuras interactivas se verán bien en la pantalla, pero se guardarán incorrectamente.

source: Normalize, rescale, and colormap this image's data for rendering using *renderer*, with the given *magnification*.
es_es: Normalizar, reescalar y mapear los datos de esta imagen para renderizarla usando el *renderizador*, con la *coordenada* dada.

source: If *unsampled* is True, the image will not be scaled, but an appropriate affine transformation will be returned instead.
es_es: Si *unsampled* es verdadero, la imagen no será escalada, pero una transformación de afecto apropiada será devuelta en su lugar.

source: Returns
es_es: Devuelve

source: **image**
es_es: **imagen**

source: (M, N, 4) uint8 array
es_es: (M, N, 4) arreglo uint8

source: The RGBA image, resampled unless *unsampled* is True.
es_es: La imagen RGBA, de nuevo muestreo a menos que *sin muestreo* sea verdadera.

source: float
es_es: de punto flotante (float)

source: The upper left corner where the image should be drawn, in pixel space.
es_es: La esquina superior izquierda donde debe dibujarse la imagen, en espacio de píxeles.

source: The affine transformation from image to pixel space.
es_es: La transformación de la imagen al espacio de píxeles.

source: Set multiple properties at once.
es_es: Establece varias propiedades a la vez.

source: Supported properties are
es_es: Las propiedades admitidas son

source: Property
es_es: Propiedad

source: Description
es_es: Descripción

source: a filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array
es_es: una función de filtro, que toma un arreglo de puntos flotantes (m, n, 3) y un valor de dpi, y devuelve un arreglo (m, n, 3)

source: ``alpha``
es_es: ``alfa``

source: float or 2D array-like or None
es_es: flotante o tipo array 2D o ninguno

source: (vmin: float, vmax: float)
es_es: (vmin: flotante, vmax: flotante)

source: Patch or (Path, Transform) or None
es_es: Patch o (Path, Transform) o None

source: `.Colormap` or str or None
es_es: `.Colormap` o str o ninguno

source: array-like or `PIL.Image.Image`
es_es: array-like o `PIL.Image.Image`

source: 4-tuple of float
es_es: 4 tuplas de flotante

source: ``filternorm``
es_es: ``filtronorma``

source: positive float
es_es: flotante positivo

source: ``interpolation``
es_es: ``interpolación``

source: {'antialiased', 'nearest', 'bilinear', 'bicubic', 'spline16', 'spline36', 'hanning', 'hamming', 'hermite', 'kaiser', 'quadric', 'catrom', 'gaussian', 'bessel', 'mitchell', 'sinc', 'lanczos', 'none'} or None
es_es: {'antialiased', 'cercano', 'bilinear', 'bicubic', 'spline16', 'spline36', 'hanning', 'hamming', 'hermite', 'kaiser', 'cuadric', 'catrom', 'gaussian', 'bessel', 'mitchell', 'landes', 'lanczos', 'outer'} o ninguno

source: ``interpolation_stage``
es_es: ``interpolación_etapa``

source: {'data', 'rgba'} or None
es_es: {'data', 'rgba'} o ninguno

source: `.Normalize` or None
es_es: `.normalize` o Ninguno

source: None or bool or float or callable
es_es: None o bool o float o callable

source: ``resample``
es_es: ``volver a mostrar``

source: Set the image extent.
es_es: Definir la extensión de la imagen.

source: The position and size of the image as tuple ``(left, right, bottom, top)`` in data coordinates.
es_es: La posición y el tamaño de la imagen como tupla ``(izquierda, derecha, abajo, arriba)`` en las coordenadas de datos.

source: This updates ``ax.dataLim``, and, if autoscaling, sets ``ax.viewLim`` to tightly fit the image, regardless of ``dataLim``. Autoscaling state is not changed, so following this with ``ax.autoscale_view()`` will redo the autoscaling in accord with ``dataLim``.
es_es: Esto actualiza ``ax.dataLim``, y si se autocala configura ``ax.viewLim`` como ajustado a la imagen, independientemente de ``dataLim``. El estado de autoescalado no se cambia, por lo que seguir esto con ``ax.autoscale_view()`` rehará el autoescalado de acuerdo con ``dataLim``.

source: The Image class whose size is determined by the given bbox.
es_es: La clase Imagen, cuyo tamaño está determinado por el cuadro dado.

source: cmap is a colors.Colormap instance norm is a colors.Normalize instance to map luminance to 0-1
es_es: cmap es una norma de instancia colors.Colormap es un colors.Normalize instancia para mapear luminancia a 0-1

source: kwargs are an optional list of Artist keyword args
es_es: kwargs son una lista opcional de argumentos de palabras clave del artista

source: Test whether the mouse event occurred within the image.
es_es: Evalúa si el evento del ratón ha ocurrido dentro de la imagen.

source: An image attached to a figure.
es_es: Una imagen adjunta a una figura.

source: unknown
es_es: desconocido

source: Set the image array.
es_es: Establecer el array de imágenes.

source: **interpolation**
es_es: **interpolación**

source: {'nearest', 'bilinear'}, default: 'nearest'
es_es: {'nearest', 'bilinear'}, por defecto: 'más cercano'

source: All other keyword arguments are identical to those of `.AxesImage`.
es_es: Todos los otros argumentos de palabra clave son idénticos a los de `.AxesImage`.

source: :meth:`interpolation <matplotlib.image.NonUniformImage.set_interpolation>`
es_es: :meth:`interpolación <matplotlib.image.NonUniformImage.set_interpolation>`

source: {'nearest', 'bilinear'} or None
es_es: {'nearest', 'bilinear'} o ninguno

source: Retained for backwards compatibility - use set_data instead.
es_es: Conservado por compatibilidad con versiones anteriores - use set_data en su lugar.

source: Set the colormap for luminance data.
es_es: Establece el mapa de colores para los datos de la luminancia.

source: **cmap** : `.Colormap` or str or None
es_es: **cmap** : `.Colormap` o str o None

source: Colormap or str or None
es_es: Colormap o str o ninguno

source: Set the grid for the pixel centers, and the pixel values.
es_es: Establece la cuadrícula para los centros de píxeles y los valores de los píxeles.

source: Monotonic arrays of shapes (N,) and (M,), respectively, specifying pixel centers.
es_es: Arreglos monotónicos de formas (N,) y (M,), respectivamente, especificando los centros de píxeles.

source: (M, N) ndarray or masked array of values to be colormapped, or (M, N, 3) RGB array, or (M, N, 4) RGBA array.
es_es: (M, N) ndarray o array enmascarado de valores a ser colormapped, o (M, N, 3) RGB array, o (M, N, 4) RGBA array.

source: Set whether the resize filter normalizes the weights.
es_es: Establecer si el filtro de redimensionar normaliza las pesas.

source: See help for `~.Axes.imshow`.
es_es: Vea ayuda para `~.Axes.imshow`.

source: Set the resize filter radius only applicable to some interpolation schemes -- see help for imshow
es_es: Establecer el radio de redimensionar filtro sólo aplicable a algunos esquemas de interpolación -- ver ayuda para mostrar

source: If None, use :rc:`image.interpolation`.
es_es: Si no, usa :rc:`image.interpolation`.

source: Set the normalization instance.
es_es: Establece la instancia de normalización.

source: **norm** : `.Normalize` or None
es_es: **norma** : `.Normalize` o Ninguno

source: Normalize or None
es_es: Normalizar o ninguno

source: If there are any colorbars using the mappable for this norm, setting the norm of the mappable will reset the norm, locator, and formatters on the colorbar to default.
es_es: Si hay alguna barra de colores usando el mapeable para esta norma, establecer la norma del mapeable restablecerá la norma, localización y formateadores de la barra de colores por defecto.

source: Make a pcolor-style plot with an irregular rectangular grid.
es_es: Crea una parcela de color con una rejilla rectangular irregular.

source: This uses a variation of the original irregular image code, and it is used by pcolorfast for the corresponding grid type.
es_es: Esto usa una variación del código de imagen irregular original, y es usado por pcolorfast para el tipo de cuadrícula correspondiente.

source: 1D array-like, optional
es_es: Opcional para matriz 1D

source: Monotonic arrays of length N+1 and M+1, respectively, specifying rectangle boundaries. If not given, will default to ``range(N + 1)`` and ``range(M + 1)``, respectively.
es_es: Arreglos monotónicos de longitud N+1 y M+1, respectivamente, especificando los límites del rectángulo. Si no se da, por defecto será ``range(N + 1)`` y ``range(M + 1)``, respectivamente.

source: The data to be color-coded. The interpretation depends on the shape:
es_es: Los datos a ser codificados por color. La interpretación depende de la forma:

source: (M, N) ndarray or masked array: values to be colormapped
es_es: (M, N) ndarray o matriz enmascarada: valores a ser mapeados en color

source: (M, N, 3): RGB array
es_es: (M, N, 3): array RVA

source: (M, N, 4): RGBA array
es_es: (M, N, 4): arreglo RGBA

source: Set the grid for the rectangle boundaries, and the data values.
es_es: Establece la cuadrícula para los límites del rectángulo, y los valores de los datos.

source: Composite a number of RGBA images into one. The images are composited in the order in which they appear in the *images* list.
es_es: Componer un número de imágenes RGBA en una, las imágenes se componen en el orden en el que aparecen en la lista de *imágenes*.

source: list of Images
es_es: lista de imágenes

source: Each must have a `make_image` method. For each image, `can_composite` should return `True`, though this is not enforced by this function. Each image must have a purely affine transformation with no shear.
es_es: Cada uno debe tener un método `make_image`. Para cada imagen, `can_composite` debe devolver `True`, aunque esto no es forzado por esta función. Cada imagen debe tener una transformación puramente afectada sin esquilma.

source: **renderer** : `.RendererBase`
es_es: **renderizador** : `.RendererBase`

source: RendererBase
es_es: RenderizarBase

source: **magnification**
es_es: **Conocimiento**

source: The additional magnification to apply for the renderer in use.
es_es: La ampliación adicional para el renderizador en uso.

source: uint8 array (M, N, 4)
es_es: array uint8 (M, N, 4)

source: The composited RGBA image.
es_es: La imagen RGBA compuesta.

source: The (left, bottom) offset where the composited image should be placed in the output figure.
es_es: El desplazamiento (izquierdo, inferior) donde la imagen compuesta debe colocarse en la figura de salida.

source: Read an image from a file into an array.
es_es: Leer una imagen de un archivo a una matriz.

source: This function exists for historical reasons. It is recommended to use `PIL.Image.open` instead for loading images.
es_es: Esta función existe por razones históricas. Se recomienda usar `PIL.Image.open` para cargar imágenes.

source: str or file-like
es_es: str o archivo

source: The image file to read: a filename, a URL or a file-like object opened in read-binary mode.
es_es: El archivo de imagen a leer: un nombre de archivo, una URL o un objeto tipo archivo abierto en modo de lectura-binario.

source: Passing a URL is deprecated. Please open the URL for reading and pass the result to Pillow, e.g. with ``np.array(PIL.Image.open(urllib.request.urlopen(url)))``.
es_es: Pasar una URL es obsoleto. Por favor, abra la URL para leer y pase el resultado a Pillow, por ejemplo, con ``np.array(PIL.Image.open(urllib.request.urlopen(url))``.

source: **format**
es_es: **formato**

source: str, optional
es_es: str, opcional

source: The image file format assumed for reading the data. The image is loaded as a PNG file if *format* is set to "png", if *fname* is a path or opened file with a ".png" extension, or if it is an URL. In all other cases, *format* is ignored and the format is auto-detected by `PIL.Image.open`.
es_es: El formato de archivo de imagen asumido para leer los datos. La imagen se carga como un archivo PNG si *format* está establecido en "png", si *fname* es una ruta o archivo abierto con un ". extensión ng", o si es una URL. En todos los demás casos, *format* es ignorado y el formato es auto-detectado por `PIL.Image.open`.

source: The image data. The returned array has shape
es_es: Los datos de la imagen. La matriz devuelta tiene forma

source: (M, N) for grayscale images.
es_es: (M, N) para imágenes en escala de grises.

source: (M, N, 3) for RGB images.
es_es: (M, N, 3) para imágenes RGB.

source: (M, N, 4) for RGBA images.
es_es: (M, N, 4) para imágenes RGBA.

source: PNG images are returned as float arrays (0-1). All other formats are returned as int arrays, with a bit depth determined by the file's contents.
es_es: Las imágenes PNG se devuelven como matrices flotantes (0-1).

source: Save an array as an image file.
es_es: Guardar una matriz como un archivo de imagen.

source: str or path-like or file-like
es_es: str o como ruta o archivo

source: A path or a file-like object to store the image in. If *format* is not set, then the output format is inferred from the extension of *fname*, if any, and from :rc:`savefig.format` otherwise. If *format* is set, it determines the output format.
es_es: Una ruta o un objeto tipo archivo en el que almacenar la imagen. Si no se establece *formato*, el formato de salida se inferirá de la extensión de *fname*, si existe, y de :rc:`savefig. ormat` de otra manera. Si se establece *formato*, determina el formato de salida.

source: **arr**
es_es: **ar**

source: The image data. The shape can be one of MxN (luminance), MxNx3 (RGB) or MxNx4 (RGBA).
es_es: Los datos de la imagen. La forma puede ser una de MxN (luminancia), MxNx3 (RGB) o MxNx4 (RGBA).

source: float, optional
es_es: float, opcional

source: *vmin* and *vmax* set the color scaling for the image by fixing the values that map to the colormap color limits. If either *vmin* or *vmax* is None, that limit is determined from the *arr* min/max value.
es_es: *vmin* y *vmax* establecen la escala de color de la imagen al fijar los valores que asignan a los límites de color del mapa de colores. Si *vmin* o *vmax* no es Ninguno, ese límite se determina a partir del valor *arr* min/max.

source: A Colormap instance or registered colormap name. The colormap maps scalar data to colors. It is ignored for RGB(A) data.
es_es: Una instancia de Colormap o nombre de mapa de colores registrado. El mapa de colores asigna datos escalares a colores. Se ignora para datos RGB(A).

source: The file format, e.g. 'png', 'pdf', 'svg', ... The behavior when this is unset is documented under *fname*.
es_es: El formato de archivo, p. ej., 'png', 'pdf', 'svg', ... El comportamiento cuando no está configurado está documentado bajo *fname*.

source: Indicates whether the ``(0, 0)`` index of the array is in the upper left or lower left corner of the axes.
es_es: Indica si el índice ``(0, 0)`` de la matriz está en la esquina superior izquierda o inferior izquierda de los ejes.

source: The DPI to store in the metadata of the file. This does not affect the resolution of the output image. Depending on file format, this may be rounded to the nearest integer.
es_es: El DPI para almacenar en los metadatos del archivo. Esto no afecta a la resolución de la imagen de salida. Dependiendo del formato de archivo, esto puede ser redondeado al entero más cercano.

source: **metadata**
es_es: **metadatos**

source: Metadata in the image file. The supported keys depend on the output format, see the documentation of the respective backends for more information.
es_es: Metadatos en el archivo de imagen. Las claves soportadas dependen del formato de salida, vea la documentación de los respectivos backends para más información.

source: Keyword arguments passed to `PIL.Image.Image.save`. If the 'pnginfo' key is present, it completely overrides *metadata*, including the default 'Software' key.
es_es: Argumentos de palabra clave pasados a `PIL.Image.save`. Si la clave 'pnginfo' está presente, anula completamente *metadata*, incluyendo la clave 'Software' por defecto.
