Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/index.po
Languages: es_es

source: API Reference
es_es: Referencia API

source: When using the library you will typically create :doc:`Figure <figure_api>` and :doc:`Axes <axes_api>` objects and call their methods to add content and modify the appearance.
es_es: Al usar la librería, normalmente crearás objetos :doc:`Figura <figure_api>y :doc:`Ejes <axes_api>` y llamarás a sus métodos para añadir contenido y modificar la apariencia.

source: :mod:`matplotlib.figure`: axes creation, figure-level content
es_es: :mod:`matplotlib.figure`: creación de ejes, contenido a nivel de figura

source: :mod:`matplotlib.axes`: most plotting methods, Axes labels, access to axis styling, etc.
es_es: :mod:`matplotlib.axes`: la mayoría de métodos de trazado, etiquetas de ejes, acceso a la difusión de ejes, etc.

source: Example: We create a Figure ``fig`` and Axes ``ax``. Then we call methods on them to plot data, add axis labels and a figure title.
es_es: Ejemplo: Creamos una Figura ``figura`` y ejes ``ej``. Luego llamamos métodos en ellos para graficar datos, añadir etiquetas de ejes y un título de figura.

source: (`Source code <../api/index-1.py>`__, `png <../api/index-1.png>`__, `pdf <../api/index-1.pdf>`__)
es_es: (`Código fuente <../api/index-1.py>`__, `png <../api/index-1.png>`__, `pdf <../api/index-1.pdf>`__)

source: Modules
es_es: Módulos

source: Alphabetical list of modules:
es_es: Lista alfabética de módulos:

source: Usage patterns
es_es: Patrones de uso

source: Below we describe several common approaches to plotting with Matplotlib.
es_es: A continuación describimos varios enfoques comunes de trazado con Matplotlib.

source: The pyplot API
es_es: La API de pyplot

source: `matplotlib.pyplot` is a collection of functions that make Matplotlib work like MATLAB. Each pyplot function makes some change to a figure: e.g., creates a figure, creates a plotting area in a figure, plots some lines in a plotting area, decorates the plot with labels, etc.
es_es: `matplotlib.pyplot` es una colección de funciones que hacen que Matplotlib funcione como MATLAB. Cada función pyplot cambia algo a una figura: e. ., crea una figura, crea un área de trazado en una figura, dibuja algunas líneas en una zona de trazado, decora la parcela con etiquetas, etc.

source: `.pyplot` is mainly intended for interactive plots and simple cases of programmatic plot generation.
es_es: `.pyplot` está destinado principalmente a parcelas interactivas y casos simples de generación de parcelas programáticas.

source: Further reading:
es_es: Leyendo más:

source: The `matplotlib.pyplot` function reference
es_es: La referencia de la función `matplotlib.pyplot`

source: The object-oriented API
es_es: La API orientada a objetos

source: At its core, Matplotlib is object-oriented. We recommend directly working with the objects, if you need more control and customization of your plots.
es_es: En su núcleo, Matplotlib está orientado a objetos. Recomendamos trabajar directamente con los objetos, si necesita más control y personalización de sus parcelas.

source: In many cases you will create a `.Figure` and one or more `~matplotlib.axes.Axes` using `.pyplot.subplots` and from then on only work on these objects. However, it's also possible to create `.Figure`\ s explicitly (e.g. when including them in GUI applications).
es_es: En muchos casos crearás un `.Figure` y uno o más `~matplotlib.axes.Axes` usando `.pyplot.subplots` y a partir de entonces solo trabajarás en estos objetos. Sin embargo, también es posible crear `.Figure`\ s explícitamente (por ejemplo, cuando se incluyen en aplicaciones GUI).

source: `matplotlib.axes.Axes` and `matplotlib.figure.Figure` for an overview of
es_es: `matplotlib.axes.Axes` y `matplotlib.figure.Figure` para una visión general de

source: plotting functions.
es_es: funciones de graficación.

source: Most of the :ref:`examples <examples-index>` use the object-oriented approach
es_es: La mayoría de los :ref:`ejemplos <examples-index>utilizan el enfoque orientado a objetos

source: (except for the pyplot section)
es_es: (excepto la sección de pyplot)

source: The pylab API (discouraged)
es_es: La API de pylab (desalentada)

source: Since heavily importing into the global namespace may result in unexpected behavior, the use of pylab is strongly discouraged. Use `matplotlib.pyplot` instead.
es_es: Dado que importar fuertemente en el espacio de nombres global puede resultar en un comportamiento inesperado, el uso de pylab está fuertemente desaconsejado. Utilice `matplotlib.pyplot` en su lugar.

source: `pylab` is a module that includes `matplotlib.pyplot`, `numpy`, `numpy.fft`, `numpy.linalg`, `numpy.random`, and some additional functions, all within a single namespace. Its original purpose was to mimic a MATLAB-like way of working by importing all functions into the global namespace. This is considered bad style nowadays.
es_es: `pylab` es un módulo que incluye `matplotlib.pyplot`, `numpy`, `numpy.fft`, `numpy.linalg`, `numpy.random`, y algunas funciones adicionales, todo dentro de un solo espacio de nombres. Su propósito original era imitar una forma de trabajar similar a MATLAB importando todas las funciones al espacio de nombres global.
