Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/legend_handler_api.po
Languages: es_es

source: Default legend handlers.
es_es: Manejadores de leyendas predeterminados.

source: This is a low-level legend API, which most end users do not need.
es_es: Esta es una API de bajo nivel de leyenda, que la mayoría de los usuarios finales no necesitan.

source: We recommend that you are familiar with the :doc:`legend guide </tutorials/intermediate/legend_guide>` before reading this documentation.
es_es: Te recomendamos que estés familiarizado con la :doc:`guía de leyenda </tutorials/intermediate/legend_guide>` antes de leer esta documentación.

source: Legend handlers are expected to be a callable object with a following signature. ::
es_es: Se espera que los manejadores de leyendas sean un objeto llamable con una siguiente firma. ::

source: Where *legend* is the legend itself, *orig_handle* is the original plot, *fontsize* is the fontsize in pixels, and *handlebox* is a OffsetBox instance. Within the call, you should create relevant artists (using relevant properties from the *legend* and/or *orig_handle*) and add them into the handlebox. The artists needs to be scaled according to the fontsize (note that the size is in pixel, i.e., this is dpi-scaled value).
es_es: Donde la *leyenda* es la leyenda misma, *orig_handle* es la gráfica original, *fontsize* es el tamaño de la fuente en píxeles y *handlebox* es una instancia de OffsetBox. Dentro de la llamada, debe crear artistas relevantes (usando propiedades relevantes de la *leyend* y/o *origin_handle*) y agregarlos al handlebox. Los artistas deben ser escalados según el tamaño de la fuente (tenga en cuenta que el tamaño está en píxeles, es decir, este es el valor escalado en dpi).

source: This module includes definition of several legend handler classes derived from the base class (HandlerBase) with the following method::
es_es: Este módulo incluye la definición de varias clases manejadoras de leyendas derivadas de la clase base (HandlerBase) con el siguiente método::

source: A Base class for default legend handlers.
es_es: Una clase Base para los manejadores de leyendas predeterminados.

source: The derived classes are meant to override *create_artists* method, which has a following signature.::
es_es: Las clases derivadas están destinadas a anular el método *create_artists*, el cual tiene una firma siguiente.::

source: The overridden method needs to create artists of the given transform that fits in the given dimension (xdescent, ydescent, width, height) that are scaled by fontsize if necessary.
es_es: El método sobreescrito necesita crear artistas de la transformación dada que se ajusta a la dimensión dada (xdescent, Ascenso, ancho, altura) que son escalados por tamaño de fuente si es necesario.

source: Return the artist that this HandlerBase generates for the given original artist/handle.
es_es: Devuelve el artista que esta Base de HandlerBase genera para el artista/asa original dado.

source: Parameters
es_es: Parámetros

source: **legend** : `~matplotlib.legend.Legend`
es_es: **leyenda** : `~matplotlib.legend.Legend`

source: Legend
es_es: Leyenda

source: The legend for which these legend artists are being created.
es_es: La leyenda para la que se crean estos artistas leyendas.

source: **orig_handle** : :class:`matplotlib.artist.Artist` or similar
es_es: **orig_handle** : :class:`matplotlib.artist.Artist` o similar

source: matplotlib.artist.Artist or similar
es_es: matplotlib.artist.Artista o similar

source: The object for which these legend artists are being created.
es_es: El objeto para el que se crean estos artistas leyendas.

source: The fontsize in pixels. The artists being created should be scaled according to the given fontsize.
es_es: El tamaño de fuente en píxeles. Los artistas que se están creando deben escalarse de acuerdo con el tamaño de fuente dado.

source: The box which has been created to hold this legend entry's artists. Artists created in the `legend_artist` method must be added to this handlebox inside this method.
es_es: La caja que se ha creado para albergar a los artistas de esta leyenda. Los artistas creados en el método `legend_artist` deben ser añadidos a este handlebox dentro de este método.

source: Handler for `.CircleCollection`\s.
es_es: Manejador para `.CircleCollection`\s.

source: Number of points to show in legend entry.
es_es: Número de puntos a mostrar en la entrada de la leyenda.

source: array of floats
es_es: array de flotantes

source: Length *numpoints* list of y offsets for each point in legend entry.
es_es: Largo *numpoints* lista de compensaciones y por cada punto en entrada de leyenda.

source: Keyword arguments forwarded to `.HandlerNpoints`.
es_es: Argumentos de palabra clave enviados a `.HandlerNpoints`.

source: Handler for Errorbars.
es_es: Manejador de barras de error.

source: Padding between points in legend entry.
es_es: Rellenar entre puntos en la entrada de la leyenda.

source: Handler for `.Line2D` instances.
es_es: Handler para instancias `.Line2D`.

source: An earlier handler implementation, which used one artist for the line and another for the marker(s).
es_es: Una implementación anterior del manejador, que utilizó un artista para la línea y otro para los marcador(es).

source: Original handler for `.Line2D` instances, that relies on combining a line-only with a marker-only artist. May be deprecated in the future.
es_es: Manejador original para instancias `.Line2D`, que se basa en la combinación de una línea sólo con un artista con marcadores. Puede estar obsoleto en el futuro.

source: Handler for `.LineCollection` instances.
es_es: Manejador para instancias de `.LineCollection`.

source: A legend handler that shows *numpoints* points in the legend entry.
es_es: Un manejador de leyendas que muestra puntos *numpoints* en la entrada de la leyenda.

source: Keyword arguments forwarded to `.HandlerBase`.
es_es: Argumentos de palabra clave enviados a `.HandlerBase`.

source: A legend handler that shows *numpoints* in the legend, and allows them to be individually offset in the y-direction.
es_es: Un manejador de leyendas que muestra *entumecimientos* en la leyenda, y les permite ser compensados individualmente en la dirección y-.

source: Handler for `.Patch` instances.
es_es: Handler para instancias `.Patch`.

source: **patch_func**
es_es: **parche_función**

source: callable, optional
es_es: llamable, opcional

source: The function that creates the legend key artist. *patch_func* should have the signature::
es_es: La función que crea el artista clave de la leyenda. *patch_func* debe tener la firma::

source: Subsequently the created artist will have its ``update_prop`` method called and the appropriate transform will be applied.
es_es: Posteriormente, el artista creado tendrá su método ``update_prop`` llamado y se aplicará la transformación apropiada.

source: Handler for `.PathCollection`\s, which are used by `~.Axes.scatter`.
es_es: Handler para `.PathCollection`\s, que son usados por `~.Axes.scatter`.

source: Handler for `.PolyCollection` used in `~.Axes.fill_between` and `~.Axes.stackplot`.
es_es: Manejador para `.PolyCollection` usado en `~.Axes.fill_between` y `~.Axes.stackplot`.

source: Handler for `.RegularPolyCollection`\s.
es_es: Manejador para `.RegularPolyCollection`\s.

source: Handler for plots produced by `~.Axes.stem`.
es_es: Handler para parcelas producidas por `~.Axes.stem`.

source: int, optional
es_es: int, opcional

source: **bottom**
es_es: **inferior**

source: float, optional
es_es: float, opcional

source: array of floats, optional
es_es: array de flotantes, opcional

source: Keyword arguments forwarded to `.HandlerNpointsYoffsets`.
es_es: Argumentos de palabra clave enviados a `.HandlerNpointsYoffsets`.

source: Handler for `~.matplotlib.patches.StepPatch` instances.
es_es: Manejador para instancias `~.matplotlib.patches.StepPatch`.

source: Handler for Tuple.
es_es: Manejador para Tuple.

source: int, default: 1
es_es: int, por defecto: 1

source: The number of sections to divide the legend area into. If None, use the length of the input tuple.
es_es: El número de secciones en las que dividir el área de la leyenda. Si no, use la longitud de la tupla de entrada.

source: **pad** : float, default: :rc:`legend.borderpad`
es_es: **pad** : float, por defecto: :rc:`legend.borderpad`

source: float, default:
es_es: flotante, por defecto:

source: Padding in units of fraction of font size.
es_es: Rellenar unidades de fracción de tamaño de fuente.
