Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/mathtext_api.po
Languages: es_es

source: A module for parsing a subset of the TeX math syntax and rendering it to a Matplotlib backend.
es_es: Un módulo para analizar un subconjunto de la sintaxis de matemáticas TeX y procesarlo en un backend de Matplotlib.

source: For a tutorial of its usage, see :doc:`/tutorials/text/mathtext`. This document is primarily concerned with implementation details.
es_es: Para obtener un tutorial de su uso, consulte :doc:`/tutorials/text/mathtext`. Este documento se ocupa principalmente de los detalles de implementación.

source: The module uses pyparsing_ to parse the TeX expression.
es_es: El módulo usa pyparsing_ para analizar la expresión TeX.

source: The Bakoma distribution of the TeX Computer Modern fonts, and STIX fonts are supported. There is experimental support for using arbitrary fonts, but results may vary without proper tweaking and metrics for those fonts.
es_es: La distribución Bakoma de las fuentes TeX Computer Modern y las fuentes STIX están soportadas. Hay soporte experimental para el uso de fuentes arbitrarias, pero los resultados pueden variar sin un ajuste adecuado y métricas para esas fuentes.

source: Create a MathTextParser for the given backend *output*.
es_es: Crea un MathTextParser para el backend dado *output*.

source: [*Deprecated*] Get the depth of a mathtext string.
es_es: [*Obsoleto*] Obtener la profundidad de una cadena de texto de matemáticas.

source: Parameters
es_es: Parámetros

source: A valid mathtext string, e.g., r'IQ: $\sigma_i=15$'.
es_es: Una cadena de texto matemático válida, por ejemplo, r'IQ: $\sigma_i=15$'.

source: The dots-per-inch setting used to render the text.
es_es: El ajuste punto-por-inch utilizado para renderizar el texto.

source: Returns
es_es: Devuelve

source: Offset of the baseline from the bottom of the image, in pixels.
es_es: Desplazamiento de la línea de referencia desde la parte inferior de la imagen, en píxeles.

source: Parse the given math expression *s* at the given *dpi*. If *prop* is provided, it is a `.FontProperties` object specifying the "default" font to use in the math expression, used for all non-math text.
es_es: Analizar la expresión matemática dada *s* en el *dpi* dado. objeto ontProperties` que especifica la fuente "predeterminada" a usar en la expresión matemática, usada para todos los textos no matemáticos.

source: The results are cached, so multiple calls to `parse` with the same expression should be fast.
es_es: Los resultados se almacenan en caché, por lo que múltiples llamadas a 'analizar' con la misma expresión deben ser rápidas.

source: [*Deprecated*] Convert a mathtext string to a grayscale array and depth.
es_es: [*Deprecado*] Convierte una cadena de texto de matemáticas a una matriz y profundidad de escala de grises.

source: The font size in points
es_es: Tamaño de fuente en puntos

source: **array**
es_es: **matriz**

source: 2D uint8 alpha
es_es: Alfa uint8 2D

source: Mask array of rasterized tex.
es_es: Matriz de máscara de texto rasterizado.

source: **depth**
es_es: **profundidad**

source: [*Deprecated*] Render a tex expression to a PNG file.
es_es: [*Desaprobado*] Procesa una expresión textil a un archivo PNG.

source: **filename**
es_es: **nombre de archivo**

source: A writable filename or fileobject.
es_es: Un nombre de archivo escribible u objeto de archivo.

source: The text color.
es_es: El color del texto.

source: The font size in points.
es_es: El tamaño de la fuente en puntos.

source: [*Deprecated*] Convert a mathtext string to an RGBA array and depth.
es_es: [*Deprecado*] Convierte una cadena de texto de matemáticas a una matriz y profundidad RGBA.

source: RGBA color values of rasterized tex, colorized with *color*.
es_es: Valores de color RGBA de texto rasterizado, colorado con *color*.

source: Bases: :py:class:`Warning`
es_es: Bases: :py:class:`Advertencia`

source: The base class for the mathtext backend-specific code. `MathtextBackend` subclasses interface between mathtext and specific Matplotlib graphics backends.
es_es: La clase base para el código específico del backend del mathtext. `MathtextBackend` subclases interfaz entre los backends gráficos de Matplotlib específicos.

source: Subclasses need to override the following:
es_es: Las subclases necesitan sobreescribir lo siguiente:

source: :meth:`render_glyph`
es_es: :meth:`render_glifo`

source: And optionally, if you need to use a FreeType hinting style:
es_es: Y opcionalmente, si necesita usar un estilo de insinuación FreeType:

source: Get the FreeType hinting type to use with this particular backend.
es_es: Obtener el tipo de insinuación FreeType para usar con este backend en particular.

source: Return a backend-specific tuple to return to the backend after all processing is done.
es_es: Devuelve una tupla específica del backend para regresar al backend después de que todo el procesamiento haya finalizado.

source: Draw a glyph described by *info* to the reference point (*ox*, *oy*).
es_es: Dibuje un glifo descrito por *información* al punto de referencia (*ox*, *oy*).

source: Draw a filled black rectangle from (*x1*, *y1*) to (*x2*, *y2*).
es_es: Dibuja un rectángulo negro lleno de (*x1*, *y1*) a (*x2*, *y2*).

source: Set the dimension of the drawing canvas.
es_es: Define la dimensión del lienzo de dibujo.

source: Render glyphs and rectangles to an FTImage buffer, which is later transferred to the Agg image by the Agg backend.
es_es: Procesa los glifos y rectángulos a un buffer FTImage que se transfiere más tarde a la imagen Agg por el backend Agg.

source: [*Deprecated*] Store information to write a mathtext rendering to the Cairo backend.
es_es: [*Desaprobado*] Almacena información para escribir un texto matemático renderizado en el backend de El Cairo.

source: Store information to write a mathtext rendering to the text path machinery.
es_es: Almacena información para escribir un renderizado de texto en la maquinaria de ruta de texto.

source: [*Deprecated*] Store information to write a mathtext rendering to the PDF backend.
es_es: [*Obsoleto*] Almacena información para escribir un texto matemático renderizado en el backend PDF.

source: [*Deprecated*] Store information to write a mathtext rendering to the PostScript backend.
es_es: [*Obsoleto*] Tienda información para escribir un texto de procesamiento de matemáticas en el backend de PostScript.

source: [*Deprecated*] Store information to write a mathtext rendering to the SVG backend.
es_es: [*Obsoleto*] Tienda información para escribir un texto de procesamiento de matemáticas en el backend SVG.

source: Return the integer index (from the Unicode table) of *symbol*.
es_es: Devuelve el índice entero (desde la tabla Unicode) de *symbol*.

source: A single unicode character, a TeX command (e.g. r'\pi') or a Type1 symbol name (e.g. 'phi').
es_es: Un único carácter unicode, un comando TeX (por ejemplo, r'\pi') o un nombre de símbolo Type1 (por ejemplo, 'phi').

source: **math**
es_es: **matemática**

source: bool, default: True
es_es: bool, por defecto: True

source: If False, always treat as a single unicode character.
es_es: Si False, siempre trate como un único carácter unicode.

source: Given a math expression, renders it in a closely-clipped bounding box to an image file.
es_es: Dada una expresión matemática, la renderiza en un cuadro delimitador estrechamente recortado a un archivo de imagen.

source: A math expression. The math portion must be enclosed in dollar signs.
es_es: Una expresión matemática. La porción de las matemáticas debe estar encerrada en signos de dólares.

source: **filename_or_obj**
es_es: **Nombre de archivo_objeto**

source: str or path-like or file-like
es_es: str o como ruta o archivo

source: Where to write the image data.
es_es: Dónde escribir los datos de la imagen.

source: **prop** : `.FontProperties`, optional
es_es: **prop** : `.FontProperties`, opcional

source: FontProperties, optional
es_es: Propiedades de la fuente, opcional

source: The size and style of the text.
es_es: El tamaño y el estilo del texto.

source: float, optional
es_es: float, opcional

source: The output dpi. If not set, the dpi is determined as for `.Figure.savefig`.
es_es: El dpi de salida. Si no se establece, el dpi se determina como para `.Figure.savefig`.

source: **format**
es_es: **formato**

source: str, optional
es_es: str, opcional

source: The output format, e.g., 'svg', 'pdf', 'ps' or 'png'. If not set, the format is determined as for `.Figure.savefig`.
es_es: El formato de salida, por ejemplo, 'svg', 'pdf', 'ps' o 'png'. Si no se establece, el formato se determina como para `.Figure.savefig`.
