Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/mlab_api.po
Languages: es_es

source: Get all windows of x with length n as a single array, using strides to avoid data duplication.
es_es: Obtener todas las ventanas de x con longitud n como una solo arreglo, usando pasos para evitar la duplicación de datos.

source: It is not safe to write to the output array. Multiple elements may point to the same piece of memory, so modifying one value may change others.
es_es: No es seguro escribir en el arreglo de salida. Múltiples elementos pueden apuntar a la misma pieza de memoria, por lo que modificar un valor puede cambiar otros.

source: 1D array or sequence
es_es: Arreglo o secuencia 1D

source: The number of data points in each window.
es_es: El número de puntos de datos en cada ventana.

source: The overlap between adjacent windows.
es_es: La superposición entre las ventanas adyacentes.

source: The axis along which the windows will run.
es_es: El eje a lo largo del cual correrán las ventanas.

source: Return x times the hanning window of len(x).
es_es: Devuelve x veces la ventana de hanning de len(x).

source: Another window algorithm.
es_es: Otro algoritmo de ventana.

source: No window function; simply return x.
es_es: No hay función de ventana; simplemente devuelve x.
