Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/mlab_api.po
Languages: es_es

source: Numerical Python functions written for compatibility with MATLAB commands with the same names. Most numerical Python functions can be found in the `NumPy`_ and `SciPy`_ libraries. What remains here is code for performing spectral computations and kernel density estimations.
es_es: Funciones numéricas de Python escritas para que sean compatibles con los comandos de MATLAB con los mismos nombres. La mayoría de las funciones numéricas de Python se pueden encontrar en las bibliotecas `NumPy`_ y `SciPy`_. Lo que queda aquí es el código para realizar cálculos espectrales y estimaciones de la densidad del núcleo.

source: Spectral functions
es_es: Funciones espectrales

source: Coherence (normalized cross spectral density)
es_es: Coherencia (densidad espectral cruzada normalizada)

source: Cross spectral density using Welch's average periodogram
es_es: Densidad espectral cruzada mediante el periodograma promedio de Welch

source: Remove the mean or best fit line from an array
es_es: Eliminar la línea media o de mejor ajuste de una arreglo

source: Power spectral density using Welch's average periodogram
es_es: Densidad espectral de potencia mediante el periodograma promedio de Welch

source: Spectrogram (spectrum over segments of time)
es_es: Espectrograma (espectro sobre segmentos de tiempo)

source: Return the complex-valued frequency spectrum of a signal
es_es: Devuelve el espectro de frecuencias de valor complejo de una señal

source: Return the magnitude of the frequency spectrum of a signal
es_es: Devuelve la magnitud del espectro de frecuencias de una señal

source: Return the angle (wrapped phase) of the frequency spectrum of a signal
es_es: Devuelve el ángulo (fase wrapped) del espectro de frecuencias de una señal

source: Return the phase (unwrapped angle) of the frequency spectrum of a signal
es_es: Devuelve la fase (ángulo unwrapped) del espectro de frecuencias de una señal

source: Remove the mean from a line.
es_es: Eliminar la media de una línea.

source: Remove the best fit line from a line.
es_es: Eliminar la línea de mejor ajuste de una línea.

source: Return the original line.
es_es: Devuelve la línea original.

source: Get all windows in an array in a memory-efficient manner
es_es: Obtener todas las ventanas de un arreglo de forma eficiente en memoria

source: Representation of a kernel-density estimate using Gaussian kernels.
es_es: Representación de una estimación de la densidad del núcleo mediante núcleos gaussianos.

source: Parameters
es_es: Parámetros

source: Datapoints to estimate from. In case of univariate data this is a 1-D array, otherwise a 2D array with shape (# of dims, # of data).
es_es: Puntos de datos para estimar. En el caso de los datos univariantes, se trata de un arreglo 1-D, de lo contrario un arreglo 2D con forma (# de dims, # de datos).

source: The method used to calculate the estimator bandwidth. This can be 'scott', 'silverman', a scalar constant or a callable. If a scalar, this will be used directly as `kde.factor`. If a callable, it should take a `GaussianKDE` instance as only parameter and return a scalar. If None (default), 'scott' is used.
es_es: El método utilizado para calcular el ancho de banda del estimador. Puede ser `scott`, `silverman`, una constante escalar o un invocable. Si es un escalar, se utilizará directamente como `kde.factor`. Si es un invocable, debe tomar una instancia de `GaussianKDE` como único parámetro y devolver un escalar. Si es None (por defecto), se utiliza `scott`.

source: Attributes
es_es: Atributos

source: The dataset with which `gaussian_kde` was initialized.
es_es: El conjunto de datos con el que se inicializó `gaussian_kde`.

source: Number of dimensions.
es_es: Número de dimensiones.

source: Number of datapoints.
es_es: Número de puntos de datos.

source: The bandwidth factor, obtained from `kde.covariance_factor`, with which the covariance matrix is multiplied.
es_es: El factor de ancho de banda, obtenido de `kde.covariance_factor`, con el que se multiplica la matriz de covarianza.

source: The covariance matrix of *dataset*, scaled by the calculated bandwidth (`kde.factor`).
es_es: La matriz de covarianza de *conjunto de datos*, escalada por el ancho de banda calculado (`kde.factor`).

source: The inverse of *covariance*.
es_es: La inversa de la *covarianza*.

source: Methods
es_es: Métodos

source: (ndarray) Evaluate the estimated pdf on a provided set of points.
es_es: (ndarray) Evaluar el pdf estimado en un conjunto de puntos proporcionado.

source: (ndarray) Same as kde.evaluate(points)
es_es: (ndarray) Igual que kde.evaluate(points)

source: Evaluate the estimated pdf on a set of points.
es_es: Evaluar el pdf estimado en un conjunto de puntos.

source: (# of dimensions, # of points)-array
es_es: (# de dimensiones, # de puntos)-array

source: Alternatively, a (# of dimensions,) vector can be passed in and treated as a single point.
es_es: Alternativamente, un (# de dimensiones,) vector puede ser pasado y tratado como un solo punto.

source: Returns
es_es: Devuelve

source: (# of points,)-array
es_es: (# de puntos,)-array

source: The values at each point.
es_es: Los valores en cada punto.

source: Raises
es_es: Plantea

source: if the dimensionality of the input points is different
es_es: si la dimensionalidad de los puntos de entrada es diferente

source: than the dimensionality of the KDE.
es_es: que la dimensionalidad de la KDE.

source: Compute the angle of the frequency spectrum (wrapped phase spectrum) of *x*. Data is padded to a length of *pad_to* and the windowing function *window* is applied to the signal.
es_es: Calcula el ángulo del espectro de frecuencias (espectro de fase wrapped) de *x*. Los datos se rellenan con una longitud de *pad_to* y se aplica la función de ventana *window* a la señal.

source: 1-D array or sequence
es_es: Arreglo o secuencia 1-D

source: Array or sequence containing the data
es_es: Arreglo o secuencia que contiene los datos

source: The sampling frequency (samples per time unit). It is used to calculate the Fourier frequencies, *freqs*, in cycles per time unit.
es_es: La frecuencia de muestreo (muestras por unidad de tiempo). Se utiliza para calcular las frecuencias de Fourier, *freqs*, en ciclos por unidad de tiempo.

source: **window** : callable or ndarray, default: `.window_hanning`
es_es: **window** : callable o ndarray, default: `.window_hanning`

source: callable or ndarray, default:
es_es: callable o ndarray, default:

source: A function or a vector of length *NFFT*. To create window vectors see `.window_hanning`, `.window_none`, `numpy.blackman`, `numpy.hamming`, `numpy.bartlett`, `scipy.signal`, `scipy.signal.get_window`, etc. If a function is passed as the argument, it must take a data segment as an argument and return the windowed version of the segment.
es_es: Una función o un vector de longitud *NFFT*. Para crear vectores ventana, ver `.window_hanning`, `.window_none`, `numpy.blackman`, `numpy.hamming`, `numpy.bartlett`, `scipy.signal`, `scipy.signal.get_window`, etc. Si se pasa una función como argumento, debe tomar un segmento de datos como argumento y devolver la versión con ventana del segmento.

source: {'default', 'onesided', 'twosided'}, optional
es_es: {'default', 'onesided', 'twosided'}, opcional

source: Which sides of the spectrum to return. 'default' is one-sided for real data and two-sided for complex data. 'onesided' forces the return of a one-sided spectrum, while 'twosided' forces two-sided.
es_es: Qué lados del espectro devolver. 'default' es de un solo lado para datos reales y de dos lados para datos complejos. 'onesided' fuerza la devolución de un espectro de un solo lado, mientras que 'twosided' fuerza dos lados.

source: int, optional
es_es: int, opcional

source: The number of points to which the data segment is padded when performing the FFT. While not increasing the actual resolution of the spectrum (the minimum distance between resolvable peaks), this can give more points in the plot, allowing for more detail. This corresponds to the *n* parameter in the call to fft(). The default is None, which sets *pad_to* equal to the length of the input signal (i.e. no padding).
es_es: El número de puntos con los que se rellena el segmento de datos al realizar la FFT. Aunque no aumenta la resolución real del espectro (la distancia mínima entre los picos resolubles), esto puede dar más puntos en el gráfico, permitiendo más detalles. Esto corresponde al parámetro *n* en la llamada a fft(). El valor por defecto es None, que establece *pad_to* igual a la longitud de la señal de entrada (es decir, sin relleno).

source: 1-D array
es_es: Arreglo 1-D

source: The angle of the frequency spectrum (wrapped phase spectrum).
es_es: El ángulo del espectro de frecuencias (espectro de fase envuelto).

source: The frequencies corresponding to the elements in *spectrum*.
es_es: Las frecuencias correspondientes a los elementos en *espectro*.

source: Returns the power spectral density.
es_es: Devuelve la potencia de la densidad espectral.

source: Returns the complex-valued frequency spectrum.
es_es: Devuelve el espectro de frecuencias de valor complejo.

source: Returns the absolute value of the `complex_spectrum`.
es_es: Devuelve el valor absoluto del `complex_spectrum`.

source: Returns the angle of the `complex_spectrum`.
es_es: Devuelve el ángulo de `complex_spectrum`.

source: Returns the phase (unwrapped angle) of the `complex_spectrum`.
es_es: Devuelve la fase (ángulo desenvuelto) del `complex_spectrum`.

source: Can return the complex spectrum of segments within the signal.
es_es: Puede devolver el espectro complejo de segmentos dentro de la señal.

source: The coherence between *x* and *y*. Coherence is the normalized cross spectral density:
es_es: La coherencia entre *x* y *y*. La coherencia es la densidad espectral cruzada normalizada:

source: The number of points to which the data segment is padded when performing the FFT. This can be different from *NFFT*, which specifies the number of data points used. While not increasing the actual resolution of the spectrum (the minimum distance between resolvable peaks), this can give more points in the plot, allowing for more detail. This corresponds to the *n* parameter in the call to fft(). The default is None, which sets *pad_to* equal to *NFFT*
es_es: El número de puntos a los que se rellena el segmento de datos al realizar la FFT. Esto puede ser diferente de *NFFT*, que especifica el número de puntos de datos utilizados. Aunque no aumenta la resolución real del espectro (la distancia mínima entre los picos resolubles), esto puede dar más puntos en el gráfico, permitiendo más detalles. Esto corresponde al parámetro *n* en la llamada a fft(). El valor por defecto es None, que establece *pad_to* igual a *NFFT*

source: The number of data points used in each block for the FFT. A power 2 is most efficient. This should *NOT* be used to get zero padding, or the scaling of the result will be incorrect; use *pad_to* for this instead.
es_es: El número de puntos de datos utilizados en cada bloque para la FFT. Una potencia 2 es lo más eficiente. Esto debe *NO* usarse para obtener el relleno de cero, o el escalado del resultado será incorrecto; use *pad_to* para esto en su lugar.

source: The function applied to each segment before fft-ing, designed to remove the mean or linear trend. Unlike in MATLAB, where the *detrend* parameter is a vector, in Matplotlib it is a function. The :mod:`~matplotlib.mlab` module defines `.detrend_none`, `.detrend_mean`, and `.detrend_linear`, but you can use a custom function as well. You can also use a string to choose one of the functions: 'none' calls `.detrend_none`. 'mean' calls `.detrend_mean`. 'linear' calls `.detrend_linear`.
es_es: La función aplicada a cada segmento antes de fft-ing, diseñada para eliminar la media o la tendencia lineal. A diferencia de MATLAB, donde el parámetro *detrend* es un vector, en Matplotlib es una función. El módulo :mod:`~matplotlib.mlab` define `.detrend_none`, `.detrend_mean` y `.detrend_linear`, pero también se puede utilizar una función personalizada. También puede utilizar una cadena para elegir una de las funciones: "none" llama a `.detrend_none`. 'mean' invoca a `.detrend_mean`. 'linear' llama a `.detrend_linear`.

source: Whether the resulting density values should be scaled by the scaling frequency, which gives density in units of Hz^-1. This allows for integration over the returned frequency values. The default is True for MATLAB compatibility.
es_es: Si los valores de densidad resultantes deben ser escalados por la frecuencia de escalado, que da la densidad en unidades de Hz^-1. Esto permite la integración sobre los valores de frecuencia devueltos. El valor por defecto es True para la compatibilidad con MATLAB.

source: The number of points of overlap between segments.
es_es: El número de puntos de solapamiento entre segmentos.

source: The coherence vector.
es_es: El vector de coherencia.

source: The frequencies for the elements in *Cxy*.
es_es: Las frecuencias de los elementos en *Cxy*.

source: For information about the methods used to compute :math:`P_{xy}`, :math:`P_{xx}` and :math:`P_{yy}`.
es_es: Para obtener información sobre los métodos utilizados para calcular :math:`P_{xy}`, :math:`P_{xx}` y :math:`P_{yy}`.

source: Compute the complex-valued frequency spectrum of *x*. Data is padded to a length of *pad_to* and the windowing function *window* is applied to the signal.
es_es: Calcula el espectro de frecuencia de valor complejo de *x*. Los datos se rellenan con una longitud de *pad_to* y se aplica la función de ventana *window* a la señal.

source: The complex-valued frequency spectrum.
es_es: El espectro de frecuencias de valor complejo.

source: Compute the cross-spectral density.
es_es: Calcula la densidad espectral cruzada.

source: The cross spectral density :math:`P_{xy}` by Welch's average periodogram method. The vectors *x* and *y* are divided into *NFFT* length segments. Each segment is detrended by function *detrend* and windowed by function *window*. *noverlap* gives the length of the overlap between segments. The product of the direct FFTs of *x* and *y* are averaged over each segment to compute :math:`P_{xy}`, with a scaling to correct for power loss due to windowing.
es_es: La densidad espectral cruzada :math:`P_{xy}` por el método del periodograma medio de Welch. Los vectores *x* e *y* se dividen en segmentos de longitud *NFFT*. Cada segmento se detrae con la función *detrend* y se abre con la función *window*. *noverlap* da la longitud del solapamiento entre segmentos. El producto de las FFTs directas de *x* y *y* se promedia sobre cada segmento para calcular :math:`P_{xy}`, con una escala para corregir la pérdida de potencia debido a la ventana.

source: If len(*x*) < *NFFT* or len(*y*) < *NFFT*, they will be zero padded to *NFFT*.
es_es: Si len(*x*) < *NFFT* o len(*y*) < *NFFT*, se rellenarán de cero a *NFFT*.

source: 1-D arrays or sequences
es_es: Arreglos o secuencias 1-D

source: Arrays or sequences containing the data
es_es: Arreglos o secuencias que contienen los datos

source: The values for the cross spectrum :math:`P_{xy}` before scaling (real valued)
es_es: Los valores del espectro cruzado :math:`P_{xy}` antes de escalar (valor real)

source: The frequencies corresponding to the elements in *Pxy*
es_es: Las frecuencias correspondientes a los elementos de *Pxy*

source: equivalent to setting ``y = x``.
es_es: equivalente a establecer ``y = x``.

source: References
es_es: Referencias

source: Bendat & Piersol -- Random Data: Analysis and Measurement Procedures, John Wiley & Sons (1986)
es_es: Bendat & Piersol -- Datos aleatorios: Analysis and Measurement Procedures, John Wiley & Sons (1986)

source: Return x with its trend removed.
es_es: Devuelve x con su tendencia eliminada.

source: array or sequence
es_es: arreglo o secuencia

source: Array or sequence containing the data.
es_es: Arreglo o secuencia que contiene los datos.

source: {'default', 'constant', 'mean', 'linear', 'none'} or function
es_es: {'default', 'constant', 'mean', 'linear', 'none'} o función

source: The detrending algorithm to use. 'default', 'mean', and 'constant' are the same as `detrend_mean`. 'linear' is the same as `detrend_linear`. 'none' is the same as `detrend_none`. The default is 'mean'. See the corresponding functions for more details regarding the algorithms. Can also be a function that carries out the detrend operation.
es_es: El algoritmo de desdiferenciación a utilizar. 'default', 'mean', y 'constant' son los mismos que `detrend_mean`. 'linear' es lo mismo que `detrend_linear`. 'none' es lo mismo que `detrend_none`. El valor por defecto es 'mean'. Consulte las funciones correspondientes para obtener más detalles sobre los algoritmos. También puede ser una función que realice la operación de detrend.

source: The axis along which to do the detrending.
es_es: El eje a lo largo del cual se realiza la desviación.

source: Implementation of the 'mean' algorithm.
es_es: Implementación del algoritmo 'mean'.

source: Implementation of the 'linear' algorithm.
es_es: Implementación del algoritmo 'linear'.

source: Implementation of the 'none' algorithm.
es_es: Implementación del algoritmo 'none'.

source: Return x minus best fit line; 'linear' detrending.
es_es: Devuelve x menos la línea de mejor ajuste; detrending 'linear'.

source: 0-D or 1-D array or sequence
es_es: Arreglo o secuencia 0-D o 1-D

source: Another detrend algorithm.
es_es: Otro algoritmo de detrimento.

source: A wrapper around all the detrend algorithms.
es_es: Una envoltura alrededor de todos los algoritmos detrend.

source: Return x minus the mean(x).
es_es: Devuelve x menos la media(x).

source: Array or sequence containing the data Can have any dimensionality
es_es: Arreglo o secuencia que contiene los datos Puede tener cualquier dimensionalidad

source: The axis along which to take the mean. See numpy.mean for a description of this argument.
es_es: El eje a lo largo del cual se tomará la media. Ver numpy.mean para una descripción de este argumento.

source: Return x: no detrending.
es_es: Retorno x: no hay detrending.

source: any object
es_es: cualquier objeto

source: An object containing the data
es_es: Un objeto que contiene los datos

source: This parameter is ignored. It is included for compatibility with detrend_mean
es_es: Este parámetro se ignora. Se incluye por compatibilidad con detrend_mean

source: Compute the magnitude (absolute value) of the frequency spectrum of *x*. Data is padded to a length of *pad_to* and the windowing function *window* is applied to the signal.
es_es: Calcula la magnitud (valor absoluto) del espectro de frecuencia de *x*. Los datos se rellenan con una longitud de *pad_to* y se aplica la función de ventana *window* a la señal.

source: The magnitude (absolute value) of the frequency spectrum.
es_es: La magnitud (valor absoluto) del espectro de frecuencias.

source: Compute the phase of the frequency spectrum (unwrapped phase spectrum) of *x*. Data is padded to a length of *pad_to* and the windowing function *window* is applied to the signal.
es_es: Calcula la fase del espectro de frecuencias (espectro de fase sin envolver) de *x*. Los datos se rellenan con una longitud de *pad_to* y se aplica la función de ventana *window* a la señal.

source: The phase of the frequency spectrum (unwrapped phase spectrum).
es_es: La fase del espectro de frecuencias (espectro de fase sin envolver).

source: Compute the power spectral density.
es_es: Calcula la densidad espectral de potencia.

source: The power spectral density :math:`P_{xx}` by Welch's average periodogram method. The vector *x* is divided into *NFFT* length segments. Each segment is detrended by function *detrend* and windowed by function *window*. *noverlap* gives the length of the overlap between segments. The :math:`|\mathrm{fft}(i)|^2` of each segment :math:`i` are averaged to compute :math:`P_{xx}`.
es_es: La densidad espectral de potencia :math:`P_{xx}` por el método del periodograma medio de Welch. El vector *x* se divide en segmentos de longitud *NFFT*. Cada segmento se detrae con la función *detrend* y se abre con la función *window*. La función *noverlap* da la longitud del solapamiento entre segmentos. El :math:`|mathrm{fft}(i)|^2` de cada segmento :math:`i` se promedia para calcular :math:`P_{xx}`.

source: If len(*x*) < *NFFT*, it will be zero padded to *NFFT*.
es_es: Si len(*x*) < *NFFT*, se rellenará de cero a *NFFT*.

source: The values for the power spectrum :math:`P_{xx}` (real valued)
es_es: Los valores del espectro de potencia :math:`P_{xx}` (de valor real)

source: The frequencies corresponding to the elements in *Pxx*
es_es: Las frecuencias correspondientes a los elementos de *Pxx*

source: `specgram` differs in the default overlap; in not returning the mean of the segment periodograms; and in returning the times of the segments.
es_es: `specgram` difiere en el solapamiento por defecto; en no devolver la media de los periodogramas de los segmentos; y en devolver los tiempos de los segmentos.

source: returns the magnitude spectrum.
es_es: devuelve el espectro de magnitud.

source: returns the spectral density between two signals.
es_es: devuelve la densidad espectral entre dos señales.

source: Compute a spectrogram.
es_es: Calcula un espectrograma.

source: Compute and plot a spectrogram of data in x. Data are split into NFFT length segments and the spectrum of each section is computed. The windowing function window is applied to each segment, and the amount of overlap of each segment is specified with noverlap.
es_es: Calcula y grafica un espectrograma de datos en x. Los datos se dividen en segmentos de longitud NFFT y se calcula el espectro de cada sección. La función de ventana se aplica a cada segmento, y la cantidad de solapamiento de cada segmento se especifica con noverlap.

source: 1-D array or sequence.
es_es: Arreglo o secuencia 1-D.

source: int, default: 128
es_es: int, por defecto: 128

source: The number of points of overlap between blocks.
es_es: El número de puntos de solapamiento entre bloques.

source: What sort of spectrum to use:
es_es: Qué tipo de espectro utilizar:

source: Returns the magnitude spectrum.
es_es: Devuelve el espectro de magnitud.

source: Returns the phase spectrum without unwrapping.
es_es: Devuelve el espectro de fases sin desenvolver.

source: Returns the phase spectrum with unwrapping.
es_es: Devuelve el espectro de fase con desenvoltura.

source: 2D array, columns are the periodograms of successive segments.
es_es: Arreglo 2D, las columnas son los periodogramas de los segmentos sucesivos.

source: 1-D array, frequencies corresponding to the rows in *spectrum*.
es_es: Arreglo 1-D, frecuencias correspondientes a las filas del *espectro*.

source: 1-D array, the times corresponding to midpoints of segments (i.e the columns in *spectrum*).
es_es: Arreglo 1-D, los tiempos correspondientes a los midpoints de los segmentos (es decir, las columnas en *spectrum*).

source: differs in the overlap and in the return values.
es_es: difiere en el solapamiento y en los valores de retorno.

source: similar, but with complex valued frequencies.
es_es: similar, pero con frecuencias de valor complejo.

source: similar single segment when mode is 'magnitude'.
es_es: segmento único similar cuando el modo es 'magnitude'.

source: similar to single segment when mode is 'angle'.
es_es: similar a un solo segmento cuando el modo es 'angle'.

source: similar to single segment when mode is 'phase'.
es_es: similar a un solo segmento cuando el modo es 'phase'.

source: Notes
es_es: Notas

source: detrend and scale_by_freq only apply when *mode* is set to 'psd'.
es_es: detrend y scale_by_freq sólo se aplican cuando *mode* se establece como 'psd'.
