Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/path_api.po
Languages: es_es

source: If *width* and *height* are both non-zero then the lines will be simplified so that vertices outside of (0, 0), (width, height) will be clipped.
es_es: Si *ancho* y *alto* son ambos distintos de cero, las líneas se simplificarán de modo que los vértices fuera de (0, 0), (ancho, alto) serán recortados.

source: If *closed_only* is `True` (default), only closed polygons, with the last point being the same as the first point, will be returned. Any unclosed polylines in the path will be explicitly closed. If *closed_only* is `False`, any unclosed polygons in the path will be returned as unclosed polygons, and the closed polygons will be returned explicitly closed by setting the last point to the same as the first point.
es_es: Si *closed_only* es `True` (por defecto), sólo se devolverán polígonos cerrados, cuyo último punto sea el mismo que el primero. Cualquier polilínea no cerrada en la ruta se cerrará explícitamente. Si *closed_only* es `False`, cualquier polígono no cerrado en el camino será devuelto como polígono no cerrado, y los polígonos cerrados serán devueltos explícitamente cerrados estableciendo el último punto igual al primer punto.

source: Return a transformed copy of the path.
es_es: Devuelve una copia transformada de la ruta.

source: A specialized path class that will cache the transformed result and automatically update when the transform changes.
es_es: Una clase de ruta especializada que almacenará en caché el resultado transformado y se actualizará automáticamente cuando la transformación cambie.

source: Return the readonly :class:`Path` of the unit circle.
es_es: Devuelve la lectura :class:`Path` del círculo unitario.

source: For most cases, :func:`Path.circle` will be what you want.
es_es: En la mayoría de los casos, :func:`Path.circle` será lo que tú deseas.

source: Return a `Path` of the right half of a unit circle.
es_es: Devuelve una `Ruta` de la mitad derecha de un círculo unitario.

source: See `Path.circle` for the reference on the approximation used.
es_es: Ver `Path.circle` para la referencia de la aproximación utilizada.

source: Return a `Path` instance of the unit rectangle from (0, 0) to (1, 1).
es_es: Devuelve una instancia de `Ruta` del rectángulo unitario desde (0, 0) hasta (1, 1).

source: Return a :class:`Path` for a unit regular asterisk with the given numVertices and radius of 1.0, centered at (0, 0).
es_es: Devuelve un :class:`Path` para un asterisco regular unitario con el número de vértices dado y un radio de 1,0, centrado en (0, 0).

source: Return a :class:`Path` instance for a unit regular polygon with the given *numVertices* such that the circumscribing circle has radius 1.0, centered at (0, 0).
es_es: Devuelve una instancia de :class:`Path` para un polígono regular unitario con el *numVertices* dado tal que el círculo que lo circunscribe tiene radio 1.0, centrado en (0, 0).

source: Return a :class:`Path` for a unit regular star with the given numVertices and radius of 1.0, centered at (0, 0).
es_es: Devuelve un :class:`Path` para una estrella regular unitaria con el número de vértices dado y un radio de 1,0, centrado en (0, 0).

source: The list of vertices in the `Path` as an Nx2 numpy array.
es_es: La lista de vértices en la `Ruta` como un arreglo numpy Nx2.

source: Return a `Path` for the unit circle wedge from angles *theta1* to *theta2* (in degrees).
es_es: Devuelve una `Ruta` para la cuña del círculo unitario desde los ángulos *theta1* a *theta2* (en grados).

source: *theta2* is unwrapped to produce the shortest wedge within 360 degrees. That is, if *theta2* > *theta1* + 360, the wedge will be from *theta1* to *theta2* - 360 and not a full circle plus some extra overlap.
es_es: *theta2* se desenvuelve para producir un wedge más corto dentro de los 360 grados. Es decir, si *theta2* > *theta1* + 360, el wedge será de *theta1* a *theta2* - 360 y no un círculo completo más algún solapamiento extra.

source: See `Path.arc` for the reference on the approximation used.
es_es: Ver `Path.arc` para la referencia sobre la aproximación utilizada.

source: Given a sequence of `Path`\s, `.Transform`\s objects, and offsets, as found in a `.PathCollection`, returns the bounding box that encapsulates all of them.
es_es: Dada una secuencia de `Path`, objetos `.Transform` y desplazamientos, que se encuentran en una `.PathCollection`, devuelve la caja delimitadora que los engloba a todos.

source: Transform
es_es: Transformar

source: Global transformation applied to all paths.
es_es: Transformación global aplicada a todas las rutas.

source: **paths** : list of `Path`
es_es: **paths** : lista de `Path`

source: list of
es_es: lista de

source: **transforms** : list of `.Affine2D`
es_es: **transforms** : lista de `.Affine2D`

source: Transform applied to the offsets before offsetting the path.
es_es: Transformación aplicada a los desplazamientos antes de desplazar la ruta.

source: The way that *paths*, *transforms* and *offsets* are combined follows the same method as for collections: Each is iterated over independently, so if you have 3 paths, 2 transforms and 1 offset, their combinations are as follows:
es_es: La forma en que se combinan los *rutas*, las *transformaciones* y los *desplazamientos* sigue el mismo método que para las colecciones: Cada uno de ellos se itera de forma independiente, por lo que si tienes 3 rutas, 2 transformaciones y 1 desplazamiento, sus combinaciones son las siguientes:
