Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/patheffects_api.po
Languages: es_es

source: Defines classes for path effects. The path effects are supported in `.Text`, `.Line2D` and `.Patch`.
es_es: Define las clases para los efectos de la ruta. Los efectos de la ruta son soportados en `.Text`, `.Line2D` y `.Patch`.

source: :doc:`/tutorials/advanced/patheffects_guide`
es_es: :doc:`/tutorials/avanzado/patheffects_guide`

source: A base class for path effects.
es_es: Una clase base para efectos de ruta.

source: Subclasses should override the ``draw_path`` method to add effect functionality.
es_es: Las subclases deben sobreescribir el método ``draw_path`` para agregar funcionalidad de efecto.

source: Parameters
es_es: Parámetros

source: The (x, y) offset to apply to the path, measured in points.
es_es: El desplazamiento (x, y) para aplicar a la ruta, medido en puntos.

source: Derived should override this method. The arguments are the same as :meth:`matplotlib.backend_bases.RendererBase.draw_path` except the first argument is a renderer.
es_es: Derivado debe anular este método. Los argumentos son los mismos que :meth:`matplotlib.backend_bases.RendererBase.draw_path` excepto que el primer argumento es un renderizador.

source: The "identity" PathEffect.
es_es: La "identidad" PathEffect.

source: The Normal PathEffect's sole purpose is to draw the original artist with no special path effect.
es_es: El propósito único de Normal PathEffect es dibujar al artista original sin ningún efecto especial de ruta.

source: Implements a Renderer which contains another renderer.
es_es: Implementa un Renderer que contiene otro renderizador.

source: This proxy then intercepts draw calls, calling the appropriate :class:`AbstractPathEffect` draw method.
es_es: Este proxy intercepta entonces las llamadas de dibujo, llamando al método :class:de dibujo `AbstractPathEffect` apropiado.

source: Not all methods have been overridden on this RendererBase subclass. It may be necessary to add further methods to extend the PathEffects capabilities further.
es_es: No todos los métodos han sido sobreescritos en esta subclase RenderBase. Puede ser necesario agregar métodos adicionales para extender aún más las capacidades de PathEffects.

source: **path_effects** : iterable of :class:`AbstractPathEffect`
es_es: **path_effects** : iterable de :class:`AbstractPathEffect`

source: iterable of
es_es: iterable de

source: The path effects which this renderer represents.
es_es: Los efectos de ruta que representa este renderizador.

source: **renderer** : `matplotlib.backend_bases.RendererBase` subclass
es_es: **renderizador** : subclase `matplotlib.backend_bases.RendererBase`

source: matplotlib.backend_bases.RendererBase subclass
es_es: subclase de base de renderizador

source: Draw a marker at each of *path*'s vertices (excluding control points).
es_es: Dibuja un marcador en cada uno de los vértices de *path* (excluyendo los puntos de control).

source: This provides a fallback implementation of draw_markers that makes multiple calls to :meth:`draw_path`. Some backends may want to override this method in order to draw the marker only once and reuse it multiple times.
es_es: Esto proporciona una implementación de draw_markers que hace varias llamadas a :meth:`draw_path`. Algunos backends pueden querer sobreescribir este método para dibujar el marcador una sola vez y reutilizarlo varias veces.

source: GraphicsContextBase
es_es: Contexto gráfico base

source: The graphics context.
es_es: El contexto gráfico.

source: matplotlib.transforms.Transform
es_es: matplotlib.transforms.Transformar

source: An affine transform applied to the marker.
es_es: Una transformación afectada aplicada al marcador.

source: An affine transform applied to the path.
es_es: Una transformación afectada aplicada a la ruta.

source: Draw a `~.path.Path` instance using the given affine transform.
es_es: Dibuja una instancia `~.path.Path` usando la transforma affine dada.

source: Draw a collection of paths selecting drawing properties from the lists *facecolors*, *edgecolors*, *linewidths*, *linestyles* and *antialiaseds*. *offsets* is a list of offsets to apply to each of the paths. The offsets in *offsets* are first transformed by *offsetTrans* before being applied.
es_es: Dibuja una colección de rutas seleccionando propiedades de las listas *colores face*, *colores*, *anchuras de línea*, *linestyles* y *antialias*. *offsets* es una lista de desplazamientos a aplicar a cada una de las rutas. Los desplazamientos en *offsets* son transformados primero por *offsetTrans* antes de ser aplicados.

source: *offset_position* is unused now, but the argument is kept for backwards compatibility.
es_es: *offset_position* no se usa ahora, pero el argumento se mantiene por compatibilidad hacia atrás.

source: This provides a fallback implementation of :meth:`draw_path_collection` that makes multiple calls to :meth:`draw_path`. Some backends may want to override this in order to render each set of path data only once, and then reference that path multiple times with the different offsets, colors, styles etc. The generator methods :meth:`_iter_collection_raw_paths` and :meth:`_iter_collection` are provided to help with (and standardize) the implementation across backends. It is highly recommended to use those generators, so that changes to the behavior of :meth:`draw_path_collection` can be made globally.
es_es: Esto proporciona una implementación de respaldo de :meth:`draw_path_collection` que hace varias llamadas a :meth:`draw_path`. Algunos backends pueden querer anular esto para representar cada conjunto de datos de ruta sólo una vez, y luego referencia que ruta varias veces con los diferentes desplazamientos, colores, estilos, etc. Los métodos generadores :meth:`_iter_collection_raw_paths` y :meth:`_iter_collection` son proporcionados para ayudar con (y estandarizar) la implementación a través de los backends. Es altamente recomendable usar esos generadores, de modo que los cambios en el comportamiento de :meth:`draw_path_collection` puedan hacerse globalmente.

source: Draws a `.PathPatch` instance whose Path comes from the original PathEffect artist.
es_es: Dibuja una instancia `.PathPatch` cuya Ruta proviene del artista original PathEffect.

source: The (x, y) offset to apply to the path, in points.
es_es: El desplazamiento (x, y) para aplicar a la ruta, en puntos.

source: All keyword arguments are passed through to the :class:`~matplotlib.patches.PathPatch` constructor. The properties which cannot be overridden are "path", "clip_box" "transform" and "clip_path".
es_es: Todos los argumentos de palabra clave se pasan al constructor :class:`~matplotlib.patches.PathPatch`. Las propiedades que no se pueden anular son "ruta", "clip_box" "transform" y "clip_path".

source: A simple shadow via a line.
es_es: Una simple sombra a través de una línea.

source: (float, float), default: (2, -2)
es_es: (flotante, flotante), por defecto: (2, -2)

source: **shadow_color**
es_es: **sombra_color**

source: color, default: 'black'
es_es: color, predeterminado: 'negro'

source: The shadow color. A value of ``None`` takes the original artist's color with a scale factor of *rho*.
es_es: El color de la sombra. Un valor de ``Ninguno`` toma el color del artista original con un factor de escala de *rho*.

source: **alpha**
es_es: **alfa**

source: The alpha transparency of the created shadow patch.
es_es: La transparencia alfa del parche de sombra creado.

source: A scale factor to apply to the rgbFace color if *shadow_color* is ``None``.
es_es: Un factor de escala a aplicar al color rgbFace si *shadow_color* es ``Ninguno``.

source: Extra keywords are stored and passed through to :meth:`AbstractPathEffect._update_gc`.
es_es: Las palabras clave adicionales se almacenan y pasan a través de :meth:`AbstractPathEffect._update_gc`.

source: Overrides the standard draw_path to add the shadow offset and necessary color changes for the shadow.
es_es: Sobrescribe la ruta de dibujo estándar para añadir el desplazamiento de sombras y los cambios de color necesarios para la sombra.

source: A simple shadow via a filled patch.
es_es: Una simple sombra a través de un parche lleno.

source: The (x, y) offset of the shadow in points.
es_es: El desplazamiento (x, y) de la sombra en puntos.

source: The shadow color.
es_es: El color de la sombra.

source: The alpha transparency of the created shadow patch. http://matplotlib.1069221.n5.nabble.com/path-effects-question-td27630.html
es_es: La transparencia alfa del parche de sombra creado. http://matplotlib.1069221.n5.nabble.com/path-effects-question-td27630.html

source: A scale factor to apply to the rgbFace color if *shadow_rgbFace* is not specified.
es_es: Un factor de escala para aplicar al color rgbFace si *shadow_rgbFace* no es especificado.

source: A line based PathEffect which re-draws a stroke.
es_es: Una línea basada en PathEffect que vuelve a dibujar un trazo.

source: The path will be stroked with its gc updated with the given keyword arguments, i.e., the keyword arguments should be valid gc parameter values.
es_es: La ruta se trazará con su gc actualizado con los argumentos de palabra clave, es decir, los argumentos de palabra clave deben ser valores de parámetro gc válidos.

source: Draw the path with updated gc.
es_es: Dibuje la ruta con gc actualizado.

source: A line-based PathEffect which draws a path with a ticked style.
es_es: Un PathEffect basado en la línea que dibuja un camino con un estilo marcado.

source: This line style is frequently used to represent constraints in optimization. The ticks may be used to indicate that one side of the line is invalid or to represent a closed boundary of a domain (i.e. a wall or the edge of a pipe).
es_es: Este estilo de línea se utiliza frecuentemente para representar restricciones en la optimización. Los ticks pueden ser usados para indicar que un lado de la línea es inválido o para representar un límite cerrado de un dominio (i. . una pared o el borde de una tubería).

source: The spacing, length, and angle of ticks can be controlled.
es_es: El espaciado, la longitud y el ángulo de ticks pueden ser controlados.

source: This line style is sometimes referred to as a hatched line.
es_es: Este estilo de línea se conoce a veces como una línea eclosionada.

source: See also the :doc:`contour demo example </gallery/lines_bars_and_markers/lines_with_ticks_demo>`.
es_es: Ver también el :doc:`ejemplo de demostración de contorno </gallery/lines_bars_and_markers/lines_with_ticks_demo>`.

source: See also the :doc:`contours in optimization example </gallery/images_contours_and_fields/contours_in_optimization_demo>`.
es_es: Ver también el :doc:`contornos en ejemplo de optimización </gallery/images_contours_and_fields/contours_in_optimization_demo>`.

source: **spacing**
es_es: **Interlineado**

source: The spacing between ticks in points.
es_es: La separación entre ticks en puntos.

source: float, default: 45.0
es_es: flotante, por defecto: 45.0

source: The angle between the path and the tick in degrees. The angle is measured as if you were an ant walking along the curve, with zero degrees pointing directly ahead, 90 to your left, -90 to your right, and 180 behind you.
es_es: El ángulo entre el camino y el tick en grados. El ángulo se mide como si fuera un caminante por la curva, con cero grados apuntando directamente hacia adelante, 90 a la izquierda, -90 a la derecha y 180 detrás de ti.

source: float, default: 1.414
es_es: flotante, por defecto: 1.414

source: Examples
es_es: Ejemplos

source: See :doc:`/gallery/misc/tickedstroke_demo`.
es_es: Vea :doc:`/gallery/misc/tickedstroke_demo`.

source: A shortcut PathEffect for applying `.SimplePatchShadow` and then drawing the original Artist.
es_es: Un acceso directo PathEffect para aplicar `.SimplePatchShadow` y luego dibujar el artista original.

source: With this class you can use ::
es_es: Con esta clase puedes usar ::

source: as a shortcut for ::
es_es: como acceso directo para ::

source: A shortcut PathEffect for applying `.Stroke` and then drawing the original Artist.
es_es: Un acceso directo PathEffect para aplicar `.Stroke` y luego dibujar el artista original.

source: A shortcut PathEffect for applying `.TickedStroke` and then drawing the original Artist.
es_es: Un acceso directo PathEffect para aplicar `.TickedStroke` y luego dibujar el artista original.
