Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/path_api.po
Languages: es_es

source: A module for dealing with the polylines used throughout Matplotlib.
es_es: Un módulo para tratar las polilíneas utilizadas en Matplotlib.

source: The primary class for polyline handling in Matplotlib is `Path`. Almost all vector drawing makes use of `Path`\s somewhere in the drawing pipeline.
es_es: La clase principal para el manejo de polilíneas en Matplotlib es `Path`. Casi todo el dibujo vectorial hace uso de `Path` en alguna parte del pipeline de dibujo.

source: Whilst a `Path` instance itself cannot be drawn, some `.Artist` subclasses, such as `.PathPatch` and `.PathCollection`, can be used for convenient `Path` visualisation.
es_es: Aunque no se puede dibujar una instancia de `Path` en sí misma, algunas subclases de `.Artist`, como `.PathPatch` y `.PathCollection`, pueden utilizarse para una cómoda visualización de `Path`.

source: A series of possibly disconnected, possibly closed, line and curve segments.
es_es: Una serie de segmentos de líneas y curvas posiblemente desconectados y cerrados.

source: The underlying storage is made up of two parallel numpy arrays:
es_es: El almacenamiento subyacente está formado por dos arreglos paralelos de numpy:

source: *vertices*: an Nx2 float array of vertices
es_es: *vertices*: un arreglo Nx2 de punto flotante (float) de vértices

source: *codes*: an N-length uint8 array of path codes, or None
es_es: *codes*: un arreglo uint8 de longitud N de códigos de ruta, o None

source: These two arrays always have the same length in the first dimension. For example, to represent a cubic curve, you must provide three vertices and three ``CURVE4`` codes.
es_es: Estos dos arreglos siempre tienen la misma longitud en la primera dimensión. Por ejemplo, para representar una curva cúbica, debes proporcionar tres vértices y tres códigos ``CURVE4``.

source: The code types are:
es_es: Los tipos de código son:

source: 1 vertex (ignored)
es_es: 1 vértice (ignorado)

source: A marker for the end of the entire path (currently not required and ignored)
es_es: Un marcador para el final de la ruta completa (actualmente no es necesario y se ignora)

source: 1 vertex
es_es: 1 vértice

source: Pick up the pen and move to the given vertex.
es_es: Toma la pluma y se mueve al vértice dado.

source: Draw a line from the current position to the given vertex.
es_es: Dibuja una línea desde la posición actual hasta el vértice dado.

source: 1 control point, 1 endpoint
es_es: 1 punto de control, 1 punto final

source: Draw a quadratic Bezier curve from the current position, with the given control point, to the given end point.
es_es: Dibuja una curva cuadrática de Bézier desde la posición actual, con el punto de control dado, hasta el punto final dado.

source: 2 control points, 1 endpoint
es_es: 2 puntos de control, 1 punto final

source: Draw a cubic Bezier curve from the current position, with the given control points, to the given end point.
es_es: Dibuja una curva cúbica Bézier desde la posición actual, con los puntos de control dados, hasta el punto final especificado.

source: Draw a line segment to the start point of the current polyline.
es_es: Dibuja un segmento de línea hasta el punto de inicio de la polilínea actual.

source: If *codes* is None, it is interpreted as a ``MOVETO`` followed by a series of ``LINETO``.
es_es: Si *codes* no es None, se interpreta como un ``MOVETO`` seguido por una serie de ``LINETO``.

source: Users of Path objects should not access the vertices and codes arrays directly. Instead, they should use `iter_segments` or `cleaned` to get the vertex/code pairs. This helps, in particular, to consistently handle the case of *codes* being None.
es_es: Los usuarios de los objetos Path no deberían acceder a los arreglos de vértices y códigos directamente. En su lugar, deberían utilizar `iter_segments` o `cleaned` para obtener los pares vértice/código. Esto ayuda, en particular, a manejar consistentemente el caso de que los *códigos* sean None.

source: Some behavior of Path objects can be controlled by rcParams. See the rcParams whose keys start with 'path.'.
es_es: Algunos comportamientos de los objetos Path pueden ser controlados por rcParams. Ver los rcParams cuyas claves empiezan por 'path.'.

source: The vertices and codes arrays should be treated as immutable -- there are a number of optimizations and assumptions made up front in the constructor that will not change when the data changes.
es_es: Los arreglos de vértices y códigos deben ser tratadas como inmutables -- hay un número de optimizaciones y suposiciones hechas por adelantado en el constructor que no cambiarán cuando los datos cambien.

source: Create a new path with the given vertices and codes.
es_es: Crea una nueva ruta con los vértices y códigos dados.

source: Parameters
es_es: Parámetros

source: The path vertices, as an array, masked array or sequence of pairs. Masked values, if any, will be converted to NaNs, which are then handled correctly by the Agg PathIterator and other consumers of path data, such as :meth:`iter_segments`.
es_es: Los vértices de la ruta, como un arreglo, un arreglo enmascarado o secuencia de pares. Los valores enmascarados, si los hay, se convertirán en NaNs, que luego serán manejados correctamente por el Agg PathIterator y otros consumidores de datos de rutas, como :meth:`iter_segments`.

source: array-like or None, optional
es_es: array-like o None, opcional

source: N-length array of integers representing the codes of the path. If not None, codes must be the same length as vertices. If None, *vertices* will be treated as a series of line segments.
es_es: Arreglo de longitud N de enteros que representan los códigos de la ruta. Si no es None, los códigos deben tener la misma longitud que los vértices. Si es None, los *vértices* serán tratados como una serie de segmentos de línea.

source: int, optional
es_es: int, opcional

source: Used as a hint to certain projections, such as Polar, that this path should be linearly interpolated immediately before drawing. This attribute is primarily an implementation detail and is not intended for public use.
es_es: Se utiliza como una pista para ciertas proyecciones, como la Polar, de que esta ruta debe ser interpolada linealmente inmediatamente antes de ser dibujada. Este atributo es principalmente un detalle de implementación y no está destinado al uso público.

source: If *codes* is None and closed is True, vertices will be treated as line segments of a closed polygon. Note that the last vertex will then be ignored (as the corresponding code will be set to CLOSEPOLY).
es_es: Si *códigos* es None y closed es True, los vértices serán tratados como segmentos de línea de un polígono cerrado. Tenga en cuenta que el último vértice será entonces ignorado (ya que el código correspondiente se establecerá como CLOSEPOLY).

source: Makes the path behave in an immutable way and sets the vertices and codes as read-only arrays.
es_es: Hace que la ruta se comporte de forma inmutable y establece los vértices y los códigos como arreglos de sólo lectura.

source: A dictionary mapping Path codes to the number of vertices that the code expects.
es_es: Un diccionario que asigna los códigos de ruta al número de vértices que espera el código.

source: Return a `Path` for the unit circle arc from angles *theta1* to *theta2* (in degrees).
es_es: Devuelve una `Ruta` para el arco del círculo unitario desde los ángulos *theta1* a *theta2* (en grados).

source: *theta2* is unwrapped to produce the shortest arc within 360 degrees. That is, if *theta2* > *theta1* + 360, the arc will be from *theta1* to *theta2* - 360 and not a full circle plus some extra overlap.
es_es: *theta2* se desenvuelve para producir el arco más corto dentro de 360 grados. Es decir, si *theta2* > *theta1* + 360, el arco será de *theta1* a *theta2* - 360 y no un círculo completo más algún solapamiento extra.

source: If *n* is provided, it is the number of spline segments to make. If *n* is not provided, the number of spline segments is determined based on the delta between *theta1* and *theta2*.
es_es: Si se proporciona *n*, es el número de segmentos de spline a realizar. Si no se proporciona *n*, el número de segmentos de spline se determina en base al delta entre *theta1* y *theta2*.

source: Return a `Path` representing a circle of a given radius and center.
es_es: Devuelve una `Ruta` que representa un círculo de un radio y centro dados.

source: The center of the circle.
es_es: El centro del círculo.

source: The radius of the circle.
es_es: El radio del círculo.

source: Whether the created path should have the "readonly" argument set when creating the Path instance.
es_es: Si la ruta creada debe tener el argumento "readonly" establecido al crear la instancia de la ruta.

source: Notes
es_es: Notas

source: The circle is approximated using 8 cubic Bezier curves, as described in
es_es: El círculo se aproxima utilizando 8 curvas cúbicas de Bezier, como se describe en

source: Return a new Path with vertices and codes cleaned according to the parameters.
es_es: Devuelve una nueva ruta con vértices y códigos limpiados según los parámetros.

source: for details of the keyword arguments.
es_es: para detalles de los argumentos de palabras clave.

source: Clip the path to the given bounding box.
es_es: Recorta la ruta a la caja delimitadora dada.

source: The path must be made up of one or more closed polygons. This algorithm will not behave correctly for unclosed paths.
es_es: El camino debe estar formado por uno o más polígonos cerrados. Este algoritmo no se comportará correctamente para rutas no cerradas.

source: If *inside* is `True`, clip to the inside of the box, otherwise to the outside of the box.
es_es: Si *inside* es `True`, recorta al interior de la caja, de lo contrario al exterior de la caja.

source: The list of codes in the `Path` as a 1D numpy array. Each code is one of `STOP`, `MOVETO`, `LINETO`, `CURVE3`, `CURVE4` or `CLOSEPOLY`. For codes that correspond to more than one vertex (`CURVE3` and `CURVE4`), that code will be repeated so that the length of `self.vertices` and `self.codes` is always the same.
es_es: La lista de códigos en la `Ruta` como un arreglo numpy 1D. Cada código es uno de los siguientes: `STOP`, `MOVETO`, `LINETO`, `CURVE3`, `CURVE4` o `CLOSEPOLY`. Para los códigos que corresponden a más de un vértice (`CURVE3` y `CURVE4`), ese código se repetirá para que la longitud de `self.vertices` y `self.codes` sea siempre la misma.

source: Return whether this (closed) path completely contains the given path.
es_es: Devuelve si esta ruta (cerrada) contiene completamente la ruta dada.

source: If *transform* is not ``None``, the path will be transformed before checking for containment.
es_es: Si *transform* no es ``None``, la ruta será transformada antes de comprobar la contención.

source: Return whether the area enclosed by the path contains the given point.
es_es: Devuelve si el área encerrada por la ruta contiene el punto dado.

source: The path is always treated as closed; i.e. if the last code is not CLOSEPOLY an implicit segment connecting the last vertex to the first vertex is assumed.
es_es: La trayectoria se trata siempre como cerrada; es decir, si el último código no es CLOSEPOLY se asume un segmento implícito que conecta el último vértice con el primero.

source: The point (x, y) to check.
es_es: El punto (x, y) a comprobar.

source: **transform** : `matplotlib.transforms.Transform`, optional
es_es: **transform** : `matplotlib.transforms.Transform`, opcional

source: matplotlib.transforms.Transform, optional
es_es: matplotlib.transforms.Transform, opcional

source: If not ``None``, *point* will be compared to ``self`` transformed by *transform*; i.e. for a correct check, *transform* should transform the path into the coordinate system of *point*.
es_es: Si no es ``None``, *punto* se comparará con ``self`` transformado por *transform*; es decir, para una comprobación correcta, *transform* debería transformar la trayectoria en el sistema de coordenadas de *punto*.

source: Add an additional margin on the path in coordinates of *point*. The path is extended tangentially by *radius/2*; i.e. if you would draw the path with a linewidth of *radius*, all points on the line would still be considered to be contained in the area. Conversely, negative values shrink the area: Points on the imaginary line will be considered outside the area.
es_es: Añade un margen adicional en el trazado en coordenadas de *punto*. El trazado se extiende tangencialmente por *radio/2*; es decir, si dibujara el trazado con un ancho de línea de *radio*, todos los puntos de la línea seguirían considerándose contenidos en el área. Por el contrario, los valores negativos reducen el área: Los puntos de la línea imaginaria se considerarán fuera del área.

source: Returns
es_es: Devuelve

source: The current algorithm has some limitations:
es_es: El algoritmo actual tiene algunas limitaciones:

source: The result is undefined for points exactly at the boundary (i.e. at the path shifted by *radius/2*).
es_es: El resultado es indefinido para los puntos situados exactamente en el límite (es decir, en la ruta desplazada por *radio/2*).

source: The result is undefined if there is no enclosed area, i.e. all vertices are on a straight line.
es_es: El resultado es indefinido si no hay un área cerrada, es decir, si todos los vértices están en una línea recta.

source: If bounding lines start to cross each other due to *radius* shift, the result is not guaranteed to be correct.
es_es: Si las líneas delimitadoras comienzan a cruzarse debido al desplazamiento del *radio*, no se garantiza que el resultado sea correcto.

source: Return whether the area enclosed by the path contains the given points.
es_es: Devuelve si el área delimitada por el camino contiene los puntos dados.

source: The points to check. Columns contain x and y values.
es_es: Los puntos a comprobar. Las columnas contienen los valores x e y.

source: If not ``None``, *points* will be compared to ``self`` transformed by *transform*; i.e. for a correct check, *transform* should transform the path into the coordinate system of *points*.
es_es: Si no es ``None``, los *puntos* se compararán con el ``self`` transformado por *transform*; es decir, para una comprobación correcta, *transform* debería transformar la trayectoria en el sistema de coordenadas de los *puntos*.

source: Add an additional margin on the path in coordinates of *points*. The path is extended tangentially by *radius/2*; i.e. if you would draw the path with a linewidth of *radius*, all points on the line would still be considered to be contained in the area. Conversely, negative values shrink the area: Points on the imaginary line will be considered outside the area.
es_es: Añade un margen adicional en el trazado en coordenadas de *puntos*. El trazado se extiende tangencialmente por *radio/2*; es decir, si dibujara el trazado con un ancho de línea de *radio*, todos los puntos de la línea seguirían considerándose contenidos en el área. Por el contrario, los valores negativos reducen el área: Los puntos de la línea imaginaria se considerarán fuera del área.

source: length-N bool array
es_es: length-N arreglo bool

source: Return a shallow copy of the `Path`, which will share the vertices and codes with the source `Path`.
es_es: Devuelve una copia superficial de `Ruta`, que compartirá los vértices y códigos con la `Ruta` de origen.

source: Return a deepcopy of the `Path`. The `Path` will not be readonly, even if the source `Path` is.
es_es: Devuelve una copia profunda de la `Ruta`. La `Ruta` no será de sólo lectura, incluso si la `Ruta` de origen lo es.

source: Get Bbox of the path.
es_es: Obtener Bbox de la ruta.

source: Transform to apply to path before computing extents, if any.
es_es: Transformación a aplicar a la ruta antes de calcular las extensiones, si las hay.

source: Forwarded to `.iter_bezier`.
es_es: Reenviado a `.iter_bezier`.

source: The extents of the path Bbox([[xmin, ymin], [xmax, ymax]])
es_es: Las extensiones de la trayectoria Bbox([[xmin, ymin], [xmax, ymax]])

source: Given a hatch specifier, *hatchpattern*, generates a Path that can be used in a repeated hatching pattern. *density* is the number of lines per unit square.
es_es: Dado un especificador de sombreado, *patrón de sombreado*, genera una ruta que puede utilizarse en un patrón de sombreado repetido. *densidad* es el número de líneas por unidad cuadrada.

source: Return a new path resampled to length N x steps.
es_es: Devuelve una nueva ruta remuestreada con una longitud de N x pasos.

source: Codes other than LINETO are not handled correctly.
es_es: Los códigos que no son LINETO no se manejan correctamente.

source: Return whether this path intersects a given `~.transforms.Bbox`.
es_es: Devuelve si esta ruta interseca un `~.transforms.Bbox` dado.

source: If *filled* is True, then this also returns True if the path completely encloses the `.Bbox` (i.e., the path is treated as filled).
es_es: Si *relleno* es True, entonces esto también devuelve True si el camino encierra completamente el `.Bbox` (es decir, el camino es tratado como relleno).

source: The bounding box is always considered filled.
es_es: La caja delimitadora se considera siempre rellena.

source: Return whether if this path intersects another given path.
es_es: Devuelve si esta ruta se cruza con otra ruta dada.

source: If *filled* is True, then this also returns True if one path completely encloses the other (i.e., the paths are treated as filled).
es_es: Si *relleno* es True, entonces también devuelve True si una ruta encierra completamente a al otra (es decir, las rutas se tratan como rellenos).

source: Iterate over each bezier curve (lines included) in a Path.
es_es: Iterar sobre cada curva Bézier (líneas incluidas) en una Ruta.

source: Forwarded to `.iter_segments`.
es_es: Reenviado a `.iter_segments`.

source: Yields
es_es: Rendimiento

source: The bezier curves that make up the current path. Note in particular that freestanding points are bezier curves of order 0, and lines are bezier curves of order 1 (with two control points).
es_es: Las curvas de Bézier que componen la trayectoria actual. Ten en cuenta que los puntos libres son curvas de Bézier de orden 0, y las líneas son curvas de Bézier de orden 1 (con dos puntos de control).

source: The code describing what kind of curve is being returned. Path.MOVETO, Path.LINETO, Path.CURVE3, Path.CURVE4 correspond to bezier curves with 1, 2, 3, and 4 control points (respectively). Path.CLOSEPOLY is a Path.LINETO with the control points correctly chosen based on the start/end points of the current stroke.
es_es: El código que describe qué tipo de curva se devuelve. Path.MOVETO, Path.LINETO, Path.CURVE3, Path.CURVE4 corresponden a curvas bezier con 1, 2, 3 y 4 puntos de control (respectivamente). Path.CLOSEPOLY es un Path.LINETO con los puntos de control correctamente elegidos en base a los puntos de inicio/fin del trazo actual.

source: Iterate over all curve segments in the path.
es_es: Iterar sobre todos los segmentos de la curva en la ruta.

source: Each iteration returns a pair ``(vertices, code)``, where ``vertices`` is a sequence of 1-3 coordinate pairs, and ``code`` is a `Path` code.
es_es: Cada iteración devuelve un par ``(vértices, código)``, donde ``vértices`` es una secuencia de 1-3 pares de coordenadas, y ``código`` es un código `Path`.

source: Additionally, this method can provide a number of standard cleanups and conversions to the path.
es_es: Además, este método puede proporcionar una serie de limpiezas y conversiones estándar a la ruta.

source: **transform** : None or :class:`~matplotlib.transforms.Transform`
es_es: **transform** : None o :class:`~matplotlib.transforms.Transform`

source: None or
es_es: None o

source: If not None, the given affine transformation will be applied to the path.
es_es: Si no es None, la transformación afín dada se aplicará a la ruta.

source: Whether to remove all NaNs from the path and skip over them using MOVETO commands.
es_es: Si se eliminan todos los NaNs de la ruta y se saltan con los comandos MOVETO.

source: None or (float, float, float, float), optional
es_es: None o (float, float, float, float), optional

source: If not None, must be a four-tuple (x1, y1, x2, y2) defining a rectangle in which to clip the path.
es_es: Si no es None, debe ser una cuádruple pareja (x1, y1, x2, y2) que defina un rectángulo en el que recortar la ruta.

source: If True, snap all nodes to pixels; if False, don't snap them. If None, snap if the path contains only segments parallel to the x or y axes, and no more than 1024 of them.
es_es: Si es True, ajusta todos los nodos a los píxeles; si es False, no los ajusta. Si es None, ajustar si la ruta contiene sólo segmentos paralelos a los ejes x o y, y no más de 1024 de ellos.

source: The width of the stroke being drawn (used for path snapping).
es_es: La anchura del trazo que se está dibujando (se utiliza para el ajuste de la ruta).

source: Whether to simplify the path by removing vertices that do not affect its appearance. If None, use the :attr:`should_simplify` attribute. See also :rc:`path.simplify` and :rc:`path.simplify_threshold`.
es_es: Si se simplifica la ruta eliminando los vértices que no afectan a su apariencia. Si es None, utiliza el atributo :attr:`should_simplify`. Ver también :rc:`path.simplify` y :rc:`path.simplify_threshold`.

source: If True, curve segments will be returned as curve segments. If False, all curves will be converted to line segments.
es_es: Si es True, los segmentos de curva se devolverán como segmentos de curva. Si es False, todas las curvas se convertirán en segmentos de línea.

source: None or sequence, optional
es_es: Ninguna o secuencia, opcional

source: If not None, must be a 3-tuple of the form (scale, length, randomness), representing the sketch parameters.
es_es: Si no es Ninguno, debe ser una tripleta de la forma (escala, longitud, aleatoriedad), que representa los parámetros del boceto.

source: Make a compound path from a list of `Path` objects. Blindly removes all `Path.STOP` control points.
es_es: Crea una ruta compuesta a partir de una lista de objetos `Path`. Elimina ciegamente todos los puntos de control de `Path.STOP`.

source: Make a compound path object to draw a number of polygons with equal numbers of sides XY is a (numpolys x numsides x 2) numpy array of vertices. Return object is a :class:`Path`.
es_es: Crea un objeto path compuesto para dibujar un número de polígonos con igual número de lados XY es un (numpolys x numsides x 2) arreglo numpy de vértices. El objeto devuelto es un :class:`Path`.

source: `True` if the `Path` is read-only.
es_es: `Verdadero` si la `Ruta` es de sólo lectura.

source: `True` if the vertices array should be simplified.
es_es: `Verdadero` si el arreglo de vértices debe ser simplificado.

source: The fraction of a pixel difference below which vertices will be simplified out.
es_es: La fracción de un píxel de diferencia por debajo de la cual se simplificarán los vértices.

source: Convert this path to a list of polygons or polylines. Each polygon/polyline is an Nx2 array of vertices. In other words, each polygon has no ``MOVETO`` instructions or curves. This is useful for displaying in backends that do not support compound paths or Bezier curves.
es_es: Convierte esta ruta en una lista de polígonos o polilíneas. Cada polígono/polilínea es un arreglo Nx2 de vértices. En otras palabras, cada polígono no tiene instrucciones ``MOVETO`` o curvas. Esto es útil para mostrar en backends que no soportan rutas compuestas o curvas Bezier.
