Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/rcsetup_api.po
Languages: es_es

source: The rcsetup module contains the validation code for customization using Matplotlib's rc settings.
es_es: El módulo rcsetup contiene el código de validación para personalizar usando la configuración rc de Matplotlib.

source: Each rc setting is assigned a function used to validate any attempted changes to that setting. The validation functions are defined in the rcsetup module, and are used to construct the rcParams global object which stores the settings and is referenced throughout Matplotlib.
es_es: Cada ajuste rc tiene asignada una función usada para validar cualquier intento de cambio en ese ajuste. Las funciones de validación están definidas en el módulo rcset, y se utilizan para construir el objeto global rcParams que almacena la configuración y se hace referencia a través de Matplotlib.

source: The default values of the rc settings are set in the default matplotlibrc file. Any additions or deletions to the parameter set listed here should also be propagated to the :file:`matplotlibrc.template` in Matplotlib's root source directory.
es_es: Los valores por defecto de la configuración de rc se establecen en el archivo matplotlibrc predeterminado. Cualquier adición o eliminación del conjunto de parámetros listados aquí también debería propagarse al :file:`matplotlibrc.template` en el directorio raíz de fuente de Matplotlib.

source: *valid* is a list of legal strings.
es_es: *válido* es una lista de cadenas legales.

source: Create a `~cycler.Cycler` object much like :func:`cycler.cycler`, but includes input validation.
es_es: Crea un objeto `~cycler.Cycler` similar a :func:`cycler.cycler`, pero incluye la validación de entrada.

source: Call signatures::
es_es: Firma de llamadas::

source: Form 1 copies a given `~cycler.Cycler` object.
es_es: Forma 1 copia un objeto `~cycler.Cycler` dado.

source: Form 2 creates a `~cycler.Cycler` which cycles over one or more properties simultaneously. If multiple properties are given, their value lists must have the same length.
es_es: La forma 2 crea un `~cycler.Cycler` que cicla una o más propiedades simultáneamente. Si se dan múltiples propiedades, sus listas de valores deben tener la misma longitud.

source: Form 3 creates a `~cycler.Cycler` for a single property. This form exists for compatibility with the original cycler. Its use is discouraged in favor of the kwarg form, i.e. ``cycler(label=values)``.
es_es: El formulario 3 crea un `~cycler.Cycler` para una única propiedad. Esta forma existe por compatibilidad con el cicler original. Su uso se desalienta a favor de la forma enano, es decir, ``cycler(label=valores)``.

source: Parameters
es_es: Parámetros

source: Cycler
es_es: Ciclador

source: Copy constructor for Cycler.
es_es: Copiar constructor para Cycler.

source: **label**
es_es: **etiqueta**

source: The property key. Must be a valid `.Artist` property. For example, 'color' or 'linestyle'. Aliases are allowed, such as 'c' for 'color' and 'lw' for 'linewidth'.
es_es: La clave de la propiedad. Debe ser una propiedad `.Artist` válida. Por ejemplo, 'color' o 'linestyle'. Se permiten alias, como 'c' para 'color' y 'lw' para 'ancho de línea'.

source: **values**
es_es: **valores**

source: Finite-length iterable of the property values. These values are validated and will raise a ValueError if invalid.
es_es: Longitud finita iterable de los valores de la propiedad. Estos valores son validados y generarán un ValueError si no es válido.

source: Returns
es_es: Devuelve

source: A new :class:`~cycler.Cycler` for the given properties.
es_es: Un nuevo :class:`~cycler.Cycler` para las propiedades dadas.

source: Examples
es_es: Ejemplos

source: Creating a cycler for a single property:
es_es: Creando un cicler para una sola propiedad:

source: Creating a cycler for simultaneously cycling over multiple properties (e.g. red circle, green plus, blue cross):
es_es: Creando un cicler para ciclear simultáneamente sobre múltiples propiedades (por ejemplo, círculo rojo, verde plus, cruz azul):

source: Convert b to ``bool`` or raise.
es_es: Convierte b a ``bool`` o levanta.

source: return a list of colorspecs
es_es: devolver una lista de colorspecs

source: Return a Cycler object from a string repr or the object itself.
es_es: Devuelve un objeto Cycler desde un repr de cadena o el propio objeto.

source: return a list of floats
es_es: devolver una lista de flotantes

source: Confirm s is string 'figure' or convert s to float or raise.
es_es: Confirmar s es la cadena 'figure' o convertir s a flotante o raise.

source: Confirm that this is a Postscript or PDF font type that we know how to convert to.
es_es: Confirme que este es un tipo de fuente Postscript o PDF al que sabemos convertir.

source: Validate a hatch pattern. A hatch pattern string can have any sequence of the following characters: ``\ / | - + * . x o O``.
es_es: Validar un patrón de colchón. Una cadena de patrón de hatch puede tener cualquier secuencia de los siguientes caracteres: ``\ / | - + * . x o O``.

source: Validate the markevery property of a Line2D object.
es_es: Validar la propiedad markevery de un objeto Line2D.

source: None, int, (int, int), slice, float, (float, float), or list[int]
es_es: Ninguno, int, int), corte, float, (float, float) o lista[int]

source: return a list of strings
es_es: devolver una lista de cadenas
