Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/sankey_api.po
Languages: es_es

source: Module for creating Sankey diagrams using Matplotlib.
es_es: Módulo para crear diagramas de Sankey usando Matplotlib.

source: Sankey diagram.
es_es: Diagrama de sankey.

source: Sankey diagrams are a specific type of flow diagram, in which the width of the arrows is shown proportionally to the flow quantity. They are typically used to visualize energy or material or cost transfers between processes. `Wikipedia (6/1/2011) <https://en.wikipedia.org/wiki/Sankey_diagram>`_
es_es: Los diagramas de sankey son un tipo específico de diagrama de flujo, en el que el ancho de las flechas se muestra proporcionalmente a la cantidad de flujo. Normalmente se utilizan para visualizar la energía o las transferencias de material o costo entre procesos. `Wikipedia (6/1/2011) <https://en.wikipedia.org/wiki/Sankey_diagram>`_

source: Create a new Sankey instance.
es_es: Crear una nueva instancia de Sankey.

source: The optional arguments listed below are applied to all subdiagrams so that there is consistent alignment and formatting.
es_es: Los argumentos opcionales listados a continuación se aplican a todos los subdiagramas para que haya una alineación y formato consistentes.

source: In order to draw a complex Sankey diagram, create an instance of :class:`Sankey` by calling it without any kwargs::
es_es: Para dibujar un diagrama complejo de Sankey, crea una instancia de :class:`Sankey` llamándola sin ningún kwargs::

source: Then add simple Sankey sub-diagrams::
es_es: Luego añade un simple subdiagramas de Sanke::

source: Finally, create the full diagram::
es_es: Finalmente, crear el diagrama completo::

source: Or, instead, simply daisy-chain those calls::
es_es: O, en su lugar, simplemente caducar esas llamadas::

source: Other Parameters
es_es: Otros Parámetros

source: **ax** : `~.axes.Axes`
es_es: **eje** : `~.axes.Axes`

source: Axes
es_es: Ejes

source: Axes onto which the data should be plotted. If *ax* isn't provided, new Axes will be created.
es_es: Ejes sobre los que los datos deben ser trazados. Si no se proporciona *ax*, se crearán nuevos ejes.

source: **scale**
es_es: **escala**

source: float
es_es: de punto flotante (float)

source: Scaling factor for the flows. *scale* sizes the width of the paths in order to maintain proper layout. The same scale is applied to all subdiagrams. The value should be chosen such that the product of the scale and the sum of the inputs is approximately 1.0 (and the product of the scale and the sum of the outputs is approximately -1.0).
es_es: Factor de escala para los flujos. *escala* talla el ancho de las rutas para mantener una disposición adecuada. La misma escala se aplica a todos los subgráficos. El valor debe ser elegido de tal manera que el producto de la escala y la suma de las entradas sean aproximadamente 1. (y el producto de la escala y la suma de las salidas es aproximadamente -1.0).

source: The physical unit associated with the flow quantities. If *unit* is None, then none of the quantities are labeled.
es_es: La unidad física asociada con la cantidad de flujo. Si la *unidad* no es ninguna, entonces ninguna de las cantidades está etiquetada.

source: **format**
es_es: **formato**

source: str or callable
es_es: str o llamable

source: A Python number formatting string or callable used to label the flows with their quantities (i.e., a number times a unit, where the unit is given). If a format string is given, the label will be ``format % quantity``. If a callable is given, it will be called with ``quantity`` as an argument.
es_es: Una cadena de formato de números Python o llamable usada para etiquetar los flujos con sus cantidades (i. ., un número de veces una unidad, donde se da la unidad). Si se da una cadena de formato, la etiqueta será ``format % quantity``. Si se da una llamada, se llamará con ``quantity`` como argumento.

source: **gap**
es_es: **hueco**

source: Space between paths that break in/break away to/from the top or bottom.
es_es: Espacio entre caminos que se rompen en/se separan hacia/desde arriba o abajo.

source: Inner radius of the vertical paths.
es_es: Radio interior de las vías verticales.

source: **shoulder**
es_es: **hombro**

source: Size of the shoulders of output arrows.
es_es: Tamaño de los hombros de las flechas de producción.

source: Text offset (from the dip or tip of the arrow).
es_es: Desplazamiento de texto (de la inmersión o punta de la flecha).

source: **head_angle**
es_es: **ángulo de cabeza**

source: Angle, in degrees, of the arrow heads (and negative of the angle of the tails).
es_es: Ángulo, en grados, de la flecha se dirige (y negativo del ángulo de las taillas).

source: **margin**
es_es: **margen**

source: Minimum space between Sankey outlines and the edge of the plot area.
es_es: Espacio mínimo entre los contornos de Sankey y el borde de la parcela.

source: **tolerance**
es_es: **tolerancia**

source: Acceptable maximum of the magnitude of the sum of flows. The magnitude of the sum of connected flows cannot be greater than *tolerance*.
es_es: Máximo aceptable de la magnitud de la suma de los flujos. La magnitud de la suma de los flujos conectados no puede ser mayor que la *tolerancia*.

source: Any additional keyword arguments will be passed to :meth:`add`, which will create the first subdiagram.
es_es: Cualquier argumento adicional de palabra clave será pasado a :meth:`add`, que creará el primer subdiagrama.

source: Examples
es_es: Ejemplos

source: (`Source code <../gallery/specialty_plots/sankey_basics.py>`__)
es_es: (`Código fuente <../gallery/specialty_plots/sankey_basics.py>`__)

source: Add a simple Sankey diagram with flows at the same hierarchical level.
es_es: Agrega un diagrama simple de Sankey con flujos en el mismo nivel jerárquico.

source: Parameters
es_es: Parámetros

source: **patchlabel**
es_es: **etiqueta de parche**

source: Label to be placed at the center of the diagram. Note that *label* (not *patchlabel*) can be passed as keyword argument to create an entry in the legend.
es_es: Etiqueta a colocarse en el centro del diagrama. Tenga en cuenta que *etiqueta* (no *etiqueta*) puede ser pasado como argumento de palabra clave para crear una entrada en la leyenda.

source: **flows**
es_es: **flujos**

source: list of float
es_es: lista de decimales

source: Array of flow values. By convention, inputs are positive and outputs are negative.
es_es: Arreglo de valores de flujo. Por convención, las entradas son positivas y las salidas son negativas.

source: Flows are placed along the top of the diagram from the inside out in order of their index within *flows*. They are placed along the sides of the diagram from the top down and along the bottom from the outside in.
es_es: Los flujos se colocan a lo largo de la parte superior del diagrama del interior en orden de su índice dentro de *flujos*. Se colocan a lo largo de los lados del diagrama desde arriba hacia abajo y a lo largo de la parte inferior desde el exterior.

source: If the sum of the inputs and outputs is nonzero, the discrepancy will appear as a cubic Bezier curve along the top and bottom edges of the trunk.
es_es: Si la suma de las entradas y salidas es nonzero, la discrepancia aparecerá como una curva cúbica Bézier a lo largo de los bordes superiores e inferiores del tronco.

source: **orientations**
es_es: **orientaciones**

source: list of {-1, 0, 1}
es_es: lista de {-1, 0, 1}

source: List of orientations of the flows (or a single orientation to be used for all flows). Valid values are 0 (inputs from the left, outputs to the right), 1 (from and to the top) or -1 (from and to the bottom).
es_es: Lista de orientaciones de los flujos (o una única orientación para todos los flujos). Los valores válidos son 0 (entradas de la izquierda, salidas a la derecha), 1 (de y hacia arriba) o -1 (de y hacia abajo).

source: list of (str or None)
es_es: lista de (str o ninguno)

source: List of labels for the flows (or a single label to be used for all flows). Each label may be *None* (no label), or a labeling string. If an entry is a (possibly empty) string, then the quantity for the corresponding flow will be shown below the string. However, if the *unit* of the main diagram is None, then quantities are never shown, regardless of the value of this argument.
es_es: Lista de etiquetas para los flujos (o una sola etiqueta para todos los flujos). Cada etiqueta puede ser *nunca* (no etiqueta), o una cadena de etiquetado. Si una entrada es una cadena (posiblemente vacía), entonces la cantidad para el flujo correspondiente se mostrará debajo de la cadena. Sin embargo, si la *unidad* del diagrama principal no es Ninguna, entonces nunca se muestran las cantidades, independientemente del valor de este argumento.

source: **trunklength**
es_es: **tronco**

source: Length between the bases of the input and output groups (in data-space units).
es_es: Longitud entre las bases de los grupos de entrada y salida (en unidades de espacio de datos).

source: **pathlengths**
es_es: **longitudes de ruta**

source: List of lengths of the vertical arrows before break-in or after break-away. If a single value is given, then it will be applied to the first (inside) paths on the top and bottom, and the length of all other arrows will be justified accordingly. The *pathlengths* are not applied to the horizontal inputs and outputs.
es_es: Lista de longitudes de las flechas verticales antes de la ruptura o después de la ruptura. Si se da un único valor, entonces se aplicará a las primeras rutas (en el interior) en la parte superior e inferior, y la longitud de todas las demás flechas estará justificada en consecuencia. Las *longitudes de ruta* no se aplican a las entradas y salidas horizontales.

source: Index of the prior diagram to which this diagram should be connected.
es_es: Índice del diagrama previo al cual este diagrama debe ser conectado.

source: **connect**
es_es: **conectar**

source: A (prior, this) tuple indexing the flow of the prior diagram and the flow of this diagram which should be connected. If this is the first diagram or *prior* is *None*, *connect* will be ignored.
es_es: Un (anterior, este) tupla que indexa el flujo del diagrama anterior y el flujo de este diagrama que debe ser conectado. Si este es el primer diagrama o *prior* es *nunca*, *conectar* será ignorado.

source: Angle of rotation of the diagram in degrees. The interpretation of the *orientations* argument will be rotated accordingly (e.g., if *rotation* == 90, an *orientations* entry of 1 means to/from the left). *rotation* is ignored if this diagram is connected to an existing one (using *prior* and *connect*).
es_es: Ángulo de rotación del diagrama en grados. La interpretación del argumento de *orientaciones* se rotará en consecuencia (p. ej. if *rotation* == 90, an *orientations* entry of 1 means to/from the left). *rotación* es ignorada si este diagrama está conectado a uno existente (usando *prior* y *conectar*).

source: Returns
es_es: Devuelve

source: The current `.Sankey` instance.
es_es: La instancia actual de `.Sankey`.

source: Additional keyword arguments set `matplotlib.patches.PathPatch` properties, listed below. For example, one may want to use ``fill=False`` or ``label="A legend entry"``.
es_es: Argumentos de palabras clave adicionales establecen propiedades `matplotlib.patches.PathPatch` listados a continuación. Por ejemplo, uno puede querer usar ``fill=False`` o ``label="Una entrada de leyenda"``.

source: Property
es_es: Propiedad

source: Description
es_es: Descripción

source: a filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array
es_es: una función de filtro, que toma un arreglo de puntos flotantes (m, n, 3) y un valor de dpi, y devuelve un arreglo (m, n, 3)

source: unknown
es_es: desconocido

source: :meth:`antialiased <matplotlib.patches.Patch.set_antialiased>` or aa
es_es: :meth:`antialias <matplotlib.patches.Patch.set_antialiased>` o aa

source: `.CapStyle` or {'butt', 'projecting', 'round'}
es_es: `.CapStyle` o {'butt', 'projecting', 'round'}

source: Patch or (Path, Transform) or None
es_es: Patch o (Path, Transform) o None

source: :meth:`edgecolor <matplotlib.patches.Patch.set_edgecolor>` or ec
es_es: :meth:`edgecolor <matplotlib.patches.Patch.set_edgecolor>` o ec

source: color or None
es_es: color o ninguno

source: :meth:`facecolor <matplotlib.patches.Patch.set_facecolor>` or fc
es_es: :meth:`facecolor <matplotlib.patches.Patch.set_facecolor>` o fc

source: :meth:`fill <matplotlib.patches.Patch.set_fill>`
es_es: :meth:`rellenar <matplotlib.patches.Patch.set_fill>`

source: :meth:`hatch <matplotlib.patches.Patch.set_hatch>`
es_es: :meth:`colgante <matplotlib.patches.Patch.set_hatch>`

source: `.JoinStyle` or {'miter', 'round', 'bevel'}
es_es: `.JoinStyle` o {'miter', 'round', 'bevel'}

source: :meth:`linestyle <matplotlib.patches.Patch.set_linestyle>` or ls
es_es: :meth:`linestyle <matplotlib.patches.Patch.set_linestyle>` o ls

source: float or None
es_es: float o None

source: None or bool or float or callable
es_es: None o bool o float o callable

source: Adjust the axes and return a list of information about the Sankey subdiagram(s).
es_es: Ajusta los ejes y devuelve una lista de información sobre el(los) subdiagrama(s) de Sankey.

source: Return value is a list of subdiagrams represented with the following fields:
es_es: El valor de retorno es una lista de subdiagramas representados con los siguientes campos:

source: Field
es_es: Campo

source: *patch*
es_es: *parche*

source: Sankey outline (an instance of :class:`~matplotlib.patches.PathPatch`)
es_es: Esquema de Sankey (una instancia de :class:`~matplotlib.patches.PathPatch`)

source: *flows*
es_es: *flujo*

source: values of the flows (positive for input, negative for output)
es_es: valores de los flujos (positivo para la entrada, negativo para la salida)

source: *angles*
es_es: *ángulos*

source: list of angles of the arrows [deg/90] For example, if the diagram has not been rotated, an input to the top side will have an angle of 3 (DOWN), and an output from the top side will have an angle of 1 (UP). If a flow has been skipped (because its magnitude is less than *tolerance*), then its angle will be *None*.
es_es: lista de ángulos de las flechas [/etc/90] Por ejemplo, si el diagrama no ha sido rotado, una entrada en la parte superior tendrá un ángulo de 3 (DOWN), y una salida desde la parte superior tendrá un ángulo de 1 (UP). Si se ha omitido un flujo (porque su magnitud es menor que *tolerancia*), su ángulo será *nunca*.

source: *tips*
es_es: *consejos*

source: array in which each row is an [x, y] pair indicating the positions of the tips (or "dips") of the flow paths If the magnitude of a flow is less the *tolerance* for the instance of :class:`Sankey`, the flow is skipped and its tip will be at the center of the diagram.
es_es: en la que cada fila es un [x, y] par que indica las posiciones de las puntas (o "dips") de las rutas de flujo. Si la magnitud de un flujo es menor la *tolerancia* para la instancia de :class:`Sankey`, el flujo se omite y su punta estará en el centro del diagrama.

source: *text*
es_es: *texto*

source: :class:`~matplotlib.text.Text` instance for the label of the diagram
es_es: :class:instancia `~matplotlib.text.Text` para la etiqueta del diagrama

source: *texts*
es_es: *textos*

source: list of :class:`~matplotlib.text.Text` instances for the labels of flows
es_es: lista de instancias de :class:`~matplotlib.text.Text` para las etiquetas de los flujos
