Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/scale_api.po
Languages: es_es

source: Scales define the distribution of data values on an axis, e.g. a log scaling. They are defined as subclasses of `ScaleBase`.
es_es: Las escalas definen la distribución de valores de datos en un eje, por ejemplo, una escala de registro. Se definen como subclases de `ScaleBase`.

source: See also `.axes.Axes.set_xscale` and the scales examples in the documentation.
es_es: Vea también `.axes.Axes.set_xscale` y los ejemplos de escalas en la documentación.

source: See :doc:`/gallery/scales/custom_scale` for a full example of defining a custom scale.
es_es: Vea :doc:`/gallery/scales/custom_scale` para un ejemplo completo de definir una escala personalizada.

source: Matplotlib also supports non-separable transformations that operate on both `~.axis.Axis` at the same time. They are known as projections, and defined in `matplotlib.projections`.
es_es: Matplotlib también soporta transformaciones no separables que operan en `~.axis.Axis` al mismo tiempo. Son conocidas como proyecciones, y definidas en `matplotlib.projections`.

source: Provide an arbitrary scale with user-supplied function for the axis.
es_es: Proporciona una escala arbitraria con la función suministrada por el usuario para el eje.

source: Parameters
es_es: Parámetros

source: **axis** : `~matplotlib.axis.Axis`
es_es: **eje** : `~matplotlib.axis.Axis`

source: Axis
es_es: Eje

source: The axis for the scale.
es_es: El eje de la escala.

source: **functions**
es_es: **funciones**

source: (callable, callable)
es_es: (llamable, llamable)

source: two-tuple of the forward and inverse functions for the scale. The forward function must be monotonic.
es_es: Dos tubos de las funciones hacia adelante e inversa para la escala, la función hacia adelante debe ser monotónica.

source: Both functions must have the signature::
es_es: Ambas funciones deben tener la firma::

source: Return the `.FuncTransform` associated with this scale.
es_es: Devuelve el `.FuncTransform` asociado con esta escala.

source: Set the locators and formatters of *axis* to instances suitable for this scale.
es_es: Establece los localizadores y formateadores de *eje* a instancias adecuadas para esta escala.

source: Provide an arbitrary scale with user-supplied function for the axis and then put on a logarithmic axes.
es_es: Proporciona una escala arbitraria con la función suministrada por el usuario para el eje y luego coloca un eje logarítmico.

source: **axis** : `matplotlib.axis.Axis`
es_es: **eje** : `matplotlib.axis.Axis`

source: float, default: 10
es_es: float, por defecto: 10

source: Logarithmic base of the scale.
es_es: Base logarítmica de la escala.

source: Return the `.Transform` associated with this scale.
es_es: Devuelve el `.Transform` asociado con esta escala.

source: A simple transform that takes and arbitrary function for the forward and inverse transform.
es_es: Una simple transformación que toma y función arbitraria para la transforma hacia adelante e inversa.

source: **forward**
es_es: **Adelante**

source: callable
es_es: llamable

source: The forward function for the transform. This function must have an inverse and, for best behavior, be monotonic. It must have the signature::
es_es: La función delantera para la transforma. Esta función debe tener una inversa y, para el mejor comportamiento, ser monotónica. Debe tener la firma::

source: **inverse**
es_es: **inversa**

source: The inverse of the forward function. Signature as ``forward``.
es_es: La inversa de la función de futuro. Firma como ``adelante``.

source: True if this transform has a corresponding inverse transform.
es_es: Verdadero si esta transformación tiene una transformación inversa correspondiente.

source: The number of input dimensions of this transform. Must be overridden (with integers) in the subclass.
es_es: El número de dimensiones de entrada de esta transformación. Debe ser sobrescrito (con enteros) en la subclase.

source: Return the corresponding inverse transformation.
es_es: Devuelve la transformación inversa correspondiente.

source: It holds ``x == self.inverted().transform(self.transform(x))``.
es_es: Sostiene ``x == self.inverted().transform(self.transform(x))``.

source: The return value of this method should be treated as temporary. An update to *self* does not cause a corresponding update to its inverted copy.
es_es: El valor de retorno de este método debe ser tratado como temporal. Una actualización de *self* no provoca la correspondiente actualización de su copia invertida.

source: True if this transform is separable in the x- and y- dimensions.
es_es: True si esta transformación es separable en las dimensiones x e y.

source: The number of output dimensions of this transform. Must be overridden (with integers) in the subclass.
es_es: El número de dimensiones de salida de esta transformación. Debe ser sobrescrito (con enteros) en la subclase.

source: Apply only the non-affine part of this transformation.
es_es: Aplicar sólo la parte no afín de esta transformación.

source: ``transform(values)`` is always equivalent to ``transform_affine(transform_non_affine(values))``.
es_es: ``transform(valores)`` siempre es equivalente a ``transform_affine(transform_non_affine(valores))``.

source: In non-affine transformations, this is generally equivalent to ``transform(values)``. In affine transformations, this is always a no-op.
es_es: En las transformaciones no afines, esto es generalmente equivalente a ``transformar(valores)``. En las transformaciones afines, esto es siempre un no-op.

source: **values**
es_es: **valores**

source: The input values as NumPy array of length :attr:`input_dims` or shape (N x :attr:`input_dims`).
es_es: Los valores de entrada como arreglo NumPy de longitud :attr:`input_dims` o forma (N x :attr:`input_dims`).

source: Returns
es_es: Devuelve

source: The output values as NumPy array of length :attr:`input_dims` or shape (N x :attr:`output_dims`), depending on the input.
es_es: Los valores de salida como arreglo NumPy de longitud :attr:`input_dims` o forma (N x :attr:`output_dims`), dependiendo de la entrada.

source: A string representing the "name" of the transform. The name carries no significance other than to improve the readability of ``str(transform)`` when DEBUG=True.
es_es: Una cadena que representa el "nombre" de la transformación. El nombre no tiene más significado que el de mejorar la legibilidad de ``str(transform)`` cuando DEBUG=True.

source: The default linear scale.
es_es: La escala lineal por defecto.

source: Return the transform for linear scaling, which is just the `~matplotlib.transforms.IdentityTransform`.
es_es: Devuelve la transformación para escalado lineal, que es sólo el `~matplotlib.transforms.IdentityTransform`.

source: A standard logarithmic scale. Care is taken to only plot positive values.
es_es: Una escala logarítmica estándar. Cuidado con sólo trazar valores positivos.

source: The base of the logarithm.
es_es: La base del logaritmo.

source: **nonpositive**
es_es: **no positiva**

source: Determines the behavior for non-positive values. They can either be masked as invalid, or clipped to a very small positive number.
es_es: Determina el comportamiento para valores no positivos. Pueden ser enmascarados como inválidos, o recortados a un número positivo muy pequeño.

source: sequence of int, default: None
es_es: secuencia de int, por defecto: ninguna

source: Where to place the subticks between each major tick. For example, in a log10 scale, ``[2, 3, 4, 5, 6, 7, 8, 9]`` will place 8 logarithmically spaced minor ticks between each major tick.
es_es: Dónde colocar los subticks entre cada tick importante. Por ejemplo, en una escala log10, ``[2, 3, 4, 5, 6, 7, 8, 9]`` colocará 8 ticks menores con espacio logarítmico entre cada tick principal.

source: Return the `.LogTransform` associated with this scale.
es_es: Devuelve el `.LogTransform` asociado con esta escala.

source: Limit the domain to positive values.
es_es: Limitar el dominio a valores positivos.

source: logistic transform (base 10)
es_es: transformación logística (base 10)

source: Logit scale for data between zero and one, both excluded.
es_es: Escala de registro para datos entre cero y uno, ambos excluidos.

source: This scale is similar to a log scale close to zero and to one, and almost linear around 0.5. It maps the interval ]0, 1[ onto ]-infty, +infty[.
es_es: Esta escala es similar a una escala de registro cercana a cero y a una, y casi lineal alrededor de 0. . Mapea el intervalo ]0, 1[ en ]-infty, +infty[.

source: Currently unused.
es_es: Actualmente sin usar.

source: Determines the behavior for values beyond the open interval ]0, 1[. They can either be masked as invalid, or clipped to a number very close to 0 or 1.
es_es: Determina el comportamiento de valores más allá del intervalo abierto ]0, 1[. Pueden ser enmascarados como inválidos, o recortados a un número muy cercano a 0 o 1.

source: bool, default: False
es_es: bool, por defecto: False

source: Indicate the usage of survival notation (\overline{x}) in place of standard notation (1-x) for probability close to one.
es_es: Indique el uso de notación de supervivencia (\overline{x}) en lugar de notación estándar (1-x) para probabilidad cercana a una.

source: **one_half** : str, default: r"\frac{1}{2}"
es_es: **one_half** : str, por defecto: r"\frac{1}{2}"

source: str, default: r"\frac{1}{2}"
es_es: str, por defecto: r"\frac{1}{2}"

source: The string used for ticks formatter to represent 1/2.
es_es: La cadena usada para el formateador de ticks para representar 1/2.

source: Return the `.LogitTransform` associated with this scale.
es_es: Devuelve el `.LogitTransform` asociado con esta escala.

source: Limit the domain to values between 0 and 1 (excluded).
es_es: Limitar el dominio a valores entre 0 y 1 (excluidos).

source: logit transform (base 10), masked or clipped
es_es: transformar logit (base 10), enmascarado o recortado

source: The base class for all scales.
es_es: La clase base para todas las escalas.

source: Scales are separable transformations, working on a single dimension.
es_es: Las escalas son transformaciones separables, trabajando en una sola dimensión.

source: Subclasses should override
es_es: Las subclases deben sobreescribir

source: :attr:`name`
es_es: :attr:`nombre`

source: The scale's name.
es_es: Nombre de la escala.

source: :meth:`get_transform`
es_es: :meth:`obtener_transform`

source: A method returning a `.Transform`, which converts data coordinates to scaled coordinates. This transform should be invertible, so that e.g. mouse positions can be converted back to data coordinates.
es_es: Un método que devuelve un `.Transform`, que convierte las coordenadas de datos en coordenadas escaladas. Esta transformación debe ser inversa, de modo que por ejemplo las posiciones del ratón puedan ser convertidas de nuevo a coordenadas de datos.

source: A method that sets default locators and formatters for an `~.axis.Axis` that uses this scale.
es_es: Un método que establece los localizadores y formatos predeterminados para un `~.axis.Axis` que utiliza esta escala.

source: :meth:`limit_range_for_scale`
es_es: :meth:`limit_range_para_escala`

source: An optional method that "fixes" the axis range to acceptable values, e.g. restricting log-scaled axes to positive values.
es_es: Un método opcional que "corrige" el rango de ejes a valores aceptables, por ejemplo, restringiendo ejes escalados en el registro a valores positivos.

source: Construct a new scale.
es_es: Construye una nueva escala.

source: The following note is for scale implementors.
es_es: La siguiente nota es para implementadores de escala.

source: For back-compatibility reasons, scales take an `~matplotlib.axis.Axis` object as first argument. However, this argument should not be used: a single scale object should be usable by multiple `~matplotlib.axis.Axis`\es at the same time.
es_es: Por razones de compatibilidad inversa, las escalas toman un objeto `~matplotlib.axis.Axis` como primer argumento. Sin embargo, este argumento no debe ser usado: un objeto de una sola escala debe ser usado por múltiples `~matplotlib.axis.Axis`\es al mismo tiempo.

source: Return the `.Transform` object associated with this scale.
es_es: Devuelve el objeto `.Transform` asociado con esta escala.

source: Return the range *vmin*, *vmax*, restricted to the domain supported by this scale (if any).
es_es: Devuelve el rango *vmin*, *vmax*, restringido al dominio soportado por esta escala (si existe).

source: *minpos* should be the minimum positive value in the data. This is used by log scales to determine a minimum value.
es_es: *minpos* debe ser el valor positivo mínimo en los datos. Esto es usado por escalas de registro para determinar un valor mínimo.

source: The symmetrical logarithmic scale is logarithmic in both the positive and negative directions from the origin.
es_es: La escala logarítmica simétrica es logarítmica tanto en las direcciones positivas como negativas desde el origen.

source: Since the values close to zero tend toward infinity, there is a need to have a range around zero that is linear. The parameter *linthresh* allows the user to specify the size of this range (-*linthresh*, *linthresh*).
es_es: Puesto que los valores cercanos a cero tienden a ser infinitos, hay una necesidad de tener un rango alrededor de cero que sea lineal. El parámetro *linuco* permite al usuario especificar el tamaño de este rango (-*linuco*, *linuco*).

source: Defines the range ``(-x, x)``, within which the plot is linear. This avoids having the plot go to infinity around zero.
es_es: Define el rango ``(-x, x)``, dentro del cual la trama es lineal. Esto evita que la trama vaya a infinidad alrededor de cero.

source: sequence of int
es_es: secuencia de int

source: Where to place the subticks between each major tick. For example, in a log10 scale: ``[2, 3, 4, 5, 6, 7, 8, 9]`` will place 8 logarithmically spaced minor ticks between each major tick.
es_es: Dónde colocar los subticks entre cada tick importante. Por ejemplo, en una escala log10: ``[2, 3, 4, 5, 6, 7, 8, 9]`` colocará 8 ticks menores, espaciados logarítmicamente entre cada tick principal.

source: float, optional
es_es: float, opcional

source: This allows the linear range ``(-linthresh, linthresh)`` to be stretched relative to the logarithmic range. Its value is the number of decades to use for each half of the linear range. For example, when *linscale* == 1.0 (the default), the space used for the positive and negative halves of the linear range will be equal to one decade in the logarithmic range.
es_es: Esto permite que el rango lineal ``(-linúm, linítmica)`` sea estirado relativo al rango logarítmico. Su valor es el número de décadas a usar para cada mitad del rango lineal. Por ejemplo, cuando *linscale* == 1. (el valor por defecto), el espacio utilizado para las mitades positivas y negativas de la gama lineal será igual a una década en el rango logarítmico.

source: Return the `.SymmetricalLogTransform` associated with this scale.
es_es: Devuelve el `.SymmetricalLogTransform` asociado con esta escala.

source: Return the names of the available scales.
es_es: Devuelve los nombres de las escalas disponibles.

source: Register a new kind of scale.
es_es: Registrar un nuevo tipo de escala.

source: **scale_class** : subclass of `ScaleBase`
es_es: **clase_escala** : subclase de `ScaleBase`

source: subclass of
es_es: subclase de

source: The scale to register.
es_es: La escala a registrar.

source: Return a scale class by name.
es_es: Devuelve una clase de escala por nombre.

source: **scale**
es_es: **escala**
