Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/sphinxext_plot_directive_api.po
Languages: es_es

source: A directive for including a Matplotlib plot in a Sphinx document
es_es: Una directiva para incluir una parcela Matplotlib en un documento Sphinx

source: By default, in HTML output, `plot` will include a .png file with a link to a high-res .png and .pdf. In LaTeX output, it will include a .pdf.
es_es: Por defecto, en la salida HTML, `plot` incluirá un archivo .png con un enlace a alta resolución . En la salida LaTeX se incluirá un .pdf.

source: The source code for the plot may be included in one of three ways:
es_es: El código fuente de la parcela puede incluirse de tres maneras:

source: **A path to a source file** as the argument to the directive::
es_es: **Una ruta a un archivo de origen** como argumento para la directiva::

source: When a path to a source file is given, the content of the directive may optionally contain a caption for the plot::
es_es: Cuando se da una ruta a un archivo de origen, el contenido de la directiva puede contener opcionalmente un título para la parcela::

source: Additionally, one may specify the name of a function to call (with no arguments) immediately after importing the module::
es_es: Adicionalmente, se puede especificar el nombre de una función a llamar (sin argumentos) inmediatamente después de importar el módulo::

source: Included as **inline content** to the directive::
es_es: Incluye como **contenido en línea** de la directiva::

source: Using **doctest** syntax::
es_es: Usando la sintaxis **doctest**::

source: Options
es_es: Opciones

source: The ``plot`` directive supports the following options:
es_es: La directiva ``plot`` soporta las siguientes opciones:

source: format
es_es: formato

source: The format of the input. If unset, the format is auto-detected.
es_es: El formato de la entrada. Si no se establece, el formato se detecta automáticamente.

source: include-source
es_es: incluir-fuente

source: Whether to display the source code. The default can be changed using the `plot_include_source` variable in :file:`conf.py` (which itself defaults to False).
es_es: Si desea mostrar el código fuente. El valor predeterminado puede ser cambiado usando la variable `plot_include_source` en :file:`conf.py` (que en sí mismo es el valor predeterminado de False).

source: encoding
es_es: codificación

source: If this source file is in a non-UTF8 or non-ASCII encoding, the encoding must be specified using the ``:encoding:`` option. The encoding will not be inferred using the ``-*- coding -*-`` metacomment.
es_es: Si este archivo de origen está en una codificación no UTF8 o no ASCII, la codificación debe especificarse usando la opción ``:encoding:. La codificación no se invertirá usando el metacomentario ``-*- codificación -*-```.

source: context
es_es: contexto

source: bool or str
es_es: bool o str

source: If provided, the code will be run in the context of all previous plot directives for which the ``:context:`` option was specified. This only applies to inline code plot directives, not those run from files. If the ``:context: reset`` option is specified, the context is reset for this and future plots, and previous figures are closed prior to running the code. ``:context: close-figs`` keeps the context but closes previous figures before running the code.
es_es: Si se proporciona, el código se ejecutará en el contexto de todas las directivas de trazo anteriores para las cuales se especificó la opción ``:context:``. Esto sólo se aplica a las directivas de código en línea, no a las que se ejecutan desde archivos. Si la opción ``:context: reset`` es especificada, el contexto se resetea para esto y futuras parcelas, y las cifras anteriores se cierran antes de ejecutar el código. ``:context: cifras cerradas`` mantiene el contexto pero cierra las figuras anteriores antes de ejecutar el código.

source: If specified, the code block will be run, but no figures will be inserted. This is usually useful with the ``:context:`` option.
es_es: Si se especifica, el bloque de código se ejecutará, pero no se insertarán cifras. Esto suele ser útil con la opción ``:context:.

source: caption
es_es: título

source: If specified, the option's argument will be used as a caption for the figure. This overwrites the caption given in the content, when the plot is generated from a file.
es_es: Si se especifica, el argumento de la opción se utilizará como un título para la figura. Esto sobrescribe el título dado en el contenido, cuando el gráfico se genera a partir de un archivo.

source: Additionally, this directive supports all of the options of the `image` directive, except for *target* (since plot will add its own target). These include *alt*, *height*, *width*, *scale*, *align* and *class*.
es_es: Además, esta directiva soporta todas las opciones de la directiva `image`, excepto el *objetivo* (puesto que la trama añadirá su propio objetivo). Estos incluyen *alt*, *alto*, *ancho*, *escala*, *aline* y *clase*.

source: Configuration options
es_es: Opciones de configuración

source: The plot directive has the following configuration options:
es_es: La directiva plot tiene las siguientes opciones de configuración:

source: plot_include_source
es_es: contenido_include_fuente

source: Default value for the include-source option (default: False).
es_es: Valor predeterminado para la opción include-source (por defecto: False).

source: plot_html_show_source_link
es_es: mostrar_enlace_fuente

source: Whether to show a link to the source in HTML (default: True).
es_es: Si mostrar un enlace a la fuente en HTML (por defecto: True).

source: Code that should be executed before each plot. If None (the default), it will default to a string containing::
es_es: Código que debe ser ejecutado antes de cada parcela. Si Ninguno (el predeterminado), por defecto será una cadena contenedor::

source: plot_basedir
es_es: parcela_basedir

source: Base directory, to which ``plot::`` file names are relative to. If None or empty (the default), file names are relative to the directory where the file containing the directive is.
es_es: Directorio base, al cual los nombres de archivo ``plot::`` son relativos. Si Ninguno o vacío (el predeterminado), los nombres de los archivos son relativos al directorio donde está el archivo que contiene la directiva.

source: plot_formats
es_es: plot_formatos

source: File formats to generate (default: ['png', 'hires.png', 'pdf']). List of tuples or strings::
es_es: Formatos de archivo a generar (por defecto: ['png', 'hires.png', 'pdf']). Lista de tuples o cadenas::

source: that determine the file format and the DPI. For entries whose DPI was omitted, sensible defaults are chosen. When passing from the command line through sphinx_build the list should be passed as suffix:dpi,suffix:dpi, ...
es_es: que determinan el formato de archivo y el DPI. Para las entradas cuyo DPI fue omitido, se eligen valores por defecto sensibles. Al pasar desde la línea de comandos a través de sphinx_build la lista debe ser pasada como sufix:dpi,suffix:dpi, ...

source: plot_html_show_formats
es_es: plot_html_show_formatos

source: Whether to show links to the files in HTML (default: True).
es_es: Si mostrar enlaces a los archivos en HTML (por defecto: True).

source: A dictionary containing any non-standard rcParams that should be applied before each plot (default: {}).
es_es: Un diccionario que contiene cualquier rcParams no estándar que debe aplicarse antes de cada parcela (por defecto: {}).

source: plot_apply_rcparams
es_es: plot_aplicar_rcparams

source: By default, rcParams are applied when ``:context:`` option is not used in a plot directive. If set, this configuration option overrides this behavior and applies rcParams before each plot.
es_es: Por defecto, rcParams se aplica cuando la opción ``:context:`` no se utiliza en una directiva de parcelas. Si se establece, esta opción de configuración anula este comportamiento y aplica rcParams antes de cada parcela.

source: plot_working_directory
es_es: directorio working_plot_working_

source: By default, the working directory will be changed to the directory of the example, so the code can get at its data files, if any. Also its path will be added to `sys.path` so it can import any helper modules sitting beside it. This configuration option can be used to specify a central directory (also added to `sys.path`) where data files and helper modules for all code are located.
es_es: De forma predeterminada, el directorio de trabajo se cambiará al directorio del ejemplo, para que el código pueda obtener en sus archivos de datos, si los hay. También su ruta será añadida a `sys. ath` para que pueda importar cualquier módulo auxiliar sentado a su lado. Esta opción de configuración se puede utilizar para especificar un directorio central (también añadido a `sys. ath`) donde se encuentran los archivos de datos y módulos auxiliares para todo el código.

source: plot_template
es_es: plot_plantilla

source: Provide a customized template for preparing restructured text.
es_es: Proporcione una plantilla personalizada para preparar el texto reestructurado.

source: The ``.. plot::`` directive, as documented in the module's docstring.
es_es: La directiva ``.. plot::``, como se documenta en la cadena de documentación del módulo.

source: Run the plot directive.
es_es: Ejecute la directiva de la conspiración.

source: To make plots referenceable, we need to move the reference from the "htmlonly" (or "latexonly") node to the actual figure node itself.
es_es: Para hacer que los gráficos sean referenciables, necesitamos mover la referencia desde el nodo "htmlonly" (o "latexonly") al nodo de figura real.

source: Return whether *derived* is out-of-date relative to *original* or any of the RST files included in it using the RST include directive (*includes*). *derived* and *original* are full paths, and *includes* is optionally a list of full paths which may have been included in the *original*.
es_es: Devuelve si *derivado* está desfasado relativo a *original* o cualquiera de los archivos RST incluidos en él usando la directiva RST include (*includes*). *derivado* y *original* son rutas completas, y *incluye* es opcionalmente una lista de rutas completas que pueden haber sido incluidas en el *original*.

source: Run a pyplot script and save the images in *output_dir*.
es_es: Ejecute un script pyplot y guarde las imágenes en *output_dir*.

source: Save the images under *output_dir* with file names derived from *output_base*
es_es: Guardar las imágenes bajo *output_dir* con nombres de archivo derivados de *output_base*

source: [*Deprecated*] Import a Python module from a path, and run the function given by name, if function_name is not None.
es_es: [*Desaprobado*] Importar un módulo Python desde una ruta, y ejecutar la función dada por el nombre, si function_name no es Ninguno.

source: [*Deprecated*] Split code at plt.show().
es_es: [*Obsoleto*] Divida el código en plt.show().

source: [*Deprecated*] Extract code from a piece of text, which contains either Python code or doctests.
es_es: [*Obsoleto*] Extrae código de un fragmento de texto, que contiene código Python o doctests.
