Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/sphinxext_mathmpl_api.po
Languages: es_es

source: A role and directive to display mathtext in Sphinx
es_es: Un rol y directiva para mostrar matemáticas en Sphinx

source: In most cases, you will likely want to use one of `Sphinx's builtin Math extensions <https://www.sphinx-doc.org/en/master/usage/extensions/math.html>`__ instead of this one.
es_es: En la mayoría de los casos, probablemente querrás usar una de las extensiones de `Matemáticas incorporadas de Sphinx <https://www.sphinx-doc.org/en/master/usage/extensions/math.html>`__ en lugar de esta.

source: Mathtext may be included in two ways:
es_es: El texto matemático puede incluirse de dos maneras:

source: Inline, using the role::
es_es: En línea, usando el rol::

source: which produces:
es_es: que produce:

source: This text uses inline math: :mathmpl:`\alpha > \beta`.
es_es: Este texto utiliza matemáticas en línea: :mathmpl:`\alpha > \beta`.

source: Standalone, using the directive::
es_es: Independientemente de ello, utilizando la directiva::

source: Here is some standalone math:
es_es: Aquí hay algunas matemáticas independientes:

source: Options
es_es: Opciones

source: The ``mathmpl`` role and directive both support the following options:
es_es: El rol y la directiva ``mathmpl`` soportan las siguientes opciones:

source: The font set to use when displaying math. See :rc:`mathtext.fontset`.
es_es: El conjunto de fuentes a usar al mostrar matemáticas. Ver :rc:`mathtext.fontset`.

source: The font size, in points. Defaults to the value from the extension configuration option defined below.
es_es: El tamaño de la fuente, en puntos. Por defecto el valor de la opción de configuración de extensión definida a continuación.

source: Configuration options
es_es: Opciones de configuración

source: The mathtext extension has the following configuration options:
es_es: La extensión mathtext tiene las siguientes opciones de configuración:

source: mathmpl_fontsize
es_es: tamaño fuente mathmpl_

source: Default font size, in points.
es_es: Tamaño de fuente predeterminado, en puntos.

source: list of str, default: []
es_es: lista de str, por defecto: []

source: Additional image sizes to generate when embedding in HTML, to support `responsive resolution images <https://developer.mozilla.org/en-US/docs/Learn/HTML/Multimedia_and_embedding/Responsive_images>`__. The list should contain additional x-descriptors (``'1.5x'``, ``'2x'``, etc.) to generate (1x is the default and always included.)
es_es: Tamaños de imagen adicionales a generar al insertar en HTML, para soportar `imágenes de resolución receptiva <https://developer.mozilla.org/en-US/docs/Learn/HTML/Multimedia_and_embedding/Responsive_images>`__. La lista debe contener descriptores x adicionales (``'1.5x'``, ``'2x'``, etc.) para generar (1x es el predeterminado y siempre incluido.)

source: The ``.. mathmpl::`` directive, as documented in the module's docstring.
es_es: La directiva ``.. mathmpl::`` documentada en la documentación del módulo.
