Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/spines_api.po
Languages: es_es

source: An axis spine -- the line noting the data area boundaries.
es_es: Una columna vertebral - la línea que anota los límites del área de datos.

source: Spines are the lines connecting the axis tick marks and noting the boundaries of the data area. They can be placed at arbitrary positions. See `~.Spine.set_position` for more information.
es_es: Los pinos son las líneas que conectan las marcas de los ejes y señalan los límites del área de datos. Pueden ser colocados en posiciones arbitrarias. Vea `~.Spine.set_position` para más información.

source: The default position is ``('outward', 0)``.
es_es: La posición por defecto es ``('hacia afuera', 0)``.

source: Spines are subclasses of `.Patch`, and inherit much of their behavior.
es_es: Las espinas son subclases de `.Patch`, y heredan gran parte de su comportamiento.

source: Spines draw a line, a circle, or an arc depending if `~.Spine.set_patch_line`, `~.Spine.set_patch_circle`, or `~.Spine.set_patch_arc` has been called. Line-like is the default.
es_es: Las espinas dibujan una línea, un círculo, o un arco dependiendo de si `~.Spine.set_patch_line`, `~.Spine.set_patch_circle`, o `~.Spine.set_patch_arc` ha sido llamado. La línea similar es la predeterminada.

source: Parameters
es_es: Parámetros

source: Axes
es_es: Ejes

source: The `~.axes.Axes` instance containing the spine.
es_es: La instancia `~.axes.Axes` que contiene la columna vertebral.

source: **spine_type**
es_es: **tipo de espina**

source: The spine type.
es_es: Tipo de lomo.

source: Path
es_es: Ruta

source: The `.Path` instance used to draw the spine.
es_es: La instancia `.Path` utilizada para dibujar el lomo.

source: Other Parameters
es_es: Otros Parámetros

source: Valid keyword arguments are:
es_es: Los argumentos válidos de la palabra clave son:

source: Property
es_es: Propiedad

source: Description
es_es: Descripción

source: a filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array
es_es: una función de filtro, que toma un arreglo de puntos flotantes (m, n, 3) y un valor de dpi, y devuelve un arreglo (m, n, 3)

source: unknown
es_es: desconocido

source: :meth:`antialiased <matplotlib.patches.Patch.set_antialiased>` or aa
es_es: :meth:`antialias <matplotlib.patches.Patch.set_antialiased>` o aa

source: `.CapStyle` or {'butt', 'projecting', 'round'}
es_es: `.CapStyle` o {'butt', 'projecting', 'round'}

source: Patch or (Path, Transform) or None
es_es: Patch o (Path, Transform) o None

source: :meth:`edgecolor <matplotlib.patches.Patch.set_edgecolor>` or ec
es_es: :meth:`edgecolor <matplotlib.patches.Patch.set_edgecolor>` o ec

source: color or None
es_es: color o ninguno

source: :meth:`facecolor <matplotlib.patches.Patch.set_facecolor>` or fc
es_es: :meth:`facecolor <matplotlib.patches.Patch.set_facecolor>` o fc

source: :meth:`fill <matplotlib.patches.Patch.set_fill>`
es_es: :meth:`rellenar <matplotlib.patches.Patch.set_fill>`

source: :meth:`hatch <matplotlib.patches.Patch.set_hatch>`
es_es: :meth:`colgante <matplotlib.patches.Patch.set_hatch>`

source: `.JoinStyle` or {'miter', 'round', 'bevel'}
es_es: `.JoinStyle` o {'miter', 'round', 'bevel'}

source: :meth:`linestyle <matplotlib.patches.Patch.set_linestyle>` or ls
es_es: :meth:`linestyle <matplotlib.patches.Patch.set_linestyle>` o ls

source: float or None
es_es: float o None

source: None or bool or float or callable
es_es: None o bool o float o callable

source: float
es_es: de punto flotante (float)

source: Create and return an arc `Spine`.
es_es: Crea y devuelve un arco `Spine`.

source: Create and return a circular `Spine`.
es_es: Crea y devuelve un `Spine` circular.

source: Clear the current spine.
es_es: Limpia la columna vertebral.

source: Draw the Artist (and its children) using the given renderer.
es_es: Dibuja el Artist (y sus hijos) usando el renderizador dado.

source: This has no effect if the artist is not visible (`.Artist.get_visible` returns False).
es_es: Esto no tiene efecto si el artist no es visible (`.Artist.get_visible` devuelve False).

source: **renderer** : `.RendererBase` subclass.
es_es: **renderer** : `.RendererBase` subclase.

source: RendererBase subclass.
es_es: Subclase RendererBase.

source: This method is overridden in the Artist subclasses.
es_es: Este método se sobrescribe en las subclases de Artist.

source: Get the bounds of the spine.
es_es: Consigue los límites de la columna vertebral.

source: Return the `~.transforms.Transform` instance mapping patch coordinates to data coordinates.
es_es: Devuelve las coordenadas del parche `~.transforms.Transform` de la instancia del parche a las coordenadas de datos.

source: For example, one may define a patch of a circle which represents a radius of 5 by providing coordinates for a unit circle, and a transform which scales the coordinates (the patch coordinate) by 5.
es_es: Por ejemplo, se puede definir un parche de un círculo que representa un radio de 5 proporcionando coordenadas para un círculo unitario, y una transformación que escala las coordenadas (la coordenada del parche) por 5.

source: Return the path of this patch.
es_es: Devuelve la ruta de este parche.

source: Return the spine position.
es_es: Devuelve la posición de la columna vertebral.

source: Return the spine transform.
es_es: Devuelve la transforma de la columna vertebral.

source: Return the window extent of the spines in display space, including padding for ticks (but not their labels)
es_es: Devuelve la extensión de la ventana de las espinas en el espacio de visualización, incluyendo relleno para ticks (pero no sus etiquetas)

source: Create and return a linear `Spine`.
es_es: Crea y devuelve un `Spine` lineal.

source: Register an axis.
es_es: Registrar un eje.

source: An axis should be registered with its corresponding spine from the Axes instance. This allows the spine to clear any axis properties when needed.
es_es: Un eje debe registrarse con su columna vertebral correspondiente desde la instancia de los ejes. Esto permite que la columna borre las propiedades de cualquier eje cuando sea necesario.

source: Set multiple properties at once.
es_es: Establece varias propiedades a la vez.

source: Supported properties are
es_es: Las propiedades admitidas son

source: scalar or None
es_es: escalar o None

source: :meth:`bounds <matplotlib.spines.Spine.set_bounds>`
es_es: :meth:`Límites <matplotlib.spines.Spine.set_bounds>`

source: (low: float, high: float)
es_es: (bajo: flotante, alto: flotante)

source: Set the spine bounds.
es_es: Establece los límites de la columna vertebral.

source: **low**
es_es: **bajo**

source: float or None, optional
es_es: flotante o ninguno, opcional

source: The lower spine bound. Passing *None* leaves the limit unchanged.
es_es: El límite inferior de la columna vertebral. Pasar *nunca* deja el límite sin cambios.

source: The bounds may also be passed as the tuple (*low*, *high*) as the first positional argument.
es_es: Los límites también se pueden pasar como la tupla (*bajo*, *alto*) como el primer argumento posicional.

source: **high**
es_es: **alto**

source: The higher spine bound. Passing *None* leaves the limit unchanged.
es_es: El límite más alto de la columna vertebral. Pasar *nunca* deja el límite sin cambios.

source: Set the edgecolor.
es_es: Establecer el color del borde.

source: This method does not modify the facecolor (which defaults to "none"), unlike the `.Patch.set_color` method defined in the parent class. Use `.Patch.set_facecolor` to set the facecolor.
es_es: Este método no modifica el color facecolor (que por defecto es "ninguno"), a diferencia del `.Patch. et_color` método definido en la clase padre. Use `.Patch.set_facecolor` para establecer el color facecolor.

source: Set the spine to be arc-like.
es_es: Establece la columna vertebral para que sea de tipo arco.

source: Set the spine to be circular.
es_es: Define la columna vertebral a circular.

source: Set the spine to be linear.
es_es: Define la columna a ser lineal.

source: Set the position of the spine.
es_es: Define la posición del lomo.

source: Spine position is specified by a 2 tuple of (position type, amount). The position types are:
es_es: La posición del pino se especifica por una tupla de 2 (tipo de posición, cantidad). Los tipos de posición son:

source: 'outward': place the spine out from the data area by the specified number of points. (Negative values place the spine inwards.)
es_es: 'hacia afuera': coloca la columna fuera del área de datos por el número de puntos especificado. (Los valores negativos colocan la columna dentro.)

source: 'axes': place the spine at the specified Axes coordinate (0 to 1).
es_es: 'ejes': coloca el lomo en la coordenada de ejes especificada (0 a 1).

source: 'data': place the spine at the specified data coordinate.
es_es: 'data': coloque la columna vertebral en la coordenada de datos especificada.

source: Additionally, shorthand notations define a special positions:
es_es: Adicionalmente, las notaciones abreviadas definen posiciones especiales:

source: 'center' -> ('axes', 0.5)
es_es: 'centro' -> ('ejes', 0.5)

source: 'zero' -> ('data', 0.0)
es_es: 'cero' -> ('datos', 0.0)

source: The container of all `.Spine`\s in an Axes.
es_es: El contenedor de todos `.Spine`\s en un eje.

source: The interface is dict-like mapping names (e.g. 'left') to `.Spine` objects. Additionally it implements some pandas.Series-like features like accessing elements by attribute::
es_es: La interfaz está dictando nombres de mapeo (por ejemplo, 'izquierda') a objetos `.Spine`. Además, implementa algunas características similares a pandas.Series como acceder a elementos mediante atributo::

source: Multiple spines can be addressed simultaneously by passing a list::
es_es: Múltiples espinas pueden ser abordadas simultáneamente pasando una lista::

source: Use an open slice to address all spines::
es_es: Utilice una rebanada abierta para abordar todas las espinas::

source: The latter two indexing methods will return a `SpinesProxy` that broadcasts all ``set_*`` calls to its members, but cannot be used for any other operation.
es_es: Los últimos dos métodos de indexación devolverán un `SpinesProxy` que transmite todas las llamadas ``set_*`` a sus miembros, pero no puede ser usado para ninguna otra operación.

source: A proxy to broadcast ``set_*`` method calls to all contained `.Spines`.
es_es: Un proxy para transmitir llamadas a los métodos ``set_*`` a todos los `.Spines`.

source: The proxy cannot be used for any other operations on its members.
es_es: El proxy no puede ser utilizado para ninguna otra operación de sus miembros.

source: The supported methods are determined dynamically based on the contained spines. If not all spines support a given method, it's executed only on the subset of spines that support it.
es_es: Los métodos soportados se determinan dinámicamente basándose en las espinas contenidas. Si no todas las espinas soportan un método determinado, se ejecuta sólo en el subconjunto de espinas que lo soportan.
