Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/style_api.po
Languages: es_es

source: Styles are predefined sets of `.rcParams` that define the visual appearance of a plot.
es_es: Los estilos son conjuntos predefinidos de `.rcParams` que definen la apariencia visual de una parcela.

source: :doc:`/tutorials/introductory/customizing` describes the mechanism and usage of styles.
es_es: :doc:`/tutorials/introductoria/personalización` describe el mecanismo y el uso de estilos.

source: The :doc:`/gallery/style_sheets/style_sheets_reference` gives an overview of the builtin styles.
es_es: La :doc:`/gallery/style_sheets/style_sheets_reference` da una visión general de los estilos incorporados.

source: Context manager for using style settings temporarily.
es_es: Gestor de contexto para usar temporalmente la configuración de estilo.

source: Parameters
es_es: Parámetros

source: str, dict, Path or list
es_es: str, dicto, ruta o lista

source: A style specification. Valid options are:
es_es: Una especificación de estilo. Las opciones válidas son:

source: The name of a style or a path/URL to a style file. For a list of available style names, see `.style.available`.
es_es: El nombre de un estilo o una ruta/URL a un archivo de estilo. Para una lista de nombres de estilo disponibles, vea `.style.available`.

source: Dictionary with valid key/value pairs for `matplotlib.rcParams`.
es_es: Diccionario con pares de clave/valor válidos para `matplotlib.rcParams`.

source: Path
es_es: Ruta

source: A path-like object which is a path to a style file.
es_es: Un objeto similar a la ruta que es una ruta a un archivo de estilo.

source: list
es_es: lista

source: A list of style specifiers (str, Path or dict) applied from first to last in the list.
es_es: Una lista de especificadores de estilo (str, Ruta o dictado) aplicada de la primera a la última en la lista.

source: **after_reset**
es_es: **después_reiniciar**

source: If True, apply style after resetting settings to their defaults; otherwise, apply style on top of the current settings.
es_es: Si es verdadero, aplicar estilo después de restablecer la configuración a sus valores predeterminados; de lo contrario, aplicar estilo encima de los ajustes actuales.

source: Reload the style library.
es_es: Recarga la biblioteca de estilo.

source: Use Matplotlib style settings from a style specification.
es_es: Utilice la configuración de estilo Matplotlib de una especificación de estilo.

source: The style name of 'default' is reserved for reverting back to the default style settings.
es_es: El nombre de estilo de 'default' está reservado para volver a la configuración de estilo predeterminada.

source: This updates the `.rcParams` with the settings from the style. `.rcParams` not defined in the style are kept.
es_es: Esto actualiza los `.rcParams` con los ajustes del estilo. `.rcParams` no definidos en el estilo son altos.

source: The following `.rcParams` are not related to style and will be ignored if found in a style specification:
es_es: Los siguientes `.rcParams` no están relacionados con el estilo y serán ignorados si se encuentra en una especificación de estilo:

source: date.epoch
es_es: fecha.epoch

source: figure.max_open_warning
es_es: aviso_abierto.max_advertencia

source: figure.raise_window
es_es: ventana de figure.raise

source: interactive
es_es: interactivo

source: tk.window_focus
es_es: enfoque.ventana

source: toolbar
es_es: barra de herramientas

source: webagg.open_in_browser
es_es: webagg.abrir_en_navegador

source: webagg.port
es_es: webagg.puerto

source: webagg.port_retries
es_es: reintentos

source: A dict mapping from style name to `.RcParams` defining that style.
es_es: Un mapeo de dictado desde el nombre del estilo a `.RcParams` definiendo ese estilo.

source: This is meant to be read-only. Use `.reload_library` to update.
es_es: Esto está pensado para ser de sólo lectura. Usa `.reload_library` para actualizar.

source: List of the names of the available styles.
es_es: Lista de los nombres de los estilos disponibles.
