Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/testing_api.po
Languages: es_es

source: [*Deprecated*] Run the matplotlib test suite.
es_es: [*Desaprobado*] Ejecute la suite de pruebas matplotlib.

source: Helper functions for testing.
es_es: Funciones auxiliares para pruebas.

source: Utilities for comparing image results.
es_es: Utilidades para comparar los resultados de la imagen.

source: Calculate the per-pixel errors, then compute the root mean square error.
es_es: Calcula los errores por píxel, luego calcula el error de la raíz media cuadrada.

source: Return the list of file formats that `.compare_images` can compare on this system.
es_es: Devuelve la lista de formatos de archivo que `.compare_images` puede comparar en este sistema.

source: Returns
es_es: Devuelve

source: list of str
es_es: lista de str

source: E.g. ``['png', 'pdf', 'svg', 'eps']``.
es_es: P.e. ``['png', 'pdf', 'svg', 'eps']``.

source: Compare two "image" files checking differences within a tolerance.
es_es: Compara dos archivos de "imagen" comprobando diferencias dentro de una tolerancia.

source: The two given filenames may point to files which are convertible to PNG via the `.converter` dictionary. The underlying RMS is calculated with the `.calculate_rms` function.
es_es: Los dos nombres de archivo dados pueden apuntar a archivos que son convertibles a PNG a través del `. diccionario onverter`. El RMS subyacente se calcula con la función `.calculate_rms`.

source: Parameters
es_es: Parámetros

source: **expected**
es_es: **esperado**

source: The filename of the expected image.
es_es: El nombre de archivo de la imagen esperada.

source: **actual**
es_es: **real**

source: The filename of the actual image.
es_es: El nombre de archivo de la imagen real.

source: **tol**
es_es: **tó**

source: The tolerance (a color value difference, where 255 is the maximal difference). The test fails if the average pixel difference is greater than this value.
es_es: La tolerancia (una diferencia de valor de color, donde 255 es la diferencia máxima) La prueba falla si la diferencia promedio de píxeles es mayor que este valor.

source: **in_decorator**
es_es: **in_decorador**

source: Determines the output format. If called from image_comparison decorator, this should be True. (default=False)
es_es: Determina el formato de salida. Si se llama desde el decorador image_comparation, este debe ser True. (por defecto=False)

source: None or dict or str
es_es: Ninguno o dictado o str

source: Return *None* if the images are equal within the given tolerance.
es_es: Devuelve *nunca* si las imágenes son iguales dentro de la tolerancia dada.

source: If the images differ, the return value depends on *in_decorator*. If *in_decorator* is true, a dict with the following entries is returned:
es_es: Si las imágenes difieren, el valor devuelto depende de *in_decorator*. Si *in_decorator* es verdadero, se retorna un dict con las siguientes entradas:

source: *rms*: The RMS of the image difference.
es_es: *rms*: El RMS de la diferencia de imagen.

source: *expected*: The filename of the expected image.
es_es: *esperado*: El nombre de archivo de la imagen esperada.

source: *actual*: The filename of the actual image.
es_es: *actual*: El nombre del archivo de la imagen real.

source: *diff_image*: The filename of the difference image.
es_es: *diff_image*: El nombre del archivo de la imagen de diferencia.

source: *tol*: The comparison tolerance.
es_es: *tol*: La tolerancia a la comparación.

source: Otherwise, a human-readable multi-line string representation of this information is returned.
es_es: De lo contrario, se devuelve una representación de cadena multi-línea legible por el hombre.

source: Examples
es_es: Ejemplos

source: A wrapper for unittest.TestCase that includes cleanup operations.
es_es: Un envoltorio para unittest.TestCase que incluye operaciones de limpieza.

source: Create an instance of the class that will use the named test method when executed. Raises a ValueError if the instance does not have a method with the specified name.
es_es: Crea una instancia de la clase que usará el método de prueba nombrado cuando se ejecute. Aumenta un ValueError si la instancia no tiene un método con el nombre especificado.

source: Hook method for setting up class fixture before running tests in the class.
es_es: Método Hook para configurar el dispositivo de clase antes de ejecutar pruebas en la clase.

source: Hook method for deconstructing the class fixture after running all tests in the class.
es_es: Método Hook para deconstruir el aparato de clase después de ejecutar todas las pruebas en la clase.

source: Decorator for test cases that generate and compare two figures.
es_es: Decorador para casos de prueba que generan y comparan dos cifras.

source: The decorated function must take two keyword arguments, *fig_test* and *fig_ref*, and draw the test and reference images on them. After the function returns, the figures are saved and compared.
es_es: La función decorada debe tomar dos argumentos de palabra clave, *fig_test* y *fig_ref*, y dibujar las imágenes de prueba y referencia en ellos. Después de que la función regrese, las cifras se guardan y comparan.

source: This decorator should be preferred over `image_comparison` when possible in order to keep the size of the test suite from ballooning.
es_es: Este decorador debe ser preferido sobre `image_comparison` cuando sea posible para mantener el tamaño de la suite de pruebas del globo.

source: **extensions**
es_es: **extensiones**

source: list, default: ["png", "pdf", "svg"]
es_es: lista, por defecto: ["png", "pdf", "svg"]

source: The extensions to test.
es_es: Las extensiones a prueba.

source: The RMS threshold above which the test is considered failed.
es_es: El umbral RMS por encima del cual se considera que la prueba ha fallado.

source: Raises
es_es: Plantea

source: RuntimeError
es_es: Error de ejecución

source: If any new figures are created (and not subsequently closed) inside the test function.
es_es: Si se crean nuevas cifras (y no se cierran) dentro de la función de prueba.

source: Check that calling `.Axes.plot` with a single argument plots it against ``[0, 1, 2, ...]``::
es_es: Comprueba que llamar a `.Axes.plot` con un solo argumento lo traza contra ``[0, 1, 2, ...]``::

source: A decorator to ensure that any global state is reset before running a test.
es_es: Un decorador para asegurar que cualquier estado global se reinicie antes de ejecutar una prueba.

source: str, dict, or list, optional
es_es: str, dictar o listar, opcional

source: The style(s) to apply. Defaults to ``["classic", "_classic_test_patch"]``.
es_es: El estilo(s) a aplicar. Por defecto es ``["clásico", "_classic_test_patch"]``.

source: Compare images generated by the test with those specified in *baseline_images*, which must correspond, else an `ImageComparisonFailure` exception will be raised.
es_es: Compara las imágenes generadas por la prueba con las especificadas en *baseline_images*, que deben corresponder, de lo contrario se levantará una excepción `ImageComparisonFailure`.

source: list or None
es_es: lista o ninguno

source: A list of strings specifying the names of the images generated by calls to `.Figure.savefig`.
es_es: Una lista de cadenas que especifica los nombres de las imágenes generadas por llamadas a `.Figure.savefig`.

source: If *None*, the test function must use the ``baseline_images`` fixture, either as a parameter or with `pytest.mark.usefixtures`. This value is only allowed when using pytest.
es_es: Si *nunca*, la función de prueba debe usar la característica ``baseline_images``, ya sea como parámetro o con `pytest.mark.usefixtures`. Este valor solo está permitido cuando se usa pytest.

source: None or list of str
es_es: Ninguno o lista de str

source: The list of extensions to test, e.g. ``['png', 'pdf']``.
es_es: La lista de extensiones a test, por ejemplo, ``['png', 'pdf']``.

source: If *None*, defaults to all supported extensions: png, pdf, and svg.
es_es: Si *Ninguno*, el valor predeterminado de todas las extensiones soportadas: png, pdf y svg.

source: When testing a single extension, it can be directly included in the names passed to *baseline_images*. In that case, *extensions* must not be set.
es_es: Cuando se prueba una sola extensión, se puede incluir directamente en los nombres pasados a *baseline_images*.

source: In order to keep the size of the test suite from ballooning, we only include the ``svg`` or ``pdf`` outputs if the test is explicitly exercising a feature dependent on that backend (see also the `check_figures_equal` decorator for that purpose).
es_es: Con el fin de mantener el tamaño de la suite de pruebas del globo, sólo incluimos las salidas ``svg`` o ``pdf`` si la prueba está ejerciendo explícitamente una característica dependiente de ese backend (ver también el decorador `check_figures_equal`).

source: Due to expected small differences in floating-point calculations, on 32-bit systems an additional 0.06 is added to this threshold.
es_es: Debido a las pequeñas diferencias esperadas en los cálculos de coma flotante, en sistemas de 32 bits se añade un 0,06 adicional a este umbral.

source: **freetype_version**
es_es: **versión freetype**

source: str or tuple
es_es: str o tupla

source: The expected freetype version or range of versions for this test to pass.
es_es: La versión freetype esperada o el rango de versiones para que esta prueba pase.

source: **remove_text**
es_es: **remover texto**

source: Remove the title and tick text from the figure before comparison. This is useful to make the baseline images independent of variations in text rendering between different versions of FreeType.
es_es: Elimina el título y marca el texto de la figura antes de la comparación. Esto es útil para hacer que las imágenes de línea base sean independientes de las variaciones en la representación de texto entre diferentes versiones de FreeType.

source: This does not remove other, more deliberate, text, such as legends and annotations.
es_es: Esto no elimina otro texto más deliberado, como leyendas y anotaciones.

source: Optional arguments that are passed to the savefig method.
es_es: Argumentos opcionales que se pasan al método savehig.

source: str, dict, or list
es_es: str, dictar o lista

source: The optional style(s) to apply to the image test. The test itself can also apply additional styles if desired. Defaults to ``["classic", "_classic_test_patch"]``.
es_es: El estilo(s) opcional a aplicar a la prueba de imagen. La prueba misma también puede aplicar estilos adicionales si así lo desea. Por defecto es ``["clásico", "_classic_test_patch"]``.

source: Raise this exception to mark a test as a comparison between two images.
es_es: Aumenta esta excepción para marcar una prueba como una comparación entre dos imágenes.
