Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/texmanager_api.po
Languages: es_es

source: Support for embedded TeX expressions in Matplotlib.
es_es: Soporte para expresiones TeX embebidas en Matplotlib.

source: Requirements:
es_es: Requisitos:

source: PS backend: PSfrag, dvips, and Ghostscript>=9.0.
es_es: P: PSfrag, dvips y Ghostscript>=9.0.

source: PDF and SVG backends: if LuaTeX is present, it will be used to speed up some post-processing steps, but note that it is not used to parse the TeX string itself (only LaTeX is supported).
es_es: PDF y SVG backends: si LuaTeX está presente, se utilizará para acelerar algunos pasos de postprocesamiento, pero tenga en cuenta que no se usa para analizar la cadena TeX en sí misma (sólo LaTeX está soportado).

source: To enable TeX rendering of all text in your Matplotlib figure, set :rc:`text.usetex` to True.
es_es: Para habilitar el renderizado TeX de todo el texto en tu figura de Matplotlib, establece :rc:`text.usetex` a True.

source: TeX and dvipng/dvips processing results are cached in ~/.matplotlib/tex.cache for reuse between sessions.
es_es: Los resultados de procesamiento de TeX y dvipng/dvips se almacenan en caché en ~/.matplotlib/tex.cache para reutilizarlos entre sesiones.

source: `TexManager.get_rgba` can also be used to directly obtain raster output as RGBA NumPy arrays.
es_es: `TexManager.get_rgba` también puede ser usado para obtener directamente salida de raster como matrices numéricas RGBA.

source: Convert strings to dvi files using TeX, caching the results to a directory.
es_es: Convierte cadenas a archivos dvi usando TeX, almacenando en caché los resultados en un directorio.

source: Repeated calls to this constructor always return the same instance.
es_es: Las llamadas repetidas a este constructor siempre devuelven la misma instancia.

source: Return a filename based on a hash of the string, fontsize, and dpi.
es_es: Devuelve un nombre de archivo basado en un hash de la cadena, tamaño de fuente y dpi.

source: Return a string containing user additions to the tex preamble.
es_es: Devuelve una cadena que contenga adiciones de usuario al preámbulo del texto.

source: Return a string containing font configuration for the tex preamble.
es_es: Devuelve una cadena que contiene la configuración de fuente para el preámbulo de textos.

source: Return the alpha channel.
es_es: Devuelve el canal alfa.

source: Return latex's rendering of the tex string as an rgba array.
es_es: Devuelve el renderizado de látex de la cadena de texto como una matriz rgba.

source: Examples
es_es: Ejemplos

source: Return width, height and descent of the text.
es_es: Devuelve el ancho, la altura y la bajada del texto.

source: Generate a dvi file containing latex's layout of tex string.
es_es: Genera un archivo dvi que contiene la disposición del látex de la cadena de textos.

source: Return the file name.
es_es: Devuelve el nombre del archivo.

source: Generate a png file containing latex's rendering of tex string.
es_es: Genera un archivo png que contiene el renderizado de la cadena de textos.

source: Generate a tex file to render the tex string at a specific font size.
es_es: Genera un archivo de texto para renderizar la cadena de texto a un tamaño de fuente específico.
