Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/text_api.po
Languages: es_es

source: Classes for including text in a figure.
es_es: Clases para incluir texto en una figura.

source: An `.Annotation` is a `.Text` that can refer to a specific position *xy*. Optionally an arrow pointing from the text to *xy* can be drawn.
es_es: Una `.Annotation` es un `.Text` que puede referirse a una posición específica *xy*. Opcionalmente se puede dibujar una flecha que apunte desde el texto a *xy*.

source: Attributes
es_es: Atributos

source: The annotated position.
es_es: La posición anotada.

source: The coordinate system for *xy*.
es_es: El sistema de coordenadas para *xy*.

source: A `.FancyArrowPatch` to point from *xytext* to *xy*.
es_es: Un `.FancyArrowPatch` para apuntar desde *xytext* a *xy*.

source: Annotate the point *xy* with text *text*.
es_es: Anotar el punto *xy* con el texto *text*.

source: In the simplest form, the text is placed at *xy*.
es_es: En la forma más simple, el texto se coloca en *xy*.

source: Optionally, the text can be displayed in another position *xytext*. An arrow pointing from the text to the annotated point *xy* can then be added by defining *arrowprops*.
es_es: Opcionalmente, el texto puede mostrarse en otra posición *xytext*. Entonces se puede añadir una flecha que apunte desde el texto al punto anotado *xy* definiendo *arrowprops*.

source: Parameters
es_es: Parámetros

source: **text**
es_es: **texto**

source: The text of the annotation.
es_es: El texto de la anotación.

source: The point *(x, y)* to annotate. The coordinate system is determined by *xycoords*.
es_es: El punto *(x, y)* a anotar. El sistema de coordenadas está determinado por *coordenadasxy*.

source: **xytext** : (float, float), default: *xy*
es_es: **xytext** : (float, float), por defecto: *xy*

source: (float, float), default:
es_es: (float, float), por defecto:

source: The position *(x, y)* to place the text at. The coordinate system is determined by *textcoords*.
es_es: La posición *(x, y)* en la que colocar el texto. El sistema de coordenadas está determinado por *textcoords*.

source: **xycoords** : str or `.Artist` or `.Transform` or callable or (float, float), default: 'data'
es_es: **xycoords** : str o `.Artist` o `.Transform` o callable o (float, float), por defecto: 'data'

source: The coordinate system that *xy* is given in. The following types of values are supported:
es_es: El sistema de coordenadas en el que se da *xy*. Se admiten los siguientes tipos de valores:

source: One of the following strings:
es_es: Una de las siguientes cadenas:

source: Value
es_es: Valor

source: Description
es_es: Descripción

source: Points from the lower left of the figure
es_es: Puntos de la parte inferior izquierda de la figura

source: Pixels from the lower left of the figure
es_es: Píxeles de la parte inferior izquierda de la figura

source: Fraction of figure from lower left
es_es: Fracción de la figura desde la parte inferior izquierda

source: Points from the lower left of the subfigure
es_es: Puntos de la parte inferior izquierda de la subfigura

source: Pixels from the lower left of the subfigure
es_es: Píxeles de la parte inferior izquierda de la subfigura

source: Fraction of subfigure from lower left
es_es: Fracción de la subfigura desde la parte inferior izquierda

source: Points from lower left corner of axes
es_es: 'polar'

source: Pixels from lower left corner of axes
es_es: Píxeles de la esquina inferior izquierda de los ejes

source: Fraction of axes from lower left
es_es: Fracción de ejes desde la parte inferior izquierda

source: Use the coordinate system of the object being annotated (default)
es_es: Utilizar el sistema de coordenadas del objeto que se anota (por defecto)

source: *(theta, r)* if not native 'data' coordinates
es_es: *(theta, r)* si no son coordenadas nativas de 'data'

source: Note that 'subfigure pixels' and 'figure pixels' are the same for the parent figure, so users who want code that is usable in a subfigure can use 'subfigure pixels'.
es_es: Ten en cuenta que 'subfigure pixels' y 'figure pixels' son los mismos para la figura padre, por lo que los usuarios que quieran un código utilizable en una subfigura pueden utilizar 'subfigure pixels'.

source: An `.Artist`: *xy* is interpreted as a fraction of the artist's `~matplotlib.transforms.Bbox`. E.g. *(0, 0)* would be the lower left corner of the bounding box and *(0.5, 1)* would be the center top of the bounding box.
es_es: Un `.Artist`: *xy* se interpreta como una fracción del artista `~matplotlib.transforms.Bbox`. Por ejemplo, *(0, 0)* sería la esquina inferior izquierda de la caja delimitadora y *(0,5, 1)* sería la parte superior central de la caja delimitadora.

source: A `.Transform` to transform *xy* to screen coordinates.
es_es: Un `.Transform` para transformar *xy* a coordenadas de pantalla.

source: A function with one of the following signatures::
es_es: Una función con una de las siguientes firmas::

source: where *renderer* is a `.RendererBase` subclass.
es_es: donde *renderer* es una subclase `.RendererBase`.

source: The result of the function is interpreted like the `.Artist` and `.Transform` cases above.
es_es: El resultado de la función se interpreta como los casos `.Artist` y `.Transform` anteriores.

source: A tuple *(xcoords, ycoords)* specifying separate coordinate systems for *x* and *y*. *xcoords* and *ycoords* must each be of one of the above described types.
es_es: Una tupla *(xcoords, ycoords)* que especifica sistemas de coordenadas separados para *x* y *y*. *xcoords* y *ycoords* deben ser cada uno de los tipos descritos anteriormente.

source: See :ref:`plotting-guide-annotation` for more details.
es_es: Ver :ref:`plotting-guide-annotation` para más detalles.

source: **textcoords** : str or `.Artist` or `.Transform` or callable or (float, float), default: value of *xycoords*
es_es: **textcoords** : str o `.Artist` o `.Transform` o callable o (float, float), por defecto: valor de *xycoords*

source: The coordinate system that *xytext* is given in.
es_es: El sistema de coordenadas en el que se da *xytext*.

source: All *xycoords* values are valid as well as the following strings:
es_es: Todos los valores *xycoords* son válidos, así como las siguientes cadenas:

source: Offset (in points) from the *xy* value
es_es: Desplazamiento (en puntos) del valor *xy*

source: Offset (in pixels) from the *xy* value
es_es: Desplazamiento (en píxeles) del valor *xy*

source: dict, optional
es_es: dict, opcional

source: The properties used to draw a `.FancyArrowPatch` arrow between the positions *xy* and *xytext*. Defaults to None, i.e. no arrow is drawn.
es_es: Las propiedades utilizadas para dibujar una flecha `.FancyArrowPatch` entre las posiciones *xy* y *xytext*. Por defecto es None, es decir, no se dibuja ninguna flecha.

source: For historical reasons there are two different ways to specify arrows, "simple" and "fancy":
es_es: Por razones históricas, hay dos formas diferentes de especificar las flechas, "simple" y "elegante":

source: **Simple arrow:**
es_es: **Flecha simple:**

source: If *arrowprops* does not contain the key 'arrowstyle' the allowed keys are:
es_es: Si *arrowprops* no contiene la clave 'arrowstyle' las claves permitidas son:

source: Key
es_es: Clave

source: width
es_es: anchura

source: The width of the arrow in points
es_es: El ancho de la flecha en puntos

source: The width of the base of the arrow head in points
es_es: El ancho de la base de la punta de la flecha en puntos

source: The length of the arrow head in points
es_es: La longitud de la punta de la flecha en puntos

source: shrink
es_es: reducir

source: Fraction of total length to shrink from both ends
es_es: Fracción de la longitud total a encoger desde ambos extremos

source: Any key to :class:`matplotlib.patches.FancyArrowPatch`
es_es: Cualquier clave para :class:`matplotlib.patches.FancyArrowPatch`

source: The arrow is attached to the edge of the text box, the exact position (corners or centers) depending on where it's pointing to.
es_es: La flecha se une al borde de la caja de texto, la posición exacta (esquinas o centros) depende de hacia dónde apunte.

source: **Fancy arrow:**
es_es: **Flecha de lujo:**

source: This is used if 'arrowstyle' is provided in the *arrowprops*.
es_es: Se utiliza si se proporciona 'arrowstyle' en el *arrowprops*.

source: Valid keys are the following `~matplotlib.patches.FancyArrowPatch` parameters:
es_es: Las claves válidas son los siguientes parámetros:

source: the arrow style
es_es: el estilo de la flecha

source: the connection style
es_es: el estilo de conexión

source: see below; default is (0.5, 0.5)
es_es: ver abajo; por defecto es (0.5, 0.5)

source: default is bounding box of the text
es_es: por defecto es la caja de delimitación del texto

source: default is None
es_es: por defecto es None

source: default is 2 points
es_es: por defecto son 2 puntos

source: default is text size (in points)
es_es: por defecto es el tamaño del texto (en puntos)

source: default is 1.
es_es: por defecto es 1.

source: any key for :class:`matplotlib.patches.PathPatch`
es_es: cualquier clave para :class:`matplotlib.patches.PathPatch`

source: The exact starting point position of the arrow is defined by *relpos*. It's a tuple of relative coordinates of the text box, where (0, 0) is the lower left corner and (1, 1) is the upper right corner. Values <0 and >1 are supported and specify points outside the text box. By default (0.5, 0.5) the starting point is centered in the text box.
es_es: La posición exacta del punto de partida de la flecha se define por *relpos*. Es una tupla de coordenadas relativas de la caja de texto, donde (0, 0) es la esquina inferior izquierda y (1, 1) es la esquina superior derecha. Los valores <0 y >1 son compatibles y especifican puntos fuera de la caja de texto. Por defecto (0.5, 0.5) el punto de partida está centrado en la caja de texto.

source: bool or None, default: None
es_es: bool o None, por defecto: None

source: Whether to draw the annotation when the annotation point *xy* is outside the axes area.
es_es: Si se dibuja la anotación cuando el punto de anotación *xy* está fuera del área de los ejes.

source: If *True*, the annotation will only be drawn when *xy* is within the axes.
es_es: Si *True*, la anotación sólo se dibujará cuando *xy* esté dentro de los ejes.

source: If *False*, the annotation will always be drawn.
es_es: Si *False*, la anotación se dibujará siempre.

source: If *None*, the annotation will only be drawn when *xy* is within the axes and *xycoords* is 'data'.
es_es: Si *None*, la anotación sólo se dibujará cuando *xy* esté dentro de los ejes y *xycoords* sea 'data'.

source: Additional kwargs are passed to `~matplotlib.text.Text`.
es_es: Se pasan kwargs adicionales a `~matplotlib.text.Text`.

source: Returns
es_es: Devuelve

source: The coordinate system to use for `.Annotation.xyann`.
es_es: El sistema de coordenadas a utilizar para `.Annotation.xyann`.

source: Return whether the mouse event occurred inside the axis-aligned bounding-box of the text.
es_es: Devuelve si el evento del ratón ocurrió dentro de la caja delimitadora alineada con el eje del texto.

source: Draw the Artist (and its children) using the given renderer.
es_es: Dibuja el Artista (y sus hijos) usando el renderizador dado.

source: This has no effect if the artist is not visible (`.Artist.get_visible` returns False).
es_es: Esto no tiene efecto si el artista no es visible (`.Artist.get_visible` devuelve False).

source: **renderer** : `.RendererBase` subclass.
es_es: **renderizador** : subclase `.RendererBase`.

source: RendererBase subclass.
es_es: Subclase RendererBase.

source: Notes
es_es: Notas

source: This method is overridden in the Artist subclasses.
es_es: Este método se sobrescribe en las subclases de Artist.

source: Return the coordinate system to use for `.Annotation.xyann`.
es_es: Devuelve el sistema de coordenadas a utilizar para `.Annotation.xyann`.

source: See also *xycoords* in `.Annotation`.
es_es: Ver también *xycoords* en `.Annotation`.

source: Like `.Artist.get_window_extent`, but includes any clipping.
es_es: Como `.Artist.get_window_extent`, pero incluye cualquier recorte.

source: **renderer** : `.RendererBase` subclass
es_es: **renderer** : subclase `.RendererBase`

source: RendererBase subclass
es_es: Subclase RendererBase

source: renderer that will be used to draw the figures (i.e. ``fig.canvas.get_renderer()``)
es_es: renderizador que se utilizará para dibujar las figuras (es decir, ``fig.canvas.get_renderer()``)

source: The enclosing bounding box (in figure pixel coordinates).
es_es: La caja delimitadora (en coordenadas de píxeles de la figura).

source: Return the `.Bbox` bounding the text, in display units.
es_es: Devuelve el `.Bbox` que delimita el texto, en unidades de visualización.

source: In addition to being used internally, this is useful for specifying clickable regions in a png file on a web page.
es_es: Además de usarse internamente, esto es útil para especificar regiones clicables en un archivo png en una página web.

source: Renderer, optional
es_es: Renderizador, opcional

source: A renderer is needed to compute the bounding box. If the artist has already been drawn, the renderer is cached; thus, it is only necessary to pass this argument when calling `get_window_extent` before the first `draw`. In practice, it is usually easier to trigger a draw first (e.g. by saving the figure).
es_es: Se necesita un renderizador para calcular el cuadro delimitador. Si el artista ya ha sido dibujado, el renderizador se almacena en caché; por lo tanto, sólo es necesario pasar este argumento cuando se llama a `get_window_extent` antes del primer `draw`. En la práctica, normalmente es más fácil activar un dibujo primero (por ejemplo, guardando la figura).

source: float, optional
es_es: float, opcional

source: The dpi value for computing the bbox, defaults to ``self.figure.dpi`` (*not* the renderer dpi); should be set e.g. if to match regions with a figure saved with a custom dpi value.
es_es: El valor de ppp para calcular el bbox, por defecto es ``self.figure.dpi`` (*no* el ppp del renderizador); debe establecerse, por ejemplo, si se quiere hacer coincidir regiones con una figura guardada con un valor de ppp personalizado.

source: Set multiple properties at once.
es_es: Establecer varias propiedades a la vez.

source: Supported properties are
es_es: Las propiedades soportadas son

source: Property
es_es: Propiedad

source: a filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array
es_es: una función de filtro, que toma un arreglo de flotadores (m, n, 3) y un valor de ppp, y devuelve un arreglo (m, n, 3)

source: scalar or None
es_es: escalar o None

source: unknown
es_es: desconocido

source: bool or None
es_es: bool o None

source: dict with properties for `.patches.FancyBboxPatch`
es_es: dict con propiedades para `.patches.FancyBboxPatch`

source: Patch or (Path, Transform) or None
es_es: Parche o (Ruta, Transformación) o Ninguno

source: :meth:`fontfamily <matplotlib.text.Text.set_fontfamily>` or family
es_es: :meth:`fontfamily <matplotlib.text.Text.set_fontfamily>` o familia

source: :meth:`fontproperties <matplotlib.text.Text.set_fontproperties>` or font or font_properties
es_es: :meth:`fontproperties <matplotlib.text.Text.set_fontproperties>` o font o font_properties

source: `.font_manager.FontProperties` or `str` or `pathlib.Path`
es_es: `.font_manager.FontProperties` o `str` o `pathlib.Path`

source: :meth:`fontsize <matplotlib.text.Text.set_fontsize>` or size
es_es: :meth:`fontsize <matplotlib.text.Text.set_fontsize>` o size

source: {a numeric value in range 0-1000, 'ultra-condensed', 'extra-condensed', 'condensed', 'semi-condensed', 'normal', 'semi-expanded', 'expanded', 'extra-expanded', 'ultra-expanded'}
es_es: {un valor numérico en el rango 0-1000, 'ultra-condensed', 'extra-condensed', 'condensed', 'semi-condensed', 'normal', 'semi-expanded', 'expanded', 'extra-expanded', 'ultra-expanded'}

source: :meth:`fontstyle <matplotlib.text.Text.set_fontstyle>` or style
es_es: :meth:`fontstyle <matplotlib.text.Text.set_fontstyle>` o style

source: :meth:`fontvariant <matplotlib.text.Text.set_fontvariant>` or variant
es_es: :meth:`fontvariant <matplotlib.text.Text.set_fontvariant>` o variant

source: {a numeric value in range 0-1000, 'ultralight', 'light', 'normal', 'regular', 'book', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'}
es_es: {un valor numérico en el rango 0-1000, 'ultralight', 'light', 'normal', 'regular', 'book', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'}

source: object
es_es: objeto

source: float (multiple of font size)
es_es: float (múltiplo del tamaño de la fuente)

source: :meth:`multialignment <matplotlib.text.Text.set_multialignment>` or ma
es_es: :meth:`multialignment <matplotlib.text.Text.set_multialignment>` o ma

source: None or bool or float or callable
es_es: None o bool o float o callable

source: float or {'vertical', 'horizontal'}
es_es: float o {'vertical', 'horizontal'}

source: (scale: float, length: float, randomness: float)
es_es: (escala: float, longitud: float, aleatoriedad: float)

source: float
es_es: de punto flotante (float)

source: Set the coordinate system to use for `.Annotation.xyann`.
es_es: Establece el sistema de coordenadas a utilizar para `.Annotation.xyann`.

source: Set the `.Figure` instance the artist belongs to.
es_es: Establece la instancia `.Figure` a la que pertenece el artist.

source: Figure
es_es: Figura

source: Update the pixel positions of the annotation text and the arrow patch.
es_es: Actualizar las posiciones de los píxeles del texto de la anotación y del parche de la flecha.

source: The text position.
es_es: La posición del texto.

source: See also *xytext* in `.Annotation`.
es_es: Ver también *xytext* en `.Annotation`.

source: Callable helper class for working with `Annotation`.
es_es: Clase de ayuda invocable para trabajar con `Anotaciones`.

source: **artist** : `.Artist` or `.BboxBase` or `.Transform`
es_es: **artist** : `.Artist` o `.BboxBase` o `.Transform`

source: Artist or BboxBase or Transform
es_es: Artista o BboxBase o Transform

source: The object to compute the offset from.
es_es: El objeto para calcular el desplazamiento desde.

source: If *artist* is an `.Artist` or `.BboxBase`, this values is the location to of the offset origin in fractions of the *artist* bounding box.
es_es: Si *artist* es un `.Artist` o `.BboxBase`, este valor es la ubicación del origen del desplazamiento en fracciones de la caja delimitadora del *artist*.

source: If *artist* is a transform, the offset origin is the transform applied to this value.
es_es: Si *artist* es una transformación, el origen del desplazamiento es la transformación aplicada a este valor.

source: The screen units to use (pixels or points) for the offset input.
es_es: Las unidades de pantalla a utilizar (píxeles o puntos) para la entrada de desplazamiento.

source: Return the unit for input to the transform used by ``__call__``.
es_es: Devuelve la unidad de entrada a la transformación utilizada por ``__call__``.

source: Set the unit for input to the transform used by ``__call__``.
es_es: Establece la unidad de entrada a la transformación utilizada por ``__call__``.

source: Handle storing and drawing of text in window or data coordinates.
es_es: Maneja el almacenamiento y el dibujo de texto en coordenadas de ventana o de datos.

source: Create a `.Text` instance at *x*, *y* with string *text*.
es_es: Crea una instancia `.Text` en *x*, *y* con la cadena *text*.

source: Valid keyword arguments are:
es_es: Los argumentos válidos de la palabra clave son:

source: Return the bbox Patch, or None if the `.patches.FancyBboxPatch` is not made.
es_es: Devuelve el parche bbox, o None si el `.patches.FancyBboxPatch` no está hecho.

source: Alias for `get_color`.
es_es: Alias para `get_color`.

source: Return the color of the text.
es_es: Devuelve el color del texto.

source: Alias for `get_fontfamily`.
es_es: Alias para `get_fontfamily`.

source: Alias for `get_fontproperties`.
es_es: Alias para `get_fontproperties`.

source: Return the list of font families used for font lookup.
es_es: Devuelve la lista de familias de fuentes utilizadas para la búsqueda de fuentes.

source: Return the font name as a string.
es_es: Devuelve el nombre de la fuente como una cadena.

source: Return the `.font_manager.FontProperties`.
es_es: Devuelve las `.font_manager.FontProperties`.

source: Return the font size as an integer.
es_es: Devuelve el tamaño de la fuente como un entero.

source: Return the font style as a string.
es_es: Devuelve el estilo de la fuente como una cadena.

source: Return the font variant as a string.
es_es: Devuelve la variante de la fuente como una cadena.

source: Return the font weight as a string or a number.
es_es: Devuelve el peso de la fuente como una cadena o un número.

source: Alias for `get_horizontalalignment`.
es_es: Alias para `get_horizontalalalignment`.

source: Return the horizontal alignment as a string. Will be one of 'left', 'center' or 'right'.
es_es: Devuelve la alineación horizontal como una cadena. Será una de 'izquierda', 'centro' o 'derecha'.

source: Return the font family name for math text rendered by Matplotlib.
es_es: Devuelve el nombre de la familia de fuentes para el texto matemático renderizado por Matplotlib.

source: The default value is :rc:`mathtext.fontset`.
es_es: El valor por defecto es :rc:`mathtext.fontset`.

source: Alias for `get_fontname`.
es_es: Alias para `get_fontname`.

source: Return whether mathtext parsing is considered for this `Text`.
es_es: Devuelve si se considera el análisis de mathtext para este `Text`.

source: Return the (x, y) position of the text.
es_es: Devuelve la posición (x, y) del texto.

source: [*Deprecated*] Return a hashable tuple of properties.
es_es: [*Abandonado*] Devuelve una tupla hashable de propiedades.

source: Not intended to be human readable, but useful for backends who want to cache derived information about text (e.g., layouts) and need to know if the text has changed.
es_es: No se pretende que sea legible para los humanos, pero es útil para los backends que quieren almacenar en caché información derivada sobre el texto (por ejemplo, diseños) y necesitan saber si el texto ha cambiado.

source: Return the text angle in degrees between 0 and 360.
es_es: Devuelve el ángulo del texto en grados entre 0 y 360.

source: Return the text rotation mode.
es_es: Devuelve el modo de rotación del texto.

source: Alias for `get_fontsize`.
es_es: Alias para `get_fontsize`.

source: Return the font stretch as a string or a number.
es_es: Devuelve el tramo de la fuente como una cadena o un número.

source: Alias for `get_fontstyle`.
es_es: Alias para `get_fontstyle`.

source: Return the text string.
es_es: Devuelve la cadena de texto.

source: Return whether rotations of the transform affect the text direction.
es_es: Devuelve si las rotaciones de la transformación afectan a la dirección del texto.

source: Return the (x, y) unitless position of the text.
es_es: Devuelve la posición (x, y) sin unidades del texto.

source: Return whether this `Text` object uses TeX for rendering.
es_es: Devuelve si este objeto `Text` utiliza TeX para el renderizado.

source: Alias for `get_verticalalignment`.
es_es: Alias para `get_verticalalignment`.

source: Alias for `get_fontvariant`.
es_es: Alias para `get_fontvariant`.

source: Return the vertical alignment as a string. Will be one of 'top', 'center', 'bottom', 'baseline' or 'center_baseline'.
es_es: Devuelve la alineación vertical como una cadena. Será una de 'top', 'center', 'bottom', 'baseline' o 'center_baseline'.

source: Alias for `get_fontweight`.
es_es: Alias para `get_fontweight`.
