Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/textpath_api.po
Languages: es_es

source: Create a path from the text.
es_es: Crear una ruta desde el texto.

source: Create a path from the text. Note that it simply is a path, not an artist. You need to use the `.PathPatch` (or other artists) to draw this path onto the canvas.
es_es: Crea una ruta desde el texto. Ten en cuenta que simplemente es una ruta, no un artista. Necesitas usar el `.PathPatch` (u otros artistas) para dibujar esta ruta en el lienzo.

source: Parameters
es_es: Parámetros

source: tuple or array of two float values
es_es: tuple o array de dos valores flotantes

source: Position of the text. For no offset, use ``xy=(0, 0)``.
es_es: Posición del texto. Para ningún desplazamiento, use ``xy=(0, 0)``.

source: The text to convert to a path.
es_es: El texto a convertir a una ruta.

source: float, optional
es_es: float, opcional

source: Font size in points. Defaults to the size specified via the font properties *prop*.
es_es: Tamaño de fuente en puntos. Por defecto el tamaño especificado mediante las propiedades *prop*.

source: **prop** : `matplotlib.font_manager.FontProperties`, optional
es_es: **prop** : `matplotlib.font_manager.FontProperties`, opcional

source: matplotlib.font_manager.FontProperties, optional
es_es: matplotlib.font_manager.FontProperties, opcional

source: Font property. If not provided, will use a default ``FontProperties`` with parameters from the :ref:`rcParams<customizing-with-dynamic-rc-settings>`.
es_es: Propiedad de la fuente. Si no se proporciona, utilizará un ``FontProperties`` predeterminado con parámetros del :ref:`rcParams<customizing-with-dynamic-rc-settings>`.

source: int, optional
es_es: int, opcional

source: (Currently ignored)
es_es: (Actualmente ignorado)

source: bool, default: False
es_es: bool, por defecto: False

source: Whether to use tex rendering.
es_es: Si se utiliza el renderizado de textos.

source: Examples
es_es: Ejemplos

source: The following creates a path from the string "ABC" with Helvetica font face; and another path from the latex fraction 1/2::
es_es: A continuación se crea una ruta de la cadena "ABC" con la cara de la fuente Helvetica; y otra ruta de la fracción de látex 1/2::

source: Also see :doc:`/gallery/text_labels_and_annotations/demo_text_path`.
es_es: Vea también :doc:`/gallery/text_labels_and_annotations/demo_text_path`.

source: Return the codes
es_es: Devuelve los códigos

source: Get the text size.
es_es: Obtener el tamaño del texto.

source: Set the text size.
es_es: Establecer el tamaño del texto.

source: Return the cached path after updating it if necessary.
es_es: Devuelve la ruta cacheada después de actualizarla si es necesario.

source: A class that converts strings to paths.
es_es: Una clase que convierte cadenas a rutas.

source: Parse mathtext string *s* and convert it to a (vertices, codes) pair.
es_es: Analizar cadena mathtext *s* y convertirla a un par (vértices, códigos).

source: Convert the string *s* to vertices and codes using usetex mode.
es_es: Convierte la cadena *s* a vértices y códigos usando el modo usetex.

source: Convert string *s* to vertices and codes using the provided ttf font.
es_es: Convierte la cadena *s* a vértices y códigos usando la fuente ttf proporcionada.

source: Return the cached `~.texmanager.TexManager` instance.
es_es: Devuelve la instancia `~.texmanager.TexManager` en caché.

source: Convert text *s* to path (a tuple of vertices and codes for matplotlib.path.Path).
es_es: Convierte texto *s* a ruta (una tupla de vértices y códigos para matplotlib.path.Path).

source: The font properties for the text.
es_es: Las propiedades de fuente para el texto.

source: The text to be converted.
es_es: El texto a convertir.

source: {False, True, "TeX"}
es_es: {False, Verdadero, "TeX"}

source: If True, use mathtext parser. If "TeX", use tex for rendering.
es_es: Si es verdadero, usa el analizador de mathtext. Si es "TeX", usa el texto para renderizar.

source: Returns
es_es: Devuelve

source: list
es_es: lista

source: A list of numpy arrays containing the x and y coordinates of the vertices.
es_es: Una lista de matrices numéricas que contienen las coordenadas x e y de los vértices.

source: A list of path codes.
es_es: Una lista de códigos de ruta.

source: Create a list of vertices and codes from a text, and create a `.Path` from those::
es_es: Crea una lista de vértices y códigos a partir de un texto, y crea un `.Path` a partir de estose::

source: Also see `TextPath` for a more direct way to create a path from a text.
es_es: También vea `TextPath` para una manera más directa de crear una ruta desde un texto.
