Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/text_api.po
Languages: es_es

source: Return whether the text can be wrapped.
es_es: Devuelve si el texto puede ser envuelto.

source: Set the background color of the text by updating the bbox.
es_es: Establecer el color de fondo del texto actualizando el bbox.

source: To change the position of the bounding box
es_es: Para cambiar la posición del cuadro delimitador

source: Draw a bounding box around self.
es_es: Dibuja una caja delimitadora alrededor de sí mismo.

source: **rectprops** : dict with properties for `.patches.FancyBboxPatch`
es_es: **rectprops** : dict con propiedades para `.patches.FancyBboxPatch`

source: dict with properties for
es_es: dict con propiedades para

source: The default boxstyle is 'square'. The mutation scale of the `.patches.FancyBboxPatch` is set to the fontsize.
es_es: El boxstyle por defecto es `cuadrado`. La escala de mutación del `.patches.FancyBboxPatch` se ajusta al tamaño de la fuente.

source: Examples
es_es: Ejemplos

source: Alias for `set_color`.
es_es: Alias para `set_color`.

source: Set the artist's clip `.Bbox`.
es_es: Establecer el clip del artista `.Bbox`.

source: Set whether the artist uses clipping.
es_es: Establecer si el artista utiliza el recorte.

source: When False artists will be visible outside of the axes which can lead to unexpected results.
es_es: Cuando es False los artistas serán visibles fuera de los ejes lo que puede llevar a resultados inesperados.

source: Set the artist's clip path.
es_es: Establecer la ruta del clip del artista.

source: **path** : `.Patch` or `.Path` or `.TransformedPath` or None
es_es: **ruta** : `.Patch` o `.Path` o `.TransformedPath` o None

source: Patch or Path or TransformedPath or None
es_es: Patch o Path o TransformedPath o None

source: The clip path. If given a `.Path`, *transform* must be provided as well. If *None*, a previously set clip path is removed.
es_es: La ruta del clip. Si se le da un `.Path`, se debe proporcionar también *transform*. Si *None*, se elimina la ruta de recorte previamente establecida.

source: **transform** : `~matplotlib.transforms.Transform`, optional
es_es: **transformación** : `~matplotlib.transforms.Transform`, opcional

source: Transform, optional
es_es: Transformación, opcional

source: Only used if *path* is a `.Path`, in which case the given `.Path` is converted to a `.TransformedPath` using *transform*.
es_es: Sólo se utiliza si *path* es un `.Path`, en cuyo caso el `.Path` dado se convierte en un `.TransformedPath` utilizando *transform*.

source: For efficiency, if *path* is a `.Rectangle` this method will set the clipping box to the corresponding rectangle and set the clipping path to ``None``.
es_es: Por eficiencia, si *ruta* es un `.Rectángulo` este método establecerá la caja de recorte al rectángulo correspondiente y establecerá la ruta de recorte a ``Ninguna``.

source: For technical reasons (support of `~.Artist.set`), a tuple (*path*, *transform*) is also accepted as a single positional parameter.
es_es: Por razones técnicas (soporte de `~.Artist.set`), también se acepta una tupla (*ruta*, *transformación*) como parámetro posicional único.

source: Set the foreground color of the text
es_es: Establecer el color de primer plano del texto

source: Alias for `set_fontfamily`.
es_es: Alias para `set_fontfamily`.

source: Alias for `set_fontproperties`.
es_es: Alias para `set_fontproperties`.

source: Set the font family. May be either a single string, or a list of strings in decreasing priority. Each string may be either a real font name or a generic font class name. If the latter, the specific font names will be looked up in the corresponding rcParams.
es_es: Establece la familia de fuentes. Puede ser una sola cadena, o una lista de cadenas en prioridad decreciente. Cada cadena puede ser un nombre de fuente real o un nombre de clase de fuente genérico. En este último caso, los nombres específicos de las fuentes se buscarán en los correspondientes rcParams.

source: If a `Text` instance is constructed with ``fontfamily=None``, then the font is set to :rc:`font.family`, and the same is done when `set_fontfamily()` is called on an existing `Text` instance.
es_es: Si una instancia de `Text` se construye con ``fontfamily=None``, entonces la fuente se establece en :rc:`font.family`, y lo mismo se hace cuando se llama a `set_fontfamily()` en una instancia de `Text` existente.

source: Alias for `set_family`.
es_es: Alias para `set_family`.

source: One-way alias only: the getter differs.
es_es: Alias unidireccional solamente: el getter difiere.

source: Set the font properties that control the text.
es_es: Establecer las propiedades de la fuente que controlan el texto.

source: **fp** : `.font_manager.FontProperties` or `str` or `pathlib.Path`
es_es: **fp** : `.font_manager.FontProperties` o `str` o `pathlib.Path`

source: font_manager.FontProperties or str or pathlib.Path
es_es: font_manager.FontProperties o str o pathlib.Path

source: If a `str`, it is interpreted as a fontconfig pattern parsed by `.FontProperties`. If a `pathlib.Path`, it is interpreted as the absolute path to a font file.
es_es: Si es una `str`, se interpreta como un patrón de fontconfig analizado por `.FontProperties`. Si es un `pathlib.Path`, se interpreta como la ruta absoluta a un archivo de fuentes.

source: Set the font size.
es_es: Establecer el tamaño de la fuente.

source: If float, the fontsize in points. The string values denote sizes relative to the default font size.
es_es: Si es float, el tamaño de las fuentes en puntos. Los valores de cadena denotan tamaños relativos al tamaño de la fuente por defecto.

source: Set the font stretch (horizontal condensation or expansion).
es_es: Establecer el estiramiento de la fuente (condensación o expansión horizontal).

source: Set the font style.
es_es: Establecer el estilo de la fuente.

source: Set the font variant.
es_es: Establecer la variante de la fuente.

source: Set the font weight.
es_es: Establecer el peso de la fuente.

source: Alias for `set_horizontalalignment`.
es_es: Alias para `set_horizontalalignment`.

source: Set the horizontal alignment to one of
es_es: Establecer la alineación horizontal a uno de

source: Set the line spacing as a multiple of the font size.
es_es: Establecer el interlineado como un múltiplo del tamaño de la fuente.

source: The default line spacing is 1.2.
es_es: El interlineado por defecto es 1,2.

source: **spacing**
es_es: **Interlineado**

source: Alias for `set_multialignment`.
es_es: Alias para `set_multialignment`.

source: Set the font family for math text rendered by Matplotlib.
es_es: Establecer la familia de fuentes para el texto matemático renderizado por Matplotlib.

source: This does only affect Matplotlib's own math renderer. It has no effect when rendering with TeX (``usetex=True``).
es_es: Esto sólo afecta al propio renderizador matemático de Matplotlib. No tiene efecto cuando se renderiza con TeX (``usetex=True``).

source: The name of the font family.
es_es: El nombre de la familia de fuentes.

source: Available font families are defined in the :ref:`matplotlibrc.template file <customizing-with-matplotlibrc-files>`.
es_es: Las familias de fuentes disponibles se definen en el archivo :ref:`matplotlibrc.template <customizing-with-matplotlibrc-files>`.

source: Set the text alignment for multiline texts.
es_es: Establecer la alineación del texto para los textos multilínea.

source: The layout of the bounding box of all the lines is determined by the horizontalalignment and verticalalignment properties. This property controls the alignment of the text lines within that box.
es_es: La disposición de la caja delimitadora de todas las líneas viene determinada por las propiedades horizontalalignment y verticalalignment. Esta propiedad controla la alineación de las líneas de texto dentro de esa caja.

source: Alias for `set_fontname`.
es_es: Alias para `set_fontname`.

source: Override switch to disable any mathtext parsing for this `Text`.
es_es: Anular el interruptor para desactivar cualquier análisis de texto matemático para este `Text`.

source: If False, this `Text` will never use mathtext. If True, mathtext will be used if there is an even number of unescaped dollar signs.
es_es: Si es False, este `Text` nunca utilizará mathtext. Si es True, se utilizará mathtext si hay un número par de signos de dólar sin esconder.

source: Set the (*x*, *y*) position of the text.
es_es: Establece la posición (*x*, *y*) del texto.

source: Set the rotation of the text.
es_es: Establecer la rotación del texto.

source: The rotation angle in degrees in mathematically positive direction (counterclockwise). 'horizontal' equals 0, 'vertical' equals 90.
es_es: El ángulo de rotación en grados en dirección matemáticamente positiva (en sentido contrario a las agujas del reloj). 'horizontal' es igual a 0, 'vertical' es igual a 90.

source: Set text rotation mode.
es_es: Establecer el modo de rotación del texto.

source: If ``None`` or ``"default"``, the text will be first rotated, then aligned according to their horizontal and vertical alignments. If ``"anchor"``, then alignment occurs before rotation.
es_es: Si ``None`` o ``"default"``, el texto será primero rotado, y luego alineado según sus alineaciones horizontales y verticales. Si ``"anchor"``, entonces la alineación se produce antes de la rotación.

source: Alias for `set_fontsize`.
es_es: Alias para `set_fontsize`.

source: Alias for `set_fontstretch`.
es_es: Alias para `set_fontstretch`.

source: Alias for `set_fontstyle`.
es_es: Alias para `set_fontstyle`.

source: Set the text string *s*.
es_es: Establecer la cadena de texto *s*.

source: It may contain newlines (``\n``) or math in LaTeX syntax.
es_es: Puede contener nuevas líneas (``\n``) o matemáticas en sintaxis LaTeX.

source: Any object gets converted to its `str` representation, except for ``None`` which is converted to an empty string.
es_es: Cualquier objeto se convierte a su representación `str`, excepto ``None`` que se convierte a una cadena vacía.

source: Whether rotations of the transform affect the text direction.
es_es: Si las rotaciones de la transformación afectan a la dirección del texto.

source: Whether to render using TeX, ``None`` means to use :rc:`text.usetex`.
es_es: Si se va a renderizar usando TeX, ``None`` significa usar :rc:`text.usetex`.

source: Alias for `set_verticalalignment`.
es_es: Alias para `set_verticalalignment`.

source: Alias for `set_fontvariant`.
es_es: Alias para `set_fontvariant`.

source: Set the vertical alignment.
es_es: Establecer la alineación vertical.

source: Alias for `set_fontweight`.
es_es: Alias para `set_fontweight`.

source: Set whether the text can be wrapped.
es_es: Establecer si el texto puede ser envuelto.

source: Wrapping does not work together with ``savefig(..., bbox_inches='tight')`` (which is also used internally by ``%matplotlib inline`` in IPython/Jupyter). The 'tight' setting rescales the canvas to accommodate all content and happens before wrapping.
es_es: El envoltorio no funciona junto con ``savefig(..., bbox_inches='tight')`` (que también es utilizado internamente por ``%matplotlib inline`` en IPython/Jupyter). El ajuste 'tight' reescala el lienzo para acomodar todo el contenido y ocurre antes de envolver.

source: Set the *x* position of the text.
es_es: Establecer la posición *x* del texto.

source: Set the *y* position of the text.
es_es: Establecer la posición *y* del texto.

source: Update this artist's properties from the dict *props*.
es_es: Actualizar las propiedades de este artista desde el dict *props*.

source: Update the location and the size of the bbox.
es_es: Actualiza la ubicación y el tamaño del bbox.

source: This method should be used when the position and size of the bbox needs to be updated before actually drawing the bbox.
es_es: Este método debe utilizarse cuando la posición y el tamaño del bbox deben actualizarse antes de dibujar el bbox.

source: Copy properties from *other* to *self*.
es_es: Copiar propiedades de *otro* a *self*.

source: Return *rotation* normalized to an angle between 0 and 360 degrees.
es_es: Devuelve la *rotación* normalizada a un ángulo entre 0 y 360 grados.

source: float or {None, 'horizontal', 'vertical'}
es_es: float o {None, 'horizontal', 'vertical'}

source: Rotation angle in degrees. *None* and 'horizontal' equal 0, 'vertical' equals 90.
es_es: Ángulo de rotación en grados. *None* y 'horizontal' igual a 0, 'vertical' igual a 90.
