Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/ticker_api.po
Languages: es_es

source: Tick locating and formatting
es_es: Localización y formato de los marcadores

source: This module contains classes for configuring tick locating and formatting. Generic tick locators and formatters are provided, as well as domain specific custom ones.
es_es: Este módulo contiene clases para configurar la localización y el formato de los marcadores. Se proporcionan localizadores y formateadores de marcadores genéricos, así como los personalizados específicos del dominio.

source: Although the locators know nothing about major or minor ticks, they are used by the Axis class to support major and minor tick locating and formatting.
es_es: Aunque los localizadores no saben nada de los marcadores mayores o menores, son utilizados por la clase Axis para soportar la localización y el formato de los marcadores mayores y menores.

source: Tick locating
es_es: Localización de marcadores

source: The Locator class is the base class for all tick locators. The locators handle autoscaling of the view limits based on the data limits, and the choosing of tick locations. A useful semi-automatic tick locator is `MultipleLocator`. It is initialized with a base, e.g., 10, and it picks axis limits and ticks that are multiples of that base.
es_es: La clase Locator es la clase base para todos los localizadores de marcadores. Los localizadores manejan el autoescalado de los límites de la vista basado en los límites de los datos, y la elección de las ubicaciones de los marcadores. Un útil localizador de marcadores semiautomático es `MultipleLocator`. Se inicializa con una base, por ejemplo, 10, y selecciona los límites del eje y los marcadores que son múltiplos de esa base.

source: The Locator subclasses defined here are:
es_es: Las subclases de localizadores definidas aquí son:

source: `MaxNLocator` with simple defaults. This is the default tick locator for most plotting.
es_es: `MaxNLocator` con valores predeterminados simples. Este es el localizador de marcadores por defecto para la mayoría de los trazados.

source: Finds up to a max number of intervals with ticks at nice locations.
es_es: Encuentra hasta un número máximo de intervalos con marcadores en buenas ubicaciones.

source: Space ticks evenly from min to max.
es_es: Espaciar los marcadores uniformemente desde el mínimo hasta el máximo.

source: Space ticks logarithmically from min to max.
es_es: Espaciar los marcadores logarítmicamente desde el mínimo al máximo.

source: Ticks and range are a multiple of base; either integer or float.
es_es: Los marcadores y el rango son un múltiplo de la base; ya sea entero o flotante.

source: Tick locations are fixed.
es_es: Las ubicaciones de los marcadores están arregladas.

source: Locator for index plots (e.g., where ``x = range(len(y))``).
es_es: Localizador para gráficos de índice (por ejemplo, donde ``x = range(len(y))``).

source: No ticks.
es_es: No hay marcadores.

source: Locator for use with with the symlog norm; works like `LogLocator` for the part outside of the threshold and adds 0 if inside the limits.
es_es: Localizador para usar con la norma symlog; funciona como `LogLocator` para la parte fuera del umbral y añade 0 si está dentro de los límites.

source: Locator for logit scaling.
es_es: Localizador para el escalado logit.

source: Locator for minor ticks when the axis is linear and the major ticks are uniformly spaced. Subdivides the major tick interval into a specified number of minor intervals, defaulting to 4 or 5 depending on the major interval.
es_es: Localizador para los marcadores menores cuando el eje es lineal y los marcadores mayores están uniformemente espaciados. Subdivide el intervalo de ticks mayores en un número especificado de intervalos menores, por defecto 4 o 5 dependiendo del intervalo mayor.

source: There are a number of locators specialized for date locations - see the :mod:`.dates` module.
es_es: Hay una serie de localizadores especializados en ubicaciones de fechas - véase el módulo :mod:`.dates`.

source: You can define your own locator by deriving from Locator. You must override the ``__call__`` method, which returns a sequence of locations, and you will probably want to override the autoscale method to set the view limits from the data limits.
es_es: Puedes definir tu propio localizador derivando de Locator. Debes anular el método ``__call__``, que devuelve una secuencia de localizaciones, y probablemente querrás anular el método autoscale para establecer los límites de la vista a partir de los límites de los datos.

source: If you want to override the default locator, use one of the above or a custom locator and pass it to the x or y axis instance. The relevant methods are::
es_es: Si quieres anular el localizador por defecto, utiliza uno de los anteriores o un localizador personalizado y pásalo a la instancia del eje x o y. Los métodos relevantes son::

source: The default minor locator is `NullLocator`, i.e., no minor ticks on by default.
es_es: El localizador menor por defecto es `NullLocator`, es decir, no hay marcadores menores por defecto.

source: `Locator` instances should not be used with more than one `~matplotlib.axis.Axis` or `~matplotlib.axes.Axes`. So instead of::
es_es: Las instancias de `Locator` no deben utilizarse con más de un `~matplotlib.axis.Axis` o `~matplotlib.axes.Axes`. Así que en lugar de::

source: do the following instead::
es_es: haz lo siguiente en su lugar::

source: Tick formatting
es_es: Formato de los marcadores

source: Tick formatting is controlled by classes derived from Formatter. The formatter operates on a single tick value and returns a string to the axis.
es_es: El formato de los marcadores se controla mediante clases derivadas de Formatter. El formateador opera sobre un único valor de marcador y devuelve una cadena al eje.

source: No labels on the ticks.
es_es: No hay etiquetas en los marcadores.

source: Set the strings manually for the labels.
es_es: Establecer las cadenas manualmente para las etiquetas.

source: User defined function sets the labels.
es_es: La función definida por el usuario establece las etiquetas.

source: Use string `format` method.
es_es: Utiliza el método de cadena `format`.

source: Use an old-style sprintf format string.
es_es: Utilizar una cadena de formato sprintf de estilo antiguo.

source: Default formatter for scalars: autopick the format string.
es_es: Formateador por defecto para escalares: autoescoge la cadena de formato.

source: Formatter for log axes.
es_es: Formateador para los ejes de registro.

source: Format values for log axis using ``exponent = log_base(value)``.
es_es: Formatea los valores para el eje log usando ``exponente = log_base(valor)``.

source: Format values for log axis using ``exponent = log_base(value)`` using Math text.
es_es: Formatear los valores para el eje logarítmico usando ``exponente = log_base(valor)`` usando Math text.

source: Format values for log axis using scientific notation.
es_es: Formatear los valores para el eje logarítmico utilizando la notación científica.

source: Probability formatter.
es_es: Formateador de probabilidad.

source: Format labels in engineering notation.
es_es: Formatear las etiquetas en notación de ingeniería.

source: Format labels as a percentage.
es_es: Formatear las etiquetas como un porcentaje.

source: You can derive your own formatter from the Formatter base class by simply overriding the ``__call__`` method. The formatter class has access to the axis view and data limits.
es_es: Puedes derivar tu propio formateador de la clase base Formatter simplemente anulando el método ``__call__``. La clase formatter tiene acceso a la vista de los ejes y a los límites de los datos.

source: To control the major and minor tick label formats, use one of the following methods::
es_es: Para controlar los formatos de las etiquetas de los marcadores mayores y menores, utilice uno de los siguientes métodos::

source: In addition to a `.Formatter` instance, `~.Axis.set_major_formatter` and `~.Axis.set_minor_formatter` also accept a ``str`` or function. ``str`` input will be internally replaced with an autogenerated `.StrMethodFormatter` with the input ``str``. For function input, a `.FuncFormatter` with the input function will be generated and used.
es_es: Además de una instancia `.Formatter`, `~.Axis.set_major_formatter` y `~.Axis.set_minor_formatter` también aceptan una ``str`` o función. La entrada ``str`` será reemplazada internamente por un `.StrMethodFormatter` autogenerado con la entrada ``str``. Para la entrada de funciones, se generará y utilizará un `.FuncFormatter` con la función de entrada.

source: See :doc:`/gallery/ticks/major_minor_demo` for an example of setting major and minor ticks. See the :mod:`matplotlib.dates` module for more information and examples of using date locators and formatters.
es_es: Ver :doc:`/gallery/ticks/major_minor_demo` para un ejemplo de configuración de marcadores mayores y menores. Consulta el módulo :mod:`matplotlib.dates` para obtener más información y ejemplos de uso de localizadores y formateadores de fechas.

source: Dynamically find major tick positions. This is actually a subclass of `~matplotlib.ticker.MaxNLocator`, with parameters *nbins = 'auto'* and *steps = [1, 2, 2.5, 5, 10]*.
es_es: Encuentra dinámicamente las principales posiciones de los marcadores. En realidad es una subclase de `~matplotlib.ticker.MaxNLocator`, con los parámetros *nbins = 'auto'* y *steps = [1, 2, 2.5, 5, 10]*.

source: To know the values of the non-public parameters, please have a look to the defaults of `~matplotlib.ticker.MaxNLocator`.
es_es: Para conocer los valores de los parámetros no públicos, por favor, echa un vistazo a los valores por defecto de `~matplotlib.ticker.MaxNLocator`.

source: Dynamically find minor tick positions based on the positions of major ticks. The scale must be linear with major ticks evenly spaced.
es_es: Encuentra dinámicamente las posiciones de los marcadores menores basándose en las posiciones de los marcadores mayores. La escala debe ser lineal con los marcadores mayores espaciados uniformemente.

source: *n* is the number of subdivisions of the interval between major ticks; e.g., n=2 will place a single minor tick midway between major ticks.
es_es: *n* es el número de subdivisiones del intervalo entre los marcadores mayores; por ejemplo, n=2 colocará un único marcador menor a medio camino entre los marcadores mayores.

source: If *n* is omitted or None, it will be set to 5 or 4.
es_es: Si *n* se omite o es None, se establecerá en 5 o 4.

source: Return the values of the located ticks given **vmin** and **vmax**.
es_es: Devuelve los valores de los marcadores localizados dados **vmin** y **vmax**.

source: To get tick locations with the vmin and vmax values defined automatically for the associated :attr:`axis` simply call the Locator instance::
es_es: Para obtener las ubicaciones de los marcadores con los valores vmin y vmax definidos automáticamente para el :attr:`eje` asociado, simplemente llame a la instancia Locator::

source: Format axis values using engineering prefixes to represent powers of 1000, plus a specified unit, e.g., 10 MHz instead of 1e7.
es_es: Formatea los valores del eje utilizando prefijos de ingeniería para representar potencias de 1000, más una unidad especificada, por ejemplo, 10 MHz en lugar de 1e7.

source: Parameters
es_es: Parámetros

source: Unit symbol to use, suitable for use with single-letter representations of powers of 1000. For example, 'Hz' or 'm'.
es_es: Símbolo de la unidad a utilizar, adecuado para usar con representaciones de una sola letra de potencias de 1000. Por ejemplo, 'Hz' o 'm'.

source: Precision with which to display the number, specified in digits after the decimal point (there will be between one and three digits before the decimal point). If it is None, the formatting falls back to the floating point format '%g', which displays up to 6 *significant* digits, i.e. the equivalent value for *places* varies between 0 and 5 (inclusive).
es_es: Precisión con la que se muestra el número, especificada en dígitos después del punto decimal (habrá entre uno y tres dígitos antes del punto decimal). Si es None, el formato vuelve al formato de punto flotante '%g', que muestra hasta 6 dígitos *significativos*, es decir, el valor equivalente para *lugares* varía entre 0 y 5 (inclusive).

source: Separator used between the value and the prefix/unit. For example, one get '3.14 mV' if ``sep`` is " " (default) and '3.14mV' if ``sep`` is "". Besides the default behavior, some other useful options may be:
es_es: Separador utilizado entre el valor y el prefijo/unidad. Por ejemplo, se obtiene '3.14 mV' si ``sep`` es " " (por defecto) y '3.14mV' si ``sep`` es "". Además del comportamiento por defecto, algunas otras opciones útiles pueden ser:

source: ``sep=""`` to append directly the prefix/unit to the value;
es_es: ``sep=""`` para añadir directamente el prefijo/unidad al valor;

source: **usetex** : bool, default: :rc:`text.usetex`
es_es: **usetex** : bool, por defecto: :rc:`text.usetex`

source: To enable/disable the use of TeX's math mode for rendering the numbers in the formatter.
es_es: Para activar/desactivar el uso del modo matemático de TeX para renderizar los números en el formateador.

source: **useMathText** : bool, default: :rc:`axes.formatter.use_mathtext`
es_es: **useMathText** : bool, por defecto: :rc:`axes.formatter.use_mathtext`

source: To enable/disable the use mathtext for rendering the numbers in the formatter.
es_es: Para activar/desactivar el uso de mathtext para renderizar los números en el formateador.

source: Format a number in engineering notation, appending a letter representing the power of 1000 of the original number. Some examples:
es_es: Formatea un número en notación de ingeniería, añadiendo una letra que representa la potencia de 1000 del número original. Algunos ejemplos:

source: Return fixed strings for tick labels based only on position, not value.
es_es: Devuelve cadenas fijas para las etiquetas de los marcadores basadas sólo en la posición, no en el valor.

source: `.FixedFormatter` should only be used together with `.FixedLocator`. Otherwise, the labels may end up in unexpected positions.
es_es: `.FixedFormatter` sólo debe utilizarse junto con `.FixedLocator`. De lo contrario, las etiquetas pueden terminar en posiciones inesperadas.

source: Set the sequence *seq* of strings that will be used for labels.
es_es: Establecer la secuencia *seq* de cadenas que se utilizarán para las etiquetas.

source: Tick locations are fixed. If nbins is not None, the array of possible positions will be subsampled to keep the number of ticks <= nbins +1. The subsampling will be done so as to include the smallest absolute value; for example, if zero is included in the array of possibilities, then it is guaranteed to be one of the chosen ticks.
es_es: Se arreglan las ubicaciones de los marcadores. Si nbins no es None, el arreglo de posibles posiciones será submuestreado para mantener el número de marcadores <= nbins +1. El submuestreo se hará de forma que se incluya el valor absoluto más pequeño; por ejemplo, si se incluye el cero en el arreglo de posibilidades, se garantiza que sea uno de los marcadores elegidos.

source: Set parameters within this locator.
es_es: Establece los parámetros dentro de este localizador.

source: Return the locations of the ticks.
es_es: Devuelve las ubicaciones de los marcadores.

source: Because the values are fixed, vmin and vmax are not used in this method.
es_es: Como los valores están arreglados, vmin y vmax no se usan en este método.

source: Use an old-style ('%' operator) format string to format the tick.
es_es: Utiliza una cadena de formato de estilo antiguo (operador '%') para formatear el marcador.

source: The format string should have a single variable format (%) in it. It will be applied to the value (not the position) of the tick.
es_es: La cadena de formato debe tener una sola variable de formato (%) en ella. Se aplicará al valor (no a la posición) del marcador.

source: Negative numeric values will use a dash not a unicode minus, use mathtext to get a unicode minus by wrappping the format specifier with $ (e.g. "$%g$").
es_es: Los valores numéricos negativos utilizarán un guión y no un signo de menos unicode, utilice mathtext para obtener un signo de menos unicode envolviendo el especificador de formato con $ (por ejemplo, "$%g$").

source: Create a string based on a tick value and location.
es_es: Crea una cadena basada en un valor de marcador y una ubicación.

source: Some classes may want to replace a hyphen for minus with the proper unicode symbol (U+2212) for typographical correctness. This is a helper method to perform such a replacement when it is enabled via :rc:`axes.unicode_minus`.
es_es: Algunas clases pueden querer reemplazar un guión por menos con el símbolo unicode apropiado (U+2212) para la corrección tipográfica. Este es un método de ayuda para realizar dicho reemplazo cuando se habilita a través de :rc:`axes.unicode_minus`.

source: Return the full string representation of the value with the position unspecified.
es_es: Devuelve la representación de cadena completa del valor con la posición sin especificar.

source: Return a short string version of the tick value.
es_es: Devuelve una versión de cadena corta del valor del marcador.

source: Defaults to the position-independent long value.
es_es: Por defecto, el valor largo independiente de la posición.

source: Return the tick labels for all the ticks at once.
es_es: Devuelve las etiquetas de los marcadores de todos los ticks a la vez.

source: Set the locations of the ticks.
es_es: Establecer las ubicaciones de los marcadores.

source: This method is called before computing the tick labels because some formatters need to know all tick locations to do so.
es_es: Este método se llama antes de calcular las etiquetas de los marcadores porque algunos formateadores necesitan conocer todas las ubicaciones de los marcadores para hacerlo.

source: Use a user-defined function for formatting.
es_es: Utilizar una función definida por el usuario para el formateo.

source: The function should take in two inputs (a tick value ``x`` and a position ``pos``), and return a string containing the corresponding tick label.
es_es: La función debe tomar dos entradas (un valor de marcador ``x`` y una posición ``pos``), y devolver una cadena que contenga la etiqueta de marcador correspondiente.

source: Place a tick on every multiple of some base number of points plotted, e.g., on every 5th point. It is assumed that you are doing index plotting; i.e., the axis is 0, len(data). This is mainly useful for x ticks.
es_es: Coloca un marcador en cada múltiplo de algún número base de puntos trazados, por ejemplo, en cada quinto punto. Se asume que está haciendo un trazado de índice; es decir, el eje es 0, len(data). Esto es útil principalmente para los marcadores de x.

source: Place ticks every *base* data point, starting at *offset*.
es_es: Coloca los marcadores cada punto de datos *básico*, comenzando en el *desplazamiento*.

source: Set parameters within this locator
es_es: Establece los parámetros dentro de este localizador

source: Determine the tick locations
es_es: Determinar las ubicaciones de los marcadores

source: The first time this function is called it will try to set the number of ticks to make a nice tick partitioning. Thereafter the number of ticks will be fixed so that interactive navigation will be nice
es_es: La primera vez que se llame a esta función se intentará establecer el número de marcadores para hacer una buena partición de los mismos. A partir de entonces se arreglará el número de marcadores para que la navegación interactiva sea agradable

source: Use presets to set locs based on lom. A dict mapping vmin, vmax->locs
es_es: Utiliza preajustes para establecer locs basados en lom. Un mapeo dict vmin, vmax->locs

source: Try to choose the view limits intelligently.
es_es: Intenta elegir los límites de la vista de forma inteligente.

source: Determine the tick locations;
es_es: Determinar las ubicaciones de los marcadores;

source: Note that the same locator should not be used across multiple `~matplotlib.axis.Axis` because the locator stores references to the Axis data and view limits.
es_es: Ten en cuenta que el mismo localizador no debe ser utilizado a través de múltiples `~matplotlib.axis.Axis` porque el localizador almacena referencias a los datos del Eje y los límites de la vista.

source: Adjust a range as needed to avoid singularities.
es_es: Ajustar un rango según sea necesario para evitar singularidades.

source: This method gets called during autoscaling, with ``(v0, v1)`` set to the data limits on the axes if the axes contains any data, or ``(-inf, +inf)`` if not.
es_es: Este método se llama durante el autoescalado, con ``(v0, v1)`` establecido a los límites de los datos en los ejes si los ejes contienen algún dato, o ``(-inf, +inf)`` si no.

source: If ``v0 == v1`` (possibly up to some floating point slop), this method returns an expanded interval around this value.
es_es: Si ``v0 == v1`` (posiblemente hasta cierto desnivel de punto flotante), este método devuelve un intervalo expandido alrededor de este valor.

source: If ``(v0, v1) == (-inf, +inf)``, this method returns appropriate default view limits.
es_es: Si ``(v0, v1) == (-inf, +inf)``, este método devuelve los límites de vista por defecto adecuados.

source: Otherwise, ``(v0, v1)`` is returned without modification.
es_es: En caso contrario, se devuelve ``(v0, v1)`` sin modificar.

source: Log at WARNING level if *locs* is longer than `Locator.MAXTICKS`.
es_es: Log en nivel WARNING si *locs* es más largo que `Locator.MAXTICKS`.

source: This is intended to be called immediately before returning *locs* from ``__call__`` to inform users in case their Locator returns a huge number of ticks, causing Matplotlib to run out of memory.
es_es: Esto está pensado para ser llamado inmediatamente antes de devolver *locs* de ``call__`` para informar a los usuarios en caso de que su Locator devuelva un gran número de marcadores, haciendo que Matplotlib se quede sin memoria.

source: The "strange" name of this method dates back to when it would raise an exception instead of emitting a log.
es_es: El "extraño" nombre de este método se remonta a cuando lanzaba una excepción en lugar de emitir un registro.

source: Do nothing, and raise a warning. Any locator class not supporting the set_params() function will call this.
es_es: No hacer nada, y levantar una advertencia. Cualquier clase de localizador que no soporte la función set_params() llamará a esto.

source: Select a scale for the range from vmin to vmax.
es_es: Selecciona una escala para el rango de vmin a vmax.

source: Subclasses should override this method to change locator behaviour.
es_es: Las subclases deben anular este método para cambiar el comportamiento del localizador.

source: Base class for formatting ticks on a log or symlog scale.
es_es: Clase base para formatear los marcadores en una escala log o symlog.

source: It may be instantiated directly, or subclassed.
es_es: Puede ser instanciado directamente, o subclasificado.

source: float, default: 10.
es_es: float, por defecto: 10.

source: Base of the logarithm used in all calculations.
es_es: Base del logaritmo utilizado en todos los cálculos.

source: bool, default: False
es_es: bool, por defecto: False

source: If True, label ticks only at integer powers of base. This is normally True for major ticks and False for minor ticks.
es_es: Si es True, etiqueta los marcadores sólo en potencias enteras de la base. Normalmente es True para los marcadores mayores y False para los menores.

source: (subset, all), default: (1, 0.4)
es_es: (subset, all), por defecto: (1, 0.4)
