Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/ticker_api.po
Languages: es_es

source: If labelOnlyBase is False, these two numbers control the labeling of ticks that are not at integer powers of base; normally these are the minor ticks. The controlling parameter is the log of the axis data range. In the typical case where base is 10 it is the number of decades spanned by the axis, so we can call it 'numdec'. If ``numdec <= all``, all minor ticks will be labeled. If ``all < numdec <= subset``, then only a subset of minor ticks will be labeled, so as to avoid crowding. If ``numdec > subset`` then no minor ticks will be labeled.
es_es: Si labelOnlyBase es False, estos dos números controlan el etiquetado de los marcadores que no están a potencias enteras de la base; normalmente son los marcadores menores. El parámetro de control es el logaritmo del rango de datos del eje. En el caso típico en el que la base es 10, es el número de décadas que abarca el eje, por lo que podemos llamarlo ``numdec''. Si ``numdec <= all``, se etiquetarán todos los marcadores menores. Si ``todos < numdec <= subconjunto``, sólo se etiquetará un subconjunto de los marcadores menores, para evitar la aglomeración. Si ``numdec > subset``, entonces no se etiquetará ningún marcador menor.

source: None or float, default: None
es_es: Ninguno o float, por defecto: None

source: If a symmetric log scale is in use, its ``linthresh`` parameter must be supplied here.
es_es: Si se utiliza una escala logarítmica simétrica, su parámetro ``linthresh`` debe ser suministrado aquí.

source: Notes
es_es: Notas

source: The `set_locs` method must be called to enable the subsetting logic controlled by the ``minor_thresholds`` parameter.
es_es: El método `set_locs` debe ser llamado para habilitar la lógica de subconjunto controlada por el parámetro ``minor_thresholds``.

source: In some cases such as the colorbar, there is no distinction between major and minor ticks; the tick locations might be set manually, or by a locator that puts ticks at integer powers of base and at intermediate locations. For this situation, disable the minor_thresholds logic by using ``minor_thresholds=(np.inf, np.inf)``, so that all ticks will be labeled.
es_es: En algunos casos, como la barra de colores, no hay distinción entre los marcadores mayores y menores; las ubicaciones de los marcadores podrían establecerse manualmente, o mediante un localizador que pone los marcadores en potencias enteras de la base y en ubicaciones intermedias. Para esta situación, desactive la lógica de minor_thresholds usando ``minor_thresholds=(np.inf, np.inf)``, para que todos los marcadores sean etiquetados.

source: To disable labeling of minor ticks when 'labelOnlyBase' is False, use ``minor_thresholds=(0, 0)``. This is the default for the "classic" style.
es_es: Para desactivar el etiquetado de los marcadores menores cuando 'labelOnlyBase' es False, utilice ``minor_thresholds=(0, 0)``. Este es el valor por defecto para el estilo "clásico".

source: Examples
es_es: Ejemplos

source: To label a subset of minor ticks when the view limits span up to 2 decades, and all of the ticks when zoomed in to 0.5 decades or less, use ``minor_thresholds=(2, 0.5)``.
es_es: Para etiquetar un subconjunto de marcadores menores cuando los límites de la vista abarcan hasta 2 décadas, y todos los marcadores cuando se amplía a 0,5 décadas o menos, utilice ``minor_thresholds=(2, 0,5)``.

source: To label all minor ticks when the view limits span up to 1.5 decades, use ``minor_thresholds=(1.5, 1.5)``.
es_es: Para etiquetar todos los marcadores menores cuando los límites de la vista abarcan hasta 1,5 décadas, utilice ``minor_thresholds=(1,5, 1,5)``.

source: Change the *base* for labeling.
es_es: Cambiar la *base* para el etiquetado.

source: Should always match the base used for :class:`LogLocator`
es_es: Debería coincidir siempre con la base utilizada para :class:`LogLocator`

source: Switch minor tick labeling on or off.
es_es: Activar o desactivar el etiquetado de los marcadores menores.

source: If True, label ticks only at integer powers of base.
es_es: Si es True, la etiqueta marca sólo en potencias enteras de la base.

source: Use axis view limits to control which ticks are labeled.
es_es: Utilizar los límites de la vista del eje para controlar qué marcadores se etiquetan.

source: The *locs* parameter is ignored in the present algorithm.
es_es: El parámetro *locs* se ignora en el presente algoritmo.

source: Format values following scientific notation in a logarithmic axis.
es_es: Formatea los valores siguiendo la notación científica en un eje logarítmico.

source: Determine the tick locations for log axes
es_es: Determinar las ubicaciones de los marcadores para los ejes de registro

source: Place ticks on the locations : subs[j] * base**i
es_es: Colocar los marcadores en las ubicaciones : subs[j] * base**i

source: The base of the log used, so ticks are placed at ``base**n``.
es_es: La base del registro utilizado, por lo que los marcadores se colocan en ``base**n``.

source: None or str or sequence of float, default: (1.0,)
es_es: Ninguno o str o secuencia de float, por defecto: (1.0,)

source: Gives the multiples of integer powers of the base at which to place ticks. The default places ticks only at integer powers of the base. The permitted string values are ``'auto'`` and ``'all'``, both of which use an algorithm based on the axis view limits to determine whether and how to put ticks between integer powers of the base. With ``'auto'``, ticks are placed only between integer powers; with ``'all'``, the integer powers are included. A value of None is equivalent to ``'auto'``.
es_es: Da los múltiplos de potencias enteras de la base en los que colocar los marcadores. El valor por defecto coloca los marcadores sólo en potencias enteras de la base. Los valores de cadena permitidos son ``'auto'`` y ``'all'``, los cuales utilizan un algoritmo basado en los límites de la vista del eje para determinar si se colocan los marcadores entre potencias enteras de la base y cómo hacerlo. Con ``'auto'``, los marcadores se colocan sólo entre potencias enteras; con ``'all'``, se incluyen las potencias enteras. Un valor de None es equivalente a ``'auto'``.

source: None or int, default: None
es_es: None o int, por defecto: None

source: The maximum number of ticks to allow on a given axis. The default of ``None`` will try to choose intelligently as long as this Locator has already been assigned to an axis using `~.axis.Axis.get_tick_space`, but otherwise falls back to 9.
es_es: El número máximo de marcadores a permitir en un eje dado. El valor por defecto de ``None`` intentará elegir de forma inteligente siempre y cuando este localizador ya haya sido asignado a un eje utilizando `~.axis.Axis.get_tick_space`, pero en caso contrario vuelve a 9.

source: Set the log base (major tick every ``base**i``, i integer).
es_es: Establecer la base del registro (mayor marcador cada ``base**i``, i entero).

source: Set the minor ticks for the log scaling every ``base**i*subs[j]``.
es_es: Establecer los marcadores menores para el escalado del registro cada ``base**i*subs[j]``.

source: Probability formatter (using Math text).
es_es: Formateador de probabilidades (usando texto de Math).

source: If x > 1/2, with x = 1-v, indicate if x should be displayed as $\overline{v}$. The default is to display $1-v$.
es_es: Si x > 1/2, con x = 1-v, indica si x debe mostrarse como $\overline{v}$. El valor por defecto es mostrar $1-v$.

source: **one_half** : str, default: r"\frac{1}{2}"
es_es: **one_half** : str, por defecto: r"\frac{1}{2}"

source: str, default: r"\frac{1}{2}"
es_es: str, por defecto: r"\frac{1}{2}"

source: The string used to represent 1/2.
es_es: La cadena utilizada para representar 1/2.

source: Indicate if the formatter is formatting minor ticks or not. Basically minor ticks are not labelled, except when only few ticks are provided, ticks with most space with neighbor ticks are labelled. See other parameters to change the default behavior.
es_es: Indica si el formateador está formateando los marcadores menores o no. Básicamente los marcadores menores no se etiquetan, excepto cuando se proporcionan pocos marcadores, se etiquetan los marcadores con más espacio con los marcadores vecinos. Vea otros parámetros para cambiar el comportamiento por defecto.

source: Maximum number of locs for labelling some minor ticks. This parameter have no effect if minor is False.
es_es: Número máximo de locs para etiquetar algunos marcadores menores. Este parámetro no tiene efecto si minor es False.

source: int, default: 6
es_es: int, por defecto: 6

source: Number of ticks which are labelled when the number of ticks is below the threshold.
es_es: Número de marcadores que se etiquetan cuando el número de marcadores está por debajo del umbral.

source: Set the number of minor ticks to label when some minor ticks are labelled.
es_es: Establece el número de marcadores menores a etiquetar cuando se etiquetan algunos marcadores menores.

source: Set the threshold for labelling minors ticks.
es_es: Establecer el umbral para etiquetar los marcadores menores.

source: Maximum number of locations for labelling some minor ticks. This parameter have no effect if minor is False.
es_es: Número máximo de ubicaciones para etiquetar algunos marcadores menores. Este parámetro no tiene efecto si minor es False.

source: Set the way one half is displayed.
es_es: Establecer la forma en que se muestra una mitad.

source: Switch display mode with overline for labelling p>1/2.
es_es: Cambiar el modo de visualización con sobrelínea para el etiquetado p>1/2.

source: Determine the tick locations for logit axes
es_es: Determinar las ubicaciones de los marcadores para los ejes logit

source: Place ticks on the logit locations
es_es: Coloca los marcadores en las ubicaciones de logit

source: int or 'auto', optional
es_es: int o 'auto', opcional

source: Number of ticks. Only used if minor is False.
es_es: Número de marcadores. Sólo se utiliza si minor es False.

source: Indicate if this locator is for minor ticks or not.
es_es: Indicar si este localizador es para los marcadores menores o no.

source: Find nice tick locations with no more than N being within the view limits. Locations beyond the limits are added to support autoscaling.
es_es: Encuentra buenas ubicaciones de los marcadores con no más de N estando dentro de los límites de la vista. Las ubicaciones más allá de los límites se añaden para soportar el autoescalado.

source: int or 'auto', default: 10
es_es: int o 'auto', por defecto: 10

source: Maximum number of intervals; one less than max number of ticks. If the string 'auto', the number of bins will be automatically determined based on the length of the axis.
es_es: Número máximo de intervalos; uno menos que el número máximo de marcadores. Si la cadena 'auto', el número de intervalos se determinará automáticamente en función de la longitud del eje.

source: **steps**
es_es: **Pasos**

source: array-like, optional
es_es: tipo arreglo, opcional

source: Sequence of nice numbers starting with 1 and ending with 10; e.g., [1, 2, 4, 5, 10], where the values are acceptable tick multiples. i.e. for the example, 20, 40, 60 would be an acceptable set of ticks, as would 0.4, 0.6, 0.8, because they are multiples of 2. However, 30, 60, 90 would not be allowed because 3 does not appear in the list of steps.
es_es: Secuencia de números agradables que comienzan con 1 y terminan con 10; por ejemplo, [1, 2, 4, 5, 10], donde los valores son múltiplos aceptables de los marcadores. Es decir, para el ejemplo, 20, 40, 60 serían un conjunto aceptable de marcadores, al igual que 0,4, 0,6, 0,8, porque son múltiplos de 2. Sin embargo, 30, 60, 90 no estarían permitidos porque 3 no aparece en la lista de pasos.

source: If True, ticks will take only integer values, provided at least *min_n_ticks* integers are found within the view limits.
es_es: Si es True, los marcadores sólo tomarán valores enteros, siempre que se encuentren al menos *min_n_ticks* enteros dentro de los límites de la vista.

source: If True, autoscaling will result in a range symmetric about zero.
es_es: Si es True, el autoescalado dará como resultado un rango simétrico respecto a cero.

source: {'lower', 'upper', 'both', None}, default: None
es_es: {'lower', 'upper', 'both', None}, por defecto: None

source: Remove edge ticks -- useful for stacked or ganged plots where the upper tick of one axes overlaps with the lower tick of the axes above it, primarily when :rc:`axes.autolimit_mode` is ``'round_numbers'``. If ``prune=='lower'``, the smallest tick will be removed. If ``prune == 'upper'``, the largest tick will be removed. If ``prune == 'both'``, the largest and smallest ticks will be removed. If *prune* is *None*, no ticks will be removed.
es_es: Elimina los marcadores de los bordes -- útil para los gráficos apilados o agrupados en los que el marcador superior de un eje se solapa con el marcador inferior de los ejes superiores, principalmente cuando :rc:`axes.autolimit_mode` es ``'round_numbers``. Si ``prune=='lower'``, se eliminará el marcador más pequeño. Si ``prune == 'upper'``, se eliminará el marcador más grande. Si ``prune == 'both'``, se eliminarán los marcadores más grandes y más pequeños. Si *prune* es *None*, no se eliminará ningún marcador.

source: Relax *nbins* and *integer* constraints if necessary to obtain this minimum number of ticks.
es_es: Relajar las restricciones *nbins* y *integer* si es necesario para obtener este número mínimo de marcadores.

source: Set parameters for this locator.
es_es: Establece los parámetros para este localizador.

source: see `.MaxNLocator`
es_es: ver `.MaxNLocator`

source: bool, optional
es_es: bool, opcional

source: {'lower', 'upper', 'both', None}, optional
es_es: {'lower', 'upper', 'both', None}, opcional

source: int, optional
es_es: int, opcional

source: Set a tick on each integer multiple of a base within the view interval.
es_es: Establece un marcador en cada múltiplo entero de una base dentro del intervalo de la vista.

source: Set the view limits to the nearest multiples of base that contain the data.
es_es: Establecer los límites de la vista a los múltiplos de base más cercanos que contienen los datos.

source: Always return the empty string.
es_es: Devuelve siempre la cadena vacía.

source: No ticks
es_es: No hay marcadores

source: Because the values are Null, vmin and vmax are not used in this method.
es_es: Como los valores son Nulos, vmin y vmax no se utilizan en este método.

source: Format numbers as a percentage.
es_es: Formatear los números como un porcentaje.

source: Determines how the number is converted into a percentage. *xmax* is the data value that corresponds to 100%. Percentages are computed as ``x / xmax * 100``. So if the data is already scaled to be percentages, *xmax* will be 100. Another common situation is where *xmax* is 1.0.
es_es: Determina cómo se convierte el número en un porcentaje. *xmax* es el valor de los datos que corresponde al 100%. Los porcentajes se calculan como ``x / xmax * 100``. Así que si los datos ya están escalados para ser porcentajes, *xmax* será 100. Otra situación común es cuando *xmax* es 1.0.

source: None or int
es_es: Ninguno o int

source: The number of decimal places to place after the point. If *None* (the default), the number will be computed automatically.
es_es: El número de decimales a colocar después del punto. Si *None* (el valor por defecto), el número se calculará automáticamente.

source: str or None
es_es: str o None

source: A string that will be appended to the label. It may be *None* or empty to indicate that no symbol should be used. LaTeX special characters are escaped in *symbol* whenever latex mode is enabled, unless *is_latex* is *True*.
es_es: Una cadena que se añadirá a la etiqueta. Puede ser *Ninguna* o estar vacía para indicar que no se debe utilizar ningún símbolo. Los caracteres especiales de LaTeX se escapan en *symbol* siempre que el modo látex esté activado, a menos que *is_latex* sea *True*.

source: If *False*, reserved LaTeX characters in *symbol* will be escaped.
es_es: Si *False*, los caracteres LaTeX reservados en *símbolo* serán escapados.

source: Format the number as a percentage number with the correct number of decimals and adds the percent symbol, if any.
es_es: Formatea el número como un número de porcentaje con el número correcto de decimales y añade el símbolo de porcentaje, si lo hay.

source: If ``self.decimals`` is `None`, the number of digits after the decimal point is set based on the *display_range* of the axis as follows:
es_es: Si ``self.decimals`` es `None`, el número de dígitos después del punto decimal se establece en base al *display_range* del eje como sigue:

source: decimals
es_es: decimales

source: sample
es_es: muestra

source: This method will not be very good for tiny axis ranges or extremely large ones. It assumes that the values on the chart are percentages displayed on a reasonable scale.
es_es: Este método no será muy bueno para rangos de ejes pequeños o extremadamente grandes. Asume que los valores del gráfico son porcentajes mostrados en una escala razonable.

source: The configured percent symbol as a string.
es_es: El símbolo de porcentaje configurado como una cadena.

source: If LaTeX is enabled via :rc:`text.usetex`, the special characters ``{'#', '$', '%', '&', '~', '_', '^', '\', '{', '}'}`` are automatically escaped in the string.
es_es: Si LaTeX está habilitado mediante :rc:`text.usetex`, los caracteres especiales ``'#', '$', '%', '&', '~', '_', '^', '\', '{', '}'}`` se escapan automáticamente en la cadena.

source: Format tick values as a number.
es_es: Formatear los valores de los marcadores como un número.

source: **useOffset** : bool or float, default: :rc:`axes.formatter.useoffset`
es_es: **useOffset** : bool o float, por defecto: :rc:`axes.formatter.useoffset`

source: bool or float, default:
es_es: bool o float, por defecto:

source: Whether to use offset notation. See `.set_useOffset`.
es_es: Si se utiliza la notación de desplazamiento. Ver `.set_useOffset`.

source: Whether to use fancy math formatting. See `.set_useMathText`.
es_es: Si se utiliza el formato matemático de lujo. Ver `.set_useMathText`.

source: **useLocale** : bool, default: :rc:`axes.formatter.use_locale`.
es_es: **useLocale** : bool, por defecto: :rc:`axes.formatter.use_locale`.

source: Whether to use locale settings for decimal sign and positive sign. See `.set_useLocale`.
es_es: Si se utiliza la configuración regional para el signo decimal y el signo positivo. Ver `.set_useLocale`.

source: In addition to the parameters above, the formatting of scientific vs. floating point representation can be configured via `.set_scientific` and `.set_powerlimits`).
es_es: Además de los parámetros anteriores, el formato de la representación científica frente a la de punto flotante puede configurarse mediante `.set_scientific` y `.set_powerlimits`).

source: **Offset notation and scientific notation**
es_es: **Notación de desplazamiento y notación científica**

source: Offset notation and scientific notation look quite similar at first sight. Both split some information from the formatted tick values and display it at the end of the axis.
es_es: La notación de desplazamiento y la notación científica parecen bastante similares a primera vista. Ambas dividen cierta información de los valores de los marcadores formateados y la muestran al final del eje.

source: The scientific notation splits up the order of magnitude, i.e. a multiplicative scaling factor, e.g. ``1e6``.
es_es: La notación científica divide el orden de magnitud, es decir, un factor de escala multiplicativo, por ejemplo ``1e6``.

source: The offset notation separates an additive constant, e.g. ``+1e6``. The offset notation label is always prefixed with a ``+`` or ``-`` sign and is thus distinguishable from the order of magnitude label.
es_es: La notación offset separa una constante aditiva, por ejemplo ``+1e6``. La etiqueta de notación de desplazamiento siempre va precedida de un signo ``+`` o ``-`` y, por tanto, se distingue de la etiqueta de orden de magnitud.

source: The following plot with x limits ``1_000_000`` to ``1_000_010`` illustrates the different formatting. Note the labels at the right edge of the x axis.
es_es: El siguiente gráfico con los límites de x ``1_000_000`` a ``1_000_010`` ilustra los diferentes formatos. Observe las etiquetas en el borde derecho del eje x.

source: (`Source code <../api/ticker_api-1.py>`__, `png <../api/ticker_api-1.png>`__, `pdf <../api/ticker_api-1.pdf>`__)
es_es: (`Código fuente <../api/ticker_api-1.py>`__, `png <../api/ticker_api-1.png>`__, `pdf <../api/ticker_api-1.pdf>`__)

source: Return scientific notation, plus offset.
es_es: Devuelve la notación científica, más el desplazamiento.

source: Return whether locale settings are used for formatting.
es_es: Devuelve si la configuración regional se utiliza para el formato.

source: Return whether to use fancy math formatting.
es_es: Devuelve si se utiliza el formato matemático de fantasía.

source: Return whether automatic mode for offset notation is active.
es_es: Devuelve si el modo automático para la notación de desplazamiento está activo.

source: This returns True if ``set_useOffset(True)``; it returns False if an explicit offset was set, e.g. ``set_useOffset(1000)``.
es_es: Devuelve True si ``set_useOffset(True)``; devuelve False si se estableció un offset explícito, por ejemplo ``set_useOffset(1000)``.

source: Set size thresholds for scientific notation.
es_es: Establecer los umbrales de tamaño para la notación científica.

source: A tuple *(min_exp, max_exp)* containing the powers of 10 that determine the switchover threshold. For a number representable as :math:`a \times 10^\mathrm{exp}`` with :math:`1 <= |a| < 10`, scientific notation will be used if ``exp <= min_exp`` or ``exp >= max_exp``.
es_es: Una tupla *(min_exp, max_exp)* que contiene las potencias de 10 que determinan el umbral de conmutación. Para un número representable como :math:`a \times 10^\mathrm{exp}`` con :math:`1 <= |a| < 10``, se utilizará la notación científica si ``exp <= min_exp`` o ``exp >= max_exp``.

source: The default limits are controlled by :rc:`axes.formatter.limits`.
es_es: Los límites por defecto son controlados por :rc:`axes.formatter.limits`.

source: In particular numbers with *exp* equal to the thresholds are written in scientific notation.
es_es: En particular los números con *exp* igual a los umbrales se escriben en notación científica.

source: Typically, *min_exp* will be negative and *max_exp* will be positive.
es_es: Típicamente, *min_exp* será negativo y *max_exp* será positivo.

source: For example, ``formatter.set_powerlimits((-3, 4))`` will provide the following formatting: :math:`1 \times 10^{-3}, 9.9 \times 10^{-3}, 0.01,` :math:`9999, 1 \times 10^4`.
es_es: Por ejemplo, ``formatter.set_powerlimits((-3, 4))`` proporcionará el siguiente formato: :math:`1 \times 10^{-3}, 9,9 \times 10^{-3}, 0,01,` :math:`9999, 1 \times 10^4`.

source: Turn scientific notation on or off.
es_es: Activar o desactivar la notación científica.

source: Set whether to use locale settings for decimal sign and positive sign.
es_es: Establecer si se utiliza la configuración regional para el signo decimal y el signo positivo.

source: bool or None
es_es: bool o None

source: *None* resets to :rc:`axes.formatter.use_locale`.
es_es: *None* restablece a :rc:`axes.formatter.use_locale`.

source: Set whether to use fancy math formatting.
es_es: Establecer si se utiliza el formato matemático de fantasía.

source: If active, scientific notation is formatted as :math:`1.2 \times 10^3`.
es_es: Si está activo, la notación científica se formatea como :math:`1.2 \times 10^3`.
