Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/ticker_api.po
Languages: es_es

source: *None* resets to :rc:`axes.formatter.use_mathtext`.
es_es: *None* restablece a :rc:`axes.formatter.use_mathtext`.

source: Set whether to use offset notation.
es_es: Establecer si se utiliza la notación de desplazamiento.

source: When formatting a set numbers whose value is large compared to their range, the formatter can separate an additive constant. This can shorten the formatted numbers so that they are less likely to overlap when drawn on an axis.
es_es: Al formatear un conjunto de números cuyo valor es grande en comparación con su rango, el formateador puede separar una constante aditiva. Esto puede acortar los números formateados para que sea menos probable que se superpongan cuando se dibujan en un eje.

source: bool or float
es_es: bool o float

source: If False, do not use offset notation.
es_es: Si es False, no utilizar la notación de desplazamiento.

source: If True (=automatic mode), use offset notation if it can make the residual numbers significantly shorter. The exact behavior is controlled by :rc:`axes.formatter.offset_threshold`.
es_es: Si es True (=modo automático), utiliza la notación offset si puede hacer que los números residuales sean significativamente más cortos. El comportamiento exacto es controlado por :rc:`axes.formatter.offset_threshold`.

source: If a number, force an offset of the given value.
es_es: Si es un número, forzar un desplazamiento del valor dado.

source: With active offset notation, the values
es_es: Con la notación de desplazamiento activo, los valores

source: will be formatted as ``0, 2, 4, 6, 8`` plus an offset ``+1e5``, which is written to the edge of the axis.
es_es: se formateará como ``0, 2, 4, 6, 8`` más un offset ``+1e5``, que se escribe en el borde del eje.

source: Use a new-style format string (as used by `str.format`) to format the tick.
es_es: Utilizar una cadena de formato de nuevo estilo (como la utilizada por `str.format`) para formatear el marcador.

source: The field used for the tick value must be labeled *x* and the field used for the tick position must be labeled *pos*.
es_es: El campo utilizado para el valor del marcador debe ser etiquetado *x* y el campo utilizado para la posición del marcador debe ser etiquetado *pos*.

source: Determine the tick locations for symmetric log axes.
es_es: Determinar las ubicaciones de los marcadores para los ejes logarítmicos simétricos.

source: **transform** : `~.scale.SymmetricalLogTransform`, optional
es_es: **transformación** : `~.scale.SymmetricalLogTransform`, opcional

source: SymmetricalLogTransform, optional
es_es: SymmetricalLogTransform, opcional

source: If set, defines the *base* and *linthresh* of the symlog transform.
es_es: Si se establece, define la *base* y el *linthresh* de la transformación symlog.

source: float, optional
es_es: float, opcional

source: The *base* and *linthresh* of the symlog transform, as documented for `.SymmetricalLogScale`. These parameters are only used if *transform* is not set.
es_es: La *base* y el *linthresh* de la transformación symlog, como se documenta para `.SymmetricalLogScale`. Estos parámetros sólo se utilizan si *transformación* no está establecida.

source: sequence of float, default: [1]
es_es: secuencia de float, por defecto: [1]

source: The multiples of integer powers of the base where ticks are placed, i.e., ticks are placed at ``[sub * base**i for i in ... for sub in subs]``.
es_es: Los múltiplos de potencias enteras de la base donde se colocan los marcadores, es decir, los marcadores se colocan en ``[sub * base**i for i in ... for sub in subs]``.

source: Either *transform*, or both *base* and *linthresh*, must be given.
es_es: Se debe dar *transformación*, o ambos *base* y *linthresh*.

source: [*Deprecated*]
es_es: [*Abandonado*]
