Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/tight_layout_api.po
Languages: es_es

source: Routines to adjust subplot params so that subplots are nicely fit in the figure. In doing so, only axis labels, tick labels, axes titles and offsetboxes that are anchored to axes are currently considered.
es_es: Rutinas para ajustar los parámetros de las subtramas para que éstas se ajusten bien a la figura. Al hacer esto, sólo se consideran las etiquetas de los ejes, las etiquetas de las marcas, los títulos de los ejes y los cuadros de desplazamiento que están anclados a los ejes.

source: Internally, this module assumes that the margins (left margin, etc.) which are differences between ``Axes.get_tightbbox`` and ``Axes.bbox`` are independent of Axes position. This may fail if ``Axes.adjustable`` is ``datalim`` as well as such cases as when left or right margin are affected by xlabel.
es_es: Internamente, este módulo asume que los márgenes (margen izquierdo, etc.) que son diferencias entre ``Axes.get_tightbbox`` y ``Axes.bbox``, son independientes de la posición de los ejes. Esto puede fallar si ``Axes.adjustable`` es ``datalim`` así como en casos como cuando el margen izquierdo o derecho se ven afectados por xlabel.

source: [*Deprecated*] Return a dict of subplot parameters to adjust spacing between subplots or ``None`` if resulting axes would have zero height or width.
es_es: [*Abandonado*] Devuelve un dict de parámetros de subplot para ajustar el espacio entre subplots o ``None`` si los ejes resultantes tienen altura o anchura cero.

source: Note that this function ignores geometry information of subplot itself, but uses what is given by the *nrows_ncols* and *num1num2_list* parameters. Also, the results could be incorrect if some subplots have ``adjustable=datalim``.
es_es: Ten en cuenta que esta función ignora la información de la geometría del subplot en sí, pero utiliza lo que dan los parámetros *nrows_ncols* y *num1num2_list*. Además, los resultados podrían ser incorrectos si algunos subplots tienen ``adjustable=datalim``.

source: Parameters
es_es: Parámetros

source: tuple[int, int]
es_es: tupla[int, int]

source: Number of rows and number of columns of the grid.
es_es: Número de filas y número de columnas de la cuadrícula.

source: List of numbers specifying the area occupied by the subplot
es_es: Lista de números que especifican el área ocupada por la subparcela

source: list of subplots
es_es: lista de subplots

source: List of subplots that will be used to calculate optimal subplot_params.
es_es: Lista de subplots que se utilizarán para calcular los subplot_params óptimos.

source: Padding between the figure edge and the edges of subplots, as a fraction of the font size.
es_es: Relleno entre el borde de la figura y los bordes de los subplots, como fracción del tamaño de la fuente.

source: Padding (height/width) between edges of adjacent subplots, as a fraction of the font size. Defaults to *pad*.
es_es: Relleno (altura/anchura) entre los bordes de los subplots adyacentes, como fracción del tamaño de la fuente. Por defecto es *pad*.

source: [left, bottom, right, top] in normalized (0, 1) figure coordinates.
es_es: [izquierda, abajo, derecha, arriba] en coordenadas normalizadas (0, 1) de la figura.

source: Notes
es_es: Notas

source: Return a list of subplotspec from the given list of axes.
es_es: Devuelve una lista de subplotspec a partir de la lista de ejes dada.

source: For an instance of axes that does not support subplotspec, None is inserted in the list.
es_es: Para una instancia de ejes que no soporta subplotspec, se inserta None en la lista.

source: If grid_spec is given, None is inserted for those not from the given grid_spec.
es_es: Si se da grid_spec, se inserta None para los que no son de la grid_spec dada.

source: Return subplot parameters for tight-layouted-figure with specified padding.
es_es: Devuelve los parámetros de subplot para tight-layouted-figure con el relleno especificado.

source: Figure
es_es: Figura

source: **axes_list**
es_es: **lista_de_ejes**

source: list of Axes
es_es: lista de ejes

source: **subplotspec_list** : list of `.SubplotSpec`
es_es: **subplotspec_list** : lista de `.SubplotSpec`

source: list of
es_es: lista de

source: The subplotspecs of each axes.
es_es: Los subplotspecs de cada eje.

source: Padding (height/width) between edges of adjacent subplots. Defaults to *pad*.
es_es: Relleno (altura/anchura) entre los bordes de las subtramas adyacentes. Por defecto es *pad*.

source: tuple[float, float, float, float], optional
es_es: tuple[float, float, float, float], opcional

source: (left, bottom, right, top) rectangle in normalized figure coordinates that the whole subplots area (including labels) will fit into. Defaults to using the entire figure.
es_es: (izquierda, abajo, derecha, arriba) rectángulo en coordenadas normalizadas de la figura en el que cabrá toda el área de las subtramas (incluidas las etiquetas). Por defecto se utiliza toda la figura.

source: Returns
es_es: Devuelve

source: subplotspec or None
es_es: subplotspec o None

source: subplotspec kwargs to be passed to `.Figure.subplots_adjust` or None if tight_layout could not be accomplished.
es_es: kwargs de subplotspec que se pasarán a `.Figure.subplots_adjust` o None si no se ha podido realizar tight_layout.
