Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/transformations.po
Languages: es_es

source: Matplotlib includes a framework for arbitrary geometric transformations that is used determine the final position of all elements drawn on the canvas.
es_es: Matplotlib incluye un framework para transformaciones geométricas arbitrarias que se utiliza para determinar la posición final de todos los elementos dibujados en el lienzo.

source: Transforms are composed into trees of `TransformNode` objects whose actual value depends on their children. When the contents of children change, their parents are automatically invalidated. The next time an invalidated transform is accessed, it is recomputed to reflect those changes. This invalidation/caching approach prevents unnecessary recomputations of transforms, and contributes to better interactive performance.
es_es: Las transformaciones se componen en árboles de objetos `TransformNode` cuyo valor real depende de sus hijos. Cuando el contenido de los hijos cambia, sus padres se invalidan automáticamente. La siguiente vez que se accede a una transformación invalidada, se vuelve a calcular para reflejar esos cambios. Este enfoque de invalidación/almacenamiento evita recálculos innecesarios de las transformaciones, y contribuye a un mejor rendimiento interactivo.

source: For example, here is a graph of the transform tree used to plot data to the graph:
es_es: Por ejemplo, aquí hay un gráfico del árbol de transformaciones utilizado para trazar los datos a la gráfica:

source: The framework can be used for both affine and non-affine transformations. However, for speed, we want use the backend renderers to perform affine transformations whenever possible. Therefore, it is possible to perform just the affine or non-affine part of a transformation on a set of data. The affine is always assumed to occur after the non-affine. For any transform::
es_es: El framework puede ser utilizado tanto para transformaciones afines como no afines. Sin embargo, para la velocidad, queremos usar los renderizadores del backend para realizar transformaciones afines siempre que sea posible. Por lo tanto, es posible realizar sólo la parte afín o no afín de una transformación en un conjunto de datos. Se supone que la parte afín siempre ocurre después de la parte no afín. Para cualquier transformación::

source: The backends are not expected to handle non-affine transformations themselves.
es_es: No se espera que los backends manejen por sí mismos las transformaciones no afines.

source: A mutable 2D affine transformation.
es_es: Una transformación afín 2D mutable.

source: Initialize an Affine transform from a 3x3 numpy float array::
es_es: Inicializar una transformación Affine a partir de un arreglo de 3x3 flotadores de numpy::

source: If *matrix* is None, initialize with the identity transform.
es_es: Si *matriz* es None, se inicializa con la transformada de identidad.

source: Return str(self).
es_es: Devuelve str(self).

source: Reset the underlying matrix to the identity transform.
es_es: Restablecer la matriz subyacente a la transformada de identidad.

source: Create a new Affine2D instance from the given values::
es_es: Crea una nueva instancia de Affine2D a partir de los valores dados::

source: Get the underlying transformation matrix as a 3x3 numpy array::
es_es: Obtener la matriz de transformación subyacente como un arreglo numpy de 3x3::

source: Return a new `Affine2D` object that is the identity transform.
es_es: Devuelve un nuevo objeto `Affine2D` que es la transformada de identidad.

source: Unless this transform will be mutated later on, consider using the faster `IdentityTransform` class instead.
es_es: A menos que esta transformación vaya a ser mutada más adelante, considera usar la clase más rápida `IdentityTransform` en su lugar.

source: Add a rotation (in radians) to this transform in place.
es_es: Añade una rotación (en radianes) a esta transformación en su lugar.

source: Returns *self*, so this method can easily be chained with more calls to :meth:`rotate`, :meth:`rotate_deg`, :meth:`translate` and :meth:`scale`.
es_es: Devuelve *self*, por lo que este método puede encadenarse fácilmente con más llamadas a :meth:`rotate`, :meth:`rotate_deg`, :meth:`translate` y :meth:`scale`.

source: Add a rotation (in radians) around the point (x, y) in place.
es_es: Añade una rotación (en radianes) alrededor del punto (x, y) en su lugar.

source: Add a rotation (in degrees) to this transform in place.
es_es: Añade una rotación (en grados) a esta transformación en su lugar.

source: Add a rotation (in degrees) around the point (x, y) in place.
es_es: Añade una rotación (en grados) alrededor del punto (x, y) en su lugar.

source: Add a scale in place.
es_es: Añadir una escala en su lugar.

source: If *sy* is None, the same scale is applied in both the *x*- and *y*-directions.
es_es: Si *sy* es None, se aplica la misma escala en las direcciones *x* y *y*.

source: Set this transformation from the frozen copy of another `Affine2DBase` object.
es_es: Establecer esta transformación desde la copia congelada de otro objeto `Affine2DBase`.

source: Set the underlying transformation matrix from a 3x3 numpy array::
es_es: Establecer la matriz de transformación subyacente de un arreglo de 3x3 numpy::

source: Add a skew in place.
es_es: Añade un skew en su lugar.

source: *xShear* and *yShear* are the shear angles along the *x*- and *y*-axes, respectively, in radians.
es_es: *xShear* y *yShear* son los ángulos de cizalladura a lo largo de los ejes *x* y *y*, respectivamente, en radianes.

source: *xShear* and *yShear* are the shear angles along the *x*- and *y*-axes, respectively, in degrees.
es_es: *xShear* y *yShear* son los ángulos de corte a lo largo de los ejes *x* e *y*, respectivamente, en grados.

source: Add a translation in place.
es_es: Añadir una traducción en su lugar.

source: The base class of all 2D affine transformations.
es_es: La clase base de todas las transformaciones afines 2D.

source: 2D affine transformations are performed using a 3x3 numpy array::
es_es: Las transformaciones afines 2D se realizan utilizando un arreglo numpy de 3x3::

source: This class provides the read-only interface. For a mutable 2D affine transformation, use `Affine2D`.
es_es: Esta clase proporciona la interfaz de sólo lectura. Para una transformación afín 2D mutable, utilice `Affine2D`.

source: Subclasses of this class will generally only need to override a constructor and :meth:`get_matrix` that generates a custom 3x3 matrix.
es_es: Las subclases de esta clase por lo general sólo tendrán que anular un constructor y :meth:`get_matrix` que genera una matriz 3x3 personalizada.

source: Parameters
es_es: Parámetros

source: A string representing the "name" of the transform. The name carries no significance other than to improve the readability of ``str(transform)`` when DEBUG=True.
es_es: Una cadena que representa el "nombre" de la transformación. El nombre no tiene más significado que el de mejorar la legibilidad de ``str(transform)`` cuando DEBUG=True.

source: Return a frozen copy of this transform node. The frozen copy will not be updated when its children change. Useful for storing a previously known state of a transform where ``copy.deepcopy()`` might normally be used.
es_es: Devuelve una copia congelada de este nodo de transformación. La copia congelada no se actualizará cuando sus hijos cambien. Útil para almacenar un estado previamente conocido de una transformación donde ``copy.deepcopy()`` podría usarse normalmente.

source: True if this transform has a corresponding inverse transform.
es_es: Verdadero si esta transformación tiene una transformación inversa correspondiente.

source: The number of input dimensions of this transform. Must be overridden (with integers) in the subclass.
es_es: El número de dimensiones de entrada de esta transformación. Debe ser sobrescrito (con enteros) en la subclase.

source: Return the corresponding inverse transformation.
es_es: Devuelve la transformación inversa correspondiente.

source: It holds ``x == self.inverted().transform(self.transform(x))``.
es_es: Sostiene ``x == self.inverted().transform(self.transform(x))``.

source: The return value of this method should be treated as temporary. An update to *self* does not cause a corresponding update to its inverted copy.
es_es: El valor de retorno de este método debe ser tratado como temporal. Una actualización de *self* no provoca la correspondiente actualización de su copia invertida.

source: Returns True when the argument x is true, False otherwise. The builtins True and False are the only two instances of the class bool. The class bool is a subclass of the class int, and cannot be subclassed.
es_es: Devuelve True cuando el argumento x es verdadero, False en caso contrario. Los builtins True y False son las dos únicas instancias de la clase bool. La clase bool es una subclase de la clase int, y no puede ser subclasificada.

source: The number of output dimensions of this transform. Must be overridden (with integers) in the subclass.
es_es: El número de dimensiones de salida de esta transformación. Debe ser sobrescrito (con enteros) en la subclase.

source: Return the values of the matrix as an ``(a, b, c, d, e, f)`` tuple.
es_es: Devuelve los valores de la matriz como una tupla ``(a, b, c, d, e, f)``.

source: Apply only the affine part of this transformation on the given array of values.
es_es: Aplica sólo la parte afín de esta transformación sobre el arreglo de valores dado.

source: ``transform(values)`` is always equivalent to ``transform_affine(transform_non_affine(values))``.
es_es: ``transform(valores)`` siempre es equivalente a ``transform_affine(transform_non_affine(valores))``.

source: In non-affine transformations, this is generally a no-op. In affine transformations, this is equivalent to ``transform(values)``.
es_es: En las transformaciones no afines, esto es generalmente un no-op. En las transformaciones afines, esto es equivalente a ``transform(values)``.

source: **values**
es_es: **valores**

source: The input values as NumPy array of length :attr:`input_dims` or shape (N x :attr:`input_dims`).
es_es: Los valores de entrada como arreglo NumPy de longitud :attr:`input_dims` o forma (N x :attr:`input_dims`).

source: Returns
es_es: Devuelve

source: The output values as NumPy array of length :attr:`input_dims` or shape (N x :attr:`output_dims`), depending on the input.
es_es: Los valores de salida como arreglo NumPy de longitud :attr:`input_dims` o forma (N x :attr:`output_dims`), dependiendo de la entrada.

source: The base class of all affine transformations of any number of dimensions.
es_es: La clase base de todas las transformaciones afines de cualquier número de dimensiones.

source: Array interface to get at this Transform's affine matrix.
es_es: Interfaz de arreglo para obtener la matriz afín de esta Transformación.

source: Return self==value.
es_es: Devuelve self==value.

source: Get the affine part of this transform.
es_es: Obtener la parte afín de esta transformación.

source: Apply this transformation on the given array of *values*.
es_es: Aplicar esta transformación sobre el arreglo de *valores* dado.

source: Apply only the non-affine part of this transformation.
es_es: Aplicar sólo la parte no afín de esta transformación.

source: In non-affine transformations, this is generally equivalent to ``transform(values)``. In affine transformations, this is always a no-op.
es_es: En las transformaciones no afines, esto es generalmente equivalente a ``transformar(valores)``. En las transformaciones afines, esto es siempre un no-op.

source: Apply the transform to `.Path` *path*, returning a new `.Path`.
es_es: Aplica la transformación a `.Path` *ruta*, devolviendo una nueva `.Path`.

source: In some cases, this transform may insert curves into the path that began as line segments.
es_es: En algunos casos, esta transformación puede insertar curvas en la trayectoria que comenzó como segmentos de línea.

source: Apply the affine part of this transform to `.Path` *path*, returning a new `.Path`.
es_es: Aplica la parte afín de esta transformación a `.Path` *path*, devolviendo un nuevo `.Path`.

source: ``transform_path(path)`` is equivalent to ``transform_path_affine(transform_path_non_affine(values))``.
es_es: ``transform_path(path)`` es equivalente a ``transform_path_affine(transform_path_non_affine(values))``.

source: Apply the non-affine part of this transform to `.Path` *path*, returning a new `.Path`.
es_es: Aplica la parte no afín de esta transformación a `.Path` *ruta*, devolviendo una nueva `.Path`.

source: A transform wrapper for transforming displacements between pairs of points.
es_es: Una envoltura de transformación para transformar los desplazamientos entre pares de puntos.

source: This class is intended to be used to transform displacements ("position deltas") between pairs of points (e.g., as the ``offset_transform`` of `.Collection`\s): given a transform ``t`` such that ``t = AffineDeltaTransform(t) + offset``, ``AffineDeltaTransform`` satisfies ``AffineDeltaTransform(a - b) == AffineDeltaTransform(a) - AffineDeltaTransform(b)``.
es_es: Esta clase está pensada para transformar desplazamientos ("deltas de posición") entre pares de puntos (por ejemplo, como la ``transformación de desplazamiento`` de `.Collection`s): dada una transformación ``t`` tal que ``t = AffineDeltaTransform(t) + desplazamiento``, ``AffineDeltaTransform`` satisface ``AffineDeltaTransform(a - b) == AffineDeltaTransform(a) - AffineDeltaTransform(b)``.

source: This is implemented by forcing the offset components of the transform matrix to zero.
es_es: Esto se implementa forzando los componentes de desplazamiento de la matriz de transformación a cero.

source: This class is experimental as of 3.3, and the API may change.
es_es: Esta clase es experimental a partir de la versión 3.3, y la API puede cambiar.

source: Get the matrix for the affine part of this transform.
es_es: Obtiene la matriz para la parte afín de esta transformación.

source: A mutable bounding box.
es_es: Un bounding box mutable.

source: Examples
es_es: Ejemplos

source: **Create from known bounds**
es_es: **Crear a partir de límites conocidos**

source: The default constructor takes the boundary "points" ``[[xmin, ymin], [xmax, ymax]]``.
es_es: El constructor por defecto toma los "puntos" de los límites ``[[xmin, ymin], [xmax, ymax]]``.

source: Alternatively, a Bbox can be created from the flattened points array, the so-called "extents" ``(xmin, ymin, xmax, ymax)``
es_es: Alternativamente, se puede crear una Bbox a partir de la matriz de puntos aplanada, los llamados "extents" ``(xmin, ymin, xmax, ymax)``

source: or from the "bounds" ``(xmin, ymin, width, height)``.
es_es: o de los "bounds" ``(xmin, ymin, width, height)``.

source: **Create from collections of points**
es_es: **Crear a partir de colecciones de puntos**

source: The "empty" object for accumulating Bboxs is the null bbox, which is a stand-in for the empty set.
es_es: El objeto "vacío" para acumular Bboxs es el bbox nulo, que es un sustituto del conjunto vacío.

source: Adding points to the null bbox will give you the bbox of those points.
es_es: Añadiendo puntos a la bbox nula se obtiene la bbox de esos puntos.

source: Setting ``ignore=True`` is equivalent to starting over from a null bbox.
es_es: Establecer ``ignore=True`` es equivalente a empezar de nuevo desde una bbox nula.

source: It is recommended to always specify ``ignore`` explicitly. If not, the default value of ``ignore`` can be changed at any time by code with access to your Bbox, for example using the method `~.Bbox.ignore`.
es_es: Se recomienda especificar siempre ``ignore`` explícitamente. De lo contrario, el valor por defecto de ``ignore`` puede ser cambiado en cualquier momento por código con acceso a su Bbox, por ejemplo usando el método.

source: **Properties of the ``null`` bbox**
es_es: **Propiedades de la bbox ``nula`` **

source: The current behavior of `Bbox.null()` may be surprising as it does not have all of the properties of the "empty set", and as such does not behave like a "zero" object in the mathematical sense. We may change that in the future (with a deprecation period).
es_es: El comportamiento actual de `Bbox.null()` puede ser sorprendente ya que no tiene todas las propiedades del "conjunto vacío", y como tal no se comporta como un objeto "cero" en el sentido matemático. Puede que cambiemos esto en el futuro (con un periodo de depreciación).

source: The null bbox is the identity for intersections
es_es: La bbox nula es la identidad para las intersecciones

source: except with itself, where it returns the full space.
es_es: excepto consigo mismo, donde devuelve el espacio completo.

source: A union containing null will always return the full space (not the other set!)
es_es: Una unión que contenga null siempre devolverá el espacio completo (¡no el otro conjunto!)

source: **points**
es_es: **puntos**

source: A 2x2 numpy array of the form ``[[x0, y0], [x1, y1]]``.
es_es: Una matriz numpy 2x2 de la forma ``[[x0, y0], [x1, y1]]``.

source: Default object formatter.
es_es: Formateador de objetos por defecto.

source: Return repr(self).
es_es: Devuelve repr(self).

source: Return (:attr:`x0`, :attr:`y0`, :attr:`width`, :attr:`height`).
es_es: Devuelve (:attr:`x0`, :attr:`y0`, :attr:`width`, :attr:`height`).

source: Create a new `Bbox` from *x0*, *y0*, *width* and *height*.
es_es: Crea una nueva `Bbox` a partir de *x0*, *y0*, *width* y *height*.

source: *width* and *height* may be negative.
es_es: *width* y *height* pueden ser negativos.

source: Create a new Bbox from *left*, *bottom*, *right* and *top*.
es_es: Crea una nueva Bbox a partir de *izquierda*, *inferior*, *derecha* y *superior*.

source: The *y*-axis increases upwards.
es_es: El eje *y* aumenta hacia arriba.

source: **left, bottom, right, top**
es_es: **izquierda, abajo, derecha, arriba**

source: The four extents of the bounding box.
es_es: Las cuatro extensiones de la caja delimitadora.

source: float or None
es_es: float o None

source: If this is supplied, the Bbox will have a minimum positive value set. This is useful when dealing with logarithmic scales and other scales where negative bounds result in floating point errors.
es_es: Si se suministra esto, la Bbox tendrá un valor mínimo positivo establecido. Esto es útil cuando se trata de escalas logarítmicas y otras escalas donde los límites negativos resultan en errores de punto flotante.

source: The base class for anything that participates in the transform tree and needs to invalidate its parents or be invalidated. This includes classes that are not really transforms, such as bounding boxes, since some transforms depend on bounding boxes to compute their values.
es_es: La clase base para cualquier cosa que participe en el árbol de transformaciones y necesite invalidar a sus padres o ser invalidado. Esto incluye clases que no son realmente transformaciones, como las cajas delimitadoras, ya que algunas transformaciones dependen de las cajas delimitadoras para calcular sus valores.

source: Get the points of the bounding box directly as a numpy array of the form: ``[[x0, y0], [x1, y1]]``.
es_es: Obtener los puntos de la caja delimitadora directamente como un array numpy de la forma ``[[x0, y0], [x1, y1]]``.

source: Set whether the existing bounds of the box should be ignored by subsequent calls to :meth:`update_from_data_xy`.
es_es: Establece si los límites existentes de la caja deben ser ignorados por posteriores llamadas a :meth:`update_from_data_xy`.

source: value
es_es: valor

source: When ``True``, subsequent calls to :meth:`update_from_data_xy` will ignore the existing bounds of the `Bbox`.
es_es: Cuando ``True``, las llamadas posteriores a :meth:`update_from_data_xy` ignorarán los límites existentes de la `Bbox`.

source: When ``False``, subsequent calls to :meth:`update_from_data_xy` will include the existing bounds of the `Bbox`.
es_es: Cuando ``False``, las siguientes llamadas a :meth:`update_from_data_xy` incluirán los límites existentes de la `Bbox`.

source: The pair of *x* coordinates that define the bounding box.
es_es: El par de coordenadas *x* que definen la caja delimitadora.

source: This is not guaranteed to be sorted from left to right.
es_es: No se garantiza la ordenación de izquierda a derecha.

source: The pair of *y* coordinates that define the bounding box.
es_es: El par de coordenadas *y* que definen la caja delimitadora.

source: This is not guaranteed to be sorted from bottom to top.
es_es: No se garantiza la ordenación de abajo a arriba.

source: The minimum positive value in both directions within the Bbox.
es_es: El mínimo valor positivo en ambas direcciones dentro de la Bbox.

source: This is useful when dealing with logarithmic scales and other scales where negative bounds result in floating point errors, and will be used as the minimum extent instead of *p0*.
es_es: Esto es útil cuando se trata de escalas logarítmicas y otras escalas donde los límites negativos dan lugar a errores de punto flotante, y se utilizará como la extensión mínima en lugar de *p0*.

source: The minimum positive value in the *x*-direction within the Bbox.
es_es: El valor positivo mínimo en la dirección *x* dentro de la Bbox.

source: This is useful when dealing with logarithmic scales and other scales where negative bounds result in floating point errors, and will be used as the minimum *x*-extent instead of *x0*.
es_es: Esto es útil cuando se trata de escalas logarítmicas y otras escalas donde los límites negativos dan lugar a errores de punto flotante, y se utilizará como el mínimo *x*-extensión en lugar de *x0*.

source: The minimum positive value in the *y*-direction within the Bbox.
es_es: El valor positivo mínimo en la dirección *y* dentro de la Bbox.

source: This is useful when dealing with logarithmic scales and other scales where negative bounds result in floating point errors, and will be used as the minimum *y*-extent instead of *y0*.
es_es: Esto es útil cuando se trata de escalas logarítmicas y otras escalas donde los límites negativos dan lugar a errores de punto flotante, y se utilizará como el mínimo *y*-extensión en lugar de *y0*.

source: Return whether the bbox has changed since init.
es_es: Devuelve si la bbox ha cambiado desde init.

source: Return whether the x-limits have changed since init.
es_es: Devuelve si los límites x han cambiado desde init.

source: Return whether the y-limits have changed since init.
es_es: Devuelve si los límites Y han cambiado desde init.

source: Create a new null `Bbox` from (inf, inf) to (-inf, -inf).
es_es: Crea una nueva `Bbox` nula desde (inf, inf) hasta (-inf, -inf).

source: The first pair of (*x*, *y*) coordinates that define the bounding box.
es_es: El primer par de coordenadas (*x*, *y*) que definen la caja delimitadora.

source: This is not guaranteed to be the bottom-left corner (for that, use :attr:`min`).
es_es: No se garantiza que sea la esquina inferior izquierda (para ello, utilice :attr:`min`).

source: The second pair of (*x*, *y*) coordinates that define the bounding box.
es_es: El segundo par de coordenadas (*x*, *y*) que definen la caja delimitadora.

source: This is not guaranteed to be the top-right corner (for that, use :attr:`max`).
es_es: No se garantiza que sea la esquina superior derecha (para ello, utilice :attr:`max`).

source: Set this bounding box from the "frozen" bounds of another `Bbox`.
es_es: Establece esta caja delimitadora a partir de los límites "congelados" de otra `Bbox`.
