Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/transformations.po
Languages: es_es

source: Set the points of the bounding box directly from a numpy array of the form: ``[[x0, y0], [x1, y1]]``. No error checking is performed, as this method is mainly for internal use.
es_es: Establece los puntos de la caja delimitadora directamente desde un array de numpy de la forma ``[[x0, y0], [x1, y1]]``. No se realiza ninguna comprobación de errores, ya que este método es principalmente de uso interno.

source: Create a new unit `Bbox` from (0, 0) to (1, 1).
es_es: Crea una nueva `Bbox` unitaria desde (0, 0) hasta (1, 1).

source: Update the x-bounds of the `Bbox` based on the passed in data. After updating, the bounds will have positive *width*, and *x0* will be the minimal value.
es_es: Actualiza los límites x de la `Bbox` basándose en los datos pasados. Después de la actualización, los límites tendrán *ancho* positivo, y *x0* será el valor mínimo.

source: Array of x-values.
es_es: Matriz de valores x.

source: **ignore**
es_es: **ignorar**

source: bool, optional
es_es: bool, opcional

source: When ``True``, ignore the existing bounds of the `Bbox`.
es_es: Cuando ``False``, incluye los límites existentes de la `Bbox`.

source: When ``False``, include the existing bounds of the `Bbox`.
es_es: Cuando ``False``, incluye los límites existentes de la `Bbox`.

source: When ``None``, use the last value passed to :meth:`ignore`.
es_es: Cuando ``None``, utiliza el último valor pasado a :meth:`ignore`.

source: Update the bounds of the `Bbox` based on the passed in data. After updating, the bounds will have positive *width* and *height*; *x0* and *y0* will be the minimal values.
es_es: Actualiza los límites de la `Bbox` basándose en los datos pasados. Después de la actualización, los límites tendrán *ancho* y *altura* positivos; *x0* e *y0* serán los valores mínimos.

source: A numpy array of 2D points.
es_es: Una matriz numpy de puntos 2D.

source: bool, default: True
es_es: bool, por defecto: True

source: When ``True``, update the x/y values.
es_es: Cuando ``True``, actualiza los valores x/y.

source: Update the y-bounds of the `Bbox` based on the passed in data. After updating, the bounds will have positive *height*, and *y0* will be the minimal value.
es_es: Actualiza los límites Y de la `Bbox` basándose en los datos pasados. Después de la actualización, los límites tendrán *altura* positiva, y *y0* será el valor mínimo.

source: Array of y-values.
es_es: Matriz de valores y.

source: Update the bounds of the `Bbox` to contain the vertices of the provided path. After updating, the bounds will have positive *width* and *height*; *x0* and *y0* will be the minimal values.
es_es: Actualiza los límites de la `Bbox` para que contenga los vértices del camino proporcionado. Tras la actualización, los límites tendrán *ancho* y *alto* positivos; *x0* e *y0* serán los valores mínimos.

source: Path
es_es: Ruta

source: when ``True``, ignore the existing bounds of the `Bbox`.
es_es: cuando es ``True``, ignorar los límites existentes de la `Bbox`.

source: when ``False``, include the existing bounds of the `Bbox`.
es_es: cuando es ``False``, incluir los límites existentes de la `Bbox`.

source: when ``None``, use the last value passed to :meth:`ignore`.
es_es: cuando ``None``, usar el último valor pasado a :meth:`ignore`.

source: The first of the pair of *x* coordinates that define the bounding box.
es_es: La primera del par de coordenadas *x* que definen la caja delimitadora.

source: This is not guaranteed to be less than :attr:`x1` (for that, use :attr:`xmin`).
es_es: No se garantiza que sea menor que :attr:`x1` (para ello, utilice :attr:`xmin`).

source: The second of the pair of *x* coordinates that define the bounding box.
es_es: La segunda del par de coordenadas *x* que definen la caja delimitadora.

source: This is not guaranteed to be greater than :attr:`x0` (for that, use :attr:`xmax`).
es_es: No se garantiza que sea mayor que :attr:`x0` (para ello, utilice :attr:`xmax`).

source: The first of the pair of *y* coordinates that define the bounding box.
es_es: La primera del par de coordenadas *y* que definen la caja delimitadora.

source: This is not guaranteed to be less than :attr:`y1` (for that, use :attr:`ymin`).
es_es: No se garantiza que sea menor que :attr:`y1` (para ello, utilice :attr:`ymin`).

source: The second of the pair of *y* coordinates that define the bounding box.
es_es: La segunda del par de coordenadas *y* que definen la caja delimitadora.

source: This is not guaranteed to be greater than :attr:`y0` (for that, use :attr:`ymax`).
es_es: No se garantiza que sea mayor que :attr:`y0` (para ello, utiliza :attr:`ymax`).

source: The base class of all bounding boxes.
es_es: La clase base de todas las cajas delimitadoras.

source: This class is immutable; `Bbox` is a mutable subclass.
es_es: Esta clase es inmutable; `Bbox` es una subclase mutable.

source: The canonical representation is as two points, with no restrictions on their ordering. Convenience properties are provided to get the left, bottom, right and top edges and width and height, but these are not stored explicitly.
es_es: La representación canónica es como dos puntos, sin restricciones en su ordenamiento. Se proporcionan propiedades de conveniencia para obtener los bordes izquierdo, inferior, derecho y superior, así como la anchura y la altura, pero no se almacenan explícitamente.

source: Return a copy of the `Bbox` anchored to *c* within *container*.
es_es: Devuelve una copia de la `Bbox` anclada a *c* dentro de *contenedor*.

source: (float, float) or {'C', 'SW', 'S', 'SE', 'E', 'NE', ...}
es_es: (float, float) o {'C', 'SW', 'S', 'SE', 'E', 'NE', ...}

source: Either an (*x*, *y*) pair of relative coordinates (0 is left or bottom, 1 is right or top), 'C' (center), or a cardinal direction ('SW', southwest, is bottom left, etc.).
es_es: O bien un par (*x*, *y*) de coordenadas relativas (0 es izquierda o abajo, 1 es derecha o arriba), 'C' (centro), o una dirección cardinal ('SW', suroeste, es abajo a la izquierda, etc.).

source: **container** : `Bbox`, optional
es_es: **contenedor** : `Bbox`, opcional

source: Bbox, optional
es_es: Bbox, opcional

source: The box within which the `Bbox` is positioned; it defaults to the initial `Bbox`.
es_es: La caja dentro de la cual se posiciona la `Bbox`; por defecto es la `Bbox` inicial.

source: Return whether ``(x, y)`` is in the bounding box or on its edge.
es_es: Devuelve si ``(x, y)`` está en la caja delimitadora o en su borde.

source: Return whether *x* is in the closed (:attr:`x0`, :attr:`x1`) interval.
es_es: Devuelve si *x* está en el intervalo cerrado (:attr:`x0`, :attr:`x1`).

source: Return whether *y* is in the closed (:attr:`y0`, :attr:`y1`) interval.
es_es: Devuelve si *y* está en el intervalo cerrado (:attr:`y0`, :attr:`y1`).

source: Return the corners of this rectangle as an array of points.
es_es: Devuelve las esquinas de este rectángulo como un array de puntos.

source: Specifically, this returns the array ``[[x0, y0], [x0, y1], [x1, y0], [x1, y1]]``.
es_es: En concreto, devuelve la matriz ``[[x0, y0], [x0, y1], [x1, y0], [x1, y1]]``.

source: Count the number of vertices contained in the `Bbox`. Any vertices with a non-finite x or y value are ignored.
es_es: Cuenta el número de vértices contenidos en la `Bbox`. Cualquier vértice con un valor x o y no finito se ignora.

source: Nx2 Numpy array.
es_es: Matriz Nx2 Numpy.

source: Count the number of bounding boxes that overlap this one.
es_es: Cuenta el número de cajas delimitadoras que se superponen a ésta.

source: **bboxes** : sequence of `.BboxBase`
es_es: **bboxes** : secuencia de `.BboxBase`

source: sequence of
es_es: secuencia de

source: Construct a `Bbox` by expanding this one around its center by the factors *sw* and *sh*.
es_es: Construye una `Bbox` expandiendo esta alrededor de su centro por los factores *sw* y *sh*.

source: Return (:attr:`x0`, :attr:`y0`, :attr:`x1`, :attr:`y1`).
es_es: Devuelve (:attr:`x0`, :attr:`y0`, :attr:`x1`, :attr:`y1`).

source: Return whether ``x, y`` is in the bounding box, but not on its edge.
es_es: Devuelve si ``x, y`` está en la caja delimitadora, pero no en su borde.

source: Return whether *x* is in the open (:attr:`x0`, :attr:`x1`) interval.
es_es: Devuelve si *x* está en el intervalo abierto (:attr:`x0`, :attr:`x1`).

source: Return whether *y* is in the open (:attr:`y0`, :attr:`y1`) interval.
es_es: Devuelve si *y* está en el intervalo abierto (:attr:`y0`, :attr:`y1`).

source: Return whether this bounding box overlaps with the other bounding box, not including the edges.
es_es: Devuelve si esta caja delimitadora se solapa con la otra caja delimitadora, sin incluir los bordes.

source: **other** : `.BboxBase`
es_es: **otro** : `.BboxBase`

source: The (signed) height of the bounding box.
es_es: La altura (con signo) de la caja delimitadora.

source: Return the intersection of *bbox1* and *bbox2* if they intersect, or None if they don't.
es_es: Devuelve la intersección de *bbox1* y *bbox2* si se cruzan, o None si no lo hacen.

source: The top-right corner of the bounding box.
es_es: La esquina superior derecha de la caja delimitadora.

source: The bottom-left corner of the bounding box.
es_es: La esquina inferior izquierda de la caja delimitadora.

source: Return whether this bounding box overlaps with the other bounding box.
es_es: Devuelve si esta caja delimitadora se solapa con la otra caja delimitadora.

source: Construct a `Bbox` by padding this one on all four sides by *p*.
es_es: Construye una `Bbox` rellenando ésta en sus cuatro lados por *p*.

source: Return the axes-aligned bounding box that bounds the result of rotating this `Bbox` by an angle of *radians*.
es_es: Devuelve la caja delimitadora alineada con los ejes que delimita el resultado de rotar esta `Bbox` en un ángulo de *radios*.

source: Return a copy of the `Bbox`, shrunk by the factor *mx* in the *x* direction and the factor *my* in the *y* direction. The lower left corner of the box remains unchanged. Normally *mx* and *my* will be less than 1, but this is not enforced.
es_es: Devuelve una copia de la `Bbox`, encogida por el factor *mx* en la dirección *x* y el factor *my* en la dirección *y*. La esquina inferior izquierda de la caja no cambia. Normalmente *mx* y *my* serán menores que 1, pero esto no se aplica.

source: Return a copy of the `Bbox`, shrunk so that it is as large as it can be while having the desired aspect ratio, *box_aspect*. If the box coordinates are relative (i.e. fractions of a larger box such as a figure) then the physical aspect ratio of that figure is specified with *fig_aspect*, so that *box_aspect* can also be given as a ratio of the absolute dimensions, not the relative dimensions.
es_es: Devuelve una copia de la `Bbox`, encogida para que sea tan grande como pueda ser mientras tenga la relación de aspecto deseada, *box_aspect*. Si las coordenadas de la caja son relativas (es decir, fracciones de una caja más grande, como una figura) entonces la relación de aspecto física de esa figura se especifica con *fig_aspect*, de modo que *box_aspect* también puede darse como una relación de las dimensiones absolutas, no de las dimensiones relativas.

source: The (signed) width and height of the bounding box.
es_es: La anchura y la altura (con signo) de la caja delimitadora.

source: Return a list of new `Bbox` objects formed by splitting the original one with vertical lines at fractional positions given by *args*.
es_es: Devuelve una lista de nuevos objetos `Bbox` formados al dividir el original con líneas verticales en posiciones fraccionarias dadas por *args*.

source: Return a list of new `Bbox` objects formed by splitting the original one with horizontal lines at fractional positions given by *args*.
es_es: Devuelve una lista de nuevos objetos `Bbox` formados al dividir el original con líneas horizontales en posiciones fraccionarias dadas por *args*.

source: Construct a `Bbox` by statically transforming this one by *transform*.
es_es: Construye una `Bbox` transformando estáticamente ésta por *transformación*.

source: Construct a `Bbox` by translating this one by *tx* and *ty*.
es_es: Construye una `Bbox` traduciendo ésta por *tx* y *ty*.

source: Return a `Bbox` that contains all of the given *bboxes*.
es_es: Devuelve una `Bbox` que contiene todas las *bboxes* dadas.

source: The (signed) width of the bounding box.
es_es: El ancho (con signo) de la caja delimitadora.

source: The right edge of the bounding box.
es_es: El borde derecho de la caja delimitadora.

source: The left edge of the bounding box.
es_es: El borde izquierdo de la caja delimitadora.

source: The top edge of the bounding box.
es_es: El borde superior de la caja delimitadora.

source: The bottom edge of the bounding box.
es_es: El borde inferior de la caja delimitadora.

source: `BboxTransform` linearly transforms points from one `Bbox` to another.
es_es: `BboxTransform` transforma linealmente los puntos de una `Bbox` a otra.

source: Create a new `BboxTransform` that linearly transforms points from *boxin* to *boxout*.
es_es: Crea una nueva `BboxTransform` que transforma linealmente los puntos de *boxin* a *boxout*.

source: True if this transform is separable in the x- and y- dimensions.
es_es: True si esta transformación es separable en las dimensiones x e y.

source: `BboxTransformFrom` linearly transforms points from a given `Bbox` to the unit bounding box.
es_es: `BboxTransformFrom` transforma linealmente los puntos de una `Bbox` dada a la caja delimitadora de la unidad.

source: `BboxTransformTo` is a transformation that linearly transforms points from the unit bounding box to a given `Bbox`.
es_es: `BboxTransformTo` es una transformación que transforma linealmente los puntos de la caja delimitadora unitaria a una `Bbox` dada.

source: Create a new `BboxTransformTo` that linearly transforms points from the unit bounding box to *boxout*.
es_es: Crea un nuevo `BboxTransformTo` que transforma linealmente los puntos de la caja delimitadora de la unidad a *boxout*.

source: `BboxTransformTo` is a transformation that linearly transforms points from the unit bounding box to a given `Bbox` with a fixed upper left of (0, 0).
es_es: `BboxTransformTo` es una transformación que transforma linealmente los puntos de la caja delimitadora unitaria a una `Bbox` dada con una izquierda superior fija de (0, 0).

source: A "blended" transform uses one transform for the *x*-direction, and another transform for the *y*-direction.
es_es: Una transformación "blended" utiliza una transformación para la dirección *x*, y otra transformación para la dirección *y*.

source: This version is an optimization for the case where both child transforms are of type `Affine2DBase`.
es_es: Esta versión es una optimización para el caso en que ambas transformaciones hijas sean de tipo `Affine2DBase`.

source: Create a new "blended" transform using *x_transform* to transform the *x*-axis and *y_transform* to transform the *y*-axis.
es_es: Crea una nueva transformación "blended" usando *x_transform* para transformar el eje *x* y *y_transform* para transformar el eje *y*.

source: Both *x_transform* and *y_transform* must be 2D affine transforms.
es_es: Tanto *x_transform* como *y_transform* deben ser transformaciones afines 2D.

source: You will generally not call this constructor directly but use the `blended_transform_factory` function instead, which can determine automatically which kind of blended transform to create.
es_es: Por lo general, no se llamará a este constructor directamente, sino que se utilizará la función `blended_transform_factory` en su lugar, que puede determinar automáticamente qué tipo de transformación mezclada crear.

source: This "generic" version can handle any given child transform in the *x*- and *y*-directions.
es_es: Esta versión "genérica" puede manejar cualquier child transform dada en las direcciones *x*- y *y*.

source: Return whether the given transform is a sub-tree of this transform.
es_es: Devuelve si la transformación dada es un subárbol de esta transformación.

source: This routine uses transform equality to identify sub-trees, therefore in many situations it is object id which will be used.
es_es: Esta rutina utiliza la igualdad de transform para identificar los subárboles, por lo que en muchas situaciones es el id del objeto el que se utilizará.

source: For the case where the given transform represents the whole of this transform, returns True.
es_es: Para el caso en que la transformada dada representa la totalidad de esta transformada, devuelve True.

source: Return the number of transforms which have been chained together to form this Transform instance.
es_es: Devuelve el número de transformaciones que se han encadenado para formar esta instancia de Transform.

source: For the special case of a Composite transform, the maximum depth of the two is returned.
es_es: Para el caso especial de una transformación compuesta, se devuelve la profundidad máxima de las dos.

source: If pass_through is True, all ancestors will always be invalidated, even if 'self' is already invalid.
es_es: Si pass_through es True, todos los ancestros serán siempre invalidados, incluso si 'self' ya es inválido.

source: A composite transform formed by applying transform *a* then transform *b*.
es_es: Una transformación compuesta formada aplicando la transformación *a* y luego la transformación *b*.

source: This version is an optimization that handles the case where both *a* and *b* are 2D affines.
es_es: Esta versión es una optimización que maneja el caso en que tanto *a* como *b* sean afines 2D.

source: Create a new composite transform that is the result of applying `Affine2DBase` *a* then `Affine2DBase` *b*.
es_es: Crea una nueva transformación compuesta que es el resultado de aplicar `Affine2DBase` *a* y luego `Affine2DBase` *b*.

source: You will generally not call this constructor directly but write ``a + b`` instead, which will automatically choose the best kind of composite transform instance to create.
es_es: Por lo general, no llamarás a este constructor directamente, sino que escribirás ``a + b`` en su lugar, lo que elegirá automáticamente el mejor tipo de instancia de transformación compuesta para crear.

source: This "generic" version can handle any two arbitrary transformations.
es_es: Esta versión "genérica" puede manejar dos transformaciones arbitrarias cualesquiera.

source: Create a new composite transform that is the result of applying transform *a* then transform *b*.
es_es: Crea una nueva transformación compuesta que es el resultado de aplicar la transformación *a* y luego la transformación *b*.

source: A special class that does one thing, the identity transform, in a fast way.
es_es: Una clase especial que hace una cosa, la transformación de identidad, de forma rápida.

source: A `Bbox` where some elements may be locked at certain values.
es_es: Una `Bbox` en la que algunos elementos pueden estar bloqueados en ciertos valores.

source: When the child bounding box changes, the bounds of this bbox will update accordingly with the exception of the locked elements.
es_es: Cuando la caja delimitadora hija cambia, los límites de esta bbox se actualizarán en consecuencia con la excepción de los elementos bloqueados.

source: The child bounding box to wrap.
es_es: El cuadro delimitador hijo a envolver.

source: The locked value for x0, or None to leave unlocked.
es_es: El valor bloqueado para x0, o None para dejarlo desbloqueado.

source: The locked value for y0, or None to leave unlocked.
es_es: El valor bloqueado para y0, o None para dejarlo desbloqueado.

source: The locked value for x1, or None to leave unlocked.
es_es: El valor bloqueado para x1, o None para dejarlo desbloqueado.

source: The locked value for y1, or None to leave unlocked.
es_es: El valor bloqueado para y1, o None para dejarlo desbloqueado.

source: float or None: The value used for the locked x0.
es_es: float o None: El valor utilizado para el x0 bloqueado.

source: float or None: The value used for the locked x1.
es_es: float o None: El valor utilizado para el x1 bloqueado.

source: float or None: The value used for the locked y0.
es_es: float o None: El valor utilizado para el y0 bloqueado.

source: float or None: The value used for the locked y1.
es_es: float o None: El valor utilizado para el y1 bloqueado.

source: A transformation that translates by *xt* and *yt*, after *xt* and *yt* have been transformed by *scale_trans*.
es_es: Una transformación que traduce por *xt* y *yt*, después de que *xt* y *yt* hayan sido transformados por *scale_trans*.

source: The base class of all `TransformNode` instances that actually perform a transformation.
es_es: La clase base de todas las instancias de `TransformNode` que realmente realizan una transformación.

source: All non-affine transformations should be subclasses of this class. New affine transformations should be subclasses of `Affine2D`.
es_es: Todas las transformaciones no afines deben ser subclases de esta clase. Las nuevas transformaciones afines deben ser subclases de `Affine2D`.

source: Subclasses of this class should override the following members (at minimum):
es_es: Las subclases de esta clase deberían anular los siguientes miembros (como mínimo):

source: :meth:`inverted` (if an inverse exists)
es_es: :meth:`inverted` (si existe una inversa)

source: The following attributes may be overridden if the default is unsuitable:
es_es: Los siguientes atributos pueden ser anulados si el valor por defecto no es adecuado:

source: :attr:`is_separable` (defaults to True for 1D -> 1D transforms, False otherwise)
es_es: :attr:`is_separable` (por defecto True para transformaciones 1D -> 1D, False en caso contrario)

source: :attr:`has_inverse` (defaults to True if :meth:`inverted` is overridden, False otherwise)
es_es: :attr:`has_inverse` (por defecto True si se anula :meth:`inverted`, False en caso contrario)

source: If the transform needs to do something non-standard with `matplotlib.path.Path` objects, such as adding curves where there were once line segments, it should override:
es_es: Si la transformación necesita hacer algo no estándar con los objetos `matplotlib.path.Path`, como añadir curvas donde antes había segmentos de línea, debe anular:

source: Compose two transforms together so that *self* is followed by *other*.
es_es: Componer dos transformaciones juntas para que *self* sea seguido por *other*.

source: ``A + B`` returns a transform ``C`` so that ``C.transform(x) == B.transform(A.transform(x))``.
es_es: ``A + B`` devuelve una transformación ``C`` para que ``C.transform(x) == B.transform(A.transform(x))``.

source: This method is called when a class is subclassed.
es_es: Este método es llamado cuando una clase es subclasificada.

source: The default implementation does nothing. It may be overridden to extend subclasses.
es_es: La implementación por defecto no hace nada. Se puede anular para extender las subclases.

source: Compose *self* with the inverse of *other*, cancelling identical terms if any::
es_es: Componer *self* con la inversa de *other*, cancelando los términos idénticos si los hay::

source: Cancellation (rather than naively returning ``A + B.inverted()``) is important for multiple reasons:
es_es: La cancelación (en lugar de devolver ingenuamente ``A + B.inverted()``) es importante por múltiples razones:

source: It avoids floating-point inaccuracies when computing the inverse of B: ``B - B`` is guaranteed to cancel out exactly (resulting in the identity transform), whereas ``B + B.inverted()`` may differ by a small epsilon.
es_es: Evita las imprecisiones de punto flotante al calcular la inversa de B: se garantiza que ``B - B`` se cancela exactamente (dando lugar a la transformada de identidad), mientras que ``B + B.inverted()`` puede diferir por un pequeño épsilon.
