Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/transformations.po
Languages: es_es

source: ``B.inverted()`` always returns a frozen transform: if one computes ``A + B + B.inverted()`` and later mutates ``B``, then ``B.inverted()`` won't be updated and the last two terms won't cancel out anymore; on the other hand, ``A + B - B`` will always be equal to ``A`` even if ``B`` is mutated.
es_es: ``B.inverted()`` siempre devuelve una transformación congelada: si se calcula ``A + B + B.inverted()`` y posteriormente se muta ``B``, entonces ``B.inverted()`` no se actualizará y los dos últimos términos ya no se cancelarán; por otro lado, ``A + B - B`` siempre será igual a ``A`` aunque se mute ``B``.

source: Return whether the given branch is a sub-tree of this transform on each separate dimension.
es_es: Devuelve si la rama dada es un subárbol de esta transformada en cada dimensión separada.

source: A common use for this method is to identify if a transform is a blended transform containing an axes' data transform. e.g.::
es_es: Un uso común para este método es identificar si una transformación es una transformación mezclada que contiene una transformación de datos de los ejes. por ejemplo.::

source: Transform a set of angles anchored at specific locations.
es_es: Transformar un conjunto de ángulos anclados en lugares específicos.

source: **angles**
es_es: **Ángulos**

source: (N,) array-like
es_es: (N,) tipo array

source: The angles to transform.
es_es: Los ángulos a transformar.

source: (N, 2) array-like
es_es: (N, 2) tipo array

source: The points where the angles are anchored.
es_es: Los puntos donde se anclan los ángulos.

source: **radians**
es_es: **radianes**

source: bool, default: False
es_es: bool, por defecto: False

source: Whether *angles* are radians or degrees.
es_es: Si los *ángulos* son radianes o grados.

source: For each point in *pts* and angle in *angles*, the transformed angle is computed by transforming a segment of length *pushoff* starting at that point and making that angle relative to the horizontal axis, and measuring the angle between the horizontal axis and the transformed segment.
es_es: Para cada punto en *pts* y ángulo en *angles*, el ángulo transformado se calcula transformando un segmento de longitud *pushoff* que comienza en ese punto y hace ese ángulo respecto al eje horizontal, y midiendo el ángulo entre el eje horizontal y el segmento transformado.

source: Transform the given bounding box.
es_es: Transformar la caja delimitadora dada.

source: For smarter transforms including caching (a common requirement in Matplotlib), see `TransformedBbox`.
es_es: Para las transformaciones más inteligentes que incluyen el almacenamiento en caché (un requisito común en Matplotlib), ver `TransformedBbox`.

source: Return a transformed point.
es_es: Devuelve un punto transformado.

source: This function is only kept for backcompatibility; the more general `.transform` method is capable of transforming both a list of points and a single point.
es_es: Esta función sólo se mantiene por retrocompatibilidad; el método más general `.transform` es capaz de transformar tanto una lista de puntos como un único punto.

source: The point is given as a sequence of length :attr:`input_dims`. The transformed point is returned as a sequence of length :attr:`output_dims`.
es_es: El punto se da como una secuencia de longitud :attr:`input_dims`. El punto transformado se devuelve como una secuencia de longitud :attr:`output_dims`.

source: list of weak references to the object (if defined)
es_es: lista de referencias débiles al objeto (si está definido)

source: Invalidate this `TransformNode` and triggers an invalidation of its ancestors. Should be called any time the transform changes.
es_es: Invalida este `TransformNode` y provoca la invalidación de sus ancestros. Debe ser llamado cada vez que la transformación cambia.

source: Set the children of the transform, to let the invalidation system know which transforms can invalidate this transform. Should be called from the constructor of any transforms that depend on other transforms.
es_es: Establece los hijos de la transformación, para que el sistema de invalidación sepa qué transformaciones pueden invalidar esta transformación. Debe ser llamado desde el constructor de cualquier transformación que dependa de otras transformaciones.

source: A helper class that holds a single child transform and acts equivalently to it.
es_es: Una clase de ayuda que contiene un único transform hijo y actúa de forma equivalente a éste.

source: This is useful if a node of the transform tree must be replaced at run time with a transform of a different type. This class allows that replacement to correctly trigger invalidation.
es_es: Esto es útil si un nodo del árbol de transformaciones debe ser reemplazado en tiempo de ejecución con una transformación de un tipo diferente. Esta clase permite que esa sustitución active correctamente la invalidación.

source: `TransformWrapper` instances must have the same input and output dimensions during their entire lifetime, so the child transform may only be replaced with another child transform of the same dimensions.
es_es: Las instancias de `TransformWrapper` deben tener las mismas dimensiones de entrada y salida durante toda su vida, por lo que la transformación hija sólo puede ser reemplazada por otra transformación hija de las mismas dimensiones.

source: *child*: A `Transform` instance. This child may later be replaced with :meth:`set`.
es_es: *child*: Una instancia de `Transformación`. Este hijo puede ser sustituido posteriormente por :meth:`set`.

source: Replace the current child of this transform with another one.
es_es: Reemplazar el hijo actual de este transform por otro.

source: The new child must have the same number of input and output dimensions as the current child.
es_es: El nuevo hijo debe tener el mismo número de dimensiones de entrada y salida que el hijo actual.

source: A `Bbox` that is automatically transformed by a given transform. When either the child bounding box or transform changes, the bounds of this bbox will update accordingly.
es_es: Una `Bbox` que es transformada automáticamente por una transformación dada. Cuando la caja delimitadora hija o la transformación cambien, los límites de esta bbox se actualizarán en consecuencia.

source: **transform** : `Transform`
es_es: **transformación** : `Transformación`

source: Transform
es_es: Transformación

source: A `TransformedPatchPath` caches a non-affine transformed copy of the `~.patches.Patch`. This cached copy is automatically updated when the non-affine part of the transform or the patch changes.
es_es: Un `TransformedPatchPath` almacena en caché una copia transformada no fina del `~.patches.Patch`. Esta copia en caché se actualiza automáticamente cuando la parte no afín de la transformación o el parche cambia.

source: Patch
es_es: Parche

source: A `TransformedPath` caches a non-affine transformed copy of the `~.path.Path`. This cached copy is automatically updated when the non-affine part of the transform changes.
es_es: Un `TransformedPath` almacena en caché una copia transformada no afín del `~.path.Path`. Esta copia en caché se actualiza automáticamente cuando la parte no afín de la transformación cambia.

source: Paths are considered immutable by this class. Any update to the path's vertices/codes will not trigger a transform recomputation.
es_es: Las trayectorias son consideradas inmutables por esta clase. Cualquier actualización de los vértices/códigos de la ruta no provocará un recálculo de la transformación.

source: **path** : `~.path.Path`
es_es: **Ruta** : `~.path.Path`

source: Return a fully-transformed copy of the child path.
es_es: Devuelve una copia completamente transformada de la ruta hija.

source: Return a copy of the child path, with the non-affine part of the transform already applied, along with the affine part of the path necessary to complete the transformation.
es_es: Devuelve una copia del camino hijo, con la parte no afín de la transformación ya aplicada, junto con la parte afín del camino necesaria para completar la transformación.

source: Return a copy of the child path, with the non-affine part of the transform already applied, along with the affine part of the path necessary to complete the transformation. Unlike :meth:`get_transformed_path_and_affine`, no interpolation will be performed.
es_es: Devuelve una copia del camino hijo, con la parte no afín de la transformación ya aplicada, junto con la parte afín del camino necesaria para completar la transformación. A diferencia de :meth:`get_transformed_path_and_affine`, no se realizará ninguna interpolación.

source: A faster version of the blended transform is returned for the case where both child transforms are affine.
es_es: Se devuelve una versión más rápida de la transformación mezclada para el caso en que ambas transformaciones hijas sean afines.

source: Create a new composite transform that is the result of applying transform a then transform b.
es_es: Crea una nueva transformación compuesta que es el resultado de aplicar la transformación a y luego la transformación b.

source: Shortcut versions of the blended transform are provided for the case where both child transforms are affine, or one or the other is the identity transform.
es_es: Se proporcionan versiones abreviadas de la transformada combinada para el caso en que ambas transformadas hijas sean afines, o una u otra sea la transformada de identidad.

source: Composite transforms may also be created using the '+' operator, e.g.::
es_es: Las transformaciones compuestas también pueden ser creadas usando el operador '+', por ejemplo.::

source: Check, inclusively, whether an interval includes a given value.
es_es: Comprueba, de forma inclusiva, si un intervalo incluye un valor dado.

source: **interval**
es_es: **intervalo**

source: The endpoints of the interval.
es_es: Los puntos finales del intervalo.

source: Value to check is within interval.
es_es: El valor a comprobar está dentro del intervalo.

source: Whether *val* is within the *interval*.
es_es: Si *val* está dentro del *intervalo*.

source: Check, excluding endpoints, whether an interval includes a given value.
es_es: Comprueba, excluyendo los puntos finales, si un intervalo incluye un valor dado.

source: Modify the endpoints of a range as needed to avoid singularities.
es_es: Modificar los puntos finales de un intervalo según sea necesario para evitar singularidades.

source: The initial endpoints.
es_es: Los puntos finales iniciales.

source: **expander**
es_es: **expansor**

source: float, default: 0.001
es_es: float, por defecto: 0.001

source: Fractional amount by which *vmin* and *vmax* are expanded if the original interval is too small, based on *tiny*.
es_es: Cantidad fraccionaria por la que *vmin* y *vmax* se expanden si el intervalo original es demasiado pequeño, basado en *tiny*.

source: float, default: 1e-15
es_es: float, por defecto: 1e-15

source: Threshold for the ratio of the interval to the maximum absolute value of its endpoints. If the interval is smaller than this, it will be expanded. This value should be around 1e-15 or larger; otherwise the interval will be approaching the double precision resolution limit.
es_es: Umbral para la relación entre el intervalo y el valor absoluto máximo de sus extremos. Si el intervalo es menor que esto, se expandirá. Este valor debe ser alrededor de 1e-15 o mayor; de lo contrario, el intervalo se acercará al límite de resolución de doble precisión.

source: **increasing**
es_es: **incrementando**

source: If True, swap *vmin*, *vmax* if *vmin* > *vmax*.
es_es: Si es True, intercambiar *vmin*, *vmax* si *vmin* > *vmax*.

source: Endpoints, expanded and/or swapped if necessary. If either input is inf or NaN, or if both inputs are 0 or very close to zero, it returns -*expander*, *expander*.
es_es: Puntos finales, expandidos y/o intercambiados si es necesario. Si cualquiera de las entradas es inf o NaN, o si ambas entradas son 0 o muy cercanas a cero, devuelve -*expander*, *expander*.

source: Return a new transform with an added offset.
es_es: Devuelve una nueva transformación con un desplazamiento añadido.

source: **trans** : `Transform` subclass
es_es: **trans** : Subclase de `Transformación`

source: Transform subclass
es_es: Subclase Transform

source: Any transform, to which offset will be applied.
es_es: Cualquier transformación, a la que se aplicará el offset.

source: **fig** : `~matplotlib.figure.Figure`, default: None
es_es: **fig** : `~matplotlib.figure.Figure`, por defecto: None

source: Figure, default: None
es_es: Figura, por defecto: None

source: Current figure. It can be None if *units* are 'dots'.
es_es: Figura actual. Puede ser None si las *unidades* son 'dots'.

source: float, default: 0.0
es_es: float, por defecto: 0.0

source: The offset to apply.
es_es: El desplazamiento a aplicar.

source: **units**
es_es: **Unidades**

source: {'inches', 'points', 'dots'}, default: 'inches'
es_es: {'pulgadas', 'puntos', 'puntos'}, por defecto: 'pulgadas'

source: Units of the offset.
es_es: Unidades del desplazamiento.

source: `Transform` subclass
es_es: Subclase de `Transformación`

source: Transform with applied offset.
es_es: Transformación con desplazamiento aplicado.
