Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/tri_api.po
Languages: es_es

source: Unstructured triangular grid functions.
es_es: Funciones de rejilla triangular no estructuradas.

source: An unstructured triangular grid consisting of npoints points and ntri triangles. The triangles can either be specified by the user or automatically generated using a Delaunay triangulation.
es_es: Una rejilla triangular no estructurada que consta de n puntos y ntri triángulos. Los triángulos pueden ser especificados por el usuario o generados automáticamente utilizando una triangulación de Delaunay.

source: Parameters
es_es: Parámetros

source: (npoints,) array-like
es_es: (npoints,) tipo array

source: Coordinates of grid points.
es_es: Coordenadas de los puntos de la cuadrícula.

source: **triangles**
es_es: **Triángulos**

source: (ntri, 3) array-like of int, optional
es_es: (ntri, 3) tipo array de int, opcional

source: For each triangle, the indices of the three points that make up the triangle, ordered in an anticlockwise manner. If not specified, the Delaunay triangulation is calculated.
es_es: Para cada triángulo, los índices de los tres puntos que lo componen, ordenados en sentido contrario a las agujas del reloj. Si no se especifica, se calcula la triangulación de Delaunay.

source: **mask**
es_es: **Máscara**

source: (ntri,) array-like of bool, optional
es_es: (ntri,) array-like of bool, opcional

source: Which triangles are masked out.
es_es: Qué triángulos se enmascaran.

source: Notes
es_es: Notas

source: For a Triangulation to be valid it must not have duplicate points, triangles formed from colinear points, or overlapping triangles.
es_es: Para que una triangulación sea válida no debe tener puntos duplicados, triángulos formados a partir de puntos colineales o triángulos superpuestos.

source: Attributes
es_es: Atributos

source: (ntri, 3) array of int
es_es: (ntri, 3) array de int

source: For each triangle, the indices of the three points that make up the triangle, ordered in an anticlockwise manner. If you want to take the *mask* into account, use `get_masked_triangles` instead.
es_es: Para cada triángulo, los índices de los tres puntos que lo componen, ordenados en sentido contrario a las agujas del reloj. Si quieres tener en cuenta la *máscara*, utiliza `get_masked_triangles` en su lugar.

source: Masked out triangles.
es_es: Triángulos enmascarados.

source: Whether the Triangulation is a calculated Delaunay triangulation (where *triangles* was not specified) or not.
es_es: Si la triangulación es una triangulación de Delaunay calculada (donde no se especificó *triangles*) o no.

source: Calculate plane equation coefficients for all unmasked triangles from the point (x, y) coordinates and specified z-array of shape (npoints). The returned array has shape (npoints, 3) and allows z-value at (x, y) position in triangle tri to be calculated using ``z = array[tri, 0] * x + array[tri, 1] * y + array[tri, 2]``.
es_es: Calcula los coeficientes de la ecuación del plano para todos los triángulos no enmascarados a partir de las coordenadas de los puntos (x, y) y el array de forma (npuntos) especificado. El array devuelto tiene forma (npoints, 3) y permite calcular el valor z en la posición (x, y) del triángulo usando ``z = array[tri, 0] * x + array[tri, 1] * y + array[tri, 2]``.

source: Return integer array of shape (nedges, 2) containing all edges of non-masked triangles.
es_es: Devuelve un array de enteros de forma (nedges, 2) que contiene todas las aristas de los triángulos no enmascarados.

source: Each row defines an edge by it's start point index and end point index. Each edge appears only once, i.e. for an edge between points *i* and *j*, there will only be either *(i, j)* or *(j, i)*.
es_es: Cada fila define un arist por su índice de punto inicial y su índice de punto final. Cada arist aparece sólo una vez, es decir, para una arista entre los puntos *i* y *j*, sólo habrá *(i, j)* o *(j, i)*.

source: Return the underlying C++ Triangulation object, creating it if necessary.
es_es: Devuelve el objeto de triangulación C++ subyacente, creándolo si es necesario.

source: Return a Triangulation object from the args and kwargs, and the remaining args and kwargs with the consumed values removed.
es_es: Devuelve un objeto Triangulación a partir de los args y kwargs, y el resto de args y kwargs con los valores consumidos eliminados.

source: There are two alternatives: either the first argument is a Triangulation object, in which case it is returned, or the args and kwargs are sufficient to create a new Triangulation to return. In the latter case, see Triangulation.__init__ for the possible args and kwargs.
es_es: Hay dos alternativas: o bien el primer argumento es un objeto Triangulación, en cuyo caso se devuelve, o bien los args y kwargs son suficientes para crear una nueva Triangulación a devolver. En este último caso, ver Triangulation.__init__ para los posibles args y kwargs.

source: Return an array of triangles that are not masked.
es_es: Devuelve un array de triángulos que no están enmascarados.

source: Return the default `matplotlib.tri.TriFinder` of this triangulation, creating it if necessary. This allows the same TriFinder object to be easily shared.
es_es: Devuelve el `matplotlib.tri.TriFinder` por defecto de esta triangulación, creándolo si es necesario. Esto permite compartir fácilmente el mismo objeto TriFinder.

source: Return integer array of shape (ntri, 3) containing neighbor triangles.
es_es: Devuelve un array de enteros de forma (ntri, 3) que contiene los triángulos vecinos.

source: For each triangle, the indices of the three triangles that share the same edges, or -1 if there is no such neighboring triangle. ``neighbors[i, j]`` is the triangle that is the neighbor to the edge from point index ``triangles[i, j]`` to point index ``triangles[i, (j+1)%3]``.
es_es: Para cada triángulo, los índices de los tres triángulos que comparten las mismas aristas, o -1 si no hay ningún triángulo vecino. ``neighbors[i, j]`` es el triángulo que es vecino de la arista desde el índice del punto ``triangles[i, j]`` hasta el índice del punto ``triangles[i, (j+1)%3]``.

source: Set or clear the mask array.
es_es: Establecer o borrar el array de máscaras.

source: None or bool array of length ntri
es_es: None o bool array de longitud ntri

source: Create and store a set of contour lines or filled regions for a triangular grid.
es_es: Crea y almacena un conjunto de líneas de contorno o regiones rellenas para una malla triangular.

source: This class is typically not instantiated directly by the user but by `~.Axes.tricontour` and `~.Axes.tricontourf`.
es_es: Esta clase normalmente no es instanciada directamente por el usuario sino por `~.Axes.tricontour` y `~.Axes.tricontourf`.

source: Axes
es_es: Ejes

source: The Axes object in which the contours are drawn.
es_es: El objeto Axes en el que se dibujan los contornos.

source: **collections** : `.silent_list` of `.PathCollection`\s
es_es: **colecciones** : `.silent_list` of `.PathCollection`s

source: silent_list of PathCollections
es_es: silent_list de PathCollections

source: The `.Artist`\s representing the contour. This is a list of `.PathCollection`\s for both line and filled contours.
es_es: Los `.Artist`s que representan el contorno. Se trata de una lista de `.PathCollection`s para los contornos de línea y de relleno.

source: **levels**
es_es: **Niveles**

source: The values of the contour levels.
es_es: Los valores de los niveles de contorno.

source: **layers**
es_es: **Los niveles**

source: Same as levels for line contours; half-way between levels for filled contours. See ``ContourSet._process_colors``.
es_es: Igual que los niveles para los contornos lineales; la mitad de los niveles para los contornos rellenos. Ver ``ContourSet._process_colors``.

source: Draw triangular grid contour lines or filled regions, depending on whether keyword arg 'filled' is False (default) or True.
es_es: Dibuja líneas de contorno de rejilla triangular o regiones rellenas, dependiendo de si la palabra clave arg 'filled' es False (por defecto) o True.

source: The first argument of the initializer must be an axes object. The remaining arguments and keyword arguments are described in the docstring of `~.Axes.tricontour`.
es_es: El primer argumento del inicializador debe ser un objeto eje. Los argumentos restantes y los argumentos de palabra clave se describen en el docstring de `~.Axes.tricontour`.

source: Abstract base class for classes used to find the triangles of a Triangulation in which (x, y) points lie.
es_es: Clase base abstracta para las clases utilizadas, para encontrar los triángulos de una Triangulación en los que se encuentran los puntos (x, y).

source: Rather than instantiate an object of a class derived from TriFinder, it is usually better to use the function `.Triangulation.get_trifinder`.
es_es: En lugar de instanciar un objeto de una clase derivada de TriFinder, suele ser mejor utilizar la función `.Triangulation.get_trifinder`.

source: Derived classes implement __call__(x, y) where x and y are array-like point coordinates of the same shape.
es_es: Las clases derivadas implementan __call__(x, y) donde x e y son coordenadas de puntos tipo array de la misma forma.

source: `~matplotlib.tri.TriFinder` class implemented using the trapezoid map algorithm from the book "Computational Geometry, Algorithms and Applications", second edition, by M. de Berg, M. van Kreveld, M. Overmars and O. Schwarzkopf.
es_es: Clase `~matplotlib.tri.TriFinder` implementada utilizando el algoritmo del mapa trapezoidal del libro "Computational Geometry, Algorithms and Applications", segunda edición, de M. de Berg, M. van Kreveld, M. Overmars y O. Schwarzkopf.

source: The triangulation must be valid, i.e. it must not have duplicate points, triangles formed from colinear points, or overlapping triangles. The algorithm has some tolerance to triangles formed from colinear points, but this should not be relied upon.
es_es: La triangulación debe ser válida, es decir, no debe tener puntos duplicados, triángulos formados a partir de puntos colineales o triángulos superpuestos. El algoritmo tiene cierta tolerancia con los triángulos formados a partir de puntos colineales, pero no se debe confiar en ello.

source: Abstract base class for classes used to interpolate on a triangular grid.
es_es: Clase base abstracta para las clases utilizadas para interpolar en una rejilla triangular.

source: Derived classes implement the following methods:
es_es: Las clases derivadas implementan los siguientes métodos:

source: ``__call__(x, y)``, where x, y are array-like point coordinates of the same shape, and that returns a masked array of the same shape containing the interpolated z-values.
es_es: ``__call__(x, y)``, donde x, y son coordenadas de puntos tipo array de la misma forma, y que devuelve un array enmascarado de la misma forma que contiene los valores z interpolados.

source: ``gradient(x, y)``, where x, y are array-like point coordinates of the same shape, and that returns a list of 2 masked arrays of the same shape containing the 2 derivatives of the interpolator (derivatives of interpolated z values with respect to x and y).
es_es: ``gradiente(x, y)``, donde x, y son coordenadas de puntos tipo array de la misma forma, y que devuelve una lista de 2 arrays enmascarados de la misma forma que contienen las 2 derivadas del interpolador (derivadas de los valores de z interpolados respecto a x e y).

source: Linear interpolator on a triangular grid.
es_es: Interpolador lineal en una malla triangular.

source: Each triangle is represented by a plane so that an interpolated value at point (x, y) lies on the plane of the triangle containing (x, y). Interpolated values are therefore continuous across the triangulation, but their first derivatives are discontinuous at edges between triangles.
es_es: Cada triángulo está representado por un plano de manera que un valor interpolado en el punto (x, y) se encuentra en el plano del triángulo que contiene (x, y). Los valores interpolados son por tanto continuos a lo largo de la triangulación, pero sus primeras derivadas son discontinuas en los bordes entre triángulos.

source: **triangulation** : `~matplotlib.tri.Triangulation`
es_es: **triangulación** : `~matplotlib.tri.Triangulation`

source: Triangulation
es_es: Triangulación

source: The triangulation to interpolate over.
es_es: La triangulación sobre la que interpolar.

source: Array of values, defined at grid points, to interpolate between.
es_es: Array de valores, definidos en los puntos de la cuadrícula, para interpolar entre ellos.

source: TriFinder, optional
es_es: TriFinder, opcional

source: If this is not specified, the Triangulation's default TriFinder will be used by calling `.Triangulation.get_trifinder`.
es_es: Si no se especifica, se utilizará el TriFinder por defecto de la triangulación llamando a `.Triangulation.get_trifinder`.

source: Methods
es_es: Métodos

source: (Returns interpolated values at (x, y) points.)
es_es: (Devuelve los valores interpolados en los puntos (x, y))

source: (Returns interpolated derivatives at (x, y) points.)
es_es: (Devuelve las derivadas interpoladas en los puntos (x, y))

source: Returns a list of 2 masked arrays containing interpolated derivatives at the specified (x, y) points.
es_es: Devuelve una lista de 2 matrices enmascaradas que contienen las derivadas interpoladas en los puntos (x, y) especificados.

source: x and y coordinates of the same shape and any number of dimensions.
es_es: coordenadas x e y de la misma forma y cualquier número de dimensiones.

source: Returns
es_es: Devuelve

source: 2 masked arrays of the same shape as *x* and *y*; values corresponding to (x, y) points outside of the triangulation are masked out. The first returned array contains the values of :math:`\frac{\partial z}{\partial x}` and the second those of :math:`\frac{\partial z}{\partial y}`.
es_es: 2 matrices enmascaradas de la misma forma que *x* y *y*; los valores correspondientes a los puntos (x, y) fuera de la triangulación se enmascaran. La primera matriz devuelta contiene los valores de :math:`\frac{parcial z}{parcial x}` y la segunda los de :math:`\frac{parcial z}{parcial y}`.

source: Cubic interpolator on a triangular grid.
es_es: Interpolador cúbico en una malla triangular.

source: In one-dimension - on a segment - a cubic interpolating function is defined by the values of the function and its derivative at both ends. This is almost the same in 2D inside a triangle, except that the values of the function and its 2 derivatives have to be defined at each triangle node.
es_es: En una dimensión -en un segmento- una función interpoladora cúbica está definida por los valores de la función y su derivada en ambos extremos. Esto es casi lo mismo en 2D dentro de un triángulo, excepto que los valores de la función y sus 2 derivadas tienen que ser definidos en cada nodo del triángulo.

source: The CubicTriInterpolator takes the value of the function at each node - provided by the user - and internally computes the value of the derivatives, resulting in a smooth interpolation. (As a special feature, the user can also impose the value of the derivatives at each node, but this is not supposed to be the common usage.)
es_es: El CubicTriInterpolator toma el valor de la función en cada nodo -proporcionado por el usuario- y calcula internamente el valor de las derivadas, dando como resultado una interpolación suave. (Como característica especial, el usuario también puede imponer el valor de las derivadas en cada nodo, pero se supone que este no es el uso común)

source: {'min_E', 'geom', 'user'}, optional
es_es: {'min_E', 'geom', 'user'}, opcional

source: Choice of the smoothing algorithm, in order to compute the interpolant derivatives (defaults to 'min_E'):
es_es: Elección del algoritmo de suavizado, para calcular las derivadas interpolantes (por defecto es 'min_E'):

source: if 'min_E': (default) The derivatives at each node is computed to minimize a bending energy.
es_es: if 'min_E': (por defecto) Las derivadas en cada nodo se calculan para minimizar una energía de flexión.

source: if 'geom': The derivatives at each node is computed as a weighted average of relevant triangle normals. To be used for speed optimization (large grids).
es_es: si 'geom': Las derivadas en cada nodo se calculan como una media ponderada de las normales relevantes del triángulo. Para ser utilizado para la optimización de la velocidad (mallas grandes).

source: if 'user': The user provides the argument *dz*, no computation is hence needed.
es_es: si 'user': El usuario proporciona el argumento *dz*, por lo que no es necesario ningún cálculo.

source: If not specified, the Triangulation's default TriFinder will be used by calling `.Triangulation.get_trifinder`.
es_es: Si no se especifica, se utilizará el TriFinder por defecto de la triangulación llamando a `.Triangulation.get_trifinder`.

source: tuple of array-likes (dzdx, dzdy), optional
es_es: tupla de arrays similares (dzdx, dzdy), opcional

source: Used only if *kind* ='user'. In this case *dz* must be provided as (dzdx, dzdy) where dzdx, dzdy are arrays of the same shape as *z* and are the interpolant first derivatives at the *triangulation* points.
es_es: Se utiliza sólo si *kind* ='user'. En este caso *dz* debe proporcionarse como (dzdx, dzdy) donde dzdx, dzdy son matrices de la misma forma que *z* y son las primeras derivadas interpolantes en los puntos de *triangulación*.

source: This note is a bit technical and details how the cubic interpolation is computed.
es_es: Esta nota es un poco técnica y detalla de cómo se calcula la interpolación cúbica.

source: The interpolation is based on a Clough-Tocher subdivision scheme of the *triangulation* mesh (to make it clearer, each triangle of the grid will be divided in 3 child-triangles, and on each child triangle the interpolated function is a cubic polynomial of the 2 coordinates). This technique originates from FEM (Finite Element Method) analysis; the element used is a reduced Hsieh-Clough-Tocher (HCT) element. Its shape functions are described in [R0be0c58fd53f-1]_. The assembled function is guaranteed to be C1-smooth, i.e. it is continuous and its first derivatives are also continuous (this is easy to show inside the triangles but is also true when crossing the edges).
es_es: La interpolación se basa en un esquema de subdivisión de Clough-Tocher de la malla de *triangulación* (para que quede más claro, cada triángulo de la malla se dividirá en 3 triángulos hijos, y en cada triángulo hijo la función interpolada es un polinomio cúbico de las 2 coordenadas). Esta técnica tiene su origen en el análisis MEF (Método de los Elementos Finitos); el elemento utilizado es un elemento reducido de Hsieh-Clough-Tocher (HCT). Sus funciones de forma se describen en [R0be0c58fd53f-1]_. Se garantiza que la función ensamblada es C1-suave, es decir, es continua y sus primeras derivadas también son continuas (esto es fácil de mostrar dentro de los triángulos, pero también es cierto cuando se cruzan las aristas).

source: In the default case (*kind* ='min_E'), the interpolant minimizes a curvature energy on the functional space generated by the HCT element shape functions - with imposed values but arbitrary derivatives at each node. The minimized functional is the integral of the so-called total curvature (implementation based on an algorithm from [R0be0c58fd53f-2]_ - PCG sparse solver):
es_es: En el caso por defecto (*tipo* ='min_E'), el interpolante minimiza una energía de curvatura en el espacio funcional generado por las funciones de forma de los elementos HCT - con valores impuestos pero con derivadas arbitrarias en cada nodo. El funcional minimizado es la integral de la llamada curvatura total (implementación basada en un algoritmo de [R0be0c58fd53f-2]_ - PCG sparse solver):

source: If the case *kind* ='geom' is chosen by the user, a simple geometric approximation is used (weighted average of the triangle normal vectors), which could improve speed on very large grids.
es_es: Si el caso *kind* ='geom' es elegido por el usuario, se utiliza una simple aproximación geométrica (media ponderada de los vectores normales de los triángulos), lo que podría mejorar la velocidad en mallas muy grandes.

source: References
es_es: Referencias

source: Abstract base class for classes implementing mesh refinement.
es_es: Clase base abstracta para las clases que implementan el refinamiento de la malla.

source: A TriRefiner encapsulates a Triangulation object and provides tools for mesh refinement and interpolation.
es_es: Un TriRefiner encapsula un objeto de Triangulación y proporciona herramientas para el refinamiento de la malla y la interpolación.

source: Derived classes must implement:
es_es: Las clases derivadas deben implementar:

source: ``refine_triangulation(return_tri_index=False, **kwargs)`` , where the optional keyword arguments *kwargs* are defined in each TriRefiner concrete implementation, and which returns:
es_es: ``refine_triangulation(return_tri_index=False, **kwargs)``, donde los argumentos opcionales de la palabra clave *kwargs* se definen en cada implementación concreta de TriRefiner, y que devuelve:

source: a refined triangulation,
es_es: una triangulación refinada,

source: optionally (depending on *return_tri_index*), for each point of the refined triangulation: the index of the initial triangulation triangle to which it belongs.
es_es: opcionalmente (dependiendo de *return_tri_index*), para cada punto de la triangulación refinada: el índice del triángulo de la triangulación inicial al que pertenece.

source: *z* array of field values (to refine) defined at the base triangulation nodes,
es_es: *z* array de valores de campo (a refinar) definidos en los nodos de la triangulación base,

source: *triinterpolator* is an optional `~matplotlib.tri.TriInterpolator`,
es_es: *triinterpolator* es un `~matplotlib.tri.TriInterpolator` opcional,

source: the other optional keyword arguments *kwargs* are defined in each TriRefiner concrete implementation;
es_es: los otros argumentos opcionales de la palabra clave *kwargs* se definen en cada implementación concreta de TriRefiner;

source: and which returns (as a tuple) a refined triangular mesh and the interpolated values of the field at the refined triangulation nodes.
es_es: y que devuelve (como tupla) una malla triangular refinada y los valores interpolados del campo en los nodos de la triangulación refinada.

source: Uniform mesh refinement by recursive subdivisions.
es_es: Refinamiento de malla uniforme por subdivisiones recursivas.

source: The encapsulated triangulation (to be refined)
es_es: La triangulación encapsulada (a refinar)

source: Refine a field defined on the encapsulated triangulation.
es_es: Refinar un campo definido en la triangulación encapsulada.

source: Values of the field to refine, defined at the nodes of the encapsulated triangulation. (``n_points`` is the number of points in the initial triangulation)
es_es: Valores del campo a refinar, definidos en los nodos de la triangulación encapsulada. (``n_puntos`` es el número de puntos de la triangulación inicial)

source: **triinterpolator** : `~matplotlib.tri.TriInterpolator`, optional
es_es: **triinterpolator** : `~matplotlib.tri.TriInterpolator`, opcional

source: TriInterpolator, optional
es_es: TriInterpolator, opcional

source: Interpolator used for field interpolation. If not specified, a `~matplotlib.tri.CubicTriInterpolator` will be used.
es_es: Interpolador utilizado para la interpolación de campos. Si no se especifica, se utilizará un `~matplotlib.tri.CubicTriInterpolator`.

source: int, default: 3
es_es: int, por defecto: 3
