Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/tri_api.po
Languages: es_es

source: Recursion level for the subdivision. Each triangle is divided into ``4**subdiv`` child triangles.
es_es: Nivel de recursión para la subdivisión. Cada triángulo se divide en ``4**subdiv`` triángulos hijos.

source: The returned refined triangulation.
es_es: La triangulación refinada devuelta.

source: **refi_z** : 1D array of length: *refi_tri* node count.
es_es: **refi_z** : Matriz 1D de longitud: *refi_tri* conteo de nodos.

source: 1D array of length:
es_es: Matriz 1D de longitud:

source: The returned interpolated field (at *refi_tri* nodes).
es_es: El campo interpolado devuelto (en los nodos *refi_tri*).

source: Compute an uniformly refined triangulation *refi_triangulation* of the encapsulated :attr:`triangulation`.
es_es: Calcula una triangulación uniformemente refinada *refi_triangulation* del encapsulado :attr:`triangulation`.

source: This function refines the encapsulated triangulation by splitting each father triangle into 4 child sub-triangles built on the edges midside nodes, recursing *subdiv* times. In the end, each triangle is hence divided into ``4**subdiv`` child triangles.
es_es: Esta función refina la triangulación encapsulada dividiendo cada triángulo padre en 4 subtriángulos hijos construidos en los nodos de las aristas midside, recursando *subdiv* veces. Al final, cada triángulo se divide en ``4**subdiv`` triángulos hijos.

source: bool, default: False
es_es: bool, por defecto: False

source: Whether an index table indicating the father triangle index of each point is returned.
es_es: Si se devuelve una tabla de índices que indica el índice del triángulo padre de cada punto.

source: Recursion level for the subdivision. Each triangle is divided into ``4**subdiv`` child triangles; hence, the default results in 64 refined subtriangles for each triangle of the initial triangulation.
es_es: Nivel de recursión para la subdivisión. Cada triángulo se divide en ``4**subdiv`` triángulos hijos; por tanto, el resultado por defecto es de 64 subtriángulos refinados por cada triángulo de la triangulación inicial.

source: The refined triangulation.
es_es: La triangulación refinada.

source: Index of the initial triangulation containing triangle, for each point of *refi_triangulation*. Returned only if *return_tri_index* is set to True.
es_es: Índice de la triangulación inicial que contiene el triángulo, para cada punto de *refi_triangulation*. Se devuelve sólo si *refi_tri_index* se establece como True.

source: Define basic tools for triangular mesh analysis and improvement.
es_es: Definir herramientas básicas para el análisis y mejora de mallas triangulares.

source: A TriAnalyzer encapsulates a `.Triangulation` object and provides basic tools for mesh analysis and mesh improvement.
es_es: Un TriAnalyzer encapsula un objeto `.Triangulation` y proporciona herramientas básicas para el análisis y la mejora de la malla.

source: The encapsulated triangulation to analyze.
es_es: La triangulación encapsulada a analizar.

source: Factors to rescale the triangulation into a unit square.
es_es: Factores para reescalar la triangulación en un cuadrado unitario.

source: Return a measure of the triangulation triangles flatness.
es_es: Devuelve una medida de horizontalidad de los triángulos de la triangulación.

source: The ratio of the incircle radius over the circumcircle radius is a widely used indicator of a triangle flatness. It is always ``<= 0.5`` and ``== 0.5`` only for equilateral triangles. Circle ratios below 0.01 denote very flat triangles.
es_es: La relación del radio del círculo interior sobre el radio del círculo exterior es un indicador ampliamente utilizado de la horizontalidad de un triángulo. Siempre es ``<= 0,5`` y ``== 0,5`` sólo para los triángulos equiláteros. Las proporciones de los círculos por debajo de 0,01 denotan triángulos muy planos.

source: To avoid unduly low values due to a difference of scale between the 2 axis, the triangular mesh can first be rescaled to fit inside a unit square with `scale_factors` (Only if *rescale* is True, which is its default value).
es_es: Para evitar valores indebidamente bajos debido a una diferencia de escala entre los 2 ejes, la malla triangular puede ser reescalada primero para encajar dentro de un cuadrado unitario con `scale_factors` (Sólo si *rescale* es True, que es su valor por defecto).

source: **rescale**
es_es: **Reescalado**

source: bool, default: True
es_es: bool, por defecto: True

source: If True, internally rescale (based on `scale_factors`), so that the (unmasked) triangles fit exactly inside a unit square mesh.
es_es: Si es True, reescala internamente (basado en `scale_factors`), para que los triángulos (desenmascarados) encajen exactamente dentro de una malla cuadrada unitaria.

source: masked array
es_es: matriz enmascarada

source: Ratio of the incircle radius over the circumcircle radius, for each 'rescaled' triangle of the encapsulated triangulation. Values corresponding to masked triangles are masked out.
es_es: Relación del radio del incircle sobre el radio del circumcircle, para cada triángulo 'reescalado' de la triangulación encapsulada. Los valores correspondientes a los triángulos enmascarados están enmascarados.

source: Eliminate excessively flat border triangles from the triangulation.
es_es: Eliminar los triángulos de borde excesivamente planos de la triangulación.

source: Returns a mask *new_mask* which allows to clean the encapsulated triangulation from its border-located flat triangles (according to their :meth:`circle_ratios`). This mask is meant to be subsequently applied to the triangulation using `.Triangulation.set_mask`. *new_mask* is an extension of the initial triangulation mask in the sense that an initially masked triangle will remain masked.
es_es: Devuelve una máscara *new_mask* que permite limpiar la triangulación encapsulada de sus triángulos planos situados en el borde (según sus :meth:`circle_ratios`). Esta máscara está pensada para ser aplicada posteriormente a la triangulación utilizando `.Triangulation.set_mask`. *new_mask* es una extensión de la máscara inicial de la triangulación en el sentido de que un triángulo inicialmente enmascarado permanecerá enmascarado.

source: The *new_mask* array is computed recursively; at each step flat triangles are removed only if they share a side with the current mesh border. Thus no new holes in the triangulated domain will be created.
es_es: La matriz *new_mask* se calcula recursivamente; en cada paso se eliminan los triángulos planos sólo si comparten un lado con el borde de la malla actual. Así, no se crearán nuevos agujeros en el dominio triangulado.

source: float, default: 0.01
es_es: float, por defecto: 0.01

source: Border triangles with incircle/circumcircle radii ratio r/R will be removed if r/R < *min_circle_ratio*.
es_es: Los triángulos de los bordes con relación de radios incircle/circumcircle r/R serán eliminados si r/R < *min_circle_ratio*.

source: If True, first, internally rescale (based on `scale_factors`) so that the (unmasked) triangles fit exactly inside a unit square mesh. This rescaling accounts for the difference of scale which might exist between the 2 axis.
es_es: Si es True, primero reescala internamente (basado en `scale_factors`) para que los triángulos (sin máscara) encajen exactamente dentro de una malla cuadrada unitaria. Este reescalado tiene en cuenta la diferencia de escala que pueda existir entre los 2 ejes.

source: Mask to apply to encapsulated triangulation. All the initially masked triangles remain masked in the *new_mask*.
es_es: Máscara a aplicar a la triangulación encapsulada. Todos los triángulos inicialmente enmascarados permanecen enmascarados en la *nueva_máscara*.

source: The rationale behind this function is that a Delaunay triangulation - of an unstructured set of points - sometimes contains almost flat triangles at its border, leading to artifacts in plots (especially for high-resolution contouring). Masked with computed *new_mask*, the encapsulated triangulation would contain no more unmasked border triangles with a circle ratio below *min_circle_ratio*, thus improving the mesh quality for subsequent plots or interpolation.
es_es: La razón de ser de esta función es que una triangulación Delaunay - de un conjunto de puntos no estructurados - a veces contiene triángulos casi planos en su borde, lo que conduce a artefactos en los gráficos (especialmente para el contorno de alta resolución). Si se enmascara con *new_mask*, la triangulación encapsulada no contendrá más triángulos de borde sin enmascarar con una relación de círculo inferior a *min_circle_ratio*, lo que mejorará la calidad de la malla para posteriores trazados o interpolaciones.

source: Scaling factors (kx, ky) so that the triangulation ``[triangulation.x * kx, triangulation.y * ky]`` fits exactly inside a unit square.
es_es: Factores de escala (kx, ky) para que la triangulación ``[triangulación.x * kx, triangulación.y * ky]`` encaje exactamente dentro de un cuadrado unitario.
