Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/type1font.po
Languages: es_es

source: A class representing a Type 1 font.
es_es: Una clase que representa una fuente Tipo 1.

source: This version reads pfa and pfb files and splits them for embedding in pdf files. It also supports SlantFont and ExtendFont transformations, similarly to pdfTeX and friends. There is no support yet for subsetting.
es_es: Esta versión lee archivos pfa y pfb y los divide para incrustar en archivos pdf. También soporta transformaciones SlantFont y ExtendFont, de forma similar a pdfTeX y amigos. No hay soporte para subajustes.

source: Usage::
es_es: Uso::

source: Sources:
es_es: Fuentes:

source: Adobe Technical Note #5040, Supporting Downloadable PostScript Language Fonts.
es_es: Nota técnica de Adobe #5040, Soporte para descargar fuentes de idioma PostScript.

source: Adobe Type 1 Font Format, Adobe Systems Incorporated, third printing, v1.1, 1993. ISBN 0-201-57044-0.
es_es: Adobe Type 1 Font Format, Adobe Systems Incorporated, tercera impresión, v1.1, 1993. ISBN 0-201-57044-0.

source: A class representing a Type-1 font, for use by backends.
es_es: Una clase que representa una fuente Type-1, para uso por backends.

source: Attributes
es_es: Atributos

source: **parts**
es_es: **partes**

source: tuple
es_es: tupla

source: A 3-tuple of the cleartext part, the encrypted part, and the finale of zeros.
es_es: Una 3 tupla de la parte de texto claro, la parte cifrada, y el final de ceros.

source: **decrypted**
es_es: **descifrado**

source: The decrypted form of parts[1].
es_es: La forma descifrada de las partes[1].

source: A dictionary of font properties.
es_es: Un diccionario de propiedades de fuente.

source: Initialize a Type-1 font.
es_es: Inicializar una fuente Type-1.

source: Parameters
es_es: Parámetros

source: str or 3-tuple
es_es: str o 3 tupla

source: Either a pfb file name, or a 3-tuple of already-decoded Type-1 font `~.Type1Font.parts`.
es_es: Ya sea un nombre de archivo pfb, o una tupla de 3 de tipografía ya decodificada `~.Type1Font.parts`.

source: Return a new font that is slanted and/or extended.
es_es: Devuelve una nueva fuente que está inclinada y/o extendida.

source: **effects**
es_es: **efectos**

source: A dict with optional entries:
es_es: Un dictado con entradas opcionales:

source: Tangent of the angle that the font is to be slanted to the right. Negative values slant to the left.
es_es: Tangente del ángulo que la fuente debe ser inclinada a la derecha.

source: 'extend'
es_es: 'ampliar'

source: Scaling factor for the font width. Values less than 1 condense the glyphs.
es_es: Factor de escala para el ancho de la fuente. Valores inferiores a 1 condensan los glifos.

source: Returns
es_es: Devuelve
