Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/units_api.po
Languages: es_es

source: The classes here provide support for using custom classes with Matplotlib, e.g., those that do not expose the array interface but know how to convert themselves to arrays. It also supports classes with units and units conversion. Use cases include converters for custom objects, e.g., a list of datetime objects, as well as for objects that are unit aware. We don't assume any particular units implementation; rather a units implementation must register with the Registry converter dictionary and provide a `ConversionInterface`. For example, here is a complete implementation which supports plotting with native datetime objects::
es_es: Las clases aquí proporcionan soporte para el uso de clases personalizadas con Matplotlib, p.ej. aquellos que no exponen la interfaz de matrices pero saben cómo convertirse a matrices. También soporta clases con conversión de unidades y unidades. una lista de objetos de fecha y hora, así como de objetos que son conscientes de unidades. No asumimos ninguna implementación de unidades en particular; más bien una implementación de unidades debe registrarse en el diccionario del convertidor del registro y proporcionar un `ConversionInterface`. Por ejemplo, aquí hay una implementación completa que soporta trazar con objetos nativos de fecha::

source: Information to support default axis labeling, tick labeling, and limits.
es_es: Información para soportar etiquetas de ejes por defecto, etiquetas de tick, y límites.

source: An instance of this class must be returned by `ConversionInterface.axisinfo`.
es_es: Una instancia de esta clase debe ser devuelta por `ConversionInterface.axisinfo`.

source: Parameters
es_es: Parámetros

source: Locator, optional
es_es: Localizador, opcional

source: Tick locators for the major and minor ticks.
es_es: Las habitaciones son muy pequeñas y el personal es muy amable.

source: Formatter, optional
es_es: Formato, opcional

source: Tick formatters for the major and minor ticks.
es_es: Tick formatters para los ticks mayores y menores.

source: **label**
es_es: **etiqueta**

source: str, optional
es_es: str, opcional

source: The default axis label.
es_es: La etiqueta del eje por defecto.

source: **default_limits**
es_es: **Por defecto_limits**

source: optional
es_es: opcional

source: The default min and max limits of the axis if no data has been plotted.
es_es: Límites mínimos y máximos por defecto del eje si no se han trazado datos.

source: If any of the above are ``None``, the axis will simply use the default value.
es_es: Si alguno de los anteriores es ``Ninguno``, el eje simplemente utilizará el valor por defecto.

source: The minimal interface for a converter to take custom data types (or sequences) and convert them to values Matplotlib can use.
es_es: La interfaz mínima para un conversor para tomar tipos de datos personalizados (o secuencias) y convertirlos a valores que Matplotlib puede usar.

source: Return an `.AxisInfo` for the axis with the specified units.
es_es: Devuelve un `.AxisInfo` para el eje con las unidades especificadas.

source: Convert *obj* using *unit* for the specified *axis*.
es_es: Convierte *obj* usando *unidad* para el *eje* especificado.

source: If *obj* is a sequence, return the converted sequence. The output must be a sequence of scalars that can be used by the numpy array layer.
es_es: Si *obj* es una secuencia, devuelve la secuencia convertida. La salida debe ser una secuencia de escalares que puede ser usada por la capa de matriz numpy.

source: Return the default unit for *x* or ``None`` for the given axis.
es_es: Devuelve la unidad por defecto para *x* o ``Ning`` para el eje dado.

source: [*Deprecated*] The Matplotlib datalim, autoscaling, locators etc work with scalars which are the units converted to floats given the current unit. The converter may be passed these floats, or arrays of them, even when units are set.
es_es: [*Deprecado*] Los datalimento de Matplotlib, autoscaling, localizadores, etc trabajan con escalares que son las unidades convertidas a flotantes dada la unidad actual. El convertidor puede ser pasado por estos flotantes, o arrays de ellos, incluso cuando se establecen unidades.

source: Converter for decimal.Decimal data to float.
es_es: Convertidor de datos decimal.Decimal a flotante.

source: Convert Decimals to floats.
es_es: Convierte decimales a flotantes.

source: The *unit* and *axis* arguments are not used.
es_es: Los argumentos *unidad* y *eje* no se utilizan.

source: **value**
es_es: **valor**

source: decimal.Decimal or iterable
es_es: decimal.Decimal o iterable

source: Decimal or list of Decimal need to be converted
es_es: Es necesario convertir decimales o lista de decimales

source: Register types with conversion interface.
es_es: Registrar tipos con interfaz de conversión.

source: Get the converter interface instance for *x*, or None.
es_es: Obtener la instancia del convertidor de interfaz para *x*, o ninguno.
