Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/widgets_api.po
Languages: es_es

source: A slider representing a range of floating point values. Defines the min and max of the range via the *val* attribute as a tuple of (min, max).
es_es: Un deslizador que representa un rango de valores de punto flotante. Define el mínimo y máximo del rango mediante el atributo *val* como una tupla de (min, max).

source: Create a slider that defines a range contained within [*valmin*, *valmax*] in axes *ax*. For the slider to remain responsive you must maintain a reference to it. Call :meth:`on_changed` to connect to the slider event.
es_es: Crea un deslizador que defina un rango contenido dentro de [*valmin*, *valmax*] en los ejes *ax*. Para que el deslizador siga respondiendo debes mantener una referencia a él. Llama a :meth:`on_changed` para conectarte al evento deslizador.

source: tuple of float
es_es: tupla de flotante

source: Slider value.
es_es: Valor deslizante.

source: The Axes to put the slider in.
es_es: Los ejes para colocar el deslizador.

source: Slider label.
es_es: Slider etiqueta.

source: The minimum value of the slider.
es_es: El valor mínimo del deslizador.

source: The maximum value of the slider.
es_es: El valor máximo del deslizador.

source: tuple of float or None, default: None
es_es: tuple de flotante o ninguno, por defecto: Ninguno

source: The initial positions of the slider. If None the initial positions will be at the 25th and 75th percentiles of the range.
es_es: Las posiciones iniciales del deslizador. Si ninguna de las posiciones iniciales estará en los percentiles 25 y 75 del rango.

source: str, default: None
es_es: str, por defecto: ninguno

source: %-format string used to format the slider values. If None, a `.ScalarFormatter` is used instead.
es_es: %-fcadena ormat utilizada para formatear los valores del deslizador. Si no, se utiliza un `.ScalarFormatter` en su lugar.

source: Whether the slider interval is closed on the bottom.
es_es: Si el intervalo deslizante está cerrado en la parte inferior.

source: Whether the slider interval is closed on the top.
es_es: Si el intervalo deslizante está cerrado en la parte superior.

source: **dragging**
es_es: **arrastrando**

source: If True the slider can be dragged by the mouse.
es_es: Si es Verdadero el deslizador puede ser arrastrado por el ratón.

source: If given, the slider will snap to multiples of *valstep*.
es_es: Si se proporciona, el deslizador se deslizará a múltiplos de *valstep*.

source: **orientation**
es_es: **orientación**

source: {'horizontal', 'vertical'}, default: 'horizontal'
es_es: {'horizontal', 'vertical'}, por defecto: 'horizontal'

source: The orientation of the slider.
es_es: La orientación del deslizador.

source: **track_color**
es_es: **pista_color**

source: color, default: 'lightgrey'
es_es: color, por defecto: 'gris claro'

source: The color of the background track. The track is accessible for further styling via the *track* attribute.
es_es: El color de la pista de fondo. La pista es accesible para un mayor estilo a través del atributo *track*.

source: Properties of the slider handles. Default values are
es_es: Propiedades del manejador deslizante. Los valores por defecto son

source: Key
es_es: Clave

source: Value
es_es: Valor

source: Default
es_es: Por defecto

source: Description
es_es: Descripción

source: facecolor
es_es: color cara

source: 'white'
es_es: 'blanco'

source: The facecolor of the slider handles.
es_es: El color de cara del deslizador.

source: edgecolor
es_es: color bordes

source: The edgecolor of the slider handles.
es_es: El color del borde del deslizador.

source: size
es_es: tamaño

source: The size of the slider handles in points.
es_es: El tamaño del deslizador maneja en puntos.

source: Other values will be transformed as marker{foo} and passed to the `~.Line2D` constructor. e.g. ``handle_style = {'style'='x'}`` will result in ``markerstyle = 'x'``.
es_es: Otros valores se transformarán como marcador{foo} y se pasarán al constructor `~.Line2D`. ej. ``handle_style = {'style'='x'}`` resultará en ``markerstyle = 'x'``.

source: Additional kwargs are passed on to ``self.poly`` which is the `~matplotlib.patches.Polygon` that draws the slider knob. See the `.Polygon` documentation for valid property names (``facecolor``, ``edgecolor``, ``alpha``, etc.).
es_es: Los kwargs adicionales se pasan a ``self.poly`` que es el `~matplotlib.patches.Polygon` que dibuja el knob deslizador. Vea la documentación `.Polygon` para nombres de propiedades válidos (``facecolor``, ``edgecolor``, ``alpha``, etc.).

source: Connect *func* as callback function to changes of the slider value.
es_es: Conecte *función* como función de callback a los cambios del valor del deslizador.

source: Function to call when slider is changed. The function must accept a numpy array with shape (2,) as its argument.
es_es: Función para llamar cuando se cambia el deslizador. La función debe aceptar una matriz numpy con la forma (2,) como su argumento.

source: Returns
es_es: Devuelve

source: Connection id (which can be used to disconnect *func*).
es_es: Id de conexión (que puede ser usado para desconectar *func*).

source: Set the lower value of the slider to *max*.
es_es: Establezca el valor más bajo del deslizador a *max*.

source: **max**
es_es: **máx**

source: Set the lower value of the slider to *min*.
es_es: Establezca el valor más bajo del deslizador a *min*.

source: Set slider value to *val*.
es_es: Establece el valor del deslizador a *val*.

source: tuple or array-like of float
es_es: tuple o tipo matriz de flotante

source: Select a rectangular region of an axes.
es_es: Selecciona una región rectangular de los ejes.

source: Properties with which the rectangle is drawn. See `matplotlib.patches.Patch` for valid properties. Default:
es_es: Propiedades con las que se dibuja el rectángulo. Ver `matplotlib.patches.Patch` para propiedades válidas. Por defecto:

source: See also: :doc:`/gallery/widgets/rectangle_selector`
es_es: Ver también: :doc:`/gallery/widgets/rectangle_selector`

source: Center of rectangle.
es_es: Centro de rectángulo.

source: Corners of rectangle from lower left, moving clockwise.
es_es: Esquinas del rectángulo desde la parte inferior izquierda, moviendo hacia las agujas del reloj.

source: Midpoint of rectangle edges from left, moving anti-clockwise.
es_es: Medio punto de los bordes del rectángulo de la izquierda, moviéndose en sentido anti-reloj.

source: Return (xmin, xmax, ymin, ymax).
es_es: Retorna (xmin, xmax, ymin, ymax).

source: Return an array of shape (2, 5) containing the x (``RectangleSelector.geometry[1, :]``) and y (``RectangleSelector.geometry[0, :]``) coordinates of the four corners of the rectangle starting and ending in the top left corner.
es_es: Devuelve una matriz de forma (2, 5) que contiene la x (``RectangleSelector.geometry[1, :]``) y y (``RectangleSelector. coordenadas eometry[0, :]``) de las cuatro esquinas del rectángulo que comienzan y terminan en la esquina superior izquierda.

source: A slider representing a floating point range.
es_es: Un deslizador que representa un rango de punto flotante.

source: Create a slider from *valmin* to *valmax* in axes *ax*. For the slider to remain responsive you must maintain a reference to it. Call :meth:`on_changed` to connect to the slider event.
es_es: Crea un deslizador de *valmin* a *valmax* en los ejes *ax*. Para que el deslizador permanezca receptivo, debes mantener una referencia a él. Llama a :meth:`on_changed` para conectar al evento deslizador.

source: The slider initial position.
es_es: La posición inicial del deslizador.

source: %-format string used to format the slider value. If None, a `.ScalarFormatter` is used instead.
es_es: %-fcadena ormat utilizada para formatear el valor del deslizador. Si no, se utiliza un `.ScalarFormatter` en su lugar.

source: **slidermin**
es_es: **deslizante**

source: Slider, default: None
es_es: Slider, predeterminado: ninguno

source: Do not allow the current slider to have a value less than the value of the Slider *slidermin*.
es_es: No permita que el deslizador actual tenga un valor menor que el del deslizador *deslizador*.

source: Do not allow the current slider to have a value greater than the value of the Slider *slidermax*.
es_es: No permita que el deslizador actual tenga un valor mayor que el valor del deslizador *slidermax*.

source: float or array-like, default: None
es_es: flotante o tipo matriz: Ninguno

source: If a float, the slider will snap to multiples of *valstep*. If an array the slider will snap to the values in the array.
es_es: Si es un float, el deslizador se deslizará a múltiples de *valstep*. Si es una matriz, el deslizador se ajustará a los valores de la matriz.

source: color, default: 'r'
es_es: color, predeterminado: 'r'

source: The color of the line at the *valinit* position. Set to ``'none'`` for no line.
es_es: El color de la línea en la posición *valinit*. Establecer en ``'ninguno '`` para ninguna línea.

source: Properties of the slider handle. Default values are
es_es: Propiedades del manejador deslizante. Los valores por defecto son

source: The facecolor of the slider handle.
es_es: El color de cara de la asa deslizante.

source: The edgecolor of the slider handle.
es_es: El color del borde de la asa deslizante.

source: The size of the slider handle in points.
es_es: Tamaño del control deslizante en puntos.

source: Function to call when slider is changed. The function must accept a single float as its arguments.
es_es: Función para llamar cuando se cambia el deslizador. La función debe aceptar un solo flotante como sus argumentos.

source: The base class for constructing Slider widgets. Not intended for direct usage.
es_es: La clase base para construir widgets Slider. No está destinada al uso directo.

source: For the slider to remain responsive you must maintain a reference to it.
es_es: Para que el deslizador siga respondiendo debe mantener una referencia a él.

source: Connection id of the observer to be removed.
es_es: Id de conexión del observador a ser eliminado.

source: Reset the slider to the initial value.
es_es: Restablecer el deslizador al valor inicial.

source: Visually select a min/max range on a single axis and call a function with those values.
es_es: Seleccione visualmente un rango min/max en un solo eje y llame a una función con esos valores.

source: To guarantee that the selector remains responsive, keep a reference to it.
es_es: Para garantizar que el selector siga respondiendo, mantenga una referencia a él.

source: In order to turn off the SpanSelector, set ``span_selector.active`` to False. To turn it back on, set it to True.
es_es: Para desactivar SpanSelector, establece ``span_selector.active`` a False. Para volver a activarlo, pon True.

source: **direction**
es_es: **dirección**

source: The direction along which to draw the span selector.
es_es: La dirección a lo largo de la cual dibujar el selector de la extensión.

source: If selection is less than or equal to *minspan*, the selection is removed (when already existing) or cancelled.
es_es: Si la selección es menor o igual a *minspan*, la selección se elimina (cuando ya existe) o se cancela.

source: If True, use the backend-dependent blitting features for faster canvas updates.
es_es: Si es verdadero, utilice las características de blitting dependientes del backend para actualizaciones más rápidas del lienzo.

source: Dictionary of `matplotlib.patches.Patch` properties. Default:
es_es: Diccionario de las propiedades `matplotlib.patches.Patch`. Por defecto:

source: ``dict(facecolor='red', alpha=0.5)``
es_es: ``dict(facecolor='rojo', alpha=0.5)``

source: func(min, max), min/max are floats, default: None
es_es: fun(min, max), min/max son flotantes, por defecto: Ninguno

source: Called on mouse move while the span is being selected.
es_es: Llamado al movimiento del ratón mientras se selecciona el espacio.

source: If True, the span stays visible after the mouse is released. Deprecated, use *interactive* instead.
es_es: Si es verdadero, el lapso se mantiene visible después de que el ratón sea liberado. Desaprobado, use *interactivo* en su lugar.

source: **button** : `.MouseButton` or list of `.MouseButton`, default: all buttons
es_es: **botón** : `.MouseButton` o lista de `.MouseButton`, por defecto: todos los botones

source: MouseButton or list of MouseButton, default: all buttons
es_es: MouseButton o lista de MouseButton, por defecto: todos los botones

source: The mouse buttons which activate the span selector.
es_es: Los botones del ratón que activan el selector de espacio.

source: dict, default: None
es_es: dictamen, predeterminado: ninguno

source: Properties of the handle lines at the edges of the span. Only used when *interactive* is True. See `matplotlib.lines.Line2D` for valid properties.
es_es: Propiedades de las líneas de handle en los bordes del espacio. Solo se utiliza cuando *interactivo* es True. Vea `matplotlib.lines.Line2D` para propiedades válidas.

source: See also: :doc:`/gallery/widgets/span_selector`
es_es: Ver también: :doc:`/gallery/widgets/span_selector`

source: Connect the major canvas events to methods.
es_es: Conecte los principales eventos de lienzo a los métodos.

source: Direction of the span selector: 'vertical' or 'horizontal'.
es_es: Dirección del selector espacial: 'vertical' o 'horizontal'.

source: Return extents of the span selector.
es_es: Devuelve las extensiones del selector de la extensión.

source: Set SpanSelector to operate on a new Axes.
es_es: Establezca SpanSelector para operar en un nuevo eje.

source: A tool to adjust the subplot params of a `matplotlib.figure.Figure`.
es_es: Una herramienta para ajustar los parámetros de subplot de un `matplotlib.figure.Figure`.

source: **targetfig** : `.Figure`
es_es: **figura** : `.Figure`

source: Figure
es_es: Figura

source: The figure instance to adjust.
es_es: La instancia de la figura a ajustar.

source: The figure instance to embed the subplot tool into.
es_es: La instancia de la figura en la que incrustar la herramienta subplot.

source: A GUI neutral text input box.
es_es: Una casilla de entrada de texto neutral de GUI.

source: For the text box to remain responsive you must keep a reference to it.
es_es: Para que el cuadro de texto siga respondiendo, debe guardar una referencia a él.

source: Call `.on_text_change` to be updated whenever the text changes.
es_es: Llama a `.on_text_change` para ser actualizado cada vez que el texto cambia.

source: Call `.on_submit` to be updated whenever the user hits enter or leaves the text entry field.
es_es: Llame a `.on_submit` para ser actualizado cada vez que el usuario ingrese o deje el campo de entrada de texto.

source: **label** : `.Text`
es_es: **etiqueta** : `.Text`

source: Text
es_es: Texto

source: The color of the text box when not hovering.
es_es: El color del cuadro de texto cuando no está flotando.

source: The color of the text box when hovering.
es_es: El color del cuadro de texto al pasar el ratón.

source: Label for this text box.
es_es: Etiqueta para este cuadro de texto.

source: **initial**
es_es: **inicial**

source: Initial value in the text box.
es_es: Valor inicial en el cuadro de texto.

source: The color of the box.
es_es: El color de la caja.

source: The color of the box when the mouse is over it.
es_es: El color de la caja cuando el ratón está sobre ella.

source: **label_pad**
es_es: **etiqueta_pad**

source: The distance between the label and the right side of the textbox.
es_es: La distancia entre la etiqueta y el lado derecho del cuadro de texto.

source: The horizontal location of the text.
es_es: La ubicación horizontal del texto.

source: When the user hits enter or leaves the submission box, call this *func* with event.
es_es: Cuando el usuario ingrese o salga del cuadro de presentación, llame a esta *función* con evento.

source: A connection id is returned which can be used to disconnect.
es_es: Se devuelve un identificador de conexión que puede utilizarse para desconectarse.

source: When the text changes, call this *func* with event.
es_es: Cuando el texto cambia, llame a esta *función* con evento.

source: Control handles for canvas tools.
es_es: Controles para herramientas de lienzo.

source: Matplotlib axes where tool handles are displayed.
es_es: Ejes de Matplotlib donde se muestran las asas de herramientas.

source: 1D arrays
es_es: Arreglos 1D

source: Coordinates of control handles.
es_es: Coordenadas de manejadores de control.

source: str, default: 'o'
es_es: str, por defecto: 'o'

source: Shape of marker used to display handle. See `matplotlib.pyplot.plot`.
es_es: Forma del marcador usado para mostrar el handle. Ver `matplotlib.pyplot.plot.plot`.

source: Additional marker properties. See `matplotlib.lines.Line2D`.
es_es: Propiedades de marcador adicionales. Consulte `matplotlib.lines.Line2D`.

source: Return index and pixel distance to closest index.
es_es: Devuelve el índice y la distancia de píxeles al índice más cercano.

source: Set x and y positions of handles.
es_es: Establecer posiciones x e y de asas.

source: **positions**
es_es: **posiciones**

source: 1D array
es_es: Matriz 1D

source: Positions of handles in data coordinates.
es_es: Posiciones de los manejadores en las coordenadas de datos.

source: Direction of handles, either 'vertical' or 'horizontal'
es_es: Dirección de asas, verticales o horizontales

source: **line_props**
es_es: **accesorios**

source: Additional line properties. See `matplotlib.lines.Line2D`.
es_es: Propiedades de línea adicionales. Consulte `matplotlib.lines.Line2D`.

source: Return index and pixel distance to closest handle.
es_es: Devuelve el índice y la distancia de píxeles al asa más cercana.

source: x, y position from which the distance will be calculated to determinate the closest handle
es_es: x, y posición desde la cual la distancia se calculará para determinar el asa más cercana

source: **index, distance**
es_es: **índice, distancia**

source: index of the handle and its distance from
es_es: índice del asa y su distancia desde

source: position x, y
es_es: posición x, y

source: Direction of the handle: 'vertical' or 'horizontal'.
es_es: Dirección del mano: 'vertical' o 'horizontal'.

source: Positions of the handle in data coordinates.
es_es: Posiciones del manejador en coordenadas de datos.

source: Remove the handles artist from the figure.
es_es: Remueve al artista asas de la figura.

source: Set the animated state of the handles artist.
es_es: Establece el estado animado del artista de las asas.

source: Set x or y positions of handles, depending if the lines are vertical of horizontal.
es_es: Define las posiciones x o y de las asas, dependiendo de si las líneas son verticales de horizontal.

source: tuple of length 2
es_es: tupla de longitud 2

source: Set the positions of the handle in data coordinates
es_es: Establecer las posiciones del manejador en las coordenadas de datos

source: Set the visibility state of the handles artist.
es_es: Establecer el estado de visibilidad del artista de asas.

source: Abstract base class for GUI neutral widgets.
es_es: Clase base abstracta para widgets GUI neutrales.

source: Get whether the widget is active.
es_es: Obtener si el widget está activo.

source: Return whether *event* should be ignored.
es_es: Devuelve si el *event* debe ser ignorado.

source: This method should be called at the beginning of any event callback.
es_es: Este método debe ser llamado al principio de cualquier callback de evento.

source: Set whether the widget is active.
es_es: Establecer si el widget está activo.
