Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/widgets_api.po
Languages: es_es

source: GUI neutral widgets
es_es: Widgets GUI neutral

source: Widgets that are designed to work for any of the GUI backends. All of these widgets require you to predefine a `matplotlib.axes.Axes` instance and pass that as the first parameter. Matplotlib doesn't try to be too smart with respect to layout -- you will have to figure out how wide and tall you want your Axes to be to accommodate your widget.
es_es: Widgets diseñados para trabajar en cualquiera de los soportes GUI. Todos estos widgets requieren que predefinas una instancia de `matplotlib.axes.Axes` y que pases como el primer parámetro. Matplotlib no intenta ser demasiado inteligente con respecto al diseño -- tendrás que averiguar cuán ancho y alto quieres que sean tus ejes para acomodar tu widget.

source: Widget connected to a single `~matplotlib.axes.Axes`.
es_es: Widget conectado a un solo `~matplotlib.axes.Axes`.

source: To guarantee that the widget remains responsive and not garbage-collected, a reference to the object should be maintained by the user.
es_es: Para garantizar que el widget sigue respondiendo y no recolectado de basura, el usuario debe mantener una referencia al objeto.

source: This is necessary because the callback registry maintains only weak-refs to the functions, which are member functions of the widget. If there are no references to the widget object it may be garbage collected which will disconnect the callbacks.
es_es: Esto es necesario porque el registro de devolución de llamada sólo mantiene referencias débiles a las funciones, que son funciones miembro del widget. Si no hay referencias al objeto widget puede ser basura recolectada que desconectará las devoluciones de llamada.

source: Attributes
es_es: Atributos

source: Axes
es_es: Ejes

source: The parent axes for the widget.
es_es: Los ejes superiores para el widget.

source: FigureCanvasBase
es_es: Base de lienzo de figura

source: The parent figure canvas for the widget.
es_es: El lienzo de la figura padre para el widget.

source: :obj:`active <active>`
es_es: :obj:`activo <active>`

source: Is the widget active?
es_es: ¿Está activo el widget?

source: Connect a callback function with an event.
es_es: Conecta una función de callback con un evento.

source: This should be used in lieu of ``figure.canvas.mpl_connect`` since this function stores callback ids for later clean up.
es_es: Esto debería ser usado en lugar de ``figure.canvas.mpl_connect`` ya que esta función almacena ids de devolución de llamada para su posterior limpieza.

source: Disconnect all events created by this widget.
es_es: Desconectar todos los eventos creados por este widget.

source: A GUI neutral button.
es_es: Un botón neutral de GUI.

source: For the button to remain responsive you must keep a reference to it. Call `.on_clicked` to connect to the button.
es_es: Para que el botón siga respondiendo, debe guardar una referencia a ella. Llame a `.on_clicked` para conectarse al botón.

source: **ax**
es_es: **ej**

source: The `matplotlib.axes.Axes` the button renders into.
es_es: El `matplotlib.axes.Axes` en el que se renderiza el botón.

source: **label**
es_es: **etiqueta**

source: A `matplotlib.text.Text` instance.
es_es: Una instancia `matplotlib.text.Text`.

source: The color of the button when not hovering.
es_es: El color del botón cuando no está flotando.

source: The color of the button when hovering.
es_es: El color del botón al pasar el ratón.

source: Parameters
es_es: Parámetros

source: The `~.axes.Axes` instance the button will be placed into.
es_es: La instancia `~.axes.Axes` en la que se colocará el botón.

source: The button text.
es_es: El texto del botón.

source: **image**
es_es: **imagen**

source: array-like or PIL Image
es_es: imagen de matriz o PIL

source: The image to place in the button, if not *None*. The parameter is directly forwarded to `~matplotlib.axes.Axes.imshow`.
es_es: La imagen a colocar en el botón, si no *Ninguno*. El parámetro es reenviado directamente a `~matplotlib.axes.Axes.imshow`.

source: The color of the button when not activated.
es_es: El color del botón cuando no se activa.

source: The color of the button when the mouse is over it.
es_es: El color del botón cuando el ratón está sobre él.

source: Remove the callback function with connection id *cid*.
es_es: Remueve la función callback con el id de conexión *cid*.

source: Connect the callback function *func* to button click events.
es_es: Conecte la función de callback *función* para hacer clic en eventos.

source: Returns a connection id, which can be used to disconnect the callback.
es_es: Devuelve un id de conexión, que puede ser usado para desconectar el callback.

source: A GUI neutral set of check buttons.
es_es: Un GUI neutral conjunto de botones de control.

source: For the check buttons to remain responsive you must keep a reference to this object.
es_es: Para que los botones de verificación permanezcan receptivos debe guardar una referencia a este objeto.

source: Connect to the CheckButtons with the `.on_clicked` method.
es_es: Conecta a los CheckButtons con el método `.on_clicked`.

source: **labels** : list of `.Text`
es_es: **etiquetas** : lista de `.Text`

source: list of
es_es: lista de

source: **rectangles** : list of `.Rectangle`
es_es: **rectángulos** : lista de `.Rectangle`

source: **lines** : list of (`.Line2D`, `.Line2D`) pairs
es_es: **líneas** : lista de pares (`.Line2D`, `.Line2D`)

source: list of (
es_es: lista de (

source: List of lines for the x's in the check boxes. These lines exist for each box, but have ``set_visible(False)`` when its box is not checked.
es_es: Lista de líneas para las X en las casillas de verificación. Estas líneas existen para cada casilla, pero tienen ``set_visible(False)`` cuando su casilla no está marcada.

source: Add check buttons to `matplotlib.axes.Axes` instance *ax*.
es_es: Añade botones de verificación a la instancia *ax* de `matplotlib.axes.Axes*.

source: list of str
es_es: lista de str

source: The labels of the check buttons.
es_es: Las etiquetas de los botones de control.

source: list of bool, optional
es_es: lista de bool, opcional

source: The initial check states of the buttons. The list must have the same length as *labels*. If not given, all buttons are unchecked.
es_es: Los estados de verificación iniciales de los botones. La lista debe tener la misma longitud que *etiquetas*. Si no se proporciona, todos los botones no están marcados.

source: Remove the observer with connection id *cid*.
es_es: Remueve el observador con el id de conexión *cid*.

source: Return a tuple of the status (True/False) of all of the check buttons.
es_es: Devuelve una tupla del estado (Verdadero/Falso) de todos los botones de verificación.

source: Toggle (activate or deactivate) a check button by index.
es_es: Alterna (activar o desactivar) un botón de verificación por índice.

source: Callbacks will be triggered if :attr:`eventson` is True.
es_es: Las devoluciones de llamada se activarán si :attr:`eventson` es verdadero.

source: **index**
es_es: **índice**

source: Index of the check button to toggle.
es_es: Índice del botón de verificación para alternar.

source: Raises
es_es: Plantea

source: If *index* is invalid.
es_es: Si el *índice* no es válido.

source: A crosshair cursor that spans the axes and moves with mouse cursor.
es_es: Un cursor cruzado que abarca los ejes y se mueve con el cursor del ratón.

source: For the cursor to remain responsive you must keep a reference to it.
es_es: Para que el cursor permanezca receptivo debe mantener una referencia a él.

source: The `~.axes.Axes` to attach the cursor to.
es_es: El `~.axes.Axes` al que conectar el cursor.

source: **horizOn**
es_es: **horizonte**

source: bool, default: True
es_es: bool, por defecto: True

source: Whether to draw the horizontal line.
es_es: Dibujar o no la línea horizontal.

source: Whether to draw the vertical line.
es_es: Dibujar o no la línea vertical.

source: bool, default: False
es_es: bool, por defecto: False

source: Use blitting for faster drawing if supported by the backend.
es_es: Utilice flitting para dibujar más rápido si está soportado por el backend.

source: Other Parameters
es_es: Otros Parámetros

source: **\*\*lineprops**
es_es: **\*\*\*líneas**

source: `.Line2D` properties that control the appearance of the lines. See also `~.Axes.axhline`.
es_es: Propiedades `.Line2D` que controlan la apariencia de las líneas. Vea también `~.Axes.axhline`.

source: Examples
es_es: Ejemplos

source: See :doc:`/gallery/widgets/cursor`.
es_es: Ver :doc:`/gallery/widgets/cursor`.

source: Internal event handler to clear the cursor.
es_es: Controlador interno de eventos para limpiar el cursor.

source: Internal event handler to draw the cursor when the mouse moves.
es_es: Controlador interno de eventos para dibujar el cursor cuando el ratón se mueve.

source: Select an elliptical region of an axes.
es_es: Selecciona una región elíptica de los ejes.

source: Press and release events triggered at the same coordinates outside the selection will clear the selector, except when ``ignore_event_outside=True``.
es_es: Los eventos de prensa y de liberación activados en las mismas coordenadas fuera de la selección borrarán el selector, excepto cuando ``ignore_event_outside=True``.

source: function
es_es: función

source: A callback function that is called after a release event and the selection is created, changed or removed. It must have the signature::
es_es: Una función de callback que se llama después de un evento de lanzamiento y la selección es creada, cambiada o eliminada. Debe tener la firma::

source: where *eclick* and *erelease* are the mouse click and release `.MouseEvent`\s that start and complete the selection.
es_es: donde *eclick* y *erelease* son el clic del ratón y suelta `.MouseEvent`\s que comienzan y completan la selección.

source: Selections with an x-span less than or equal to *minspanx* are removed (when already existing) or cancelled.
es_es: Las selecciones con un intervalo x menor o igual a *minspanx* son removidas (cuando ya existentes) o canceladas.

source: Selections with an y-span less than or equal to *minspanx* are removed (when already existing) or cancelled.
es_es: Las selecciones con un y-span menor o igual a *minspanx* se eliminan (cuando ya existe) o se cancelan.

source: Whether to use blitting for faster drawing (if supported by the backend).
es_es: Si se utiliza el parpadeo para un dibujo más rápido (si está soportado por el backend).

source: Properties with which the ellipse is drawn. See `matplotlib.patches.Patch` for valid properties. Default:
es_es: Propiedades con las que se dibuja el ellipse. Vea `matplotlib.patches.Patch` para propiedades válidas. Por defecto:

source: ``dict(facecolor='red', edgecolor='black', alpha=0.2, fill=True)``
es_es: ``dict(facecolor='rojo', edgecolor='black', alpha=0.2, fill=True)``

source: {"data", "pixels"}, default: "data"
es_es: {"data", "pixels"}, por defecto: "datos"

source: Whether to interpret *minspanx* and *minspany* in data or in pixel coordinates.
es_es: Si interpretar *minspanx* y *minspany* en datos o en coordenadas de píxeles.

source: **button** : `.MouseButton`, list of `.MouseButton`, default: all buttons
es_es: **botón** : `.MouseButton`, lista de `.MouseButton`, por defecto: todos los botones

source: MouseButton, list of MouseButton, default: all buttons
es_es: MouseButton, lista de MouseButton, por defecto: todos los botones

source: Button(s) that trigger rectangle selection.
es_es: Botón(es) que activan la selección del rectángulo.

source: float, default: 10
es_es: float, por defecto: 10

source: Distance in pixels within which the interactive tool handles can be activated.
es_es: Distancia en píxeles dentro de los cuales se puede activar la herramienta interactiva.

source: Properties with which the interactive handles (marker artists) are drawn. See the marker arguments in `matplotlib.lines.Line2D` for valid properties. Default values are defined in ``mpl.rcParams`` except for the default value of ``markeredgecolor`` which will be the same as the ``edgecolor`` property in *props*.
es_es: Propiedades con las que se dibujan los handles interactivos (artistas marcadores). Vea los argumentos del marcador en `matplotlib.lines.Line2D` para obtener propiedades válidas. Los valores por defecto se definen en ``mpl.rcParams`` excepto por el valor predeterminado de ``markeredgecolor`` que será el mismo que la propiedad ``edgecolor`` en *props*.

source: **interactive**
es_es: **interactivo**

source: Whether to draw a set of handles that allow interaction with the widget after it is drawn.
es_es: Si dibujar un conjunto de asas que permitan la interacción con el widget después de que se dibuje.

source: Keyboard modifiers which affect the widget's behavior. Values amend the defaults.
es_es: Modificadores de teclado que afectan el comportamiento del widget. Los valores modifican los valores predeterminados.

source: "move": Move the existing shape, default: no modifier.
es_es: "move": Mueva la forma existente, por defecto: no hay modificador.

source: "clear": Clear the current shape, default: "escape".
es_es: "clear": Borrar la forma actual, por defecto: "escape".

source: "square": Make the shape square, default: "shift".
es_es: "cuadrado": Hacer el cuadrado de la forma, por defecto: "shift".

source: "center": Make the initial point the center of the shape, default: "ctrl".
es_es: "center": Hacer el punto inicial el centro de la forma, por defecto: "ctrl".

source: "square" and "center" can be combined.
es_es: "cuadrado" y "centro" se pueden combinar.

source: **drag_from_anywhere**
es_es: **drag_de_cualquier lugar**

source: If `True`, the widget can be moved by clicking anywhere within its bounds.
es_es: Si es `Verdadero`, el widget se puede mover haciendo clic en cualquier lugar dentro de sus límites.

source: **ignore_event_outside**
es_es: **ignorar_evento**

source: If `True`, the event triggered outside the span selector will be ignored.
es_es: Si es `True`, el evento activado fuera del selector de span será ignorado.

source: Selection curve of an arbitrary shape.
es_es: Curva de selección de una forma arbitraria.

source: The selected path can be used in conjunction with `~matplotlib.path.Path.contains_point` to select data points from an image.
es_es: La ruta seleccionada puede utilizarse junto con `~matplotlib.path.Path.contains_point` para seleccionar los puntos de datos de una imagen.

source: Unlike `LassoSelector`, this must be initialized with a starting point *xy*, and the `Lasso` events are destroyed upon release.
es_es: A diferencia de `LassoSelector`, esto debe inicializarse con un punto de partida *xy*, y los eventos `Lasso` son destruidos al lanzarse.

source: Coordinates of the start of the lasso.
es_es: Coordenadas del inicio del lasso.

source: callable
es_es: llamable

source: Whenever the lasso is released, the *callback* function is called and passed the vertices of the selected path.
es_es: Cuando el lasso es liberado, la función *callback* es llamada y pasada los vértices de la ruta seleccionada.

source: For the selector to remain responsive you must keep a reference to it.
es_es: Para que el selector siga respondiendo debe mantener una referencia a él.

source: The selected path can be used in conjunction with `~.Path.contains_point` to select data points from an image.
es_es: La ruta seleccionada puede utilizarse junto con `~.Path.contains_point` para seleccionar los puntos de datos de una imagen.

source: In contrast to `Lasso`, `LassoSelector` is written with an interface similar to `RectangleSelector` and `SpanSelector`, and will continue to interact with the axes until disconnected.
es_es: A diferencia de `Lasso`, `LassoSelector` se escribe con una interfaz similar a `RectangleSelector` y `SpanSelector`, y continuará interactuando con los ejes hasta que se desconecte.

source: Example usage::
es_es: Ejemplo de uso::

source: Whenever the lasso is released, the *onselect* function is called and passed the vertices of the selected path.
es_es: Cuando el lasso es liberado, la función *onselect* es llamada y pasada los vértices de la ruta seleccionada.

source: Properties with which the line is drawn, see `matplotlib.lines.Line2D` for valid properties. Default values are defined in ``mpl.rcParams``.
es_es: Propiedades con las que se dibuja la línea, vea `matplotlib.lines.Line2D` para propiedades válidas. Los valores por defecto se definen en ``mpl.rcParams``.

source: **button** : `.MouseButton` or list of `.MouseButton`, optional
es_es: **botón** : `.MouseButton` o lista de `.MouseButton`, opcional

source: MouseButton or list of MouseButton, optional
es_es: MouseButton o lista de MouseButton, opcional

source: The mouse buttons used for rectangle selection. Default is ``None``, which corresponds to all buttons.
es_es: Los botones del ratón utilizados para la selección del rectángulo. Por defecto es ``Ninguno``, que corresponde a todos los botones.

source: Some widgets, like the cursor, draw onto the canvas, and this is not desirable under all circumstances, like when the toolbar is in zoom-to-rect mode and drawing a rectangle. To avoid this, a widget can acquire a canvas' lock with ``canvas.widgetlock(widget)`` before drawing on the canvas; this will prevent other widgets from doing so at the same time (if they also try to acquire the lock first).
es_es: Algunos widgets, como el cursor, dibujan en el lienzo, y esto no es deseable en todas las circunstancias. como cuando la barra de herramientas está en modo zoom-to-rect y dibuja un rectángulo. Para evitar esto, un widget puede adquirir un candado de lienzo con ``lienzo. idgetlock(widget)`` antes de dibujar en el lienzo; esto evitará que otros widgets lo hagan al mismo tiempo (si también tratan de adquirir el bloqueo primero).

source: Return whether drawing is available to *o*.
es_es: Devuelve si el dibujo está disponible a *o*.

source: Return whether *o* owns this lock.
es_es: Devuelve si *o* es propietario de este bloqueo.

source: Return whether the lock is currently held by an owner.
es_es: Devuelve si el bloqueo está actualmente en manos de un propietario.

source: Release the lock from *o*.
es_es: Libera el bloqueo de *o*.

source: Provide a vertical (default) and/or horizontal line cursor shared between multiple axes.
es_es: Proporciona un cursor vertical (por defecto) y/o línea horizontal compartida entre múltiples ejes.

source: The FigureCanvas that contains all the axes.
es_es: El FigureCanvas que contiene todos los ejes.

source: **axes** : list of `matplotlib.axes.Axes`
es_es: **ejes** : lista de `matplotlib.axes.Axes`

source: **vertOn: bool, default: True**
es_es: **vertOn: bool, por defecto: True**

source: See :doc:`/gallery/widgets/multicursor`.
es_es: Ver :doc:`/gallery/widgets/multicursor`.

source: Clear the cursor.
es_es: Limpia el cursor.

source: Connect events.
es_es: Conectar eventos.

source: Disconnect events.
es_es: Desconectar eventos.

source: Select a polygon region of an axes.
es_es: Selecciona una región de polígono de un eje.

source: Place vertices with each mouse click, and make the selection by completing the polygon (clicking on the first vertex). Once drawn individual vertices can be moved by clicking and dragging with the left mouse button, or removed by clicking the right mouse button.
es_es: Coloca los vértices con cada clic del ratón y realiza la selección completando el polígono (haciendo clic en el primer vértice). Una vez dibujados los vértices individuales pueden moverse haciendo clic y arrastrando con el botón izquierdo del ratón, o eliminándose haciendo clic en el botón derecho del ratón.

source: In addition, the following modifier keys can be used:
es_es: Además, se pueden utilizar las siguientes teclas modificadoras:

source: Hold *ctrl* and click and drag a vertex to reposition it before the polygon has been completed.
es_es: Mantenga pulsado *ctrl* y haga clic y arrastre un vértice para reposicionarlo antes de que el polígono haya sido completado.

source: Hold the *shift* key and click and drag anywhere in the axes to move all vertices.
es_es: Mantenga presionada la tecla *Mayar* y haga clic y arrastre a cualquier lugar en los ejes para mover todos los vértices.

source: Press the *esc* key to start a new polygon.
es_es: Pulse la tecla *esc* para iniciar un nuevo polígono.

source: When a polygon is completed or modified after completion, the *onselect* function is called and passed a list of the vertices as ``(xdata, ydata)`` tuples.
es_es: Cuando un polígono se completa o modifica después de completarse, se llama a la función *onselect* y se le pasa una lista de los vértices como tubos ``(xdata, ydata)``.

source: Properties with which the line is drawn, see `matplotlib.lines.Line2D` for valid properties. Default:
es_es: Propiedades con las que se dibuja la línea, vea `matplotlib.lines.Line2D` para propiedades válidas. Por defecto:

source: Artist properties for the markers drawn at the vertices of the polygon. See the marker arguments in `matplotlib.lines.Line2D` for valid properties. Default values are defined in ``mpl.rcParams`` except for the default value of ``markeredgecolor`` which will be the same as the ``color`` property in *props*.
es_es: Propiedades del artista para los marcadores dibujados en los vértices del polígono. Vea los argumentos del marcador en `matplotlib.lines.Line2D` para obtener propiedades válidas. Los valores por defecto se definen en ``mpl.rcParams`` excepto por el valor predeterminado de ``markeredgecolor`` que será el mismo que la propiedad ``color`` en *props*.

source: A vertex is selected (to complete the polygon or to move a vertex) if the mouse click is within *grab_range* pixels of the vertex.
es_es: Se selecciona un vértice (para completar el polígono o mover un vértice) si el ratón hace clic está dentro de píxeles de *grab_rango* del vértice.

source: If only one point remains after removing points, the selector reverts to an incomplete state and you can start drawing a new polygon from the existing point.
es_es: Si sólo queda un punto después de eliminar puntos, el selector se revierte a un estado incompleto y puedes empezar a dibujar un nuevo polígono desde el punto existente.

source: Cursor move event handler and validator.
es_es: Cursor mueve el controlador de eventos y validador.

source: The polygon vertices, as a list of ``(x, y)`` pairs.
es_es: Los vértices poligonales, como una lista de pares ``(x, y)``.

source: A GUI neutral radio button.
es_es: Un botón de radio GUI neutral.

source: For the buttons to remain responsive you must keep a reference to this object.
es_es: Para que los botones permanezcan receptivos debe guardar una referencia a este objeto.

source: Connect to the RadioButtons with the `.on_clicked` method.
es_es: Conéctate al RadioButtons con el método `.on_clicked`.

source: The color of the selected button.
es_es: El color del botón seleccionado.

source: The button labels.
es_es: Las etiquetas del botón.

source: **circles** : list of `~.patches.Circle`
es_es: **circulos** : lista de `~.patches.Circle`

source: The buttons.
es_es: Los botones.

source: **value_selected**
es_es: **valor_seleccionado**

source: The label text of the currently selected button.
es_es: El texto de la etiqueta del botón seleccionado actualmente.

source: Add radio buttons to an `~.axes.Axes`.
es_es: Añade botones de radio a un `~.axes.Axes`.

source: The axes to add the buttons to.
es_es: Los ejes a los que añadir los botones.

source: **active**
es_es: **activo**

source: The index of the initially selected button.
es_es: El índice del botón seleccionado inicialmente.

source: Select button with number *index*.
es_es: Seleccione el botón con el número *índice*.
