Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/dflt_style_changes.po
Languages: es_es

source: Changes to the default style
es_es: Cambios del estilo por defecto

source: The most important changes in matplotlib 2.0 are the changes to the default style.
es_es: Los cambios más importantes en matplotlib 2.0 son los cambios en el estilo por defecto.

source: While it is impossible to select the best default for all cases, these are designed to work well in the most common cases.
es_es: Aunque es imposible seleccionar el mejor valor por defecto para todos los casos, estos están diseñados para funcionar bien en los casos más comunes.

source: A 'classic' style sheet is provided so reverting to the 1.x default values is a single line of python
es_es: Se proporciona una hoja de estilo 'clásica' para que regresar a los valores por defecto de la versión 1.x sea una sola línea de python

source: See :ref:`customizing-with-matplotlibrc-files` for details about how to persistently and selectively revert many of these changes.
es_es: Ver :ref:`customizing-with-matplotlibrc-files` para más detalles sobre cómo revertir persistente y selectivamente muchos de estos cambios.

source: Table of Contents
es_es: Tabla de Contenidos

source: Colors, color cycles, and colormaps
es_es: Colores, ciclos de color y mapas de color

source: Colors in default property cycle
es_es: Colores en el ciclo de propiedades por defecto

source: The colors in the default property cycle have been changed from ``['b', 'g', 'r', 'c', 'm', 'y', 'k']`` to the category10 color palette used by `Vega <https://github.com/vega/vega/wiki/Scales#scale-range-literals>`__ and `d3 <https://github.com/d3/d3-3.x-api-reference/blob/master/Ordinal-Scales.md#category10>`__ originally developed at Tableau.
es_es: Los colores del ciclo de propiedades por defecto se han cambiado de ``['b', 'g', 'r', 'c', 'm', 'y', 'k']`` a la paleta de colores de la categoría10 utilizada por `Vega <https://github.com/vega/vega/wiki/Scales#scale-range-literals>`__ y `d3 <https://github.com/d3/d3-3.x-api-reference/blob/master/Ordinal-Scales.md#category10>`__ desarrollada originalmente en Tableau.

source: In addition to changing the colors, an additional method to specify colors was added. Previously, the default colors were the single character short-hand notations for red, green, blue, cyan, magenta, yellow, and black. This made them easy to type and usable in the abbreviated style string in ``plot``, however the new default colors are only specified via hex values. To access these colors outside of the property cycling the notation for colors ``'CN'``, where ``N`` takes values 0-9, was added to denote the first 10 colors in :rc:`axes.prop_cycle`. See :doc:`/tutorials/colors/colors` for more details.
es_es: Además de cambiar los colores, se ha añadido un método adicional para especificar los colores. Anteriormente, los colores por defecto eran las notaciones cortas de un solo carácter para el rojo, verde, azul, cian, magenta, amarillo y negro. Esto hacía que fueran fáciles de escribir y que se pudieran utilizar en la cadena de estilo abreviada en ``plot``, sin embargo, los nuevos colores por defecto sólo se especifican mediante valores hexadecimales. Para acceder a estos colores fuera del ciclo de propiedades se añadió la notación para colores ``'CN'``, donde ``N`` toma los valores 0-9, para denotar los 10 primeros colores en :rc:`axes.prop_cycle`. Ver :doc:`/tutorials/colors/colors` para más detalles.

source: To restore the old color cycle use
es_es: Para restablecer el ciclo de color antiguo utilice

source: or set
es_es: o establecer

source: in your :file:`matplotlibrc` file.
es_es: en su archivo :file:`matplotlibrc`.

source: Colormap
es_es: Mapa de color

source: The new default colormap used by `matplotlib.cm.ScalarMappable` instances is 'viridis' (aka `option D <https://bids.github.io/colormap/>`__).
es_es: El nuevo mapa de colores por defecto utilizado por las instancias de `matplotlib.cm.ScalarMappable` es `viridis` (también conocido como `opción D <https://bids.github.io/colormap/>`__).

source: For an introduction to color theory and how 'viridis' was generated watch Nathaniel Smith and Stéfan van der Walt's talk from SciPy2015. See `here for many more details <https://bids.github.io/colormap/>`__ about the other alternatives and the tools used to create the color map. For details on all of the colormaps available in matplotlib see :doc:`/tutorials/colors/colormaps`.
es_es: Para una introducción a la teoría del color y cómo se generó 'viridis' mira la charla de Nathaniel Smith y Stéfan van der Walt de SciPy2015. Mira `aquí para muchos más detalles <https://bids.github.io/colormap/>`__ sobre las otras alternativas y las herramientas utilizadas para crear el mapa de color. Para más detalles sobre todos los mapas de color disponibles en matplotlib ver :doc:`/tutorials/colors/colormaps`.

source: The previous default can be restored using
es_es: Se puede restablecer el valor predeterminado anterior mediante

source: or setting
es_es: o el ajuste

source: in your :file:`matplotlibrc` file; however this is strongly discouraged.
es_es: en el archivo :file:`matplotlibrc`; sin embargo, esto se desaconseja totalmente.

source: Interactive figures
es_es: Figuras interactivas

source: The default interactive figure background color has changed from grey to white, which matches the default background color used when saving.
es_es: El color de fondo por defecto de las figuras interactivas ha cambiado de gris a blanco, lo que corresponde con el color de fondo por defecto utilizado al guardar.

source: The previous defaults can be restored by ::
es_es: Los valores predeterminados anteriores se pueden restaurar mediante ::

source: or by setting ::
es_es: o ajustando ::

source: Grid lines
es_es: Líneas de la cuadrícula

source: The default style of grid lines was changed from black dashed lines to thicker solid light grey lines.
es_es: El estilo por defecto de las líneas de la cuadrícula se ha cambiado de líneas negras discontinuas a líneas sólidas más gruesas de color gris claro.

source: The previous default can be restored by using::
es_es: Se puede restablecer el valor predeterminado anterior mediante::

source: or by setting::
es_es: o mediante el ajuste::

source: Figure size, font size, and screen dpi
es_es: Tamaño de la figura, tamaño de la fuente y ppp de la pantalla

source: The default dpi used for on-screen display was changed from 80 dpi to 100 dpi, the same as the default dpi for saving files. Due to this change, the on-screen display is now more what-you-see-is-what-you-get for saved files. To keep the figure the same size in terms of pixels, in order to maintain approximately the same size on the screen, the default figure size was reduced from 8x6 inches to 6.4x4.8 inches. As a consequence of this the default font sizes used for the title, tick labels, and axes labels were reduced to maintain their size relative to the overall size of the figure. By default the dpi of the saved image is now the dpi of the `~matplotlib.figure.Figure` instance being saved.
es_es: Los ppp por defecto utilizados para la visualización en pantalla se han cambiado de 80 ppp a 100 ppp, igual que los ppp por defecto para guardar archivos. Debido a este cambio, la visualización en pantalla es ahora más lo que se ve es lo que se obtiene para los archivos guardados. Para mantener el mismo tamaño de la figura en términos de píxeles, con el fin de mantener aproximadamente el mismo tamaño en la pantalla, el tamaño de la figura por defecto se redujo de 8x6 pulgadas a 6,4x4,8 pulgadas. Como consecuencia de esto, se redujeron los tamaños de fuente por defecto utilizados para el título, las etiquetas de las marcas y las etiquetas de los ejes para mantener su tamaño en relación con el tamaño total de la figura. Por defecto, los ppp de la imagen guardada son ahora los ppp de la instancia `~matplotlib.figure.Figure` que se guarda.

source: This will have consequences if you are trying to match text in a figure directly with external text.
es_es: Esto tendrá consecuencias si intentas hacer coincidir el texto de una figura directamente con un texto externo.

source: In your :file:`matplotlibrc` file.
es_es: En su archivo :file:`matplotlibrc`.

source: In addition, the ``forward`` kwarg to `~.Figure.set_size_inches` now defaults to `True` to improve the interactive experience. Backend canvases that adjust the size of their bound `matplotlib.figure.Figure` must pass ``forward=False`` to avoid circular behavior. This default is not configurable.
es_es: Además, el kwarg ``forward`` para `~.Figure.set_size_inches` ahora es por defecto `True` para mejorar la experiencia interactiva. Los lienzos del backend que ajustan el tamaño de su `matplotlib.figure.Figure` deben pasar ``forward=False`` para evitar un comportamiento circular. Este valor por defecto no es configurable.

source: Plotting functions
es_es: Funciones de graficación

source: The following changes were made to the default behavior of `~matplotlib.axes.Axes.scatter`
es_es: Se han realizado los siguientes cambios en el comportamiento por defecto de `~matplotlib.axes.Axes.scatter`

source: The default size of the elements in a scatter plot is now based on :rc:`lines.markersize` so it is consistent with ``plot(X, Y, 'o')``. The old value was 20, and the new value is 36 (6^2).
es_es: El tamaño por defecto de los elementos en un gráfico de dispersión se basa ahora en :rc:`lines.markersize` para que sea consistente con ``plot(X, Y, 'o')``. El valor anterior era 20, y el nuevo es 36 (6^2).

source: Scatter markers no longer have a black edge.
es_es: Los marcadores de dispersión ya no tienen un borde negro.

source: If the color of the markers is not specified it will follow the property cycle, pulling from the 'patches' cycle on the ``Axes``.
es_es: Si no se especifica el color de los marcadores seguirá el ciclo de la propiedad, tirando del ciclo de "parches" en el ``Axes``.

source: The classic default behavior of `~matplotlib.axes.Axes.scatter` can only be recovered through ``mpl.style.use('classic')``. The marker size can be recovered via ::
es_es: El comportamiento clásico por defecto de `~matplotlib.axes.Axes.scatter` sólo puede recuperarse a través de ``mpl.style.use('classic')``. El tamaño del marcador se puede recuperar a través de ::

source: however, this will also affect the default marker size of `~matplotlib.axes.Axes.plot`. To recover the classic behavior on a per-call basis pass the following kwargs::
es_es: sin embargo, esto también afectará al tamaño del marcador por defecto de `~matplotlib.axes.Axes.plot`. Para recuperar el comportamiento clásico en una base por llamada pase los siguientes kwargs::

source: The following changes were made to the default behavior of `~matplotlib.axes.Axes.plot`
es_es: Se han realizado los siguientes cambios en el comportamiento por defecto de `~matplotlib.axes.Axes.plot`

source: the default linewidth increased from 1 to 1.5
es_es: el ancho de línea por defecto aumentó de 1 a 1,5

source: the dash patterns associated with ``'--'``, ``':'``, and ``'-.'`` have changed
es_es: los patrones de guiones asociados a ``'--'``, ``':'``, y ``'-.'`` han cambiado

source: the dash patterns now scale with line width
es_es: los patrones de guiones ahora se escalan con el ancho de la línea

source: The previous defaults can be restored by setting::
es_es: Se pueden restablecer los valores predeterminados anteriores configurando::

source: By default, caps on the ends of errorbars are not present.
es_es: Por defecto, las mayúsculas en los extremos de las barras de error no están presentes.

source: This also changes the return value of :meth:`~matplotlib.axes.Axes.errorbar` as the list of 'caplines' will be empty by default.
es_es: Esto también cambia el valor de retorno de :meth:`~matplotlib.axes.Axes.errorbar` ya que la lista de 'caplines' estará vacía por defecto.

source: Previously, boxplots were composed of a mish-mash of styles that were, for better for worse, inherited from Matlab. Most of the elements were blue, but the medians were red. The fliers (outliers) were black plus-symbols ('+') and the whiskers were dashed lines, which created ambiguity if the (solid and black) caps were not drawn.
es_es: Antes, los gráficos de caja se componían de un conjunto de estilos que, para bien o para mal, se habían heredado de Matlab. La mayoría de los elementos eran azules, pero las medianas eran rojas. Los fliers (valores atípicos) eran símbolos negros ('+') y los whiskers eran líneas discontinuas, lo que creaba ambigüedad si no se dibujaban las mayúsculas (sólidas y negras).

source: For the new defaults, everything is black except for the median and mean lines (if drawn), which are set to the first two elements of the current color cycle. Also, the default flier markers are now hollow circles, which maintain the ability of the plus-symbols to overlap without obscuring data too much.
es_es: Para los nuevos valores por defecto, todo es negro excepto las líneas de la mediana y la media (si se dibujan), que se establecen en los dos primeros elementos del ciclo de color actual. Además, los marcadores de volantes por defecto son ahora círculos huecos, que mantienen la capacidad de superposición de los símbolos más sin oscurecer demasiado los datos.

source: ``fill_between`` and ``fill_betweenx``
es_es: ``fill_entre`` y ``fill_betweenx``

source: If the facecolor is set via the ``facecolors`` or ``color`` keyword argument, then the color is not cycled.
es_es: Si el color de la cara se establece a través del argumento de la palabra clave ``facecolors`` o ``color``, entonces el color no se cicla.

source: To restore the previous behavior, explicitly pass the keyword argument ``facecolors='C0'`` to the method call.
es_es: Para restaurar el comportamiento anterior, pasa explícitamente el argumento de la palabra clave ``facecolors='C0'`` a la convocatoria del método.

source: Patch edges and color
es_es: Bordes y color del parche

source: Most artists drawn with a patch (``~matplotlib.axes.Axes.bar``, ``~matplotlib.axes.Axes.pie``, etc) no longer have a black edge by default. The default face color is now ``'C0'`` instead of ``'b'``.
es_es: La mayoría de los artists dibujados con un parche (``~matplotlib.axes.Axes.bar``, ``~matplotlib.axes.Axes.pie``, etc) ya no tienen un borde negro por defecto. El color de la cara por defecto es ahora `'C0'`` en lugar de ``'b'``.

source: The default value of the *linecolor* keyword argument for `~.Axes.hexbin` has changed from ``'none'`` to ``'face'``. If 'none' is now supplied, no line edges are drawn around the hexagons.
es_es: El valor por defecto del argumento de la palabra clave *linecolor* para `~.Axes.hexbin` ha cambiado de ``'none'` a ``'face'``. Si se suministra 'none', no se dibujan bordes de línea alrededor de los hexágonos.

source: ``bar`` and ``barh``
es_es: ``bar`` y ``barh``

source: The default value of the ``align`` kwarg for both `~.Axes.bar` and `~.Axes.barh` is changed from ``'edge'`` to ``'center'``.
es_es: El valor por defecto del kwarg ``align`` tanto para `~.Axes.bar` como para `~.Axes.barh` se cambia de ``'edge'`` a ``'center'``.

source: To restore the previous behavior explicitly pass the keyword argument ``align='edge'`` to the method call.
es_es: Para restablecer el comportamiento anterior, pasa explícitamente el argumento de palabra clave ``align='edge'`` a la llamada al método.

source: Hatching
es_es: Incubando

source: The color of the lines in the hatch is now determined by
es_es: El color de las líneas de la escotilla está ahora determinado por

source: If an edge color is explicitly set, use that for the hatch color
es_es: Si se establece explícitamente un color de borde, se utilizará para el color del sombreado

source: If the edge color is not explicitly set, use :rc:`hatch.color` which is looked up at artist creation time.
es_es: Si el color del borde no se establece explícitamente, utilice :rc:`hatch.color` que se busca en el momento de la creación del artist.

source: The width of the lines in a hatch pattern is now configurable by the rcParams :rc:`hatch.linewidth`, which defaults to 1 point. The old behavior for the line width was different depending on backend:
es_es: El ancho de las líneas en un patrón de sombreado es ahora configurable por el rcParams :rc:`hatch.linewidth`, que por defecto es de 1 punto. El antiguo comportamiento de la anchura de las líneas era diferente dependiendo del backend:

source: The old line width behavior can not be restored across all backends simultaneously, but can be restored for a single backend by setting::
es_es: El antiguo comportamiento del ancho de línea no puede ser restaurado en todos los backends simultáneamente, pero puede ser restaurado para un solo backend configurando::

source: The behavior of the PS and Agg backends was DPI dependent, thus::
es_es: El comportamiento de los backends PS y Agg dependía de los DPI, así::

source: There is no direct API level control of the hatch color or linewidth.
es_es: No hay un control directo a nivel de API del color del sombreado o del ancho de línea.

source: Hatching patterns are now rendered at a consistent density, regardless of DPI. Formerly, high DPI figures would be more dense than the default, and low DPI figures would be less dense. This old behavior cannot be directly restored, but the density may be increased by repeating the hatch specifier.
es_es: Los patrones de sombreado ahora se renderizan con una densidad consistente, independientemente de los PPP. Anteriormente, las figuras de alto DPI eran más densas que las predeterminadas, y las de bajo DPI eran menos densas. Este antiguo comportamiento no puede restaurarse directamente, pero la densidad puede aumentarse repitiendo el especificador de sombreado.

source: Fonts
es_es: Fuentes

source: Normal text
es_es: Texto normal

source: The default font has changed from "Bitstream Vera Sans" to "DejaVu Sans". DejaVu Sans has additional international and math characters, but otherwise has the same appearance as Bitstream Vera Sans. Latin, Greek, Cyrillic, Armenian, Georgian, Hebrew, and Arabic are `all supported <https://dejavu-fonts.github.io/>`__ (but right-to-left rendering is still not handled by matplotlib). In addition, DejaVu contains a sub-set of emoji symbols.
es_es: La fuente por defecto ha cambiado de "Bitstream Vera Sans" a "DejaVu Sans". DejaVu Sans tiene caracteres internacionales y matemáticos adicionales, pero por lo demás tiene el mismo aspecto que Bitstream Vera Sans. El latín, el griego, el cirílico, el armenio, el georgiano, el hebreo y el árabe son compatibles con DejaVu Sans <https://dejavu-fonts.github.io/>`__ (pero matplotlib aún no maneja la representación de derecha a izquierda). Además, DejaVu contiene un subconjunto de símbolos emoji.

source: See the `DejaVu Sans PDF sample for full coverage <http://dejavu.sourceforge.net/samples/DejaVuSans.pdf>`__.
es_es: Ver la muestra de `DejaVu Sans PDF para una cobertura completa <http://dejavu.sourceforge.net/samples/DejaVuSans.pdf>`__.

source: Math text
es_es: Texto matemático

source: The default math font when using the built-in math rendering engine (mathtext) has changed from "Computer Modern" (i.e. LaTeX-like) to "DejaVu Sans". This change has no effect if the TeX backend is used (i.e. ``text.usetex`` is ``True``).
es_es: La fuente matemática por defecto cuando se utiliza el motor de renderizado matemático incorporado (mathtext) ha cambiado de "Computer Modern" (es decir, similar a LaTeX) a "DejaVu Sans". Este cambio no tiene efecto si se utiliza el backend TeX (es decir, ``text.usetex`` es ``True``).

source: To revert to the old behavior set the::
es_es: Para revertir al viejo comportamiento establecer la::

source: or set::
es_es: o establecer::

source: This ``rcParam`` is consulted when the text is drawn, not when the artist is created. Thus all mathtext on a given ``canvas`` will use the same fontset.
es_es: Este ``rcParam`` se consulta cuando se dibuja el texto, no cuando se crea el artista. Por lo tanto, todos los textos matemáticos en un determinado ``canvas`` utilizarán el mismo conjunto de fuentes.

source: Legends
es_es: Leyendas

source: By default, the number of points displayed in a legend is now 1.
es_es: Por defecto, el número de puntos mostrados en una leyenda es ahora 1.

source: The default legend location is ``'best'``, so the legend will be automatically placed in a location to minimize overlap with data.
es_es: La ubicación de la leyenda por defecto es ``'best'``, por lo que la leyenda se colocará automáticamente en una ubicación para minimizar el solapamiento con los datos.

source: The legend defaults now include rounded corners, a lighter boundary, and partially transparent boundary and background.
es_es: Los valores predeterminados de la leyenda incluyen ahora esquinas redondeadas, un límite más claro y un límite y fondo parcialmente transparentes.

source: Image
es_es: Imagen

source: Interpolation
es_es: Interpolación

source: The default interpolation method for `~matplotlib.axes.Axes.imshow` is now ``'nearest'`` and by default it resamples the data (both up and down sampling) before colormapping.
es_es: El método de interpolación por defecto para `~matplotlib.axes.Axes.imshow` es ahora ``'nearest'`` y por defecto remuestrea los datos (tanto el muestreo ascendente como el descendente) antes de mapear el color.

source: To restore the previous behavior set::
es_es: Para restaurar el conjunto de comportamiento anterior::

source: Colormapping pipeline
es_es: Pipeline de mapeo de colores

source: Previously, the input data was normalized, then colormapped, and then resampled to the resolution required for the screen. This meant that the final resampling was being done in color space. Because the color maps are not generally linear in RGB space, colors not in the colormap may appear in the final image. This bug was addressed by an almost complete overhaul of the image handling code.
es_es: Anteriormente, los datos de entrada se normalizaban, luego se mapeaban en color y después se remuestreaban a la resolución requerida para la pantalla. Esto significaba que el remuestreo final se hacía en el espacio de color. Dado que los mapas de color no son generalmente lineales en el espacio RGB, los colores que no están en el mapa de color pueden aparecer en la imagen final. Este error se solucionó con una revisión casi completa del código de manejo de la imagen.

source: The input data is now normalized, then resampled to the correct resolution (in normalized dataspace), and then colormapped to RGB space. This ensures that only colors from the colormap appear in the final image. (If your viewer subsequently resamples the image, the artifact may reappear.)
es_es: Los datos de entrada se normalizan, se remuestrean a la resolución correcta (en el espacio de datos normalizado) y se mapean los colores en el espacio RGB. Esto asegura que sólo los colores del mapa de color aparecen en la imagen final. (Si el visor vuelve a muestrear la imagen posteriormente, el artefacto puede volver a aparecer)

source: The previous behavior cannot be restored.
es_es: No se puede restablecer el comportamiento anterior.

source: Shading
es_es: Sombreado

source: The default shading mode for light source shading, in ``matplotlib.colors.LightSource.shade``, is now ``overlay``. Formerly, it was ``hsv``.
es_es: El modo de sombreado por defecto para el sombreado de la fuente de luz, en ``matplotlib.colors.LightSource.shade``, es ahora ``overlay``. Anteriormente, era ``hsv``.

source: Plot layout
es_es: Disposición de la gráfica

source: Auto limits
es_es: Límites del auto
