Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/dflt_style_changes.po
Languages: es_es

source: The previous auto-scaling behavior was to find 'nice' round numbers as view limits that enclosed the data limits, but this could produce bad plots if the data happened to fall on a vertical or horizontal line near the chosen 'round number' limit. The new default sets the view limits to 5% wider than the data range.
es_es: El comportamiento anterior de auto-escalado era encontrar números redondos 'agradables' como límites de vista que encerraban los límites de los datos, pero esto podía producir malos gráficos si los datos caían en una línea vertical u horizontal cerca del límite del 'número redondo' elegido. El nuevo valor por defecto establece los límites de la vista en un 5% más amplio que el rango de datos.

source: The size of the padding in the x and y directions is controlled by the ``'axes.xmargin'`` and ``'axes.ymargin'`` rcParams respectively. Whether the view limits should be 'round numbers' is controlled by :rc:`axes.autolimit_mode`. In the original ``'round_number'`` mode, the view limits coincide with ticks.
es_es: El tamaño del relleno en las direcciones x e y es controlado por los rcParams ``'axes.xmargin'`` y ``'axes.ymargin'`` respectivamente. Si los límites de la vista deben ser "números redondos" es controlado por :rc:`axes.autolimit_mode`. En el modo original ``'round_number``, los límites de la vista coinciden con los ticks.

source: or setting::
es_es: o ajuste::

source: Z-order
es_es: Orden-Z

source: Ticks and grids are now plotted above solid elements such as filled contours, but below lines. To return to the previous behavior of plotting ticks and grids above lines, set ``rcParams['axes.axisbelow'] = False``.
es_es: Las ticks y las cuadrículas se trazan ahora por encima de los elementos sólidos, como los contornos rellenos, pero por debajo de las líneas. Para volver al comportamiento anterior de trazar ticks y cuadrículas por encima de las líneas, establezca ``rcParams['axes.axisbelow'] = False``.

source: Direction
es_es: Dirección

source: To reduce the collision of tick marks with data, the default ticks now point outward by default. In addition, ticks are now drawn only on the bottom and left spines to prevent a porcupine appearance, and for a cleaner separation between subplots.
es_es: Para reducir la colisión de las marcas de tick con los datos, las ticks por defecto ahora apuntan hacia afuera por defecto. Además, las ticks se dibujan ahora sólo en los lomos inferiores e izquierdos para evitar una apariencia de puercoespín, y para una separación más limpia entre los subgráfico.

source: Number of ticks
es_es: Número de ticks

source: The default `~matplotlib.ticker.Locator` used for the x and y axis is `~matplotlib.ticker.AutoLocator` which tries to find, up to some maximum number, 'nicely' spaced ticks. The locator now includes an algorithm to estimate the maximum number of ticks that will leave room for the tick labels. By default it also ensures that there are at least two ticks visible.
es_es: El `~matplotlib.ticker.Locator` por defecto utilizado para los ejes x e y es `~matplotlib.ticker.AutoLocator` que intenta encontrar, hasta un número máximo, ticks "bien" espaciados. El localizador ahora incluye un algoritmo para estimar el número máximo de ticks que dejará espacio para las etiquetas de la marca del eje. Por defecto también se asegura de que haya al menos dos ticks visibles.

source: There is no way, other than using ``mpl.style.use('classic')``, to restore the previous behavior as the default. On an axis-by-axis basis you may either control the existing locator via: ::
es_es: No hay otra manera, aparte de usar ``mpl.style.use('classic')``, de restaurar el comportamiento anterior como el predeterminado. Eje por eje, puede controlar el localizador existente a través de ::

source: or create a new `~matplotlib.ticker.MaxNLocator`::
es_es: o crea un nuevo `~matplotlib.ticker.MaxNLocator`::

source: The algorithm used by `~matplotlib.ticker.MaxNLocator` has been improved, and this may change the choice of tick locations in some cases. This also affects `~matplotlib.ticker.AutoLocator`, which uses ``MaxNLocator`` internally.
es_es: El algoritmo utilizado por `~matplotlib.ticker.MaxNLocator` ha sido mejorado, y esto puede cambiar la elección de las ubicaciones de los ticks en algunos casos. Esto también afecta a `~matplotlib.ticker.AutoLocator`, que utiliza ``MaxNLocator`` internamente.

source: For a log-scaled axis the default locator is the `~matplotlib.ticker.LogLocator`. Previously the maximum number of ticks was set to 15, and could not be changed. Now there is a *numticks* kwarg for setting the maximum to any integer value, to the string 'auto', or to its default value of None which is equivalent to 'auto'. With the 'auto' setting the maximum number will be no larger than 9, and will be reduced depending on the length of the axis in units of the tick font size. As in the case of the AutoLocator, the heuristic algorithm reduces the incidence of overlapping tick labels but does not prevent it.
es_es: Para un eje de escala logarítmica el localizador por defecto es el `~matplotlib.ticker.LogLocator`. Anteriormente el número máximo de ticks se fijaba en 15, y no podía cambiarse. Ahora hay un kwarg *numticks* para establecer el máximo a cualquier valor entero, a la cadena 'auto', o a su valor por defecto de None que es equivalente a 'auto'. Con el ajuste 'auto' el número máximo no será mayor de 9, y se reducirá dependiendo de la longitud del eje en unidades del tamaño de la fuente de ticks. Al igual que en el caso del AutoLocalizador, el algoritmo heurístico reduce la incidencia de las etiquetas de garrapatas superpuestas, pero no la evita.

source: Tick label formatting
es_es: Formato de la etiqueta de la marca del eje

source: ``LogFormatter`` labeling of minor ticks
es_es: ``LogFormatter`` etiquetado de ticks menores

source: Minor ticks on a log axis are now labeled when the axis view limits span a range less than or equal to the interval between two major ticks. See `~matplotlib.ticker.LogFormatter` for details. The minor tick labeling is turned off when using ``mpl.style.use('classic')``, but cannot be controlled independently via `.rcParams`.
es_es: Las marcas menores en un eje de registro se etiquetan ahora cuando los límites de la vista del eje abarcan un rango menor o igual al intervalo entre dos marcas mayores. Ver `~matplotlib.ticker.LogFormatter` para más detalles. El etiquetado de ticks menores se desactiva cuando se utiliza ``mpl.style.use('classic')``, pero no puede controlarse de forma independiente mediante `.rcParams`.

source: ``ScalarFormatter`` tick label formatting with offsets
es_es: ``ScalarFormatter`` formato de etiqueta de marca del eje con desplazamientos

source: With the default :rc:`axes.formatter.useoffset`, an offset will be used when it will save 4 or more digits. This can be controlled with the new :rc:`axes.formatter.offset_threshold`. To restore the previous behavior of using an offset to save 2 or more digits, use ``rcParams['axes.formatter.offset_threshold'] = 2``.
es_es: Con el valor predeterminado :rc:`axes.formatter.useoffset`, se utilizará un desplazamiento cuando se guarden 4 o más dígitos. Esto puede controlarse con el nuevo :rc:`axes.formatter.offset_threshold`. Para restaurar el comportamiento anterior de utilizar un offset para guardar 2 o más dígitos, utiliza ``rcParams['axes.formatter.offset_threshold'] = 2``.

source: ``AutoDateFormatter`` format strings
es_es: Cadenas de formato ``AutoDateFormatter``

source: The default date formats are now all based on ISO format, i.e., with the slowest-moving value first. The date formatters are configurable through the ``date.autoformatter.*`` rcParams.
es_es: Los formatos de fecha por defecto se basan ahora en el formato ISO, es decir, con el valor más lento primero. Los formateadores de fecha son configurables a través de los ``date.autoformatter.*` rcParams.

source: Threshold (tick interval >= than)
es_es: Umbral (tick interval >= than)

source: classic
es_es: clásico

source: 365 days
es_es: 365 días

source: 30 days
es_es: 30 días

source: 1 day
es_es: 1 día

source: 1 hour
es_es: 1 hora

source: 1 minute
es_es: 1 minuto

source: 1 second
es_es: 1 segundo

source: 1 microsecond
es_es: 1 microsegundo

source: Python's ``%x`` and ``%X`` date formats may be of particular interest to format dates based on the current locale.
es_es: Los formatos de fecha ``%x`` y ``%X`` de Python pueden ser especialmente interesantes para dar formato a las fechas en función de la localización actual.

source: The previous default can be restored by::
es_es: Se puede restablecer el valor predeterminado anterior mediante::

source: or setting ::
es_es: o el ajuste ::

source: mplot3d now obeys some style-related rcParams, rather than using hard-coded defaults. These include:
es_es: mplot3d ahora obedece a algunos rcParams relacionados con el estilo, en lugar de utilizar valores predeterminados codificados. Estos incluyen:
