Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_3.4.0.po
Languages: es_es

source: Sliders can now snap to arbitrary values
es_es: Los carruseles ahora pueden ajustarse a valores arbitrarios

source: The `~matplotlib.widgets.Slider` UI widget now accepts arrays for *valstep*. This generalizes the previous behavior by allowing the slider to snap to arbitrary values.
es_es: El widget UI `~matplotlib.widgets.Slider` ahora acepta arreglos para *valstep*. Esto generaliza el comportamiento anterior permitiendo que el carrusel se ajuste a valores arbitrarios.

source: Pausing and Resuming Animations
es_es: Pausar y reanudar animaciones

source: The `.animation.Animation.pause` and `.animation.Animation.resume` methods allow you to pause and resume animations. These methods can be used as callbacks for event listeners on UI elements so that your plots can have some playback control UI.
es_es: Los métodos `.animation.Animation.pause` y `.animation.Animation.resume` te permiten pausar y reanudar las animaciones. Estos métodos se pueden utilizar como devoluciones de invocación para los oyentes de eventos en los elementos IU para que sus gráficos puedan tener alguna IU de control de reproducción.

source: Sphinx extensions
es_es: Extensiones de Sphinx

source: ``plot_directive`` *caption* option
es_es: Opción ``plot_directive`` *caption*

source: Captions were previously supported when using the ``plot_directive`` directive with an external source file by specifying content::
es_es: Anteriormente se admitían los subtítulos cuando se utilizaba la instrucción ``plot_directive`` con un archivo fuente externo especificando el contenido::

source: The ``:caption:`` option allows specifying the caption for both external::
es_es: La opción ``:caption:`` permite especificar el pie de foto para ambos externos::

source: and inline plots::
es_es: y los gráficos en línea::

source: Backend-specific improvements
es_es: Mejoras específicas para el backend

source: Consecutive rasterized draws now merged
es_es: Los dibujos rasterizados consecutivos ahora se fusionan

source: Elements of a vector output can be individually set to rasterized, using the *rasterized* keyword argument, or `~.artist.Artist.set_rasterized()`. This can be useful to reduce file sizes. For figures with multiple raster elements they are now automatically merged into a smaller number of bitmaps where this will not effect the visual output. For cases with many elements this can result in significantly smaller file sizes.
es_es: Los elementos de una salida vectorial pueden establecerse individualmente como rasterizados, utilizando el argumento de la palabra clave *rasterized*, o `~.artist.Artist.set_rasterized()`. Esto puede ser útil para reducir el tamaño de los archivos. En el caso de las figuras con múltiples elementos rasterizados, ahora se fusionan automáticamente en un número menor de mapas de bits cuando esto no afecte a la salida visual. Para casos con muchos elementos, esto puede resultar en tamaños de archivo significativamente menores.

source: To ensure this happens do not place vector elements between raster ones.
es_es: Para que esto ocurra, no coloque elementos vectoriales entre los rasterizados.

source: To inhibit this merging set ``Figure.suppressComposite`` to True.
es_es: Para inhibir esta fusión establezca ``Figure.suppressComposite`` a True.

source: Support raw/rgba frame format in ``FFMpegFileWriter``
es_es: Soporta el formato de fotogramas raw/rgba en ``FFMpegFileWriter``

source: When using `.FFMpegFileWriter`, the *frame_format* may now be set to ``"raw"`` or ``"rgba"``, which may be slightly faster than an image format, as no encoding/decoding need take place between Matplotlib and FFmpeg.
es_es: Cuando se utiliza `.FFMpegFileWriter`, el *frame_format* puede ahora establecerse como ``"raw"`` o ``"rgba"``, lo que puede ser ligeramente más rápido que un formato de imagen, ya que no es necesario codificar/decodificar entre Matplotlib y FFmpeg.

source: nbAgg/WebAgg support middle-click and double-click
es_es: nbAgg/WebAgg soportan el clic del medio y el doble clic

source: Double click events are now supported by the nbAgg and WebAgg backends. Formerly, WebAgg would report middle-click events as right clicks, but now reports the correct button type.
es_es: Los eventos de doble clic son ahora soportados por los backends nbAgg y WebAgg. Anteriormente, WebAgg informaba de los eventos de clic en el medio como clics derechos, pero ahora informa del tipo de botón correcto.

source: nbAgg support binary communication
es_es: nbAgg soporta la comunicación binaria

source: If the web browser and notebook support binary websockets, nbAgg will now use them for slightly improved transfer of figure display.
es_es: Si el navegador web y el portátil soportan websockets binarios, nbAgg los utilizará ahora para una transferencia ligeramente mejorada de la visualización de figuras.

source: Indexed color for PNG images in PDF files when possible
es_es: Color indexado para imágenes PNG en archivos PDF cuando sea posible

source: When PNG images have 256 colors or fewer, they are converted to indexed color before saving them in a PDF. This can result in a significant reduction in file size in some cases. This is particularly true for raster data that uses a colormap but no interpolation, such as Healpy mollview plots. Currently, this is only done for RGB images.
es_es: Cuando las imágenes PNG tienen 256 colores o menos, se convierten a color indexado antes de guardarlas en un PDF. En algunos casos, esto puede suponer una reducción significativa del tamaño del archivo. Esto es especialmente cierto en el caso de los datos rasterizados que utilizan un mapa de colores pero sin interpolación, como los gráficos de Healpy mollview. Actualmente, esto sólo se hace para las imágenes RGB.

source: Improved font subsettings in PDF/PS
es_es: Mejora de los subconjuntos de fuentes en PDF/PS

source: Font subsetting in PDF and PostScript has been re-written from the embedded ``ttconv`` C code to Python. Some composite characters and outlines may have changed slightly. This fixes ttc subsetting in PDF, and adds support for subsetting of type 3 OTF fonts, resulting in smaller files (much smaller when using CJK fonts), and avoids running into issues with type 42 embedding and certain PDF readers such as Acrobat Reader.
es_es: El subconjunto de fuentes en PDF y PostScript ha sido reescrito desde el código C ``ttconv`` incrustado a Python. Algunos caracteres compuestos y contornos pueden haber cambiado ligeramente. Esto corrige el subconjunto de ttc en PDF, y añade soporte para el subconjunto de fuentes OTF de tipo 3, lo que resulta en archivos más pequeños (mucho más pequeños cuando se utilizan fuentes CJK), y evita los problemas con embedding de tipo 42 y ciertos lectores de PDF como Acrobat Reader.

source: Kerning added to strings in PDFs
es_es: Se añade el kerning a las cadenas en los PDF

source: As with text produced in the Agg backend (see :ref:`the previous what's new entry <whats-new-3-2-0-kerning>` for examples), PDFs now include kerning in text strings.
es_es: Al igual que con el texto producido en el backend Agg ( ver :ref:`the previous what's new entry <whats-new-3-2-0-kerning>` para ejemplos), los PDFs ahora incluyen kerning en las cadenas de texto.

source: Fully-fractional HiDPI in QtAgg
es_es: HiDPI totalmente fraccionado en QtAgg

source: Fully-fractional HiDPI (that is, HiDPI ratios that are not whole integers) was added in Qt 5.14, and is now supported by the QtAgg backend when using this version of Qt or newer.
es_es: El HiDPI completamente fraccionario (es decir, los ratios HiDPI que no son enteros) fue añadido en Qt 5.14, y ahora es soportado por el backend QtAgg cuando se utiliza esta versión de Qt o más reciente.

source: wxAgg supports fullscreen toggle
es_es: wxAgg soporta la alternancia de pantalla completa

source: The wxAgg backend supports toggling fullscreen using the :kbd:`f` shortcut, or the manager function `.FigureManagerBase.full_screen_toggle`.
es_es: El backend de wxAgg soporta la conmutación de pantalla completa usando el atajo de teclado :kbd:`f`, o la función del gestor `.FigureManagerBase.full_screen_toggle`.
