Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_2.0.0.po
Languages: es_es

source: What's new in Matplotlib 2.0 (Jan 17, 2017)
es_es: Novedades en Matplotlib 2.0 (Mar 17, 2017)

source: Matplotlib 2.0 supports Python 2.7, and 3.4+
es_es: Matplotlib 2.0 soporta Python 2.7, y 3.4+

source: Default style changes
es_es: Cambios de estilo por defecto

source: The major changes in v2.0 are related to overhauling the default styles.
es_es: Los cambios principales en la v2.0 están relacionados con la revisión de los estilos predeterminados.

source: Improved color conversion API and RGBA support
es_es: Mejoras en la conversión de color API y soporte RGBA

source: The :mod:`~matplotlib.colors` gained a new color conversion API with full support for the alpha channel. The main public functions are :func:`~matplotlib.colors.is_color_like`, :func:`matplotlib.colors.to_rgba`, :func:`matplotlib.colors.to_rgba_array` and :func:`~matplotlib.colors.to_hex`. RGBA quadruplets are encoded in hex format as "#rrggbbaa".
es_es: El :mod:`~matplotlib.colors` incorporó una nueva API de conversión de color con soporte completo para el canal alfa. Las principales funciones públicas son :func:`~matplotlib.colors.is_color_like`, :func:`matplotlib.colors.to_rgba`, :func:`matplotlib.colors.to_rgba_array` y :func:`~matplotlib.colors.to_hex`. Los cuartetos RGBA se codifican en formato hexadecimal como "#rrggbbaa".

source: A side benefit is that the Qt options editor now allows setting the alpha channel of the artists as well.
es_es: Un beneficio secundario es que el editor de opciones de Qt ahora permite establecer también el canal alfa de los artists.

source: New Configuration (rcParams)
es_es: Nueva configuración (rcParams)

source: New rcparams added
es_es: Nuevo rcparams añadido

source: Parameter
es_es: Parámetro

source: Description
es_es: Descripción

source: format string for 'year' scale dates
es_es: formato de cadena para las fechas de escala 'year'

source: format string for 'month' scale dates
es_es: formato de cadena para las fechas de escala 'month'

source: format string for 'day' scale dates
es_es: formato de cadena para las fechas de escala 'day'

source: format string for 'hour' scale times
es_es: formato de cadena para tiempos de escala 'hora'

source: format string for 'minute' scale times
es_es: formato de cadena para tiempos de escala 'minute'

source: format string for 'second' scale times
es_es: formato de cadena para tiempos de escala 'second'

source: format string for 'microsecond' scale times
es_es: formato de cadena para tiempos de escala 'microsecond'

source: default marker for scatter plot
es_es: marcador por defecto para el gráfico de dispersión

source: see note
es_es: ver nota

source: Control where major and minor ticks are drawn. The global values are ``and``\ed with the corresponding major/minor values. corresponding major/minor values.
es_es: Controla dónde se dibujan las ticks importantes y menores. Los valores globales se hacen ``y`` con los correspondientes valores mayores/menores. correspondientes valores mayores/menores.

source: The default number of bins to use in `~matplotlib.axes.Axes.hist`. This can be an `int`, a list of floats, or ``'auto'`` if numpy >= 1.11 is installed.
es_es: El número por defecto de bins a utilizar en `~matplotlib.axes.Axes.hist`. Puede ser un `int`, una lista de flotantes, o ``'auto`` si numpy >= 1.11 está instalado.

source: Whether the line dash patterns should scale with linewidth.
es_es: Si los patrones de guiones de línea deben escalar con el ancho de línea.

source: Minimum number of digits saved in tick labels that triggers using an offset.
es_es: Número mínimo de dígitos guardados en las etiquetas de ticks que se activan usando un offset.

source: Added ``svg.hashsalt`` key to rcParams
es_es: Se agregó la clave ``svg.hashsalt`` a rcParams

source: If ``svg.hashsalt`` is ``None`` (which it is by default), the svg backend uses ``uuid4`` to generate the hash salt. If it is not ``None``, it must be a string that is used as the hash salt instead of ``uuid4``. This allows for deterministic SVG output.
es_es: Si ``svg.hashsalt`` es ``None`` (que es por defecto), el backend svg utiliza ``uuid4`` para generar la sal hash. Si no es ``None``, debe ser una cadena que se utilice como sal hash en lugar de ``uuid4``. Esto permite una salida SVG determinista.

source: Removed the ``svg.image_noscale`` rcParam
es_es: Se ha eliminado el rcParam ``svg.image_noscale``

source: As a result of the extensive changes to image handling, the ``svg.image_noscale`` rcParam has been removed. The same functionality may be achieved by setting ``interpolation='none'`` on individual images or globally using the ``image.interpolation`` rcParam.
es_es: Como resultado de los extensos cambios en el manejo de imágenes, se ha eliminado el rcParam ``svg.image_noscale``. La misma funcionalidad puede lograrse estableciendo ``interpolación='none'`` en imágenes individuales o globalmente usando el rcParam ``image.interpolation``.

source: Qualitative colormaps
es_es: Mapas cualitativos de colores

source: ColorBrewer's "qualitative" colormaps ("Accent", "Dark2", "Paired", "Pastel1", "Pastel2", "Set1", "Set2", "Set3") were intended for discrete categorical data, with no implication of value, and therefore have been converted to ``ListedColormap`` instead of ``LinearSegmentedColormap``, so the colors will no longer be interpolated and they can be used for choropleths, labeled image features, etc.
es_es: Los mapas de colores "cualitativos" de ColorBrewer ("Accent", "Dark2", "Paired", "Pastel1", "Pastel2", "Set1", "Set2", "Set3") estaban pensados para datos categóricos discretos, sin implicación de valor, y por lo tanto se han convertido en ``ListedColormap`` en lugar de ``LinearSegmentedColormap``, por lo que los colores ya no se interpolan y pueden utilizarse para coropletas, características de imágenes etiquetadas, etc.

source: Axis offset label now responds to *labelcolor*
es_es: La etiqueta de desplazamiento del eje responde ahora a *labelcolor*

source: Axis offset labels are now colored the same as axis tick markers when *labelcolor* is altered.
es_es: Las etiquetas de desplazamiento de los ejes tienen ahora el mismo color que los marcadores de los ejes cuando se modifica *labelcolor*.

source: Improved offset text choice
es_es: Mejora de la elección del texto de desplazamiento

source: The default offset-text choice was changed to only use significant digits that are common to all ticks (e.g. 1231..1239 -> 1230, instead of 1231), except when they straddle a relatively large multiple of a power of ten, in which case that multiple is chosen (e.g. 1999..2001->2000).
es_es: La elección del texto de desplazamiento por defecto se ha cambiado para utilizar sólo los dígitos significativos que son comunes a todas las marcas (por ejemplo, 1231..1239 -> 1230, en lugar de 1231), excepto cuando se encuentran entre un múltiplo relativamente grande de una potencia de diez, en cuyo caso se elige ese múltiplo (por ejemplo, 1999..2001->2000).

source: Style parameter blacklist
es_es: Lista negra de parámetros de estilo

source: In order to prevent unexpected consequences from using a style, style files are no longer able to set parameters that affect things unrelated to style. These parameters include::
es_es: Para evitar consecuencias inesperadas del uso de un estilo, los archivos de estilo ya no pueden establecer parámetros que afecten a cosas no relacionadas con el estilo. Estos parámetros incluyen::

source: Change in default font
es_es: Cambio de la fuente por defecto

source: The default font used by matplotlib in text has been changed to DejaVu Sans and DejaVu Serif for the sans-serif and serif families, respectively. The DejaVu font family is based on the previous matplotlib default --Bitstream Vera-- but includes a much wider range of characters.
es_es: La fuente por defecto utilizada por matplotlib en el texto ha sido cambiada a DejaVu Sans y DejaVu Serif para las familias sans-serif y serif, respectivamente. La familia de fuentes DejaVu está basada en la anterior por defecto de matplotlib -Bitstream Vera-- pero incluye una gama mucho más amplia de caracteres.

source: The default mathtext font has been changed from Computer Modern to the DejaVu family to maintain consistency with regular text. Two new options for the ``mathtext.fontset`` configuration parameter have been added: ``dejavusans`` (default) and ``dejavuserif``. Both of these options use DejaVu glyphs whenever possible and fall back to STIX symbols when a glyph is not found in DejaVu. To return to the previous behavior, set the rcParam ``mathtext.fontset`` to ``cm``.
es_es: La fuente por defecto de mathtext ha sido cambiada de Computer Modern a la familia DejaVu para mantener la consistencia con el texto regular. Se han añadido dos nuevas opciones para el parámetro de configuración ``mathtext.fontset``: ``dejavusans`` (por defecto) y ``dejavuserif``. Ambas opciones utilizan los glifos DejaVu siempre que sea posible y vuelven a los símbolos STIX cuando no se encuentra un glifo en DejaVu. Para volver al comportamiento anterior, establezca el rcParam ``mathtext.fontset`` a ``cm``.

source: Faster text rendering
es_es: Renderizado de texto más rápido

source: Rendering text in the Agg backend is now less fuzzy and about 20% faster to draw.
es_es: El renderizado de texto en el backend Agg es ahora menos borroso y aproximadamente un 20% más rápido de dibujar.

source: Improvements for the Qt figure options editor
es_es: Mejoras para el editor de opciones de figura Qt

source: Various usability improvements were implemented for the Qt figure options editor, among which:
es_es: Se han implementado varias mejoras de usabilidad para el editor de opciones de figuras de Qt, entre ellas:

source: Line style entries are now sorted without duplicates.
es_es: Las entradas de estilo de línea se ordenan ahora sin duplicados.

source: The colormap and normalization limits can now be set for images.
es_es: El mapa de colores y los límites de normalización pueden ahora establecerse para las imágenes.

source: Line edits for floating values now display only as many digits as necessary to avoid precision loss. An important bug was also fixed regarding input validation using Qt5 and a locale where the decimal separator is ",".
es_es: Las ediciones de líneas para valores flotantes ahora muestran sólo los dígitos necesarios para evitar la pérdida de precisión. También se ha corregido un error importante relacionado con la validación de entradas utilizando Qt5 y una configuración regional en la que el separador decimal es ",".

source: The axes selector now uses shorter, more user-friendly names for axes, and does not crash if there are no axes.
es_es: El selector de ejes ahora utiliza nombres más cortos y fáciles de usar para los ejes, y no se bloquea si no hay ejes.

source: Line and image entries using the default labels ("_lineX", "_imageX") are now sorted numerically even when there are more than 10 entries.
es_es: Las entradas de líneas e imágenes que utilizan las etiquetas por defecto ("_lineX", "_imageX") se ordenan ahora numéricamente incluso cuando hay más de 10 entradas.

source: Improved image support
es_es: Soporte de imagen mejorado

source: Prior to version 2.0, matplotlib resampled images by first applying the colormap and then resizing the result. Since the resampling was performed on the colored image, this introduced colors in the output image that didn't actually exist in the colormap. Now, images are resampled first (and entirely in floating-point, if the input image is floating-point), and then the colormap is applied.
es_es: Antes de la versión 2.0, matplotlib remuestreaba las imágenes aplicando primero el mapa de colores y luego redimensionando el resultado. Como el remuestreo se realizaba sobre la imagen coloreada, esto introducía colores en la imagen de salida que no existían en el mapa de colores. Ahora, las imágenes se remuestrean primero (y completamente en punto flotante, si la imagen de entrada es de punto flotante), y luego se aplica el mapa de colores.

source: In order to make this important change, the image handling code was almost entirely rewritten. As a side effect, image resampling uses less memory and fewer datatype conversions than before.
es_es: Para realizar este importante cambio, se ha reescrito casi por completo el código de gestión de imágenes. Como efecto secundario, el remuestreo de imágenes utiliza menos memoria y menos conversiones de tipos de datos que antes.

source: The experimental private feature where one could "skew" an image by setting the private member ``_image_skew_coordinate`` has been removed. Instead, images will obey the transform of the axes on which they are drawn.
es_es: Se ha eliminado la función privada experimental que permitía "sesgar" una imagen estableciendo la coordenada privada ``image_skew_coordinate``. En su lugar, las imágenes obedecerán a la transformación de los ejes sobre los que se dibujan.

source: Non-linear scales on image plots
es_es: Escalas no lineales en los trazados de imágenes

source: `~.Axes.imshow` now draws data at the requested points in data space after the application of non-linear scales.
es_es: `~.Axes.imshow` ahora dibuja los datos en los puntos solicitados en el espacio de datos después de la aplicación de escalas no lineales.

source: The image on the left demonstrates the new, correct behavior. The old behavior can be recreated using `~.Axes.pcolormesh` as demonstrated on the right.
es_es: La imagen de la izquierda muestra el nuevo comportamiento correcto. El antiguo comportamiento puede recrearse utilizando `~.Axes.pcolormesh` como se demuestra en la derecha.

source: This can be understood by analogy to plotting a histogram with linearly spaced bins with a logarithmic x-axis. Equal sized bins will be displayed as wider for small *x* and narrower for large *x*.
es_es: Esto puede entenderse por analogía con el trazado de un histograma con intervalos lineales con un eje x logarítmico. Los intervalos de igual tamaño se mostrarán como más anchos para *x* pequeños y más estrechos para *x* grandes.

source: Support for HiDPI (Retina) displays in the NbAgg and WebAgg backends
es_es: Soporte para pantallas HiDPI (Retina) en los backends NbAgg y WebAgg

source: The NbAgg and WebAgg backends will now use the full resolution of your high-pixel-density display.
es_es: Los backends NbAgg y WebAgg utilizarán ahora la resolución completa de su pantalla de alta densidad de píxeles.

source: Change in the default animation codec
es_es: Cambio en el códec de animación por defecto

source: The default animation codec has been changed from ``mpeg4`` to ``h264``, which is more efficient. It can be set via the ``animation.codec`` rcParam.
es_es: El códec de animación por defecto ha sido cambiado de ``mpeg4`` a ``h264``, que es más eficiente. Se puede establecer a través del rcParam ``animation.codec``.

source: Deprecated support for mencoder in animation
es_es: Soporte obsoleto para mencoder en la animación

source: The use of mencoder for writing video files with mpl is problematic; switching to ffmpeg is strongly advised. All support for mencoder will be removed in version 2.2.
es_es: El uso de mencoder para escribir archivos de vídeo con mpl es problemático; se recomienda encarecidamente cambiar a ffmpeg. Todo el soporte para mencoder será eliminado en la versión 2.2.

source: Boxplot Zorder Keyword Argument
es_es: Argumento de la palabra clave Boxplot Zorder

source: The *zorder* parameter now exists for `~.Axes.boxplot`. This allows the zorder of a boxplot to be set in the plotting function call. ::
es_es: El parámetro *zorder* existe ahora para `~.Axes.boxplot`. Esto permite establecer el zorder de un boxplot en la llamada a la función de trazado. ::

source: Filled ``+`` and ``x`` markers
es_es: Marcadores rellenables ``+`` y ``x``

source: New fillable *plus* and *x* markers have been added. See the :mod:`~matplotlib.markers` module and :doc:`marker reference </gallery/lines_bars_and_markers/marker_reference>` examples.
es_es: Se han añadido nuevos marcadores rellenables *plus* y *x*. Consulte el módulo :mod:`~matplotlib.markers` y los ejemplos :doc:`marker reference </gallery/lines_bars_and_markers/marker_reference>`.

source: *rcount* and *ccount* for `~.axes3d.Axes3D.plot_surface`
es_es: *rcount* y *ccount* para `~.axes3d.Axes3D.plot_surface`

source: As of v2.0, mplot3d's `~.axes3d.Axes3D.plot_surface` now accepts *rcount* and *ccount* arguments for controlling the sampling of the input data for plotting. These arguments specify the maximum number of evenly spaced samples to take from the input data. These arguments are also the new default sampling method for the function, and is considered a style change.
es_es: A partir de la versión 2.0, mplot3d's `~.axes3d.Axes3D.plot_surface` acepta ahora los argumentos *rcount* y *ccount* para controlar el muestreo de los datos de entrada para el trazado. Estos argumentos especifican el número máximo de muestras espaciadas uniformemente que se tomarán de los datos de entrada. Estos argumentos son también el nuevo método de muestreo por defecto para la función, y se considera un cambio de estilo.

source: The old *rstride* and *cstride* arguments, which specified the size of the evenly spaced samples, become the default when 'classic' mode is invoked, and are still available for use. There are no plans for deprecating these arguments.
es_es: Los antiguos argumentos *rstride* y *cstride*, que especificaban el tamaño de las muestras espaciadas uniformemente, se convierten en el valor por defecto cuando se invoca el modo "clásico", y siguen estando disponibles para su uso. No hay planes para eliminar estos argumentos.

source: Streamplot Zorder Keyword Argument Changes
es_es: Cambios en la palabra clave Streamplot Zorder

source: The ``zorder`` parameter for `~.Axes.streamplot` now has default value of ``None`` instead of ``2``. If ``None`` is given as ``zorder``, `~.Axes.streamplot` has a default ``zorder`` of ``matplotlib.lines.Line2D.zorder``.
es_es: El parámetro ``zorder`` para `~.Axes.streamplot` ahora tiene el valor por defecto de ``None`` en lugar de ``2``. Si se da ``None`` como ``zorder``, `~.Axes.streamplot` tiene un ``zorder`` por defecto de ``matplotlib.lines.Line2D.zorder``.

source: Extension to `matplotlib.backend_bases.GraphicsContextBase`
es_es: Ampliación de `matplotlib.backend_bases.GraphicsContextBase`

source: To support standardizing hatch behavior across the backends we ship the `matplotlib.backend_bases.GraphicsContextBase.get_hatch_color` method as added to `matplotlib.backend_bases.GraphicsContextBase`. This is only used during the render process in the backends we ship so will not break any third-party backends.
es_es: Para apoyar la estandarización del comportamiento de los sombreados en todos los backends, enviamos el método `matplotlib.backend_bases.GraphicsContextBase.get_hatch_color` añadido a `matplotlib.backend_bases.GraphicsContextBase`. Esto sólo se utiliza durante el proceso de renderizado en los backends que enviamos, por lo que no romperá ningún backend de terceros.

source: If you maintain a third-party backend which extends `~matplotlib.backend_bases.GraphicsContextBase` this method is now available to you and should be used to color hatch patterns.
es_es: Si mantienes un backend de terceros que extienda `~matplotlib.backend_bases.GraphicsContextBase` este método está ahora disponible para ti y deberías usarlo para colorear patrones de sombreado.
