Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_1.5.po
Languages: es_es

source: Added the ability to toggle the visibility of lines in Tables. Functionality added to the `.pyplot.table` factory function under the keyword argument "edges". Values can be the strings "open", "closed", "horizontal", "vertical" or combinations of the letters "L", "R", "T", "B" which represent left, right, top, and bottom respectively.
es_es: Se ha añadido la posibilidad de alternar la visibilidad de las líneas en las tablas. Funcionalidad añadida a la función de fábrica `.pyplot.table` bajo el argumento de la palabra clave "edges". Los valores pueden ser las cadenas "open", "closed", "horizontal", "vertical" o combinaciones de las letras "L", "R", "T", "B" que representan la izquierda, la derecha, la parte superior y la parte inferior respectivamente.

source: Zero r/cstride support in plot_wireframe
es_es: Cero soporte de r/cstride en plot_wireframe

source: Adam Hughes added support to mplot3d's plot_wireframe to draw only row or column line plots.
es_es: Adam Hughes ha añadido soporte a mplot3d's plot_wireframe para dibujar sólo gráficos de líneas de filas o columnas.

source: (`Source code <../../users/prev_whats_new/whats_new_1-5-5.py>`__, `png <../../users/prev_whats_new/whats_new_1-5-5.png>`__, `pdf <../../users/prev_whats_new/whats_new_1-5-5.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_1-5-5.py>`__, `png <../../users/prev_whats_new/whats_new_1-5-5.png>`__, `pdf <../../users/prev_whats_new/whats_new_1-5-5.pdf>`__)

source: Plot bar and barh with labels
es_es: Gráfico de barras y barras con etiquetas

source: Added kwarg *tick_label* to `~.Axes.bar` and `~.Axes.barh` to support plotting bar graphs with a text label for each bar.
es_es: Se ha añadido el kwarg*tick_label* to `~.Axes.bar` y `~.Axes.barh` para poder trazar gráficos de barras con una etiqueta de texto para cada barra.

source: (`Source code <../../users/prev_whats_new/whats_new_1-5-6.py>`__, `png <../../users/prev_whats_new/whats_new_1-5-6.png>`__, `pdf <../../users/prev_whats_new/whats_new_1-5-6.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_1-5-6.py>`__, `png <../../users/prev_whats_new/whats_new_1-5-6.png>`__, `pdf <../../users/prev_whats_new/whats_new_1-5-6.pdf>`__)

source: Added center and frame kwargs to pie
es_es: Añadidos los kwargs del centro y del marco del círculo

source: These control where the center of the pie graph are and if the Axes frame is shown.
es_es: Controlan dónde está el centro del gráfico circular y si se muestra el marco de los ejes.

source: Fixed 3D filled contour plot polygon rendering
es_es: Corregido el renderizado de polígonos de contornos rellenos en 3D

source: Certain cases of 3D filled contour plots that produce polygons with multiple holes produced improper rendering due to a loss of path information between :class:`~matplotlib.collections.PolyCollection` and :class:`~mpl_toolkits.mplot3d.art3d.Poly3DCollection`. A function :func:`~matplotlib.collections.PolyCollection.set_verts_and_codes` was added to allow path information to be retained for proper rendering.
es_es: Algunos casos de gráficos de contorno rellenos en 3D que producen polígonos con múltiples agujeros producían un renderizado incorrecto debido a la pérdida de información de la ruta entre :class:`~matplotlib.collections.PolyCollection` y :class:`~mpl_toolkits.mplot3d.art3d.Poly3DCollection`. Se ha añadido una función :func:`~matplotlib.collections.PolyCollection.set_verts_and_codes` para permitir que se conserve la información de la ruta para su correcta representación.

source: Dense colorbars are rasterized
es_es: Las barras de color densas se rasterizan

source: Vector file formats (pdf, ps, svg) are efficient for many types of plot element, but for some they can yield excessive file size and even rendering artifacts, depending on the renderer used for screen display. This is a problem for colorbars that show a large number of shades, as is most commonly the case. Now, if a colorbar is showing 50 or more colors, it will be rasterized in vector backends.
es_es: Los formatos de archivo vectoriales (pdf, ps, svg) son eficientes para muchos tipos de elementos de graficado, pero para algunos pueden producir un tamaño de archivo excesivo e incluso artefactos de renderizado, dependiendo del renderizador utilizado para la visualización en pantalla. Esto es un problema para las barras de color que muestran un gran número de matices, como es el caso más común. Ahora, si una barra de color muestra 50 o más colores, se rasterizará en los backends vectoriales.

source: :class:`~matplotlib.dates.DateFormatter`\ 's ``__call__`` method will format a :class:`datetime.datetime` object with the format string passed to the formatter's constructor. This method accepts datetimes with years before 1900, unlike :meth:`datetime.datetime.strftime`.
es_es: El método ``__call__`` de :class:`~matplotlib.dates.DateFormatter`\ 's formateará un objeto :class:`datetime.datetime` con la cadena de formato pasada al constructor del formateador. Este método acepta fechas anteriores a 1900, a diferencia de :meth:`datetime.datetime.strftime`.

source: Artist-level {get,set}_usetex for text
es_es: Nivel de artist {get,set}_usetex para texto

source: Add ``{get,set}_usetex`` methods to :class:`~matplotlib.text.Text` objects which allow artist-level control of LaTeX rendering vs. the internal mathtex rendering.
es_es: Añade métodos ``{get,set}_usetex`` a los objetos :class:`~matplotlib.text.Text` que permiten el control a nivel de artist del renderizado de LaTeX frente al renderizado interno de mathtex.

source: ``Axes.remove()`` works as expected
es_es: ``Axes.remove()`` funciona como se esperaba

source: As with artists added to an :class:`~matplotlib.axes.Axes`, `~.axes.Axes` objects can be removed from their figure via `~.Artist.remove()`.
es_es: Al igual que los artistas añadidos a una :class:`~matplotlib.axes.Axes`, los objetos `~.axes.Axes` pueden ser eliminados de su figura mediante `~.Artist.remove()`.

source: API Consistency fix within Locators set_params() function
es_es: Corrección de la coherencia de la API en la función set_params() de los localizadores

source: :meth:`~matplotlib.ticker.Locator.set_params` function, which sets parameters within a :class:`~matplotlib.ticker.Locator` type instance, is now available to all `.Locator` types. The implementation also prevents unsafe usage by strictly defining the parameters that a user can set.
es_es: La función :meth:`~matplotlib.ticker.Locator.set_params`, que establece parámetros dentro de una instancia de tipo :class:`~matplotlib.ticker.Locator`, está ahora disponible para todos los tipos `.Locator`. La implementación también evita el uso inseguro al definir estrictamente los parámetros que un usuario puede establecer.

source: To use, call ``set_params()`` on a `.Locator` instance with desired arguments: ::
es_es: Para utilizarlo, invoca ``set_params()`` en una instancia de `.Locator` con los argumentos deseados: ::

source: Date Locators
es_es: Localizadores de fechas

source: Date Locators (derived from :class:`~matplotlib.dates.DateLocator`) now implement the `~matplotlib.ticker.Locator.tick_values` method. This is expected of all Locators derived from `~matplotlib.ticker.Locator`.
es_es: Los localizadores de fechas (derivados de :class:`~matplotlib.dates.DateLocator`) ahora implementan el método `~matplotlib.ticker.Locator.tick_values`. Esto se espera de todos los localizadores derivados de `~matplotlib.ticker.Locator`.

source: The Date Locators can now be used easily without creating axes ::
es_es: Los localizadores de fechas pueden utilizarse ahora fácilmente sin necesidad de crear ejes ::

source: OffsetBoxes now support clipping
es_es: Los OffsetBoxes ahora soportan el recorte

source: `.Artist`\s draw onto objects of type `.OffsetBox` through `~.offsetbox.DrawingArea` and `~.offsetbox.TextArea`. The `.TextArea` calculates the required space for the text and so the text is always within the bounds, for this nothing has changed.
es_es: Los `.Artist` dibujados sobre objetos de tipo `.OffsetBox` a través de `~.offsetbox.DrawingArea` y `~.offsetbox.TextArea`. El `.TextArea` calcula el espacio necesario para el texto y así el texto está siempre dentro de los límites, para esto nada ha cambiado.

source: However, `.DrawingArea` acts as a parent for zero or more `.Artist`\s that draw on it and may do so beyond the bounds. Now child `.Artist`\s can be clipped to the bounds of the `.DrawingArea`.
es_es: Sin embargo, `.DrawingArea` actúa como padre para cero o más `.Artist` que dibujan en él y pueden hacerlo más allá de los límites. Ahora los `.Artist` hijos pueden ser recortados a los límites del `.DrawingArea`.

source: OffsetBoxes now considered by tight_layout
es_es: OffsetBoxes ahora considerado por tight_layout

source: When `~matplotlib.pyplot.tight_layout()` or `.Figure.tight_layout` or `.GridSpec.tight_layout()` is called, `.OffsetBox`\es that are anchored outside the axes will not get chopped out. The `.OffsetBox`\es will also not get overlapped by other axes in case of multiple subplots.
es_es: Cuando se invoca `~matplotlib.pyplot.tight_layout()` o `.Figure.tight_layout` o `.GridSpec.tight_layout()`, los `.OffsetBox` que están anclados fuera de los ejes no serán cortados. Los `.OffsetBox` tampoco se superpondrán a otros ejes en caso de múltiples subgráficos.

source: Per-page pdf notes in multi-page pdfs (PdfPages)
es_es: Notas por página en pdfs de varias páginas (PdfPages)

source: Add a new method :meth:`~matplotlib.backends.backend_pdf.PdfPages.attach_note` to the PdfPages class, allowing the attachment of simple text notes to pages in a multi-page pdf of figures. The new note is visible in the list of pdf annotations in a viewer that has this facility (Adobe Reader, OSX Preview, Skim, etc.). Per default the note itself is kept off-page to prevent it to appear in print-outs.
es_es: Añade un nuevo método :meth:`~matplotlib.backends.backend_pdf.PdfPages.attach_note` a la clase PdfPages, que permite adjuntar notas de texto simples a las páginas de un pdf de figuras de varias páginas. La nueva nota es visible en la lista de anotaciones del pdf en un visor que tenga esta facilidad (Adobe Reader, OSX Preview, Skim, etc.). Por defecto, la nota se mantiene fuera de la página para evitar que aparezca en las impresiones.

source: `.PdfPages.attach_note` needs to be called before `~.Figure.savefig` in order to be added to the correct figure.
es_es: `.PdfPages.attach_note` debe ser invocado antes de `~.Figure.savefig` para que se añada a la figura correcta.

source: Updated fignum_exists to take figure name
es_es: Actualizado fignum_exists para tomar el nombre de la figura

source: Added the ability to check the existence of a figure using its name instead of just the figure number. Example::
es_es: Se ha añadido la posibilidad de comprobar la existencia de una figura utilizando su nombre en lugar de sólo el número de figura. Ejemplo::

source: ToolManager
es_es: Gestor de herramientas

source: Federico Ariza wrote the new `~matplotlib.backend_managers.ToolManager` that comes as replacement for `.NavigationToolbar2`
es_es: Federico Ariza escribió el nuevo `~matplotlib.backend_managers.ToolManager` que viene a sustituir a `.NavigationToolbar2`

source: `.ToolManager` offers a new way of looking at the user interactions with the figures. Before we had the `.NavigationToolbar2` with its own tools like ``zoom/pan/home/save/...`` and also we had the shortcuts like ``yscale/grid/quit/....``. `.ToolManager` relocate all those actions as Tools (located in `~matplotlib.backend_tools`), and defines a way to access/trigger/reconfigure them.
es_es: El `.ToolManager` ofrece una nueva forma de ver las interacciones del usuario con las figuras. Antes teníamos la `.NavigationToolbar2` con sus propias herramientas como ``zoom/pan/home/save/...`` y también teníamos los atajos como ``yscale/grid/quit/....``. El gestor de herramientas `.ToolManager` reubica todas esas acciones como herramientas (ubicadas en `~matplotlib.backend_tools`), y define una forma de acceder/desencadenar/reconfigurarlas.

source: The Toolbars are replaced by `.ToolContainerBase`\s that are just GUI interfaces to trigger the tools. But don't worry the default backends include a `.ToolContainerBase` called ``toolbar``
es_es: Las barras de herramientas son reemplazadas por `.ToolContainerBase` que son sólo interfaces IGU para activar las herramientas. Pero no te preocupes, los backends por defecto incluyen un `.ToolContainerBase` llamado ``toolbar``

source: At the moment, we release this primarily for feedback purposes and should be treated as experimental until further notice as API changes will occur. For the moment the `.ToolManager` works only with the GTK3 and Tk backends. Make sure you use one of those. Port for the rest of the backends is coming soon.
es_es: Por el momento, publicamos esto principalmente con fines de retroalimentación y debe ser tratado como experimental hasta nuevo aviso, ya que se producirán cambios en la API. Por el momento el `.ToolManager` sólo funciona con los backends GTK3 y Tk. Asegúrate de utilizar uno de ellos. El puerto para el resto de los backends está por llegar.

source: To activate the `.ToolManager` include the following at the top of your file ::
es_es: Para activar el `.ToolManager` incluya lo siguiente en la parte superior de su archivo ::

source: Interact with the ToolContainer
es_es: Interactuar con el ToolContainer

source: The most important feature is the ability to easily reconfigure the ToolContainer (aka toolbar). For example, if we want to remove the "forward" button we would just do. ::
es_es: La característica más importante es la posibilidad de reconfigurar fácilmente el ToolContainer (también conocido como barra de herramientas). Por ejemplo, si deseamos eliminar el botón de "forward" sólo tendríamos que hacer. ::

source: Now if you want to programmatically trigger the "home" button ::
es_es: Ahora bien, si desea activar mediante programación el botón "home" ::

source: New Tools for ToolManager
es_es: Nuevas herramientas para ToolManager

source: It is possible to add new tools to the ToolManager
es_es: Es posible añadir nuevas herramientas al ToolManager

source: A very simple tool that prints "You're awesome" would be::
es_es: Una herramienta muy sencilla que imprime "You're awesome" sería::

source: To add this tool to `.ToolManager`
es_es: Para añadir esta herramienta a `.ToolManager`

source: If we want to add a shortcut ("d") for the tool
es_es: Si deseamos añadir un acceso directo ("d") para la herramienta

source: To add it to the toolbar inside the group 'foo'
es_es: Para añadirlo a la barra de herramientas dentro del grupo 'foo'

source: There is a second class of tools, "Toggleable Tools", this are almost the same as our basic tools, just that belong to a group, and are mutually exclusive inside that group. For tools derived from `.ToolToggleBase` there are two basic methods `~.ToolToggleBase.enable` and `~.ToolToggleBase.disable` that are called automatically whenever it is toggled.
es_es: Hay una segunda clase de herramientas, "Toggleable Tools", estas son casi las mismas que nuestras herramientas básicas, solo que pertenecen a un grupo, y son mutuamente excluyentes dentro de ese grupo. Para las herramientas derivadas de `.ToolToggleBase` hay dos métodos básicos `~.ToolToggleBase.enable` y `~.ToolToggleBase.disable` que son invocados automáticamente cada vez que se conmuta.

source: A full example is located in :doc:`/gallery/user_interfaces/toolmanager_sgskip`
es_es: Un ejemplo completo se encuentra en :doc:`/gallery/user_interfaces/toolmanager_sgskip`

source: cbook.is_sequence_of_strings recognizes string objects
es_es: cbook.is_sequence_of_strings reconoce objetos de cadena

source: This is primarily how pandas stores a sequence of strings ::
es_es: Así es principalmente como pandas almacena una secuencia de cadenas ::

source: Previously, the last two prints returned false.
es_es: Anteriormente, las dos últimas impresiones devolvían falso.

source: New ``close-figs`` argument for plot directive
es_es: Nuevo argumento ``close-figs`` para la directiva de graficado

source: Matplotlib has a sphinx extension ``plot_directive`` that creates plots for inclusion in sphinx documents. Matplotlib 1.5 adds a new option to the plot directive - ``close-figs`` - that closes any previous figure windows before creating the plots. This can help avoid some surprising duplicates of plots when using ``plot_directive``.
es_es: Matplotlib tiene una extensión de sphinx ``plot_directive`` que crea gráficos para incluirlos en documentos de sphinx. Matplotlib 1.5 añade una nueva opción a la directiva de graficado - ``close-figs`` - que cierra cualquier ventana de figura anterior antes de crear los gráfico. Esto puede ayudar a evitar algunos duplicados sorprendentes de gráficos cuando se utiliza ``plot_directive``.

source: Support for URL string arguments to ``imread``
es_es: Soporte para argumentos de cadena URL para ``imread``

source: The :func:`~matplotlib.pyplot.imread` function now accepts URL strings that point to remote PNG files. This circumvents the generation of a HTTPResponse object directly.
es_es: La función :func:`~matplotlib.pyplot.imread` ahora acepta cadenas de URL que apuntan a archivos PNG remotos. Esto evita la generación de un objeto HTTPResponse directamente.

source: Display hook for animations in the IPython notebook
es_es: Hook de visualización para animaciones en el cuaderno IPython

source: `~matplotlib.animation.Animation` instances gained a ``_repr_html_`` method to support inline display of animations in the notebook. The method used to display is controlled by the ``animation.html`` rc parameter, which currently supports values of ``none`` and ``html5``. ``none`` is the default, performing no display. ``html5`` converts the animation to an h264 encoded video, which is embedded directly in the notebook.
es_es: Las instancias de `~matplotlib.animation.Animation` ganaron un método ``_repr_html_`` para soportar la visualización en línea de las animaciones en el cuaderno. El método utilizado para mostrar es controlado por el parámetro rc ``animation.html``, que actualmente admite valores de ``none`` y ``html5``. ``none`` es el valor por defecto, que no realiza ninguna visualización. ``html5`` convierte la animación en un vídeo codificado en h264, que se incrusta directamente en el cuaderno.

source: Users not wishing to use the ``_repr_html_`` display hook can also manually call the `.to_html5_video` method to get the HTML and display using IPython's ``HTML`` display class::
es_es: Los usuarios que no deseen utilizar el hook de visualización ``_repr_html_`` también pueden invocar manualmente el método `.to_html5_video` para obtener el HTML y visualizarlo utilizando la clase de visualización ``HTML`` de IPython::

source: Prefixed pkg-config for building
es_es: Pkg-config prefijado para la construcción

source: Handling of pkg-config has been fixed in so far as it is now possible to set it using the environment variable ``PKG_CONFIG``. This is important if your toolchain is prefixed. This is done in a simpilar way as setting ``CC`` or ``CXX`` before building. An example follows.
es_es: Se ha corregido el manejo de pkg-config en la medida en que ahora es posible establecerlo utilizando la variable de entorno ``PKG_CONFIG``. Esto es importante si su cadena de herramientas está prefijada. Esto se hace de manera similar a la configuración de ``CC`` o ``CXX`` antes de la construcción. Un ejemplo es el siguiente.

source: export PKG_CONFIG=x86_64-pc-linux-gnu-pkg-config
es_es: exportar PKG_CONFIG=x86_64-pc-linux-gnu-pkg-config
