Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_1.2.po
Languages: es_es

source: What's new in Matplotlib 1.2 (Nov 9, 2012)
es_es: Novedades en Matplotlib 1.2 (9 de noviembre de 2012)

source: Table of Contents
es_es: Tabla de Contenidos

source: matplotlib 1.2 supports Python 2.6, 2.7, and 3.1
es_es: matplotlib 1.2 soporta Python 2.6, 2.7 y 3.1

source: Python 3.x support
es_es: Soporte de Python 3.x

source: Matplotlib 1.2 is the first version to support Python 3.x, specifically Python 3.1 and 3.2. To make this happen in a reasonable way, we also had to drop support for Python versions earlier than 2.6.
es_es: Matplotlib 1.2 es la primera versión que soporta Python 3.x, concretamente Python 3.1 y 3.2. Para que esto ocurra de forma razonable, también hemos tenido que dejar de dar soporte a versiones de Python anteriores a la 2.6.

source: This work was done by Michael Droettboom, the Cape Town Python Users' Group, many others and supported financially in part by the SAGE project.
es_es: Este trabajo fue realizado por Michael Droettboom, el Grupo de Usuarios de Python de Ciudad del Cabo, muchos otros y apoyado financieramente en parte por el proyecto SAGE.

source: The following GUI backends work under Python 3.x: Gtk3Cairo, Qt4Agg, TkAgg and MacOSX. The other GUI backends do not yet have adequate bindings for Python 3.x, but continue to work on Python 2.6 and 2.7, particularly the Qt and QtAgg backends (which have been deprecated). The non-GUI backends, such as PDF, PS and SVG, work on both Python 2.x and 3.x.
es_es: Los siguientes backends de IGU funcionan bajo Python 3.x: Gtk3Cairo, Qt4Agg, TkAgg y MacOSX. Los otros backends de IGU todavía no tienen bindings adecuados para Python 3.x, pero siguen funcionando en Python 2.6 y 2.7, particularmente los backends Qt y QtAgg (que han sido obviados). Los backends no-GUI, como PDF, PS y SVG, funcionan tanto en Python 2.x como en 3.x.

source: Features that depend on the Python Imaging Library, such as JPEG handling, do not work, since the version of PIL for Python 3.x is not sufficiently mature.
es_es: Las características que dependen de la Python Imaging Library, como el manejo de JPEG, no funcionan, ya que la versión de PIL para Python 3.x no está suficientemente madura.

source: PGF/TikZ backend
es_es: Backend PGF/TikZ

source: Peter Würtz wrote a backend that allows matplotlib to export figures as drawing commands for LaTeX. These can be processed by PdfLaTeX, XeLaTeX or LuaLaTeX using the PGF/TikZ package. Usage examples and documentation are found in :doc:`/tutorials/text/pgf`.
es_es: Peter Würtz escribió un backend que permite a matplotlib exportar figuras como comandos de dibujo para LaTeX. Estas pueden ser procesadas por PdfLaTeX, XeLaTeX o LuaLaTeX usando el paquete PGF/TikZ. Los ejemplos de uso y la documentación se encuentran en :doc:`/tutorials/text/pgf`.

source: Locator interface
es_es: Interfaz de localización

source: Philip Elson exposed the intelligence behind the tick Locator classes with a simple interface. For instance, to get no more than 5 sensible steps which span the values 10 and 19.5::
es_es: Philip Elson expuso la inteligencia detrás de las clases de localizadores de garrapatas con una interfaz sencilla. Por ejemplo, para obtener no más de 5 pasos sensibles que abarcan los valores 10 y 19,5::

source: Tri-Surface Plots
es_es: Parcelas Tri-Surface

source: Damon McDougall added a new plotting method for the :mod:`~mpl_toolkits.mplot3d` toolkit called :meth:`~mpl_toolkits.mplot3d.axes3d.Axes3D.plot_trisurf`.
es_es: Damon McDougall añadió un nuevo método de trazado para el conjunto de herramientas :mod:`~mpl_toolkits.mplot3d` llamado :meth:`~mpl_toolkits.mplot3d.axes3d.Axes3D.plot_trisurf`.

source: Control the lengths of colorbar extensions
es_es: Controlar las longitudes de las extensiones de las barras de color

source: Andrew Dawson added a new keyword argument *extendfrac* to :meth:`~matplotlib.pyplot.colorbar` to control the length of minimum and maximum colorbar extensions.
es_es: Andrew Dawson ha añadido un nuevo argumento de palabra clave *extendfrac* a :meth:`~matplotlib.pyplot.colorbar` para controlar la longitud de las extensiones mínimas y máximas de las barras de color.

source: Figures are picklable
es_es: Las figuras son seleccionables

source: Philip Elson added an experimental feature to make figures picklable for quick and easy short-term storage of plots. Pickle files are not designed for long term storage, are unsupported when restoring a pickle saved in another matplotlib version and are insecure when restoring a pickle from an untrusted source. Having said this, they are useful for short term storage for later modification inside matplotlib.
es_es: Philip Elson ha añadido una característica experimental para hacer que las figuras sean seleccionables para un rápido y fácil almacenamiento a corto plazo de los gráficos. Los archivos pickle no están diseñados para el almacenamiento a largo plazo, no son soportados cuando se restaura un pickle guardado en otra versión de matplotlib y son inseguros cuando se restaura un pickle desde una fuente no confiable. Dicho esto, son útiles para el almacenamiento a corto plazo para su posterior modificación dentro de matplotlib.

source: Set default bounding box in matplotlibrc
es_es: Establecer el cuadro delimitador por defecto en matplotlibrc

source: Two new defaults are available in the matplotlibrc configuration file: ``savefig.bbox``, which can be set to 'standard' or 'tight', and ``savefig.pad_inches``, which controls the bounding box padding.
es_es: Hay dos nuevos valores por defecto disponibles en el archivo de configuración matplotlibrc: ``savefig.bbox``, que puede establecerse como "estándar" o "ajustado", y ``savefig.pad_inches``, que controla el relleno de la caja delimitadora.

source: New Boxplot Functionality
es_es: Nueva funcionalidad de Boxplot

source: Users can now incorporate their own methods for computing the median and its confidence intervals into the `~.Axes.boxplot` method. For every column of data passed to boxplot, the user can specify an accompanying median and confidence interval.
es_es: Ahora los usuarios pueden incorporar sus propios métodos para calcular la mediana y sus intervalos de confianza en el método `~.Axes.boxplot`. Para cada columna de datos pasada a boxplot, el usuario puede especificar una mediana y un intervalo de confianza.

source: New RC parameter functionality
es_es: Nueva funcionalidad de parámetros RC

source: Matthew Emmett added a function and a context manager to help manage RC parameters: :func:`~matplotlib.rc_file` and :class:`~matplotlib.rc_context`. To load RC parameters from a file::
es_es: Matthew Emmett ha añadido una función y un gestor de contexto para ayudar a gestionar los parámetros RC: :func:`~matplotlib.rc_file` y :class:`~matplotlib.rc_context`. Para cargar los parámetros RC desde un archivo::

source: To temporarily use RC parameters::
es_es: Para utilizar temporalmente los parámetros RC::

source: Tom Flannaghan and Tony Yu have added a new :meth:`~matplotlib.pyplot.streamplot` function to plot the streamlines of a vector field. This has been a long-requested feature and complements the existing :meth:`~matplotlib.pyplot.quiver` function for plotting vector fields. In addition to simply plotting the streamlines of the vector field, :meth:`~matplotlib.pyplot.streamplot` allows users to map the colors and/or line widths of the streamlines to a separate parameter, such as the speed or local intensity of the vector field.
es_es: Tom Flannaghan y Tony Yu han añadido una nueva función :meth:`~matplotlib.pyplot.streamplot` para trazar las líneas de corriente de un campo vectorial. Esta ha sido una característica largamente solicitada y complementa la función :meth:`~matplotlib.pyplot.quiver` existente para trazar campos vectoriales. Además de trazar simplemente las líneas de corriente del campo vectorial, :meth:`~matplotlib.pyplot.streamplot` permite a los usuarios asignar los colores y/o anchos de línea de las líneas de corriente a un parámetro independiente, como la velocidad o la intensidad local del campo vectorial.

source: New hist functionality
es_es: Nueva funcionalidad de hist

source: Nic Eggert added a new *stacked* kwarg to :meth:`~matplotlib.pyplot.hist` that allows creation of stacked histograms using any of the histogram types. Previously, this functionality was only available by using the "barstacked" histogram type. Now, when ``stacked=True`` is passed to the function, any of the histogram types can be stacked. The "barstacked" histogram type retains its previous functionality for backwards compatibility.
es_es: Nic Eggert ha añadido un nuevo kwarg *apilado* a :meth:`~matplotlib.pyplot.hist` que permite crear histogramas apilados utilizando cualquiera de los tipos de histograma. Anteriormente, esta funcionalidad sólo estaba disponible utilizando el tipo de histograma "barstacked". Ahora, cuando se pasa ``stacked=True`` a la función, se puede apilar cualquiera de los tipos de histograma. El tipo de histograma "barstacked" mantiene su funcionalidad anterior por compatibilidad con el pasado.

source: Updated shipped dependencies
es_es: Actualización de las dependencias enviadas

source: The following dependencies that ship with matplotlib and are optionally installed alongside it have been updated:
es_es: Se han actualizado las siguientes dependencias que se envían con matplotlib y que se instalan opcionalmente junto a él:

source: and 2.1 on Python 3.x
es_es: y 2.1 en Python 3.x

source: Face-centred colors in tripcolor plots
es_es: Colores centrados en la cara en los gráficos tripcolor

source: Ian Thomas extended :meth:`~matplotlib.pyplot.tripcolor` to allow one color value to be specified for each triangular face rather than for each point in a triangulation.
es_es: Ian Thomas ha ampliado :meth:`~matplotlib.pyplot.tripcolor` para permitir que se especifique un valor de color para cada cara triangular en lugar de para cada punto de una triangulación.

source: Hatching patterns in filled contour plots, with legends
es_es: Patrones de sombreado en gráficos de contorno rellenos, con leyendas

source: Phil Elson added support for hatching to :func:`~matplotlib.pyplot.contourf`, together with the ability to use a legend to identify contoured ranges.
es_es: Phil Elson ha añadido soporte para el sombreado a :func:`~matplotlib.pyplot.contourf`, junto con la posibilidad de utilizar una leyenda para identificar los rangos de contorno.

source: Known issues in the matplotlib 1.2 release
es_es: Problemas conocidos en la versión matplotlib 1.2

source: When using the Qt4Agg backend with IPython 0.11 or later, the save dialog will not display. This should be fixed in a future version of IPython.
es_es: Cuando se utiliza el backend Qt4Agg con IPython 0.11 o posterior, el diálogo de guardado no se muestra. Esto debería arreglarse en una futura versión de IPython.
