Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_1.0.po
Languages: es_es

source: What's new in Matplotlib 1.0 (Jul 06, 2010)
es_es: Novedades en Matplotlib 1.0 (Mar 06, 2010)

source: Table of Contents
es_es: Tabla de Contenidos

source: Simon Ratcliffe and Ludwig Schwardt have released an `HTML5/Canvas <https://code.google.com/archive/p/mplh5canvas>`__ backend for matplotlib. The backend is almost feature complete, and they have done a lot of work comparing their html5 rendered images with our core renderer Agg. The backend features client/server interactive navigation of matplotlib figures in an html5 compliant browser.
es_es: Simon Ratcliffe y Ludwig Schwardt han lanzado un `HTML5/Canvas <https://code.google.com/archive/p/mplh5canvas>`__ backend para matplotlib. El backend está casi completo, y han hecho mucho trabajo comparando sus imágenes renderizadas en html5 con nuestro renderizador central Agg. El backend cuenta con la navegación interactiva cliente/servidor de las figuras de matplotlib en un navegador compatible con html5.

source: Sophisticated subplot grid layout
es_es: Sofisticado diseño de cuadrícula de subtramas

source: Jae-Joon Lee has written :mod:`~matplotlib.gridspec`, a new module for doing complex subplot layouts, featuring row and column spans and more. See :doc:`/tutorials/intermediate/arranging_axes` for a tutorial overview.
es_es: Jae-Joon Lee ha escrito :mod:`~matplotlib.gridspec`, un nuevo módulo para realizar diseños complejos de subtramas, con espacios de filas y columnas y más. Consulta :doc:`/tutorials/intermediate/arranging_axes` para ver un tutorial general.

source: Easy pythonic subplots
es_es: Subplots pitónicos sencillos

source: Fernando Perez got tired of all the boilerplate code needed to create a figure and multiple subplots when using the matplotlib API, and wrote a :func:`~matplotlib.pyplot.subplots` helper function. Basic usage allows you to create the figure and an array of subplots with numpy indexing (starts with 0). e.g.::
es_es: Fernando Pérez se cansó de todo el código necesario para crear una figura y múltiples subplots cuando se utiliza la API de matplotlib, y escribió una función de ayuda :func:`~matplotlib.pyplot.subplots`. El uso básico permite crear la figura y un array de subplots con indexación numpy (empieza por 0). ej.::

source: See :doc:`/gallery/subplots_axes_and_figures/subplot` for several code examples.
es_es: Ver :doc:`/gallery/subplots_axes_and_figures/subplot` para varios ejemplos de código.

source: Contour fixes and and triplot
es_es: Arreglos del contorno y del triplot

source: Ian Thomas has fixed a long-standing bug that has vexed our most talented developers for years. :func:`~matplotlib.pyplot.contourf` now handles interior masked regions, and the boundaries of line and filled contours coincide.
es_es: Ian Thomas ha arreglado un antiguo error que ha molestado a nuestros desarrolladores más talentosos durante años. :func:`~matplotlib.pyplot.contourf` ahora maneja las regiones interiores enmascaradas, y los límites de los contornos lineales y rellenos coinciden.

source: Additionally, he has contributed a new module :mod:`~matplotlib.tri` and helper function :func:`~matplotlib.pyplot.triplot` for creating and plotting unstructured triangular grids.
es_es: Además, ha contribuido con un nuevo módulo :mod:`~matplotlib.tri` y una función de ayuda :func:`~matplotlib.pyplot.triplot` para crear y trazar cuadrículas triangulares no estructuradas.

source: multiple calls to show supported
es_es: soporte de múltiples llamadas a la muestra

source: A long standing request is to support multiple calls to :func:`~matplotlib.pyplot.show`. This has been difficult because it is hard to get consistent behavior across operating systems, user interface toolkits and versions. Eric Firing has done a lot of work on rationalizing show across backends, with the desired behavior to make show raise all newly created figures and block execution until they are closed. Repeated calls to show should raise newly created figures since the last call. Eric has done a lot of testing on the user interface toolkits and versions and platforms he has access to, but it is not possible to test them all, so please report problems to the `mailing list <https://mail.python.org/mailman/listinfo/matplotlib-users>`__ and `bug tracker <https://github.com/matplotlib/matplotlib/issues>`__.
es_es: Una antigua petición es la de soportar múltiples llamadas a :func:`~matplotlib.pyplot.show`. Esto ha sido difícil porque es difícil conseguir un comportamiento consistente a través de los sistemas operativos, conjuntos de herramientas de interfaz de usuario y versiones. Eric Firing ha trabajado mucho en la racionalización de show a través de backends, con el comportamiento deseado para hacer que show levante todas las figuras recién creadas y bloquee la ejecución hasta que se cierren. Las llamadas repetidas a show deberían levantar las cifras recién creadas desde la última llamada. Eric ha hecho muchas pruebas en los conjuntos de herramientas de la interfaz de usuario y en las versiones y plataformas a las que tiene acceso, pero no es posible probarlas todas, así que por favor informe de los problemas en la `lista de correo <https://mail.python.org/mailman/listinfo/matplotlib-users>`__ y en el `bug tracker <https://github.com/matplotlib/matplotlib/issues>`__.

source: mplot3d graphs can be embedded in arbitrary axes
es_es: los gráficos de mplot3d se pueden incrustar en ejes arbitrarios

source: You can now place an mplot3d graph into an arbitrary axes location, supporting mixing of 2D and 3D graphs in the same figure, and/or multiple 3D graphs in a single figure, using the "projection" keyword argument to add_axes or add_subplot. Thanks Ben Root.
es_es: Ahora puede colocar un gráfico mplot3d en una ubicación de ejes arbitraria, soportando la mezcla de gráficos 2D y 3D en la misma figura, y/o múltiples gráficos 3D en una sola figura, usando el argumento de la palabra clave "proyección" para add_axes o add_subplot. Gracias Ben Root.

source: Eric Firing wrote tick_params, a convenience method for changing the appearance of ticks and tick labels. See pyplot function :func:`~matplotlib.pyplot.tick_params` and associated Axes method :meth:`~matplotlib.axes.Axes.tick_params`.
es_es: Eric Firing escribió tick_params, un método conveniente para cambiar la apariencia de los ticks y las etiquetas de los mismos. Ver la función pyplot :func:`~matplotlib.pyplot.tick_params` y el método asociado Axes :meth:`~matplotlib.axes.Axes.tick_params`.

source: Lots of performance and feature enhancements
es_es: Muchas mejoras en el rendimiento y las características

source: Faster magnification of large images, and the ability to zoom in to a single pixel
es_es: Aumento más rápido de las imágenes grandes, y la capacidad de hacer zoom en un solo píxel

source: Local installs of documentation work better
es_es: Las instalaciones locales de la documentación funcionan mejor

source: Improved "widgets" -- mouse grabbing is supported
es_es: Mejoras en los "widgets": se admite el agarre del ratón

source: More accurate snapping of lines to pixel boundaries
es_es: Ajuste más preciso de las líneas a los límites de los píxeles

source: More consistent handling of color, particularly the alpha channel, throughout the API
es_es: Manejo más coherente del color, especialmente del canal alfa, en toda la API

source: Much improved software carpentry
es_es: Mejoras en la carpintería del software

source: The matplotlib trunk is probably in as good a shape as it has ever been, thanks to improved `software carpentry <https://software-carpentry.org/>`__. We now have a `buildbot <https://buildbot.net>`__ which runs a suite of `nose <http://code.google.com/p/python-nose/>`__ regression tests on every svn commit, auto-generating a set of images and comparing them against a set of known-goods, sending emails to developers on failures with a pixel-by-pixel image comparison. Releases and release bugfixes happen in branches, allowing active new feature development to happen in the trunk while keeping the release branches stable. Thanks to Andrew Straw, Michael Droettboom and other matplotlib developers for the heavy lifting.
es_es: El tronco de matplotlib está probablemente en tan buena forma como lo ha estado nunca, gracias a la mejora de la `software carpentry <https://software-carpentry.org/>`__. Ahora tenemos un `buildbot <https://buildbot.net>`__ que ejecuta un conjunto de pruebas de regresión `nose <http://code.google.com/p/python-nose/>`__ en cada svn commit, generando automáticamente un conjunto de imágenes y comparándolas con un conjunto de bienes conocidos, enviando correos electrónicos a los desarrolladores sobre los fallos con una comparación de imágenes píxel por píxel. Los lanzamientos y las correcciones de errores de los lanzamientos ocurren en ramas, permitiendo que el desarrollo activo de nuevas características ocurra en el tronco mientras se mantienen estables las ramas de lanzamiento. Gracias a Andrew Straw, Michael Droettboom y otros desarrolladores de matplotlib por el trabajo pesado.

source: Eric Firing went on a bug fixing and closing marathon, closing over 100 bugs on the (now-closed) SourceForge bug tracker with help from Jae-Joon Lee, Michael Droettboom, Christoph Gohlke and Michiel de Hoon.
es_es: Eric Firing se embarcó en un maratón de corrección y cierre de errores, cerrando más de 100 errores en el rastreador de errores (ahora cerrado) de SourceForge con la ayuda de Jae-Joon Lee, Michael Droettboom, Christoph Gohlke y Michiel de Hoon.
