Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_1.5.po
Languages: es_es

source: What's new in Matplotlib 1.5 (Oct 29, 2015)
es_es: Novedades en Matplotlib 1.5 (29 de octubre de 2015)

source: Table of Contents
es_es: Tabla de Contenidos

source: matplotlib 1.5 supports Python 2.7, 3.4, and 3.5
es_es: matplotlib 1.5 soporta Python 2.7, 3.4 y 3.5

source: Interactive OO usage
es_es: Uso interactivo de OO

source: All `.Artist`\s now keep track of if their internal state has been changed but not reflected in the display ('stale') by a call to ``draw``. It is thus possible to pragmatically determine if a given `.Figure` needs to be re-drawn in an interactive session.
es_es: Todos los `.Artist`s ahora llevan la cuenta de si su estado interno ha sido cambiado pero no se ha reflejado en la pantalla ('stale') por una invocación a ``draw``. De este modo es posible determinar de forma pragmática si una determinada `.Figura` necesita ser redibujada en una sesión interactiva.

source: To facilitate interactive usage a ``draw_all`` method has been added to ``pyplot`` which will redraw all of the figures which are 'stale'.
es_es: Para facilitar el uso interactivo, se ha añadido un método ``draw_all`` a ``pyplot`` que redibujará todas las figuras que sean 'stale'.

source: To make this convenient for interactive use matplotlib now registers a function either with IPython's 'post_execute' event or with the displayhook in the standard python REPL to automatically call ``plt.draw_all`` just before control is returned to the REPL. This ensures that the draw command is deferred and only called once.
es_es: Para hacer esto conveniente para el uso interactivo matplotlib ahora registra una función ya sea con el evento 'post_execute' de IPython o con el displayhook en el REPL estándar de python para invocar automáticamente ``plt.draw_all`` justo antes de que el control sea devuelto al REPL. Esto asegura que el comando de dibujo es diferido y sólo invocado una vez.

source: The upshot of this is that for interactive backends (including ``%matplotlib notebook``) in interactive mode (with ``plt.ion()``)
es_es: El resultado de esto es que para los backends interactivos (incluyendo ``%matplotlib notebook``) en modo interactivo (con ``plt.ion()``)

source: will automatically update the plot to be green. Any subsequent modifications to the ``Artist`` objects will do likewise.
es_es: actualizará automáticamente el gráfico para que sea verde. Cualquier modificación posterior de los objetos ``Artist`` hará lo mismo.

source: This is the first step of a larger consolidation and simplification of the pyplot internals.
es_es: Este es el primer paso de una mayor consolidación y simplificación de los internos de pyplot.

source: Working with labeled data like pandas DataFrames
es_es: Trabajar con datos etiquetados como pandas DataFrames

source: Plot methods which take arrays as inputs can now also work with labeled data and unpack such data.
es_es: Los métodos de gráfico que toman arreglos como entradas ahora también pueden trabajar con datos etiquetados y desempaquetar dichos datos.

source: This means that the following two examples produce the same plot:
es_es: Esto significa que los dos ejemplos siguientes producen el mismo gráfico:

source: Example ::
es_es: Ejemplo ::

source: This works for most plotting methods, which expect arrays/sequences as inputs. ``data`` can be anything which supports ``__getitem__`` (``dict``, ``pandas.DataFrame``, ``h5py``, ...) to access ``array`` like values with string keys.
es_es: Esto funciona para la mayoría de los métodos de gráfico, que esperan arreglos como entradas. ``data`` puede ser cualquier cosa que soporte ``__getitem__`` (``dict``, ``pandas.DataFrame``, ``h5py``, ...) para acceder a valores tipo ``array`` con claves de cadena.

source: In addition to this, some other changes were made, which makes working with labeled data (ex ``pandas.Series``) easier:
es_es: Además de esto, se han realizado algunos otros cambios que facilitan el trabajo con datos etiquetados (por ejemplo, ``pandas.Series``):

source: For plotting methods with ``label`` keyword argument, one of the data inputs is designated as the label source. If the user does not supply a ``label`` that value object will be introspected for a label, currently by looking for a ``name`` attribute. If the value object does not have a ``name`` attribute but was specified by as a key into the ``data`` kwarg, then the key is used. In the above examples, this results in an implicit ``label="var2"`` for both cases.
es_es: Para los métodos de graficado con el argumento de la palabra clave ``label``, una de las entradas de datos se designa como la fuente de la etiqueta. Si el usuario no proporciona una ``etiqueta``, el objeto de valor será introspeccionado en busca de una etiqueta, actualmente buscando un atributo ``name``. Si el objeto de valor no tiene un atributo ``name`` pero fue especificado como una clave en el kwarg ``data``, entonces se utiliza la clave. En los ejemplos anteriores, esto resulta en una ``label="var2"`` implícita para ambos casos.

source: ``plot()`` now uses the index of a ``Series`` instead of ``np.arange(len(y))``, if no ``x`` argument is supplied.
es_es: ``plot()`` ahora utiliza el índice de una ``Serie`` en lugar de ``np.arange(len(y))``, si no se suministra el argumento ``x``.

source: Added ``axes.prop_cycle`` key to rcParams
es_es: Añadida la clave ``axes.prop_cycle`` a rcParams

source: This is a more generic form of the now-deprecated ``axes.color_cycle`` param. Now, we can cycle more than just colors, but also linestyles, hatches, and just about any other artist property. Cycler notation is used for defining property cycles. Adding cyclers together will be like you are `zip`-ing together two or more property cycles together::
es_es: Esta es una forma más genérica del ahora obsoleto parámetro ``axes.color_cycle``. Ahora, podemos ciclar no sólo los colores, sino también los estilos de línea, los sombreados, y casi cualquier otra propiedad del artista. La notación cíclica se utiliza para definir los ciclos de las propiedades. Añadir cicladores juntos será como si estuvieras `zip`-ing juntos dos o más ciclos de propiedades juntos::

source: You can even multiply cyclers, which is like using `itertools.product` on two or more property cycles.
es_es: Incluso puede multiplicar los ciclos, que es como usar `itertools.product` en dos o más ciclos de propiedades.

source: New Colormaps
es_es: Nuevos mapas de colores

source: All four of the colormaps proposed as the new default are available as ``'viridis'`` (the new default in 2.0), ``'magma'``, ``'plasma'``, and ``'inferno'``
es_es: Los cuatro mapas de colores propuestos por defecto están disponibles como ``'viridis'`` (el nuevo valor por defecto en la versión 2.0), ``'magma'``, ``'plasma'``, e ``'inferno'``

source: (`Source code <../../users/prev_whats_new/whats_new_1-5-1.py>`__, `png <../../users/prev_whats_new/whats_new_1-5-1.png>`__, `pdf <../../users/prev_whats_new/whats_new_1-5-1.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_1-5-1.py>`__, `png <../../users/prev_whats_new/whats_new_1-5-1.png>`__, `pdf <../../users/prev_whats_new/whats_new_1-5-1.pdf>`__)

source: Styles
es_es: Estilos

source: Several new styles have been added, including many styles from the Seaborn project. Additionally, in order to prep for the upcoming 2.0 style-change release, a 'classic' and 'default' style has been added. For this release, the 'default' and 'classic' styles are identical. By using them now in your scripts, you can help ensure a smooth transition during future upgrades of matplotlib, so that you can upgrade to the snazzy new defaults when you are ready! ::
es_es: Se han añadido varios estilos nuevos, incluyendo muchos estilos del proyecto Seaborn. Además, con el fin de preparar la próxima versión de cambio de estilo 2.0, se ha añadido un estilo 'clásico' y 'por defecto'. Para esta versión, los estilos 'por defecto' y 'clásico' son idénticos. Usándolos ahora en tus scripts, puedes ayudar a asegurar una transición sin problemas durante futuras actualizaciones de matplotlib, ¡para que puedas actualizar a los nuevos y elegantes valores por defecto cuando estés listo! ::

source: The 'default' style will give you matplotlib's latest plotting styles::
es_es: El estilo 'por defecto' te dará los últimos estilos de trazado de matplotlib::

source: New backend selection
es_es: Nueva selección de backend

source: The environment variable :envvar:`MPLBACKEND` can now be used to set the matplotlib backend.
es_es: La variable de entorno :envvar:`MPLBACKEND` puede utilizarse ahora para establecer el backend de matplotlib.

source: wx backend has been updated
es_es: el backend de wx ha sido actualizado

source: The wx backend can now be used with both wxPython classic and `Phoenix <https://wxpython.org/Phoenix/docs/html/main.html>`__.
es_es: El backend de wx ahora puede ser utilizado tanto con wxPython classic como con `Phoenix <https://wxpython.org/Phoenix/docs/html/main.html>`__.

source: wxPython classic has to be at least version 2.8.12 and works on Python 2.x. As of May 2015 no official release of wxPython Phoenix is available but a current snapshot will work on Python 2.7+ and 3.4+.
es_es: wxPython classic tiene que ser al menos la versión 2.8.12 y funciona en Python 2.x. En mayo de 2015 no hay ninguna versión oficial de wxPython Phoenix, pero una instantánea actual funciona en Python 2.7+ y 3.4+.

source: If you have multiple versions of wxPython installed, then the user code is responsible setting the wxPython version. How to do this is explained in the comment at the beginning of the example :doc:`/gallery/user_interfaces/embedding_in_wx2_sgskip`.
es_es: Si tienes varias versiones de wxPython instaladas, entonces el código de usuario es responsable de establecer la versión de wxPython. Cómo hacer esto se explica en el comentario al principio del ejemplo :doc:`/gallery/user_interfaces/embedding_in_wx2_sgskip`.

source: Configuration (rcParams)
es_es: Configuración (rcParams)

source: Some parameters have been added, others have been improved.
es_es: Se han añadido algunos parámetros y se han mejorado otros.

source: Parameter
es_es: Parámetro

source: Description
es_es: Descripción

source: mplot3d now respects these parameters
es_es: mplot3d ahora respeta estos parámetros

source: Default space between the axis and the label
es_es: Espacio por defecto entre el eje y la etiqueta

source: Default length of end caps on error bars
es_es: Longitud por defecto de los extremos de las barras de error

source: Default visibility of minor x/y ticks
es_es: Visibilidad por defecto de los ticks menores x/y

source: Default transparency of the legend frame box
es_es: Transparencia por defecto del cuadro de la leyenda

source: Default facecolor of legend frame box (or ``'inherit'`` from :rc:`axes.facecolor`)
es_es: Color facial por defecto de la caja del marco de la leyenda (o ``'inherit'`` de :rc:`axes.facecolor`)

source: Default edgecolor of legend frame box (or ``'inherit'`` from :rc:`axes.edgecolor`)
es_es: Color de borde por defecto del cuadro de la leyenda (o ``'inherit'`` de :rc:`axes.edgecolor`)

source: Default font size for figure suptitles
es_es: Tamaño de letra por defecto para los subtítulos de las figuras

source: Default font weight for figure suptitles
es_es: Peso de la fuente por defecto para los subtítulos de las figuras

source: Whether a vector graphics backend should composite several images into a single image or not when saving. Useful when needing to edit the files further in Inkscape or other programs.
es_es: Si un backend de gráficos vectoriales debe componer varias imágenes en una sola imagen o no al guardar. Es útil cuando se necesita editar los archivos en Inkscape u otros programas.

source: Default fillstyle of markers. Possible values are ``'full'`` (the default), ``'left'``, ``'right'``, ``'bottom'``, ``'top'`` and ``'none'``
es_es: Estilo de relleno por defecto de los marcadores. Los valores posibles son `'full'`` (por defecto), ``'left'``, ``'right'``, ``'bottom'``, ``'top'`` y ``'none'``

source: Added ``'toolmanager'`` as a valid value, enabling the experimental ``ToolManager`` feature.
es_es: Se ha añadido ``'toolmanager'`` como valor válido, activando la función experimental ``ToolManager``.

source: Active state of Selectors
es_es: Estado activo de los selectores

source: All selectors now implement ``set_active`` and ``get_active`` methods (also called when accessing the ``active`` property) to properly update and query whether they are active.
es_es: Todos los selectores implementan ahora los métodos ``set_active`` y ``get_active`` (también invocados al acceder a la propiedad ``active``) para actualizar y consultar correctamente si están activos.

source: Moved ``ignore``, ``set_active``, and ``get_active`` methods to base class ``Widget``
es_es: Se han trasladado los métodos ``ignore``, ``set_active`` y ``get_active`` a la clase base ``Widget``

source: Pushes up duplicate methods in child class to parent class to avoid duplication of code.
es_es: Empuja los métodos duplicados en la clase hija a la clase padre para evitar la duplicación de código.

source: Adds enable/disable feature to MultiCursor
es_es: Añade la característica de activar/desactivar a MultiCursor

source: A MultiCursor object can be disabled (and enabled) after it has been created without destroying the object. Example::
es_es: Un objeto MultiCursor puede ser desactivado (y activado) después de haber sido creado sin destruir el objeto. Ejemplo::

source: Improved RectangleSelector and new EllipseSelector Widget
es_es: Mejora del RectangleSelector y nuevo Widget EllipseSelector

source: Adds an *interactive* keyword which enables visible handles for manipulating the shape after it has been drawn.
es_es: Añade una palabra clave *interactiva* que habilita manejadores visibles para manipular la forma después de haberla dibujado.

source: Adds keyboard modifiers for:
es_es: Añade modificadores de teclado para:

source: Moving the existing shape (default key = 'space')
es_es: Mover la forma existente (tecla por defecto = 'espacio')

source: Making the shape square (default 'shift')
es_es: Hacer que la forma sea cuadrada (por defecto 'shift')

source: Make the initial point the center of the shape (default 'control')
es_es: Hacer que el punto inicial sea el centro de la forma (por defecto 'control')

source: Square and center can be combined
es_es: El cuadrado y el centro pueden combinarse

source: Allow Artists to Display Pixel Data in Cursor
es_es: Permitir a los artists mostrar los datos de los píxeles en el cursor

source: Adds `~.Artist.get_cursor_data` and `~.Artist.format_cursor_data` methods to artists which can be used to add zdata to the cursor display in the status bar. Also adds an implementation for Images.
es_es: Añade los métodos `~.Artist.get_cursor_data` y `~.Artist.format_cursor_data` a los artistas que se pueden utilizar para añadir zdata a la visualización del cursor en la barra de estado. También se añade una implementación para Imágenes.

source: New plotting features
es_es: Nuevas características de graficado

source: Auto-wrapping Text
es_es: Envoltura automática del texto

source: Added the keyword argument "wrap" to Text, which automatically breaks long lines of text when being drawn. Works for any rotated text, different modes of alignment, and for text that are either labels or titles. This breaks at the ``Figure``, not ``Axes`` edge.
es_es: Se ha añadido el argumento de palabra clave "wrap" (envolver) a Texto, que rompe automáticamente las líneas largas de texto cuando se dibujan. Funciona para cualquier texto rotado, diferentes modos de alineación, y para texto que son etiquetas o títulos. Esto rompe en el borde de la ``Figura``, no en el de los ``Ejes``.

source: (`Source code <../../users/prev_whats_new/whats_new_1-5-2.py>`__, `png <../../users/prev_whats_new/whats_new_1-5-2.png>`__, `pdf <../../users/prev_whats_new/whats_new_1-5-2.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_1-5-2.py>`__, `png <../../users/prev_whats_new/whats_new_1-5-2.png>`__, `pdf <../../users/prev_whats_new/whats_new_1-5-2.pdf>`__)

source: Contour plot corner masking
es_es: Contorno del gráfico de enmascaramiento de las esquinas

source: Ian Thomas rewrote the C++ code that calculates contours to add support for corner masking. This is controlled by a new keyword argument ``corner_mask`` in the functions :func:`~matplotlib.pyplot.contour` and :func:`~matplotlib.pyplot.contourf`. The previous behaviour, which is now obtained using ``corner_mask=False``, was for a single masked point to completely mask out all four quads touching that point. The new behaviour, obtained using ``corner_mask=True``, only masks the corners of those quads touching the point; any triangular corners comprising three unmasked points are contoured as usual. If the ``corner_mask`` keyword argument is not specified, the default value is taken from rcParams.
es_es: Ian Thomas reescribió el código C++ que calcula los contornos para añadir soporte para el enmascaramiento de esquinas. Esto se controla con un nuevo argumento de palabra clave ``corner_mask`` en las funciones :func:`~matplotlib.pyplot.contour` y :func:`~matplotlib.pyplot.contourf`. El comportamiento anterior, que ahora se obtiene utilizando ``corner_mask=False``, consistía en que un único punto enmascarado enmascaraba completamente los cuatro cuadrantes que tocaban ese punto. El nuevo comportamiento, que se obtiene utilizando ``corner_mask=True``, sólo enmascara las esquinas de los quads que tocan el punto; cualquier esquina triangular que comprenda tres puntos no enmascarados se contornea como siempre. Si no se especifica el argumento de la palabra clave ``corner_mask``, se toma el valor por defecto de rcParams.

source: Mostly unified linestyles for `.Line2D`, `.Patch` and `.Collection`
es_es: Estilos de línea más unificados para `.Line2D`, `.Patch` y `.Collection`

source: The handling of linestyles for Lines, Patches and Collections has been unified. Now they all support defining linestyles with short symbols, like "--", as well as with full names, like "dashed". Also the definition using a dash pattern (``(0., [3., 3.])``) is supported for all methods using `.Line2D`, `.Patch` or `.Collection`.
es_es: Se ha unificado el manejo de los estilos de línea para Líneas, Parches y Colecciones. Ahora todos soportan la definición de estilos de línea con símbolos cortos, como "--", así como con nombres completos, como "guiones". También se admite la definición mediante un patrón de guiones (``(0., [3., 3.])``) para todos los métodos que utilizan `.Line2D`, `.Patch` o `.Collection`.

source: Legend marker order
es_es: Orden del marcador de leyenda

source: Added ability to place the label before the marker in a legend box with ``markerfirst`` keyword
es_es: Se ha añadido la posibilidad de colocar la etiqueta antes del marcador en un cuadro de leyenda con la palabra clave ``markerfirst``

source: Support for legend for PolyCollection and stackplot
es_es: Soporte para la leyenda de PolyCollection y stackplot

source: Added a :mod:`.legend_handler` for :class:`~matplotlib.collections.PolyCollection` as well as a *labels* argument to :func:`~matplotlib.axes.Axes.stackplot`.
es_es: Se ha añadido un :mod:`.legend_handler` para :class:`~matplotlib.collections.PolyCollection` así como un argumento *labels* a :func:`~matplotlib.axes.Axes.stackplot`.

source: Support for alternate pivots in mplot3d quiver plot
es_es: Soporte para pivotes alternativos en mplot3d quiver plot

source: Added a :code:`pivot` kwarg to :func:`~mpl_toolkits.mplot3d.Axes3D.quiver` that controls the pivot point around which the quiver line rotates. This also determines the placement of the arrow head along the quiver line.
es_es: Se ha añadido un kwarg :code:`pivot` a :func:`~mpl_toolkits.mplot3d.Axes3D.quiver` que controla el punto de pivote alrededor del cual gira la línea del quiver. Esto también determina la ubicación de la punta de la flecha a lo largo de la línea de quiver.

source: Logit Scale
es_es: Escala Logit

source: Added support for the 'logit' axis scale, a nonlinear transformation
es_es: Se ha añadido soporte para la escala del eje 'logit', una transformación no lineal

source: for data between 0 and 1 excluded.
es_es: para datos entre 0 y 1 excluidos.

source: Add step kwargs to fill_between
es_es: Añadir kwargs de paso a fill_between

source: Added ``step`` kwarg to `.Axes.fill_between` to allow to fill between lines drawn using the 'step' draw style. The values of ``step`` match those of the ``where`` kwarg of `.Axes.step`. The asymmetry of the kwargs names is not ideal, but `.Axes.fill_between` already has a ``where`` kwarg.
es_es: Se ha añadido el kwarg ``step`` a `.Axes.fill_between` para poder rellenar entre líneas dibujadas con el estilo de dibujo 'step'. Los valores de ``step`` coinciden con los del kwarg ``where`` de `.Axes.step``. La asimetría de los nombres de los kwargs no es ideal, pero `.Axes.fill_between` ya tiene un kwarg ``where``.

source: This is particularly useful for plotting pre-binned histograms.
es_es: Esto es especialmente útil para graficar histogramas preagrupados.

source: Square Plot
es_es: Gráfico cuadrado

source: Implemented square plots feature as a new parameter in the axis function. When argument 'square' is specified, equal scaling is set, and the limits are set such that ``xmax-xmin == ymax-ymin``.
es_es: Se ha implementado la función de gráficos cuadrados como un nuevo parámetro en la función de eje. Cuando se especifica el argumento 'square', se establece una escala igual, y los límites se establecen de manera que ``xmax-xmin == ymax-ymin``.

source: (`Source code <../../users/prev_whats_new/whats_new_1-5-3.py>`__, `png <../../users/prev_whats_new/whats_new_1-5-3.png>`__, `pdf <../../users/prev_whats_new/whats_new_1-5-3.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_1-5-3.py>`__, `png <../../users/prev_whats_new/whats_new_1-5-3.png>`__, `pdf <../../users/prev_whats_new/whats_new_1-5-3.pdf>`__)

source: Updated figimage to take optional resize parameter
es_es: Actualizado figimage para tomar el parámetro opcional de cambio de tamaño

source: Added the ability to plot simple 2D-Array using ``plt.figimage(X, resize=True)``. This is useful for plotting simple 2D-Array without the Axes or whitespacing around the image.
es_es: Se ha añadido la posibilidad de graficar una matriz 2D simple utilizando ``plt.figimage(X, resize=True)``. Esto es útil para graficar simples arreglos 2D sin los ejes o el espacio en blanco alrededor de la imagen.

source: (`Source code <../../users/prev_whats_new/whats_new_1-5-4.py>`__, `png <../../users/prev_whats_new/whats_new_1-5-4.png>`__, `pdf <../../users/prev_whats_new/whats_new_1-5-4.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_1-5-4.py>`__, `png <../../users/prev_whats_new/whats_new_1-5-4.png>`__, `pdf <../../users/prev_whats_new/whats_new_1-5-4.pdf>`__)

source: Updated Figure.savefig() can now use figure's dpi
es_es: Actualizado Figure.savefig() ahora puede utilizar los dpi de la figura

source: Added support to save the figure with the same dpi as the figure on the screen using ``dpi='figure'``:.
es_es: Se ha añadido soporte para guardar la figura con los mismos dpi que la figura en la pantalla usando ``dpi='figura'``:.

source: Example::
es_es: Ejemplo::

source: Updated Table to control edge visibility
es_es: Tabla actualizada para controlar la visibilidad de las aristas
