Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_3.4.0.po
Languages: es_es

source: What's new in Matplotlib 3.4.0 (Mar 26, 2021)
es_es: Novedades de Matplotlib 3.4.0 (26 de marzo de 2021)

source: For a list of all of the issues and pull requests since the last revision, see the :ref:`github-stats`.
es_es: Para ver una lista de todas las incidencias y pull requests desde la última revisión, consulta la :ref:`github-stats`.

source: Table of Contents
es_es: Tabla de Contenidos

source: Figure and Axes creation / management
es_es: Creación y gestión de figuras y ejes

source: New subfigure functionality
es_es: Nueva funcionalidad de subfigura

source: New `.figure.Figure.add_subfigure` and `.figure.Figure.subfigures` functionalities allow creating virtual figures within figures. Similar nesting was previously done with nested gridspecs (see :doc:`/gallery/subplots_axes_and_figures/gridspec_nested`). However, this did not allow localized figure artists (e.g., a colorbar or suptitle) that only pertained to each subgridspec.
es_es: Las nuevas funcionalidades `.figure.Figure.add_subfigure` y `.figure.Figure.subfigures` permiten crear figuras virtuales dentro de las figuras. Anteriormente se realizaba un anidamiento similar con gridspecs anidados ( ver :doc:`/gallery/subplots_axes_and_figures/gridspec_nested`). Sin embargo, esto no permitía localizar a los artists de las figuras (por ejemplo, una barra de color o un subtítulo) que sólo pertenecían a cada subgridspec.

source: The new methods `.figure.Figure.add_subfigure` and `.figure.Figure.subfigures` are meant to rhyme with `.figure.Figure.add_subplot` and `.figure.Figure.subplots` and have most of the same arguments.
es_es: Los nuevos métodos `.figure.Figure.add_subfigure` y `.figure.Figure.subfigures` están pensados para rimar con `.figure.Figure.add_subplot` y `.figure.Figure.subplots` y tienen la mayoría de los mismos argumentos.

source: See :doc:`/gallery/subplots_axes_and_figures/subfigures` for further details.
es_es: Ver :doc:`/gallery/subplots_axes_and_figures/subfigures` para más detalles.

source: The subfigure functionality is experimental API as of v3.4.
es_es: La funcionalidad de las subfiguras es una API experimental a partir de la versión 3.4.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-1.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-1.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-1.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-1.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-1.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-1.pdf>`__)

source: Single-line string notation for ``subplot_mosaic``
es_es: Notación de cadena de una sola línea para ``subplot_mosaic``

source: `.Figure.subplot_mosaic` and `.pyplot.subplot_mosaic` now accept a single-line string, using semicolons to delimit rows. Namely, ::
es_es: `.Figure.subplot_mosaic` y `.pyplot.subplot_mosaic` aceptan ahora una cadena de una sola línea, utilizando punto y coma para delimitar las filas. A saber, ::

source: may be written as the shorter:
es_es: puede escribirse como el más corto:

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-2.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-2.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-2.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-2.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-2.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-2.pdf>`__)

source: Changes to behavior of Axes creation methods (``gca``, ``add_axes``, ``add_subplot``)
es_es: Cambios en el comportamiento de los métodos de creación de ejes (``gca``, ``add_axes``, ``add_subplot``)

source: The behavior of the functions to create new Axes (`.pyplot.axes`, `.pyplot.subplot`, `.figure.Figure.add_axes`, `.figure.Figure.add_subplot`) has changed. In the past, these functions would detect if you were attempting to create Axes with the same keyword arguments as already-existing Axes in the current Figure, and if so, they would return the existing Axes. Now, `.pyplot.axes`, `.figure.Figure.add_axes`, and `.figure.Figure.add_subplot` will always create new Axes. `.pyplot.subplot` will continue to reuse an existing Axes with a matching subplot spec and equal *kwargs*.
es_es: El comportamiento de las funciones para crear nuevos Ejes (`.pyplot.axes`, `.pyplot.subplot`, `.figure.Figure.add_axes`, `.figure.Figure.add_subplot`) ha cambiado. Antes, estas funciones detectaban si se intentaba crear ejes con los mismos argumentos de palabra clave que los ejes ya existentes en la figura actual y, en ese caso, devolvían los ejes existentes. Ahora, `.pyplot.axes`, `.figure.Figure.add_axes`, y `.figure.Figure.add_subplot` siempre crearán nuevos Ejes. El programa `.pyplot.subplot` seguirá reutilizando los ejes existentes con una especificación de subplot que corresponda y con los mismos *kwargs*.

source: Correspondingly, the behavior of the functions to get the current Axes (`.pyplot.gca`, `.figure.Figure.gca`) has changed. In the past, these functions accepted keyword arguments. If the keyword arguments matched an already-existing Axes, then that Axes would be returned, otherwise new Axes would be created with those keyword arguments. Now, the keyword arguments are only considered if there are no Axes at all in the current figure. In a future release, these functions will not accept keyword arguments at all.
es_es: En consecuencia, el comportamiento de las funciones para obtener los Ejes actuales (`.pyplot.gca`, `.figure.Figure.gca`) ha cambiado. Antes, estas funciones aceptaban argumentos de palabras clave. Si los argumentos de las palabras clave corresponden con un Eje ya existente, se devolvía ese Eje, de lo contrario se creaban nuevos Ejes con esos argumentos de las palabras clave. Ahora, los argumentos de la palabra clave sólo se consideran si no hay ningún Eje en la figura actual. En una futura versión, estas funciones no aceptarán ningún argumento de palabra clave.

source: ``add_subplot``/``add_axes`` gained an *axes_class* parameter
es_es: ``add_subplot``/`add_axes`` ha ganado un parámetro *axes_class*

source: In particular, ``mpl_toolkits`` Axes subclasses can now be idiomatically used using, e.g., ``fig.add_subplot(axes_class=mpl_toolkits.axislines.Axes)``
es_es: En particular, las subclases de ejes de ``mpl_toolkits`` pueden utilizarse ahora de forma idiomática utilizando, por ejemplo, ``fig.add_subplot(axes_class=mpl_toolkits.axislines.Axes)``

source: Subplot and subplot2grid can now work with constrained layout
es_es: Subplot y subplot2grid ahora pueden trabajar con layout restringido

source: ``constrained_layout`` depends on a single `.GridSpec` for each logical layout on a figure. Previously, `.pyplot.subplot` and `.pyplot.subplot2grid` added a new ``GridSpec`` each time they were called and were therefore incompatible with ``constrained_layout``.
es_es: ``constrained_layout`` depende de un único `.GridSpec` para cada layout lógico de una figura. Anteriormente, `.pyplot.subplot` y `.pyplot.subplot2grid` añadían una nueva ``GridSpec`` cada vez que se invocaban y, por tanto, eran incompatibles con ``constrained_layout``.

source: Now ``subplot`` attempts to reuse the ``GridSpec`` if the number of rows and columns is the same as the top level GridSpec already in the figure, i.e., ``plt.subplot(2, 1, 2)`` will use the same GridSpec as ``plt.subplot(2, 1, 1)`` and the ``constrained_layout=True`` option to `~.figure.Figure` will work.
es_es: Ahora ``subplot`` intenta reutilizar el ``GridSpec`` si el número de filas y columnas es el mismo que el GridSpec de nivel superior que ya está en la figura, es decir, ``plt.subplot(2, 1, 2)`` utilizará el mismo GridSpec que ``plt.subplot(2, 1, 1)`` y la opción ``constrained_layout=True`` de `~.figure.Figure` funcionará.

source: In contrast, mixing *nrows* and *ncols* will *not* work with ``constrained_layout``: ``plt.subplot(2, 2, 1)`` followed by ``plt.subplots(2, 1, 2)`` will still produce two GridSpecs, and ``constrained_layout=True`` will give bad results. In order to get the desired effect, the second call can specify the cells the second Axes is meant to cover: ``plt.subplots(2, 2, (2, 4))``, or the more Pythonic ``plt.subplot2grid((2, 2), (0, 1), rowspan=2)`` can be used.
es_es: Por el contrario, mezclar *nrows* y *ncols* *no* funcionará con ``constrained_layout``: ``plt.subplot(2, 2, 1)`` seguido de ``plt.subplots(2, 1, 2)`` seguirá produciendo dos GridSpecs, y ``constrained_layout=True`` dará malos resultados. Para obtener el efecto deseado, la segunda vez a invocar puede especificar las celdas que el segundo eje debe cubrir: ``plt.subplots(2, 2, (2, 4))``, o se puede utilizar el más pitónico ``plt.subplot2grid((2, 2), (0, 1), rowspan=2)``.

source: Plotting methods
es_es: Métodos de graficación

source: ``axline`` supports *transform* parameter
es_es: ``axline`` soporta el parámetro *transform*

source: `~.Axes.axline` now supports the *transform* parameter, which applies to the points *xy1*, *xy2*. The *slope* (if given) is always in data coordinates.
es_es: `~.Axes.axline` soporta ahora el parámetro *transform*, que se aplica a los puntos *xy1*, *xy2*. La *slope* (si se da) está siempre en coordenadas de datos.

source: For example, this can be used with ``ax.transAxes`` for drawing lines with a fixed slope. In the following plot, the line appears through the same point on both Axes, even though they show different data limits.
es_es: Por ejemplo, esto se puede utilizar con ``ax.transAxes`` para dibujar líneas con una pendiente fija. En el siguiente gráfico, la línea aparece a través del mismo punto en ambos ejes, aunque muestren diferentes límites de datos.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-3.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-3.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-3.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-3.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-3.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-3.pdf>`__)

source: New automatic labeling for bar charts
es_es: Nuevo etiquetado automático para los gráficos de barras

source: A new `.Axes.bar_label` method has been added for auto-labeling bar charts.
es_es: Se ha añadido un nuevo método `.Axes.bar_label` para etiquetar automáticamente los gráficos de barras.

source: Example of the new automatic labeling.
es_es: Ejemplo del nuevo etiquetado automático.

source: A list of hatches can be specified to `~.axes.Axes.bar` and `~.axes.Axes.barh`
es_es: Se puede especificar una lista de escotillas a `~.axes.Axes.bar` y `~.axes.Axes.barh`

source: Similar to some other rectangle properties, it is now possible to hand a list of hatch styles to `~.axes.Axes.bar` and `~.axes.Axes.barh` in order to create bars with different hatch styles, e.g.
es_es: Al igual que otras propiedades de los rectángulos, ahora es posible entregar una lista de estilos de sombreado a `~.axes.Axes.bar` y `~.axes.Axes.barh` para crear barras con diferentes estilos de sombreado, por ejemplo.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-4.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-4.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-4.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-4.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-4.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-4.pdf>`__)

source: Setting ``BarContainer`` orientation
es_es: Fijar la orientación de ``BarContainer``

source: `.BarContainer` now accepts a new string argument *orientation*. It can be either ``'vertical'`` or ``'horizontal'``, default is ``None``.
es_es: `.BarContainer` acepta ahora un nuevo argumento de cadena *orientation*. Puede ser ``'vertical'`` u ``'horizontal'``, por defecto es ``None``.

source: Contour plots now default to using ScalarFormatter
es_es: Los gráficos de contorno ahora utilizan por defecto ScalarFormatter

source: Pass ``fmt="%1.3f"`` to the contouring call to restore the old default label format.
es_es: Pase ``fmt="%1.3f"`` a la invocación del contorno para restaurar el antiguo formato de etiqueta por defecto.

source: ``Axes.errorbar`` cycles non-color properties correctly
es_es: ``Axes.errorbar`` cicla correctamente las propiedades que no son de color

source: Formerly, `.Axes.errorbar` incorrectly skipped the Axes property cycle if a color was explicitly specified, even if the property cycler was for other properties (such as line style). Now, `.Axes.errorbar` will advance the Axes property cycle as done for `.Axes.plot`, i.e., as long as all properties in the cycler are not explicitly passed.
es_es: Anteriormente, `.Axes.errorbar` se saltaba incorrectamente el ciclo de propiedades de los ejes si se especificaba explícitamente un color, incluso si el ciclador de propiedades era para otras propiedades (como el estilo de línea). Ahora, `.Axes.errorbar` avanzará el ciclo de propiedades de los ejes como se hace con `.Axes.plot`, es decir, siempre que no se pasen explícitamente todas las propiedades del ciclador.

source: For example, the following will cycle through the line styles:
es_es: Por ejemplo, lo siguiente hará un ciclo a través de los estilos de línea:

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-5.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-5.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-5.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-5.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-5.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-5.pdf>`__)

source: ``errorbar`` *errorevery* parameter matches *markevery*
es_es: El parámetro ``errorbar`` *errorevery* corresponde con *markevery*

source: Similar to the *markevery* parameter to `~.Axes.plot`, the *errorevery* parameter of `~.Axes.errorbar` now accept slices and NumPy fancy indexes (which must match the size of *x*).
es_es: De forma similar al parámetro *markevery* de `~.Axes.plot`, el parámetro *errorevery* de `~.Axes.errorbar` ahora acepta cortes e índices de fantasía NumPy (que deben corresponder con el tamaño de *x*).

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-6.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-6.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-6.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-6.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-6.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-6.pdf>`__)

source: ``hexbin`` supports data reference for *C* parameter
es_es: ``hexbin`` soporta la referencia de datos para el parámetro *C

source: As with the *x* and *y* parameters, `.Axes.hexbin` now supports passing the *C* parameter using a data reference.
es_es: Al igual que con los parámetros *x* e *y*, `.Axes.hexbin` ahora permite pasar el parámetro *C* utilizando una referencia de datos.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-7.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-7.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-7.pdf>`__)
es_es: (`código fuente <../../users/prev_whats_new/whats_new_3-4-0-7.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-7.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-7.pdf>`__)

source: Support callable for formatting of Sankey labels
es_es: Apoyo a la invocación del formato de las etiquetas Sankey

source: The `format` parameter of `matplotlib.sankey.Sankey` can now accept callables.
es_es: El parámetro `format` de `matplotlib.sankey.Sankey` ahora puede aceptar invocables.

source: This allows the use of an arbitrary function to label flows, for example allowing the mapping of numbers to emoji.
es_es: Esto permite el uso de una función arbitraria para etiquetar flujos, por ejemplo, permitiendo el mapeo de números a emoji.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-8.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-8.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-8.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-8.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-8.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-8.pdf>`__)

source: ``Axes.spines`` access shortcuts
es_es: Atajos de acceso a ``Axes.spines``

source: ``Axes.spines`` is now a dedicated container class `.Spines` for a set of `.Spine`\s instead of an ``OrderedDict``. On top of dict-like access, ``Axes.spines`` now also supports some ``pandas.Series``-like features.
es_es: ``Axes.spines`` es ahora una clase contenedora dedicada `.Spines` para un conjunto de `.Spine`` en lugar de un ``OrderedDict``. Además del acceso tipo dict, ``Axes.spines`` ahora también soporta algunas características tipo ``pandas.Series``.

source: Accessing single elements by item or by attribute::
es_es: Acceso a elementos individuales por elemento o por atributo::

source: Accessing a subset of items::
es_es: Acceder a un subconjunto de elementos::

source: Accessing all items simultaneously::
es_es: Acceder a todos los elementos simultáneamente::

source: New ``stairs`` method and ``StepPatch`` artist
es_es: Nuevo método ``stairs`` y artist ``StepPatch``

source: `.pyplot.stairs` and the underlying artist `~.matplotlib.patches.StepPatch` provide a cleaner interface for plotting stepwise constant functions for the common case that you know the step edges. This supersedes many use cases of `.pyplot.step`, for instance when plotting the output of `numpy.histogram`.
es_es: `.pyplot.stairs` y el artist subyacente `~.matplotlib.patches.StepPatch` proporcionan una interfaz más limpia para graficar funciones constantes escalonadas para el caso común de que se conozcan los bordes de las aristas. Esto sustituye a muchos casos de uso de `.pyplot.step`, por ejemplo al trazar la salida de `numpy.histogram`.

source: For both the artist and the function, the x-like edges input is one element longer than the y-like values input
es_es: Tanto para el artist como para la función, la entrada de aristas de tipo x es un elemento más largo que la entrada de valores de tipo y

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-9.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-9.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-9.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-9.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-9.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-9.pdf>`__)

source: See :doc:`/gallery/lines_bars_and_markers/stairs_demo` for examples.
es_es: Ver :doc:`/gallery/lines_bars_and_markers/stairs_demo` para ejemplos.

source: Added *orientation* parameter for stem plots
es_es: Se ha añadido el parámetro *orientación* para los gráficos de tallo

source: By default, stem lines are vertical. They can be changed to horizontal using the *orientation* parameter of `.Axes.stem` or `.pyplot.stem`:
es_es: Por defecto, las líneas de tallo son verticales. Pueden cambiarse a horizontales utilizando el parámetro *orientación* de `.Axes.stem` o `.pyplot.stem`:

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-10.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-10.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-10.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-10.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-10.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-10.pdf>`__)

source: Angles on Bracket arrow styles
es_es: Estilos de flechas de ángulos en los soportes

source: Angles specified on the *Bracket* arrow styles (``]-[``, ``]-``, ``-[``, or ``|-|`` passed to *arrowstyle* parameter of `.FancyArrowPatch`) are now applied. Previously, the *angleA* and *angleB* options were allowed, but did nothing.
es_es: Los ángulos especificados en los estilos de flecha *Bracket* (``]-[``, ``]-``, ``-[``, o ``|-|`` pasados al parámetro *arrowstyle* de `.FancyArrowPatch`) se aplican ahora. Anteriormente, las opciones *angleA* y *angleB* estaban permitidas, pero no hacían nada.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-11.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-11.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-11.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-11.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-11.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-11.pdf>`__)

source: ``TickedStroke`` patheffect
es_es: Efecto de la ruta ``TickedStroke``

source: The new `.TickedStroke` patheffect can be used to produce lines with a ticked style. This can be used to, e.g., distinguish the valid and invalid sides of the constraint boundaries in the solution space of optimizations.
es_es: El nuevo efecto de trayectoria `.TickedStroke` puede utilizarse para producir líneas con un estilo marcado. Esto puede utilizarse, por ejemplo, para distinguir los lados válidos e inválidos de los límites de las restricciones en el espacio de solución de las optimizaciones.

source: Colors and colormaps
es_es: Colores y mapas de colores

source: Collection color specification and mapping
es_es: Especificación y mapeo del color de la colección

source: Reworking the handling of color mapping and the keyword arguments for *facecolor* and *edgecolor* has resulted in three behavior changes:
es_es: La modificación del manejo de la asignación de colores y de los argumentos de las palabras clave *facecolor* y *edgecolor* ha dado lugar a tres cambios de comportamiento:

source: Color mapping can be turned off by calling ``Collection.set_array(None)``. Previously, this would have no effect.
es_es: La asignación de colores se puede desactivar llamando a ``Collection.set_array(None)``. Anteriormente, esto no tenía ningún efecto.

source: When a mappable array is set, with ``facecolor='none'`` and ``edgecolor='face'``, both the faces and the edges are left uncolored. Previously the edges would be color-mapped.
es_es: Cuando se establece un arreglo mapeable, con ``facecolor='none'`` y ``edgecolor='face'``, tanto las caras como las aristas se dejan sin colorear. Anteriormente las aristas se coloreaban.

source: When a mappable array is set, with ``facecolor='none'`` and ``edgecolor='red'``, the edges are red. This addresses Issue #1302. Previously the edges would be color-mapped.
es_es: Cuando se establece un arreglo asignable, con ``facecolor='none'`` y ``edgecolor='red'``, las aristas son rojas. Esto soluciona el problema #1302. Anteriormente las aristas se coloreaban.

source: Transparency (alpha) can be set as an array in collections
es_es: La transparencia (alfa) puede establecerse como un arreglo en las colecciones

source: Previously, the alpha value controlling transparency in collections could be specified only as a scalar applied to all elements in the collection. For example, all the markers in a `~.Axes.scatter` plot, or all the quadrilaterals in a `~.Axes.pcolormesh` plot, would have the same alpha value.
es_es: Anteriormente, el valor alfa que controla la transparencia en las colecciones sólo podía especificarse como un escalar aplicado a todos los elementos de la colección. Por ejemplo, todos los marcadores de un gráfico `~.Axes.scatter`, o todos los cuadriláteros de un gráfico `~.Axes.pcolormesh`, tendrían el mismo valor alfa.

source: Now it is possible to supply alpha as an array with one value for each element (marker, quadrilateral, etc.) in a collection.
es_es: Ahora es posible suministrar alfa como un arreglo con un valor para cada elemento (marcador, cuadrilátero, etc.) en una colección.
