Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_3.3.0.po
Languages: es_es

source: Here we change the default epoch to the more reasonable UNIX default of ``1970-01-01T00:00:00`` which for a modern date has 0.35 microsecond resolution. (Finer resolution is not possible because we rely on `datetime.datetime` for the date locators). Access to the epoch is provided by `~.dates.get_epoch`, and there is a new :rc:`date.epoch` rcParam. The user may also call `~.dates.set_epoch`, but it must be set *before* any date conversion or plotting is used.
es_es: Aquí cambiamos la epoch por defecto a la más razonable por defecto de UNIX de ``1970-01-01T00:00:00`` que para una fecha moderna tiene una resolución de 0,35 microsegundos. (Una resolución más fina no es posible porque dependemos de `datetime.datetime` para los localizadores de fecha). El acceso a la epoch se proporciona mediante `~.dates.get_epoch`, y hay un nuevo :rc:`date.epoch` rcParam. El usuario también puede invocar a `~.dates.set_epoch`, pero debe establecerse *antes* de utilizar cualquier conversión o trazado de fechas.

source: If you have data stored as ordinal floats in the old epoch, you can convert them to the new ordinal using the following formula::
es_es: Si tiene datos almacenados como ordinales de punto flotantes en la epoch antigua, puede convertirlos al nuevo ordinal utilizando la siguiente fórmula::

source: Lines now accept ``MarkerStyle`` instances as input
es_es: Las líneas ahora aceptan instancias de ``MarkerStyle`` como entrada

source: Similar to `~.Axes.scatter`, `~.Axes.plot` and `~.lines.Line2D` now accept `~.markers.MarkerStyle` instances as input for the *marker* parameter::
es_es: Al igual que `~.Axes.scatter`, `~.Axes.plot` y `~.lines.Line2D` aceptan ahora instancias de `~.markers.MarkerStyle` como entrada para el parámetro *marker*::

source: Fonts
es_es: Fuentes

source: Simple syntax to select fonts by absolute path
es_es: Sintaxis simple para seleccionar fuentes por ruta absoluta

source: Fonts can now be selected by passing an absolute `pathlib.Path` to the *font* keyword argument of `.Text`.
es_es: Ahora se pueden seleccionar las fuentes pasando una `ruta de acceso` absoluta al argumento de la palabra clave *font* de `.Text`.

source: Improved font weight detection
es_es: Mejora de la detección del peso de las fuentes

source: Matplotlib is now better able to determine the weight of fonts from their metadata, allowing to differentiate between fonts within the same family more accurately.
es_es: Matplotlib es ahora más capaz de determinar la ponderación de las fuentes a partir de sus metadatos, lo que permite diferenciar entre las fuentes de una misma familia con mayor precisión.

source: rcParams improvements
es_es: mejoras en rcParams

source: ``matplotlib.rc_context`` can be used as a decorator
es_es: ``matplotlib.rc_context`` puede ser usado como decorador

source: `matplotlib.rc_context` can now be used as a decorator (technically, it is now implemented as a `contextlib.contextmanager`), e.g., ::
es_es: `matplotlib.rc_context` ahora puede ser utilizado como un decorador (técnicamente, ahora se implementa como un `contextlib.contextmanager`), por ejemplo, ::

source: rcParams for controlling default "raise window" behavior
es_es: rcParams para controlar el comportamiento por defecto de "levantar la ventana"

source: The new config option :rc:`figure.raise_window` allows disabling of the raising of the plot window when calling `~.pyplot.show` or `~.pyplot.pause`. The ``MacOSX`` backend is currently not supported.
es_es: La nueva opción de configuración :rc:`figure.raise_window` permite desactivar el levantamiento de la ventana de gŕafico cuando se invoca a `~.pyplot.show` o `~.pyplot.pause`. El backend ``MacOSX`` no está soportado actualmente.

source: Add generalized ``mathtext.fallback`` to rcParams
es_es: Añadir ``mathtext.fallback`` generalizado a rcParams

source: New :rc:`mathtext.fallback` rcParam. Takes "cm", "stix", "stixsans" or "none" to turn fallback off. The rcParam *mathtext.fallback_to_cm* is deprecated, but if used, will override new fallback.
es_es: Nuevo :rc:`mathtext.fallback` rcParam. Toma "cm", "stix", "stixsans" o "none" para desactivar el fallback. El rcParam *mathtext.fallback_to_cm* está obsoleto, pero si se usa, anulará el nuevo fallback.

source: Add ``contour.linewidth`` to rcParams
es_es: Añade ``contour.linewidth`` a rcParams

source: The new config option :rc:`contour.linewidth` allows to control the default line width of contours as a float. When set to ``None``, the line widths fall back to :rc:`lines.linewidth`. The config value is overridden as usual by the *linewidths* argument passed to `~.axes.Axes.contour` when it is not set to ``None``.
es_es: La nueva opción de configuración :rc:`contour.linewidth` permite controlar el ancho de línea por defecto de los contornos como un punto flotante. Cuando se establece como ``None``, el ancho de línea vuelve a ser el de :rc:`lines.linewidth`. El valor de la configuración es sobreescrito por el argumento *linewidths* que se pasa a `~.axes.Axes.contour` cuando no se establece como ``None``.

source: 3D Axes improvements
es_es: Mejoras en los ejes 3D

source: ``Axes3D`` no longer distorts the 3D plot to match the 2D aspect ratio
es_es: ``Axes3D`` ya no distorsiona el gráfico 3D para que correponda con la relación de aspecto 2D

source: Plots made with :class:`~mpl_toolkits.mplot3d.axes3d.Axes3D` were previously stretched to fit a square bounding box. As this stretching was done after the projection from 3D to 2D, it resulted in distorted images if non-square bounding boxes were used. As of 3.3, this no longer occurs.
es_es: Los gráficos realizados con :class:`~mpl_toolkits.mplot3d.axes3d.Axes3D` se estiraban anteriormente para ajustarse a una caja delimitadora cuadrada. Como este estiramiento se realizaba después de la proyección de 3D a 2D, daba lugar a imágenes distorsionadas si se utilizaban cajas delimitadoras no cuadradas. A partir de la versión 3.3, esto ya no ocurre.

source: Currently, modes of setting the aspect (via `~mpl_toolkits.mplot3d.axes3d.Axes3D.set_aspect`) in data space are not supported for Axes3D but may be in the future. If you want to simulate having equal aspect in data space, set the ratio of your data limits to match the value of `~.get_box_aspect`. To control these ratios use the `~mpl_toolkits.mplot3d.axes3d.Axes3D.set_box_aspect` method which accepts the ratios as a 3-tuple of X:Y:Z. The default aspect ratio is 4:4:3.
es_es: Actualmente, los modos de establecer el aspecto (a través de `~mpl_toolkits.mplot3d.axes3d.Axes3D.set_aspect`) en el espacio de datos no están soportados para Axes3D, pero podrían estarlo en el futuro. Si deseas simular que tiene un aspecto igual en el espacio de datos, establece la relación de sus límites de datos para que coincida con el valor de `~.get_box_aspect`. Para controlar estos ratios utiliza el método `~mpl_toolkits.mplot3d.axes3d.Axes3D.set_box_aspect`, que acepta los ratios como una tripleta de X:Y:Z. La relación de aspecto por defecto es 4:4:3.

source: 3D axes now support minor ticks
es_es: Los ejes 3D ahora soportan ticks menores

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-14.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-14.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-14.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-3-0-14.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-14.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-14.pdf>`__)

source: Home/Forward/Backward buttons now work with 3D axes
es_es: Los botones Inicio/Adelante/Atrás ahora funcionan con los ejes 3D

source: Interactive tool improvements
es_es: Mejoras en las herramientas interactivas

source: More consistent toolbar behavior across backends
es_es: Comportamiento más coherente de la barra de herramientas en todos los backends

source: Toolbar features are now more consistent across backends. The history buttons will auto-disable when there is no further action in a direction. The pan and zoom buttons will be marked active when they are in use.
es_es: Las características de la barra de herramientas son ahora más consistentes en todos los backends. Los botones del historial se desactivarán automáticamente cuando no haya más acciones en una dirección. Los botones de desplazamiento y zoom se marcarán como activos cuando estén en uso.

source: In NbAgg and WebAgg, the toolbar buttons are now grouped similarly to other backends. The WebAgg toolbar now uses the same icons as other backends.
es_es: En NbAgg y WebAgg, los botones de la barra de herramientas están ahora agrupados de forma similar a otros backends. La barra de herramientas de WebAgg ahora utiliza los mismos iconos que otros backends.

source: Toolbar icons are now styled for dark themes
es_es: Los iconos de la barra de herramientas están ahora adaptados a los temas oscuros

source: On dark themes, toolbar icons will now be inverted. When using the GTK3Agg backend, toolbar icons are now symbolic, and both foreground and background colors will follow the theme. Tooltips should also behave correctly.
es_es: En los temas oscuros, los iconos de la barra de herramientas estarán ahora invertidos. Cuando se utiliza el backend GTK3Agg, los iconos de la barra de herramientas son ahora simbólicos, y tanto el color de primer plano como el de fondo seguirán el tema. La información sobre herramientas también debería comportarse correctamente.

source: Cursor text now uses a number of significant digits matching pointing precision
es_es: El texto del cursor utiliza ahora una serie de dígitos significativos que corresponde con la precisión del puntero

source: Previously, the x/y position displayed by the cursor text would usually include far more significant digits than the mouse pointing precision (typically one pixel). This is now fixed for linear scales.
es_es: Anteriormente, la posición x/y mostrada por el texto del cursor solía incluir muchos más dígitos significativos que la precisión del puntero del ratón (normalmente un píxel). Esto se ha solucionado para las escalas lineales.

source: GTK / Qt zoom rectangle now black and white
es_es: Rectángulo de zoom GTK / Qt ahora en blanco y negro

source: This makes it visible even over a dark background.
es_es: Esto hace que sea visible incluso sobre un fondo oscuro.

source: Event handler simplifications
es_es: Simplificación de los manejadores de eventos

source: The `.backend_bases.key_press_handler` and `.backend_bases.button_press_handler` event handlers can now be directly connected to a canvas with ``canvas.mpl_connect("key_press_event", key_press_handler)`` and ``canvas.mpl_connect("button_press_event", button_press_handler)``, rather than having to write wrapper functions that fill in the (now optional) *canvas* and *toolbar* parameters.
es_es: Los manejadores de eventos `.backend_bases.key_press_handler` y `.backend_bases.button_press_handler` pueden ahora conectarse directamente a un lienzo con ``canvas.mpl_connect("key_press_event", key_press_handler)`` y ``canvas.mpl_connect("button_press_event", button_press_handler)``, en lugar de tener que escribir funciones envolventes que rellenen los parámetros (ahora opcionales) *canvas* y *toolbar*.

source: Functions to compute a Path's size
es_es: Funciones para calcular el tamaño de una ruta

source: Various functions were added to `~.bezier.BezierSegment` and `~.path.Path` to allow computation of the shape/size of a `~.path.Path` and its composite Bezier curves.
es_es: Se han añadido varias funciones a `~.bezier.BezierSegment` y `~.path.Path` para permitir el cálculo de la forma/tamaño de un `~.path.Path` y sus curvas Bezier compuestas.

source: In addition to the fixes below, `~.bezier.BezierSegment` has gained more documentation and usability improvements, including properties that contain its dimension, degree, control_points, and more.
es_es: Además de las correcciones que se indican a continuación, `~.bezier.BezierSegment` ha ganado más documentación y mejoras de usabilidad, incluyendo propiedades que contienen su dimensión, grado, puntos de control, y más.

source: Better interface for Path segment iteration
es_es: Mejora de la interfaz para la iteración de segmentos de ruta

source: `~.path.Path.iter_bezier` iterates through the `~.bezier.BezierSegment`'s that make up the Path. This is much more useful typically than the existing `~.path.Path.iter_segments` function, which returns the absolute minimum amount of information possible to reconstruct the Path.
es_es: La función `~.path.Path.iter_bezier` itera a través de los `~.bezier.BezierSegment` que componen la ruta. Esto es mucho más útil que la función existente `~.path.Path.iter_segments`, que devuelve la cantidad mínima de información posible para reconstruir la ruta.

source: Fixed bug that computed a Path's Bbox incorrectly
es_es: Se ha corregido un error que calculaba incorrectamente la caja B de una ruta

source: Historically, `~.path.Path.get_extents` has always simply returned the Bbox of a curve's control points, instead of the Bbox of the curve itself. While this is a correct upper bound for the path's extents, it can differ dramatically from the Path's actual extents for non-linear Bezier curves.
es_es: Históricamente, `~.path.Path.get_extents` siempre ha devuelto simplemente la caja B de los puntos de control de una curva, en lugar de la caja B de la propia curva. Aunque esto es un límite superior correcto para las extensiones de la ruta, puede diferir dramáticamente de las extensiones reales de la trayectoria para las curvas Bezier no lineales.

source: Backend-specific improvements
es_es: Mejoras específicas para el backend

source: ``savefig()`` gained a *backend* keyword argument
es_es: ``savefig()`` ganó un argumento de palabra clave *backend*

source: The *backend* keyword argument to ``savefig`` can now be used to pick the rendering backend without having to globally set the backend; e.g., one can save PDFs using the pgf backend with ``savefig("file.pdf", backend="pgf")``.
es_es: El argumento de la palabra clave *backend* de ``savefig`` puede utilizarse ahora para elegir el backend de renderizado sin tener que establecerlo globalmente; por ejemplo, se pueden guardar PDFs utilizando el backend pgf con ``savefig("file.pdf", backend="pgf")``.

source: The SVG backend can now render hatches with transparency
es_es: El backend SVG ahora puede renderizar escotillas con transparencia

source: The SVG backend now respects the hatch stroke alpha. Useful applications are, among others, semi-transparent hatches as a subtle way to differentiate columns in bar plots.
es_es: El backend SVG ahora respeta el alfa del trazo de la escotilla. Las aplicaciones útiles son, entre otras, las tramas semitransparentes como forma sutil de diferenciar las columnas en los gráficos de barras.

source: SVG supports URLs on more artists
es_es: SVG admite URLs en más artists

source: URLs on more artists (i.e., from `.Artist.set_url`) will now be saved in SVG files, namely, ``Tick``\s and ``Line2D``\s are now supported.
es_es: Las URLs de más artists (es decir, de `.Artist.set_url`) se guardarán ahora en archivos SVG, es decir, ahora se admiten ``Tick``\s y `Line2D``\s.

source: Images in SVG will no longer be blurred in some viewers
es_es: Las imágenes en SVG ya no se verán borrosas en algunos dispositivos de visualización

source: A style is now supplied to images without interpolation (``imshow(..., interpolation='none'``) so that SVG image viewers will no longer perform interpolation when rendering themselves.
es_es: Ahora se suministra un estilo a las imágenes sin interpolación (``imshow(..., interpolation='none'``) para que los dispositivos de visualización de imágenes SVG ya no realicen la interpolación al renderizarse.

source: Saving SVG now supports adding metadata
es_es: Guardar SVG ahora permite añadir metadatos

source: When saving SVG files, metadata can now be passed which will be saved in the file using `Dublin Core`_ and `RDF`_. A list of valid metadata can be found in the documentation for `.FigureCanvasSVG.print_svg`.
es_es: Al guardar archivos SVG, ahora se pueden pasar metadatos que se guardarán en el archivo utilizando `Dublin Core`_ y `RDF`_. Puede encontrar una lista de metadatos válidos en la documentación de `.FigureCanvasSVG.print_svg`.

source: Saving PDF metadata via PGF now consistent with PDF backend
es_es: Guardar los metadatos del PDF a través del PGF ahora es coherente con el backend del PDF

source: When saving PDF files using the PGF backend, passed metadata will be interpreted in the same way as with the PDF backend. Previously, this metadata was only accepted by the PGF backend when saving a multi-page PDF with `.backend_pgf.PdfPages`, but is now allowed when saving a single figure, as well.
es_es: Al guardar archivos PDF utilizando el backend PGF, los metadatos pasados se interpretarán de la misma manera que con el backend PDF. Anteriormente, estos metadatos sólo eran aceptados por el backend PGF cuando se guardaba un PDF de varias páginas con `.backend_pgf.PdfPages`, pero ahora también se permite cuando se guarda una sola figura.

source: NbAgg and WebAgg no longer use jQuery & jQuery UI
es_es: NbAgg y WebAgg ya no utilizan jQuery y jQuery UI

source: Instead, they are implemented using vanilla JavaScript. Please report any issues with browsers.
es_es: En su lugar, se implementan utilizando JavaScript de vainilla. Por favor, informa de cualquier incidencia con los navegadores.
