Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_3.3.0.po
Languages: es_es

source: What's new in Matplotlib 3.3.0 (Jul 16, 2020)
es_es: Novedades en Matplotlib 3.3.0 (16 de julio de 2020)

source: For a list of all of the issues and pull requests since the last revision, see the :ref:`github-stats`.
es_es: Para ver una lista de todas las incidencias y pull requests desde la última revisión, ver la :ref:`github-stats`.

source: Table of Contents
es_es: Tabla de Contenidos

source: Figure and Axes creation / management
es_es: Creación y gestión de figuras y ejes

source: Provisional API for composing semantic axes layouts from text or nested lists
es_es: API provisional para componer layouts de ejes semánticos a partir de texto o listas anidadas

source: The `.Figure` class has a provisional method to generate complex grids of named `.axes.Axes` based on nested list input or ASCII art:
es_es: La clase `.Figure` tiene un método provisional para generar mallas complejas de nombres `.axes.Axes` basadas en la entrada de listas anidadas o arte ASCII:

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-1.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-1.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-1.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-3-0-1.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-1.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-1.pdf>`__)

source: or as a string (with single-character Axes labels):
es_es: o como una cadena (con etiquetas de ejes de un solo carácter):

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-2.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-2.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-2.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-3-0-2.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-2.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-2.pdf>`__)

source: See :doc:`/tutorials/provisional/mosaic` for more details and examples.
es_es: Ver :doc:`/tutorials/provisional/mosaic` para más detalles y ejemplos.

source: The `.GridSpec` class gained a `~.GridSpecBase.subplots` method, so that one can write ::
es_es: La clase `.GridSpec` ganó un método `~.GridSpecBase.subplots`, de modo que se puede escribir ::

source: as an alternative to ::
es_es: como alternativa a ::

source: New ``Axes.sharex``, ``Axes.sharey`` methods
es_es: Nuevos métodos ``Axes.sharex``, ``Axes.sharey``

source: These new methods allow sharing axes *immediately* after creating them. Note that behavior is indeterminate if axes are not shared immediately after creation.
es_es: Estos nuevos métodos permiten compartir ejes *inmediatamente* después de crearlos. Toma en cuenta que el comportamiento es indeterminado si los ejes no se comparten inmediatamente después de la creación.

source: For example, they can be used to selectively link some axes created all together using `~.Figure.subplot_mosaic`::
es_es: Por ejemplo, se pueden utilizar para enlazar selectivamente algunos ejes creados todos juntos utilizando `~.Figure.subplot_mosaic`::

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-3.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-3.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-3.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-3-0-3.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-3.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-3.pdf>`__)

source: tight_layout now supports suptitle
es_es: tight_layout ahora soporta suptitle

source: Previous versions did not consider `.Figure.suptitle`, so it may overlap with other artists after calling `~.Figure.tight_layout`:
es_es: Las versiones anteriores no tenían en cuenta `.Figure.suptitle`, por lo que puede solaparse con otros artists tras invovar a `~.Figure.tight_layout`:

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-4.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-4.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-4.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-3-0-4.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-4.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-4.pdf>`__)

source: From now on, the ``suptitle`` will be considered:
es_es: A partir de ahora, el ``suptitle`` será considerado:

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-5.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-5.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-5.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-3-0-5.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-5.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-5.pdf>`__)

source: Setting axes box aspect
es_es: Ajuste del aspecto de la caja de ejes

source: It is now possible to set the aspect of an axes box directly via `~.Axes.set_box_aspect`. The box aspect is the ratio between axes height and axes width in physical units, independent of the data limits. This is useful to, e.g., produce a square plot, independent of the data it contains, or to have a non-image plot with the same axes dimensions next to an image plot with fixed (data-)aspect.
es_es: Ahora es posible establecer el aspecto de la caja de un eje directamente mediante `~.Axes.set_box_aspect`. El aspecto de la caja es la relación entre la altura y la anchura de los ejes en unidades físicas, independientemente de los límites de los datos. Esto es útil para, por ejemplo, producir un gráfico cuadrado, independiente de los datos que contiene, o para tener un gráfico que no sea de imagen con las mismas dimensiones de los ejes junto a un gráfico de imagen con aspecto (de datos) fijo.

source: For use cases check out the :doc:`Axes box aspect </gallery/subplots_axes_and_figures/axes_box_aspect>` example.
es_es: Para los casos de uso consulta el ejemplo :doc:`Axes box aspect </gallery/subplots_axes_and_figures/axes_box_aspect>`.

source: Colors and colormaps
es_es: Colores y mapas de colores

source: Turbo colormap
es_es: Mapa de colores turbo

source: Turbo is an improved rainbow colormap for visualization, created by the Google AI team for computer vision and machine learning. Its purpose is to display depth and disparity data. Please see the `Google AI Blog <https://ai.googleblog.com/2019/08/turbo-improved-rainbow-colormap-for.html>`_ for further details.
es_es: Turbo es un mapa de colores del arco iris mejorado para la visualización, creado por el equipo de IA de Google para la visión por computadora y el aprendizaje automático. Su objetivo es visualizar datos de profundidad y disparidad. Consulte el `Blog de Google AI <https://ai.googleblog.com/2019/08/turbo-improved-rainbow-colormap-for.html>`_ para obtener más detalles.

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-6.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-6.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-6.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-0-6.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-6.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-6.pdf>`__)

source: ``colors.BoundaryNorm`` supports *extend* keyword argument
es_es: ``colors.BoundaryNorm`` soporta argumento de palabra clave *extend*

source: `~.colors.BoundaryNorm` now has an *extend* keyword argument, analogous to *extend* in `~.axes.Axes.contourf`. When set to 'both', 'min', or 'max', it maps the corresponding out-of-range values to `~.colors.Colormap` lookup-table indices near the appropriate ends of their range so that the colors for out-of range values are adjacent to, but distinct from, their in-range neighbors. The colorbar inherits the *extend* argument from the norm, so with ``extend='both'``, for example, the colorbar will have triangular extensions for out-of-range values with colors that differ from adjacent in-range colors.
es_es: `~.colors.BoundaryNorm` tiene ahora un argumento de palabra clave *extend*, análogo a *extend* en `~.axes.Axes.contourf`. Cuando se establece como 'both', 'min' o 'max', asigna los valores correspondientes fuera de rango a los índices de la tabla de búsqueda de `~.colors.Colormap` cerca de los extremos apropiados de su rango, de modo que los colores para los valores fuera de rango son adyacentes, pero distintos, a sus vecinos dentro de rango. La barra de colores hereda el argumento *extend* de la norma, por lo que con ``extend='both'``, por ejemplo, la barra de colores tendrá extensiones triangulares para los valores fuera de rango con colores que difieren de los colores adyacentes dentro del rango.

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-7.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-7.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-7.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-0-7.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-7.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-7.pdf>`__)

source: Text color for legend labels
es_es: Color del texto de las etiquetas de la leyenda

source: The text color of legend labels can now be set by passing a parameter ``labelcolor`` to `~.axes.Axes.legend`. The ``labelcolor`` keyword can be:
es_es: El color del texto de las etiquetas de las leyendas puede ahora establecerse pasando un parámetro ``labelcolor`` a `~.axes.Axes.legend`. La palabra clave ``labelcolor`` puede ser:

source: A single color (either a string or RGBA tuple), which adjusts the text color of all the labels.
es_es: Un único color (ya sea una cadena o una tupla RGBA), que ajusta el color del texto de todas las etiquetas.

source: A list or tuple, allowing the text color of each label to be set individually.
es_es: Una lista o tupla, que permite establecer individualmente el color del texto de cada etiqueta.

source: ``linecolor``, which sets the text color of each label to match the corresponding line color.
es_es: ``linecolor``, que establece el color del texto de cada etiqueta para que coincida con el color de la línea correspondiente.

source: ``markerfacecolor``, which sets the text color of each label to match the corresponding marker face color.
es_es: ``markerfacecolor``, que establece el color del texto de cada etiqueta para que coincida con el color de la cara del marcador correspondiente.

source: ``markeredgecolor``, which sets the text color of each label to match the corresponding marker edge color.
es_es: ``markeredgecolor``, que establece el color del texto de cada etiqueta para que coincida con el color del borde del marcador correspondiente.

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-8.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-8.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-8.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-0-8.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-8.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-8.pdf>`__)

source: Pcolor and Pcolormesh now accept ``shading='nearest'`` and ``'auto'``
es_es: Pcolor y Pcolormesh ahora aceptan ``shading='nearest'`` y ``'auto'``

source: Previously `.axes.Axes.pcolor` and `.axes.Axes.pcolormesh` handled the situation where *x* and *y* have the same (respective) size as *C* by dropping the last row and column of *C*, and *x* and *y* are regarded as the edges of the remaining rows and columns in *C*. However, many users want *x* and *y* centered on the rows and columns of *C*.
es_es: Anteriormente, `.axes.Axes.pcolor` y `.axes.Axes.pcolormesh` manejaban la situación en la que *x* e *y* tienen el mismo tamaño (respectivo) que *C* eliminando la última fila y columna de *C*, y *x* e *y* se consideran las aristas de las filas y columnas restantes de *C*. Sin embargo, muchos usuarios desean que *x* e *y* estén centrados en las filas y columnas de *C*.

source: To accommodate this, ``shading='nearest'`` and ``shading='auto'`` are new allowed strings for the *shading* keyword argument. ``'nearest'`` will center the color on *x* and *y* if *x* and *y* have the same dimensions as *C* (otherwise an error will be thrown). ``shading='auto'`` will choose 'flat' or 'nearest' based on the size of *X*, *Y*, *C*.
es_es: Para ello, ``shading='nearest'`` y ``shading='auto'`` son nuevas cadenas permitidas para el argumento de la palabra clave *shading*. ``'nearest'`` centrará el color en *x* e *y* si *x* e *y* tienen las mismas dimensiones que *C* (en caso contrario se producirá un error). ``shading='auto'`` elegirá 'flat' o 'nearest' basándose en el tamaño de *X*, *Y*, *C*.

source: If ``shading='flat'`` then *X*, and *Y* should have dimensions one larger than *C*. If *X* and *Y* have the same dimensions as *C*, then the previous behavior is used and the last row and column of *C* are dropped, and a DeprecationWarning is emitted.
es_es: Si ``shading='flat'`` entonces *X*, y *Y* deben tener dimensiones una mayor que *C*. Si *X* y *Y* tienen las mismas dimensiones que *C*, entonces se utiliza el comportamiento anterior y se eliminan la última fila y columna de *C*, y se emite un DeprecationWarning.

source: Users can also specify this by the new :rc:`pcolor.shading` in their ``.matplotlibrc`` or via `.rcParams`.
es_es: Los usuarios también pueden especificar esto mediante el nuevo :rc:`pcolor.shading` en su ``.matplotlibrc`` o mediante `.rcParams`.

source: See :doc:`pcolormesh </gallery/images_contours_and_fields/pcolormesh_grids>` for examples.
es_es: Ver :doc:`pcolormesh </gallery/images_contours_and_fields/pcolormesh_grids>` para ejemplos.

source: Titles, ticks, and labels
es_es: Títulos, ticks y etiquetas

source: Align labels to Axes edges
es_es: Alinear etiquetas a bordes de aristas

source: `~.axes.Axes.set_xlabel`, `~.axes.Axes.set_ylabel` and ``ColorbarBase.set_label`` support a parameter ``loc`` for simplified positioning. For the xlabel, the supported values are 'left', 'center', or 'right'. For the ylabel, the supported values are 'bottom', 'center', or 'top'.
es_es: `~.axes.Axes.set_xlabel`, `~.axes.Axes.set_ylabel` y ``ColorbarBase.set_label`` admiten un parámetro ``loc`` para simplificar el posicionamiento. Para la etiqueta x, los valores admitidos son 'left', 'center', o 'right'.. Para la etiqueta y, los valores admitidos son 'bottom', 'center', o 'top'.

source: The default is controlled via :rc:`xaxis.labelposition` and :rc:`yaxis.labelposition`; the Colorbar label takes the rcParam based on its orientation.
es_es: El valor por defecto se controla a través de :rc:`xaxis.labelposition` y :rc:`yaxis.labelposition`; la etiqueta Colorbar toma el rcParam basado en su orientación.

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-9.py>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-3-0-9.py>`__)

source: Allow tick formatters to be set with str or function inputs
es_es: Permitir que los formateadores de tick se establezcan con entradas de str o función

source: `~.Axis.set_major_formatter` and `~.Axis.set_minor_formatter` now accept `str` or function inputs in addition to `~.ticker.Formatter` instances. For a `str` a `~.ticker.StrMethodFormatter` is automatically generated and used. For a function a `~.ticker.FuncFormatter` is automatically generated and used. In other words, ::
es_es: Las funciones `~.Axis.set_major_formatter` y `~.Axis.set_minor_formatter` aceptan ahora entradas de tipo `str` o de función, además de las instancias de `~.ticker.Formatter`. Para un `str` se genera y utiliza automáticamente un `~.ticker.StrMethodFormatter`. Para una función se genera y utiliza automáticamente un `~.ticker.FuncFormatter`. En otras palabras, ::

source: are shortcuts for::
es_es: son accesos directos para::

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-10.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-10.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-10.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-3-0-10.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-10.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-10.pdf>`__)

source: ``Axes.set_title`` gains a *y* keyword argument to control auto positioning
es_es: ``Axes.set_title`` obtiene un argumento de palabra clave *y* para controlar la posición automática

source: `~.axes.Axes.set_title` tries to auto-position the title to avoid any decorators on the top x-axis. This is not always desirable so now *y* is an explicit keyword argument of `~.axes.Axes.set_title`. It defaults to *None* which means to use auto-positioning. If a value is supplied (i.e. the pre-3.0 default was ``y=1.0``) then auto-positioning is turned off. This can also be set with the new rcParameter :rc:`axes.titley`.
es_es: `~.axes.Axes.set_title` trata de auto-posicionar el título para evitar cualquier decorador en el eje x superior. Esto no siempre es deseable, por lo que ahora *y* es un argumento explícito de palabra clave `~.axes.Axes.set_title`. El valor por defecto es *None*, lo que significa que se utilizará el auto-posicionamiento. Si se suministra un valor (es decir, el valor por defecto anterior a la versión 3.0 era ``y=1.0``), el auto-posicionamiento se desactiva. Esto también puede establecerse con el nuevo rcParameter :rc:`axes.titley`.

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-11.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-11.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-11.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-3-0-11.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-11.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-11.pdf>`__)

source: Offset text is now set to the top when using ``axis.tick_top()``
es_es: El texto de desplazamiento se establece ahora en la parte superior cuando se utiliza ``axis.tick_top()``

source: Solves the issue that the power indicator (e.g., 1e4) stayed on the bottom, even if the ticks were on the top.
es_es: Resuelve el problema de que el indicador de potencia (por ejemplo, 1e4) permanecía en la parte inferior, aunque los ticks estuvieran en la parte superior.

source: Set zorder of contour labels
es_es: Establecer el orden de las etiquetas de los contornos

source: `~.axes.Axes.clabel` now accepts a *zorder* keyword argument making it easier to set the *zorder* of contour labels. If not specified, the default *zorder* of clabels used to always be 3 (i.e. the default *zorder* of `~.text.Text`) irrespective of the *zorder* passed to `~.axes.Axes.contour`/`~.axes.Axes.contourf`. The new default *zorder* for clabels has been changed to (``2 + zorder`` passed to `~.axes.Axes.contour` / `~.axes.Axes.contourf`).
es_es: `~.axes.Axes.clabel` acepta ahora un argumento de palabra clave *zorder* que facilita la establecer el *zorder* de las etiquetas de contorno. Si no se especifica, el *zorder* por defecto de las clabels solía ser siempre 3 (es decir, el *zorder* por defecto de `~.text.Text`) independientemente del *zorder* pasado a `~.axes.Axes.contour`/`~.axes.Axes.contourf`. El nuevo *zorder* por defecto para las etiquetas se ha cambiado a (``2 + zorder`` pasado a `~.axes.Axes.contour` / `~.axes.Axes.contourf`).

source: Other changes
es_es: Otros cambios

source: New ``Axes.axline`` method
es_es: Nuevo método ``Ejes.axline``

source: A new `~.axes.Axes.axline` method has been added to draw infinitely long lines that pass through two points.
es_es: Se ha añadido un nuevo método `~.axes.Axes.axline` para dibujar líneas infinitamente largas que pasan por dos puntos.

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-12.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-12.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-12.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-3-0-12.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-12.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-12.pdf>`__)

source: ``imshow`` now coerces 3D arrays with depth 1 to 2D
es_es: ``imshow`` ahora coacciona los arreglos 3D con profundidad 1 a 2D

source: Starting from this version arrays of size MxNx1 will be coerced into MxN for displaying. This means commands like ``plt.imshow(np.random.rand(3, 3, 1))`` will no longer return an error message that the image shape is invalid.
es_es: A partir de esta versión, los arreglos de tamaño MxNx1 se convertirán en MxN para su visualización. Esto significa que comandos como ``plt.imshow(np.random.rand(3, 3, 1))`` ya no devolverán un mensaje de error de que la forma de la imagen no es válida.

source: Better control of ``Axes.pie`` normalization
es_es: Mejor control de la normalización de ``Axes.pie``

source: Previously, `.Axes.pie` would normalize its input *x* if ``sum(x) > 1``, but would do nothing if the sum were less than 1. This can be confusing, so an explicit keyword argument *normalize* has been added. By default, the old behavior is preserved.
es_es: Anteriormente, `.Axes.pie` normalizaba su entrada *x* si ``sum(x) > 1``, pero no hacía nada si la suma era menor que 1. Esto puede ser confuso, por lo que se ha añadido un argumento explícito de palabra clave *normalize*. Por defecto, se mantiene el comportamiento anterior.

source: By passing *normalize*, one can explicitly control whether any rescaling takes place or whether partial pies should be created. If normalization is disabled, and ``sum(x) > 1``, then an error is raised.
es_es: Al pasar *normalize*, se puede controlar explícitamente si se produce algún reescalado o si se deben crear pasteles parciales. Si la normalización está desactivada y ``suma(x) > 1``, se produce un error.

source: (`Source code <../../users/prev_whats_new/whats_new_3-3-0-13.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-13.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-13.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-3-0-13.py>`__, `png <../../users/prev_whats_new/whats_new_3-3-0-13.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-3-0-13.pdf>`__)

source: Dates use a modern epoch
es_es: Las fechas utilizan una epoch moderna

source: Matplotlib converts dates to days since an epoch using `.dates.date2num` (via `matplotlib.units`). Previously, an epoch of ``0000-12-31T00:00:00`` was used so that ``0001-01-01`` was converted to 1.0. An epoch so distant in the past meant that a modern date was not able to preserve microseconds because 2000 years times the 2^(-52) resolution of a 64-bit float gives 14 microseconds.
es_es: Matplotlib convierte las fechas en días desde una epoch utilizando `.dates.date2num` (a través de `matplotlib.units`). Anteriormente, se utilizaba una epoch de ``0000-12-31T00:00:00`` para que ``0001-01-01`` se convirtiera en 1.0. Una epoch tan lejana en el pasado significaba que una fecha moderna no podía conservar los microsegundos porque 2000 años por la resolución 2^(-52) de punto flotante de 64 bits da 14 microsegundos.
