Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_3.5.0.po
Languages: es_es

source: What's new in Matplotlib 3.5.0 (Nov 15, 2021)
es_es: Novedades en Matplotlib 3.5.0 (15 de Noviembre de 2021)

source: For a list of all of the issues and pull requests since the last revision, see the :ref:`github-stats`.
es_es: Para obtener una lista de todas las incidencias y pull requests desde la última revisión, ver la :ref:`github-stats`.

source: Table of Contents
es_es: Tabla de Contenidos

source: Figure and Axes creation / management
es_es: Creación / gestión de figuras y ejes

source: ``subplot_mosaic`` supports simple Axes sharing
es_es: ``subplot_mosaic`` permite compartir ejes de forma sencilla

source: `.Figure.subplot_mosaic`, `.pyplot.subplot_mosaic` support *simple* Axes sharing (i.e., only `True`/`False` may be passed to *sharex*/*sharey*). When `True`, tick label visibility and Axis units will be shared.
es_es: `.Figure.subplot_mosaic`, `.pyplot.subplot_mosaic` soportan la compartición *simple* de ejes (es decir, sólo se puede pasar `True`/`False` a *sharex*/*sharey*). Cuando es `Verdadero`, la visibilidad de las etiquetas de los ticks y las unidades de los Ejes serán compartidas.

source: Figure now has ``draw_without_rendering`` method
es_es: La figura tiene ahora el método ``draw_without_rendering``

source: Some aspects of a figure are only determined at draw-time, such as the exact position of text artists or deferred computation like automatic data limits. If you need these values, you can use ``figure.canvas.draw()`` to force a full draw. However, this has side effects, sometimes requires an open file, and is doing more work than is needed.
es_es: Algunos aspectos de una figura sólo se determinan en el momento de dibujar, como la posición exacta de los artists de texto o el cálculo diferido, como los límites de datos automáticos. Si necesita estos valores, puede utilizar ``figure.canvas.draw()`` para forzar un dibujo completo. Sin embargo, esto tiene efectos secundarios, a veces requiere un archivo abierto, y está haciendo más trabajo del necesario.

source: The new `.Figure.draw_without_rendering` method runs all the updates that ``draw()`` does, but skips rendering the figure. It's thus more efficient if you need the updated values to configure further aspects of the figure.
es_es: El nuevo método `.Figure.draw_without_rendering` ejecuta todas las actualizaciones que hace ``draw()``, pero se salta el renderizado de la figura. Por lo tanto, es más eficiente si necesitas los valores actualizados para configurar otros aspectos de la figura.

source: Figure ``__init__`` passes keyword arguments through to set
es_es: La figura ``__init__`` pasa los argumentos de las palabras clave a set

source: Similar to many other sub-classes of `~.Artist`, the `~.FigureBase`, `~.SubFigure`, and `~.Figure` classes will now pass any additional keyword arguments to `~.Artist.set` to allow properties of the newly created object to be set at initialization time. For example::
es_es: Al igual que muchas otras subclases de `~.Artist`, las clases `~.FigureBase`, `~.SubFigure` y `~.Figure` pasarán ahora cualquier argumento de palabra clave adicional a `~.Artist.set` para permitir que las propiedades del objeto recién creado se establezcan en el momento de la inicialización. Por ejemplo::

source: Plotting methods
es_es: Métodos de graficación

source: Add ``Annulus`` patch
es_es: Añadir el parche ``Annulus``

source: `.Annulus` is a new class for drawing elliptical annuli.
es_es: `.Annulus` es una nueva clase para dibujar anillos elípticos.

source: ``set_data`` method for ``FancyArrow`` patch
es_es: Método ``set_data`` para el parche ``FancyArrow``

source: `.FancyArrow`, the patch returned by ``ax.arrow``, now has a ``set_data`` method that allows modifying the arrow after creation, e.g., for animation.
es_es: `.FancyArrow`, el parche devuelto por ``ax.arrow``, tiene ahora un método ``set_data`` que permite modificar la flecha después de su creación, por ejemplo, para su animación.

source: New arrow styles in ``ArrowStyle`` and ``ConnectionPatch``
es_es: Nuevos estilos de flecha en ``ArrowStyle`` y ``ConnectionPatch``

source: The new *arrow* parameter to `.ArrowStyle` substitutes the use of the *beginarrow* and *endarrow* parameters in the creation of arrows. It receives arrows strings like ``'<-'``, ``']-[``' and ``']->``' instead of individual booleans.
es_es: El nuevo parámetro *arrow* de `.ArrowStyle` sustituye el uso de los parámetros *beginarrow* y *endarrow* en la creación de flechas. Recibe cadenas de flechas como ``'<-'``, ``']-[``' y ``']->``' en lugar de booleanas individuales.

source: Two new styles ``']->'`` and ``'<-['`` are also added via this mechanism. `.ConnectionPatch`, which accepts arrow styles though its *arrowstyle* parameter, also accepts these new styles.
es_es: Dos nuevos estilos ``']->'`` y ``'<-['`` también se añaden a través de este mecanismo. El parche `.ConnectionPatch`, que acepta estilos de flecha a través de su parámetro *arrowstyle*, también acepta estos nuevos estilos.

source: Setting collection offset transform after initialization
es_es: Ajuste de la transformación del desplazamiento de la colección después de la inicialización

source: The added `.collections.Collection.set_offset_transform` may be used to set the offset transform after initialization. This can be helpful when creating a `.collections.Collection` outside an Axes object, and later adding it with `.Axes.add_collection()` and setting the offset transform to `.Axes.transData`.
es_es: La función añadida `.collections.Collection.set_offset_transform` puede utilizarse para establecer la transformación de desplazamiento después de la inicialización. Esto puede ser útil cuando se crea una `.collections.Collection` fuera de un objeto Axes, y posteriormente se añade con `.Axes.add_collection()` y se establece la transformación de desplazamiento a `.Axes.transData`.

source: Colors and colormaps
es_es: Colores y mapas de colores

source: Colormap registry (experimental)
es_es: Registro de mapas de colores (experimental)

source: Colormaps are now managed via `matplotlib.colormaps` (or `.pyplot.colormaps`), which is a `.ColormapRegistry`. While we are confident that the API is final, we formally mark it as experimental for 3.5 because we want to keep the option to still modify the API for 3.6 should the need arise.
es_es: Los mapas de colores se gestionan ahora mediante `matplotlib.colormaps` (o `.pyplot.colormaps`), que es un `.ColormapRegistry`. Aunque estamos seguros de que la API es definitiva, la marcamos formalmente como experimental para la 3.5 porque queremos mantener la opción de seguir modificando la API para la 3.6 si surge la necesidad.

source: Colormaps can be obtained using item access::
es_es: Los mapas de colores pueden obtenerse mediante el acceso a los elementos::

source: To register new colormaps use::
es_es: Para registrar nuevos mapas de colores utilice::

source: We recommend to use the new API instead of the `~.cm.get_cmap` and `~.cm.register_cmap` functions for new code. `matplotlib.cm.get_cmap` and `matplotlib.cm.register_cmap` will eventually be deprecated and removed. Within `.pyplot`, ``plt.get_cmap()`` and ``plt.register_cmap()`` will continue to be supported for backward compatibility.
es_es: Recomendamos utilizar la nueva API en lugar de las funciones `~.cm.get_cmap` y `~.cm.register_cmap` para el código nuevo. Las funciones `matplotlib.cm.get_cmap` y `matplotlib.cm.register_cmap` serán eventualmente obsoletas y eliminadas. Dentro de `.pyplot`, ``plt.get_cmap()`` y ``plt.register_cmap()`` seguirán siendo soportados por compatibilidad con el pasado.

source: Image interpolation now possible at RGBA stage
es_es: La interpolación de imágenes ahora es posible en la etapa RGBA

source: Images in Matplotlib created via `~.axes.Axes.imshow` are resampled to match the resolution of the current canvas. It is useful to apply an auto-aliasing filter when downsampling to reduce Moiré effects. By default, interpolation is done on the data, a norm applied, and then the colormapping performed.
es_es: Las imágenes en Matplotlib creadas a través de `~.axes.Axes.imshow` son remuestreadas para ajustarse a la resolución del lienzo actual. Es útil aplicar un filtro de auto-aliasing cuando se remuestrea para reducir los efectos Moiré. Por defecto, la interpolación se realiza sobre los datos, se aplica una norma y luego se realiza el mapeo de color.

source: However, it is often desirable for the anti-aliasing interpolation to happen in RGBA space, where the colors are interpolated rather than the data. This usually leads to colors outside the colormap, but visually blends adjacent colors, and is what browsers and other image processing software do.
es_es: Sin embargo, a menudo es deseable que la interpolación anti-aliasing ocurra en el espacio RGBA, donde se interpolan los colores en lugar de los datos. Esto suele dar lugar a colores fuera del mapa de colores, pero mezcla visualmente los colores adyacentes, y es lo que hacen los navegadores y otros programas de procesamiento de imágenes.

source: A new keyword argument *interpolation_stage* is provided for `~.axes.Axes.imshow` to set the stage at which the anti-aliasing interpolation happens. The default is the current behaviour of "data", with the alternative being "rgba" for the newly-available behavior.
es_es: Se proporciona un nuevo argumento de palabra clave *interpolation_stage* para `~.axes.Axes.imshow` para establecer la etapa en la que se produce la interpolación antialiasing. El valor por defecto es el comportamiento actual de "data", siendo la alternativa "rgba" para el nuevo comportamiento disponible.

source: Example of the interpolation stage options.
es_es: Ejemplo de las opciones de la etapa de interpolación.

source: For more details see the discussion of the new keyword argument in :doc:`/gallery/images_contours_and_fields/image_antialiasing`.
es_es: Para más detalles, véase la discusión del argumento de la nueva palabra clave en :doc:`/gallery/images_contours_and_fields/image_antialiasing`.

source: ``imshow`` supports half-float arrays
es_es: ``imshow`` admite matrices de medios flotantes

source: The `~.axes.Axes.imshow` method now supports half-float arrays, i.e., NumPy arrays with dtype ``np.float16``.
es_es: El método `~.axes.Axes.imshow` soporta ahora arreglos half-float, es decir, arrays NumPy con dtype ``np.float16``.

source: A callback registry has been added to Normalize objects
es_es: Se ha añadido un registro de callback a los objetos Normalize

source: `.colors.Normalize` objects now have a callback registry, ``callbacks``, that can be connected to by other objects to be notified when the norm is updated. The callback emits the key ``changed`` when the norm is modified. `.cm.ScalarMappable` is now a listener and will register a change when the norm's vmin, vmax or other attributes are changed.
es_es: Los objetos `.colors.Normalize` tienen ahora un registro de llamadas de retorno, ``callbacks``, al que pueden conectarse otros objetos para ser notificados cuando se actualiza la norma. El callback emite la clave ``changed`` cuando se modifica la norma. La norma `.cm.ScalarMappable` es ahora un oyente y registrará un cambio cuando el vmin, vmax u otros atributos de la norma sean modificados.

source: Titles, ticks, and labels
es_es: Títulos, ticks y etiquetas

source: Settings tick positions and labels simultaneously in ``set_ticks``
es_es: Configuración de las posiciones de los ticks y las etiquetas simultáneamente en ``set_ticks``

source: `.Axis.set_ticks` (and the corresponding `.Axes.set_xticks` / `.Axes.set_yticks`) has a new parameter *labels* allowing to set tick positions and labels simultaneously.
es_es: `.Axis.set_ticks` (y los correspondientes `.Axes.set_xticks` / `.Axes.set_yticks`) tiene un nuevo parámetro *labels* que permite establecer posiciones de ticks y etiquetas simultáneamente.

source: Previously, setting tick labels was done using `.Axis.set_ticklabels` (or the corresponding `.Axes.set_xticklabels` / `.Axes.set_yticklabels`); this usually only makes sense if tick positions were previously fixed with `~.Axis.set_ticks`::
es_es: Anteriormente, la fijación de las etiquetas de los ticks se realizaba mediante `.Axis.set_ticklabels` (o los correspondientes `.Axes.set_xticklabels` / `.Axes.set_yticklabels`); esto normalmente sólo tiene sentido si las posiciones de los ticks se fijaron previamente con `~.Axis.set_ticks`::

source: The combined functionality is now available in `~.Axis.set_ticks`::
es_es: La funcionalidad combinada está ahora disponible en `~.Axis.set_ticks`::

source: The use of `.Axis.set_ticklabels` is discouraged, but it will stay available for backward compatibility.
es_es: Se desaconseja el uso de `.Axis.set_ticklabels`, pero seguirá estando disponible por compatibilidad con versiones anteriores.

source: Note: This addition makes the API of `~.Axis.set_ticks` also more similar to `.pyplot.xticks` / `.pyplot.yticks`, which already had the additional *labels* parameter.
es_es: Nota: Esta adición hace que la API de `~.Axis.set_ticks` también sea más similar a la de `.pyplot.xticks` / `.pyplot.yticks`, que ya tenía el parámetro adicional *labels*.

source: Fonts and Text
es_es: Fuentes y texto

source: Triple and quadruple dot mathtext accents
es_es: Punto triple y cuádruple acentos de mathtext

source: In addition to single and double dot accents, mathtext now supports triple and quadruple dot accents.
es_es: Además de los acentos de punto simple y doble, mathtext soporta ahora acentos de punto triple y cuádruple.

source: Font properties of legend title are configurable
es_es: Las propiedades de la fuente del título de la leyenda son configurables

source: Title's font properties can be set via the *title_fontproperties* keyword argument, for example:
es_es: Las propiedades de la fuente del título pueden configurarse mediante el argumento de la palabra clave *title_fontproperties*, por ejemplo:

source: ``Text`` and ``TextBox`` added *parse_math* option
es_es: ``Text`` y ``TextBox`` han añadido la opción *parse_math*

source: `.Text` and `.TextBox` objects now allow a *parse_math* keyword-only argument which controls whether math should be parsed from the displayed string. If *True*, the string will be parsed as a math text object. If *False*, the string will be considered a literal and no parsing will occur.
es_es: Los objetos `.Text` y `.TextBox` permiten ahora un argumento de palabra clave *parse_math* que controla si las matemáticas deben ser analizadas desde la cadena mostrada. Si es *True*, la cadena será analizada como un objeto de texto matemático. Si es *False*, la cadena se considerará un literal y no se realizará ningún análisis.

source: Text can be positioned inside TextBox widget
es_es: El texto puede ser posicionado dentro del widget TextBox

source: A new parameter called *textalignment* can be used to control for the position of the text inside the Axes of the `.TextBox` widget.
es_es: Un nuevo parámetro llamado *textalignment* puede utilizarse para controlar la posición del texto dentro de los ejes del widget `.TextBox`.

source: Simplifying the font setting for usetex mode
es_es: Simplificación de la configuración de la fuente para el modo usetex

source: Now the :rc:`font.family` accepts some font names as value for a more user-friendly setup.
es_es: Ahora el parámetro :rc:`font.family` acepta algunos nombres de fuentes como valor para una configuración más fácil para el usuario.

source: Type 42 subsetting is now enabled for PDF/PS backends
es_es: El subconjunto de tipo 42 está ahora habilitado para los backends PDF/PS

source: `~matplotlib.backends.backend_pdf` and `~matplotlib.backends.backend_ps` now use a unified Type 42 font subsetting interface, with the help of `fontTools <https://fonttools.readthedocs.io/en/latest/>`_
es_es: `~matplotlib.backends.backend_pdf` y `~matplotlib.backends.backend_ps` ahora utilizan una interfaz unificada de subconjunto de fuentes Type 42, con la ayuda de `fontTools <https://fonttools.readthedocs.io/en/latest/>`_

source: Set :rc:`pdf.fonttype` or :rc:`ps.fonttype` to ``42`` to trigger this workflow::
es_es: Establezca :rc:`pdf.fonttype` o :rc:`ps.fonttype` a ``42`` para activar este flujo de trabajo::

source: rcParams improvements
es_es: mejoras en rcParams

source: Allow setting default legend labelcolor globally
es_es: Permitir establecer el color de la leyenda por defecto de forma global

source: A new :rc:`legend.labelcolor` sets the default *labelcolor* argument for `.Figure.legend`. The special values 'linecolor', 'markerfacecolor' (or 'mfc'), or 'markeredgecolor' (or 'mec') will cause the legend text to match the corresponding color of marker.
es_es: Un nuevo :rc:`legend.labelcolor` establece el argumento *labelcolor* por defecto para `.Figure.legend`. Los valores especiales 'linecolor', 'markerfacecolor' (o 'mfc'), o 'markeredgecolor' (o 'mec') harán que el texto de la leyenda coincida con el color correspondiente del marcador.

source: 3D Axes improvements
es_es: Mejoras en los ejes 3D

source: Axes3D now allows manual control of draw order
es_es: Axes3D ahora permite el control manual del orden de dibujo

source: The `~mpl_toolkits.mplot3d.axes3d.Axes3D` class now has *computed_zorder* parameter. When set to False, Artists are drawn using their ``zorder`` attribute.
es_es: La clase `~mpl_toolkits.mplot3d.axes3d.Axes3D` tiene ahora el parámetro *computed_zorder*. Cuando se establece en False, los artists se dibujan utilizando su atributo ``zorder``.

source: Allow changing the vertical axis in 3d plots
es_es: Permitir cambiar el eje vertical en los gráficos 3d

source: `~mpl_toolkits.mplot3d.axes3d.Axes3D.view_init` now has the parameter *vertical_axis* which allows switching which axis is aligned vertically.
es_es: La clase `~mpl_toolkits.mplot3d.axes3d.Axes3D.view_init` tiene ahora el parámetro *vertical_axis* que permite cambiar el eje alineado verticalmente.

source: ``plot_surface`` supports masked arrays and NaNs
es_es: ``plot_surface`` soporta arrays enmascarados y NaNs

source: `.axes3d.Axes3D.plot_surface` supports masked arrays and NaNs, and will now hide quads that contain masked or NaN points. The behaviour is similar to `.Axes.contour` with ``corner_mask=True``.
es_es: `.axes3d.Axes3D.plot_surface` soporta arrays enmascarados y NaNs, y ahora ocultará los quads que contengan puntos enmascarados o NaN. El comportamiento es similar al de `.Axes.contour` con ``corner_mask=True``.

source: 3D plotting methods support *data* keyword argument
es_es: Los métodos de trazado 3D soportan el argumento de la palabra clave *data*

source: To match all 2D plotting methods, the 3D Axes now support the *data* keyword argument. This allows passing arguments indirectly from a DataFrame-like structure. ::
es_es: Para coincidir con todos los métodos de trazado en 2D, los Ejes 3D soportan ahora el argumento de la palabra clave *data*. Esto permite pasar argumentos indirectamente desde una estructura tipo DataFrame::

source: Interactive tool improvements
es_es: Mejoras en la herramienta interactiva

source: Colorbars now have pan and zoom functionality
es_es: Las barras de colores tienen ahora la función de desplazamiento y zoom

source: Interactive plots with colorbars can now be zoomed and panned on the colorbar axis. This adjusts the *vmin* and *vmax* of the ``ScalarMappable`` associated with the colorbar. This is currently only enabled for continuous norms. Norms used with contourf and categoricals, such as ``BoundaryNorm`` and ``NoNorm``, have the interactive capability disabled by default. ``cb.ax.set_navigate()`` can be used to set whether a colorbar axes is interactive or not.
es_es: Los gráficos interactivos con barras de colores ahora pueden ser ampliados y desplazados en el eje de la barra de colores. Esto ajusta los valores *vmin* y *vmax* del ``ScalarMappable`` asociado a la barra de colores. Actualmente sólo está habilitado para las normas continuas. Las normas utilizadas con contourf y categóricas, como ``BoundaryNorm`` y ``NoNorm``, tienen la capacidad interactiva desactivada por defecto. Se puede utilizar ``cb.ax.set_navigate()`` para establecer si un eje de barra de colores es interactivo o no.

source: Updated the appearance of Slider widgets
es_es: Actualizada la apariencia de los widgets Slider

source: The appearance of `~.Slider` and `~.RangeSlider` widgets were updated and given new styling parameters for the added handles.
es_es: Se ha actualizado la apariencia de los widgets `~.Slider` y `~.RangeSlider` y se les ha dotado de nuevos parámetros de estilo para los tiradores añadidos.

source: Removing points on a PolygonSelector
es_es: Eliminación de puntos en un PolygonSelector

source: After completing a `~matplotlib.widgets.PolygonSelector`, individual points can now be removed by right-clicking on them.
es_es: Después de completar un `~matplotlib.widgets.PolygonSelector`, ahora se pueden eliminar puntos individuales haciendo clic con el botón derecho sobre ellos.

source: Dragging selectors
es_es: Arrastrando selectores

source: The `~matplotlib.widgets.SpanSelector`, `~matplotlib.widgets.RectangleSelector` and `~matplotlib.widgets.EllipseSelector` have a new keyword argument, *drag_from_anywhere*, which when set to `True` allows you to click and drag from anywhere inside the selector to move it. Previously it was only possible to move it by either activating the move modifier button, or clicking on the central handle.
es_es: Los selectores `~matplotlib.widgets.SpanSelector`, `~matplotlib.widgets.RectangleSelector` y `~matplotlib.widgets.EllipseSelector` tienen un nuevo argumento de palabra clave, *drag_from_anywhere*, que cuando se establece en `True` permite hacer click y arrastrar desde cualquier lugar dentro del selector para moverlo. Anteriormente sólo era posible moverlo activando el botón modificador de movimiento, o haciendo click en el asa central.

source: The size of the `~matplotlib.widgets.SpanSelector` can now be changed using the edge handles.
es_es: El tamaño del `~matplotlib.widgets.SpanSelector` puede ahora cambiarse utilizando los tiradores de los bordes.

source: Clearing selectors
es_es: Limpiando selectores

source: The selectors (`~.widgets.EllipseSelector`, `~.widgets.LassoSelector`, `~.widgets.PolygonSelector`, `~.widgets.RectangleSelector`, and `~.widgets.SpanSelector`) have a new method *clear*, which will clear the current selection and get the selector ready to make a new selection. This is equivalent to pressing the *escape* key.
es_es: Los selectores (`~.widgets.EllipseSelector`, `~.widgets.LassoSelector`, `~.widgets.PolygonSelector`, `~.widgets.RectangleSelector`, y `~.widgets.SpanSelector`) tienen un nuevo método *clear*, que borrará la selección actual y preparará el selector para hacer una nueva selección. Esto es equivalente a pulsar la tecla *escape*.

source: Setting artist properties of selectors
es_es: Configuración de las propiedades de artist de los selectores

source: The artist properties of the `~.widgets.EllipseSelector`, `~.widgets.LassoSelector`, `~.widgets.PolygonSelector`, `~.widgets.RectangleSelector` and `~.widgets.SpanSelector` selectors can be changed using the ``set_props`` and ``set_handle_props`` methods.
es_es: Las propiedades artist de los selectores `~.widgets.EllipseSelector`, `~.widgets.LassoSelector`, `~.widgets.PolygonSelector`, `~.widgets.RectangleSelector` y `~.widgets.SpanSelector` pueden modificarse mediante los métodos ``set_props`` y ``set_handle_props``.

source: Ignore events outside selection
es_es: Ignorar eventos fuera de la selección
