Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_3.4.0.po
Languages: es_es

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-12.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-12.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-12.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-12.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-12.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-12.pdf>`__)

source: pcolormesh has improved transparency handling by enabling snapping
es_es: pcolormesh ha mejorado el manejo de la transparencia al permitir el ajuste

source: Due to how the snapping keyword argument was getting passed to the Agg backend, previous versions of Matplotlib would appear to show lines between the grid edges of a mesh with transparency. This version now applies snapping by default. To restore the old behavior (e.g., for test images), you may set :rc:`pcolormesh.snap` to `False`.
es_es: Debido a la forma en que el argumento de la palabra clave snapping se pasaba al backend de Agg, las versiones anteriores de Matplotlib mostraban líneas entre las aristas de la malla. Esta versión ahora aplica el snapping por defecto. Para restaurar el comportamiento anterior (por ejemplo, para las imágenes de prueba), puede establecer :rc:`pcolormesh.snap` a `False`.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-13.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-13.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-13.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-13.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-13.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-13.pdf>`__)

source: Note that there are lines between the grid boundaries of the main plot which are not the same transparency. The colorbar also shows these lines when a transparency is added to the colormap because internally it uses pcolormesh to draw the colorbar. With snapping on by default (below), the lines at the grid boundaries disappear.
es_es: Tenga en cuenta que hay líneas entre los límites de la malla de la gráfica principal que no tienen la misma transparencia. La barra de colores también muestra estas líneas cuando se añade una transparencia al mapa de colores porque internamente utiliza pcolormesh para dibujar la barra de colores. Con el ajuste activado por defecto (abajo), las líneas en los límites de la malla desaparecen.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-14.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-14.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-14.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-14.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-14.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-14.pdf>`__)

source: IPython representations for Colormap objects
es_es: Representaciones de IPython para objetos Colormap

source: The `matplotlib.colors.Colormap` object now has image representations for IPython / Jupyter backends. Cells returning a colormap on the last line will display an image of the colormap.
es_es: El objeto `matplotlib.colors.Colormap` tiene ahora representaciones de imagen para los backends de IPython / Jupyter. Las celdas que devuelven un mapa de colores en la última línea mostrarán una imagen del mapa de colores.

source: ``Colormap.set_extremes`` and ``Colormap.with_extremes``
es_es: ``Colormap.set_extremes`` y ``Colormap.with_extremes``

source: Because the `.Colormap.set_bad`, `.Colormap.set_under` and `.Colormap.set_over` methods modify the colormap in place, the user must be careful to first make a copy of the colormap if setting the extreme colors e.g. for a builtin colormap.
es_es: Debido a que los métodos `.Colormap.set_bad`, `.Colormap.set_under` y `.Colormap.set_over` modifican el mapa de colores en su lugar, el usuario debe tener cuidado de hacer primero una copia del mapa de colores si establece los colores extremos, por ejemplo, para un mapa de colores incorporado.

source: The new ``Colormap.with_extremes(bad=..., under=..., over=...)`` can be used to first copy the colormap and set the extreme colors on that copy.
es_es: El nuevo ``Colormap.with_extremes(bad=..., under=..., over=...)`` puede utilizarse para copiar primero el mapa de colores y establecer los colores extremos en esa copia.

source: The new `.Colormap.set_extremes` method is provided for API symmetry with `.Colormap.with_extremes`, but note that it suffers from the same issue as the earlier individual setters.
es_es: El nuevo método `.Colormap.set_extremes` se proporciona para la simetría de la API con `.Colormap.with_extremes`, pero tenga en cuenta que sufre el mismo problema que los anteriores setters individuales.

source: Get under/over/bad colors of Colormap objects
es_es: Obtener los colores inferiores/exteriores/malos de los objetos de Colormap

source: `matplotlib.colors.Colormap` now has methods `~.colors.Colormap.get_under`, `~.colors.Colormap.get_over`, `~.colors.Colormap.get_bad` for the colors used for out-of-range and masked values.
es_es: `matplotlib.colors.Colormap` tiene ahora métodos `~.colors.Colormap.get_under`, `~.colors.Colormap.get_over`, `~.colors.Colormap.get_bad` para los colores utilizados para los valores fuera de rango y enmascarados.

source: New ``cm.unregister_cmap`` function
es_es: Nueva función ``cm.unregister_cmap``

source: `.cm.unregister_cmap` allows users to remove a colormap that they have previously registered.
es_es: `.cm.unregister_cmap` permite a los usuarios eliminar un mapa de colores que hayan registrado previamente.

source: New ``CenteredNorm`` for symmetrical data around a center
es_es: Nueva ``CenteredNorm`` para datos simétricos alrededor de un centro

source: In cases where data is symmetrical around a center, for example, positive and negative anomalies around a center zero, `~.matplotlib.colors.CenteredNorm` is a new norm that automatically creates a symmetrical mapping around the center. This norm is well suited to be combined with a divergent colormap which uses an unsaturated color in its center.
es_es: En los casos en que los datos son simétricos alrededor de un centro, por ejemplo, anomalías positivas y negativas alrededor de un centro cero, `~.matplotlib.colors.CenteredNorm` es una nueva norma que crea automáticamente un mapeo simétrico alrededor del centro. Esta norma es muy adecuada para ser combinada con un mapa de color divergente que utiliza un color no saturado en su centro.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-15.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-15.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-15.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-15.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-15.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-15.pdf>`__)

source: If the center of symmetry is different from 0, it can be set with the *vcenter* argument. To manually set the range of `~.matplotlib.colors.CenteredNorm`, use the *halfrange* argument.
es_es: Si el centro de simetría es diferente de 0, se puede establecer con el argumento *vcenter*. Para establecer manualmente el rango de `~.matplotlib.colors.CenteredNorm`, utilice el argumento *halfrange*.

source: See :doc:`/tutorials/colors/colormapnorms` for an example and more details about data normalization.
es_es: Ver :doc:`/tutorials/colors/colormapnorms` para un ejemplo y más detalles sobre la normalización de datos.

source: New ``FuncNorm`` for arbitrary normalizations
es_es: Nuevo ``FuncNorm`` para normalizaciones arbitrarias

source: The `.FuncNorm` allows for arbitrary normalization using functions for the forward and inverse.
es_es: El `.FuncNorm` permite una normalización arbitraria utilizando funciones para el avance y la inversión.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-16.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-16.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-16.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-16.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-16.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-16.pdf>`__)

source: GridSpec-based colorbars can now be positioned above or to the left of the main axes
es_es: Las barras de color basadas en GridSpec ahora pueden colocarse encima o a la izquierda de los ejes principales

source: ... by passing ``location="top"`` or ``location="left"`` to the ``colorbar()`` call.
es_es: ... pasando ``location="top"`` o ``location="left"`` al invocar ``colorbar()``.

source: Titles, ticks, and labels
es_es: Títulos, ticks y etiquetas

source: supxlabel and supylabel
es_es: supxlabel y supylabel

source: It is possible to add x- and y-labels to a whole figure, analogous to `.FigureBase.suptitle` using the new `.FigureBase.supxlabel` and `.FigureBase.supylabel` methods.
es_es: Es posible añadir etiquetas x e y a toda una figura, de forma análoga a `.FigureBase.suptitle` utilizando los nuevos métodos `.FigureBase.supxlabel` y `.FigureBase.supylabel`.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-17.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-17.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-17.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-17.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-17.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-17.pdf>`__)

source: Shared-axes ``subplots`` tick label visibility is now correct for top or left labels
es_es: La visibilidad de etiqueta de la marca del eje ``subplots`` es ahora correcta para las etiquetas superiores o izquierdas

source: When calling ``subplots(..., sharex=True, sharey=True)``, Matplotlib automatically hides x tick labels for Axes not in the first column and y tick labels for Axes not in the last row. This behavior is incorrect if rcParams specify that Axes should be labeled on the top (``rcParams["xtick.labeltop"] = True``) or on the right (``rcParams["ytick.labelright"] = True``).
es_es: Cuando se invoca a ``subplots(..., sharex=True, sharey=True)``, Matplotlib oculta automáticamente las etiquetas de las marcas x para los ejes que no están en la primera columna y las etiquetas de las marcas y para los ejes que no están en la última fila. Este comportamiento es incorrecto si rcParams especifica que los Ejes deben ser etiquetados en la parte superior (``rcParams["xtick.labeltop"] = True``) o en la derecha (``rcParams["ytick.labelright"] = True``).

source: Cases such as the following are now handled correctly (adjusting visibility as needed on the first row and last column of Axes):
es_es: Los casos como los siguientes se manejan ahora correctamente (ajustando la visibilidad según sea necesario en la primera fila y la última columna de los Ejes):

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-18.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-18.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-18.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-18.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-18.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-18.pdf>`__)

source: An iterable object with labels can be passed to `.Axes.plot`
es_es: Se puede pasar un objeto iterable con etiquetas a `.Axes.plot`

source: When plotting multiple datasets by passing 2D data as *y* value to `~.Axes.plot`, labels for the datasets can be passed as a list, the length matching the number of columns in *y*.
es_es: Al graficar múltiples conjuntos de datos pasando datos 2D como valor *y* a `~.Axes.plot`, las etiquetas de los conjuntos de datos pueden pasarse como una lista, cuya longitud coincide con el número de columnas en *y*.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-19.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-19.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-19.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-19.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-19.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-19.pdf>`__)

source: Fonts and Text
es_es: Fuentes y texto

source: Text transform can rotate text direction
es_es: La transformación del texto puede girar la dirección del texto

source: The new `.Text` parameter ``transform_rotates_text`` now sets whether rotations of the transform affect the text direction.
es_es: El nuevo parámetro `.Text` ``transform_rotates_text`` establece ahora si las rotaciones de la transformación afectan a la dirección del texto.

source: Example of the new *transform_rotates_text* parameter
es_es: Ejemplo del nuevo parámetro *transform_rotates_text*

source: ``matplotlib.mathtext`` now supports *overset* and *underset* LaTeX symbols
es_es: ``matplotlib.mathtext`` soporta ahora los símbolos *overset* y *underset* de LaTeX

source: `.mathtext` now supports *overset* and *underset*, called as ``\overset{annotation}{body}`` or ``\underset{annotation}{body}``, where *annotation* is the text "above" or "below" the *body*.
es_es: `.mathtext` ahora soporta *overset* y *underset*, llamado como ``\overset{annotation}{body}`` o ``\underset{annotation}{body}``, donde *anotación* es el texto "arriba" o "abajo" el *cuerpo*.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-20.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-20.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-20.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-20.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-20.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-20.pdf>`__)

source: *math_fontfamily* parameter to change ``Text`` font family
es_es: Parámetro *math_fontfamily* para cambiar la familia de fuentes de ``Text``

source: The new *math_fontfamily* parameter may be used to change the family of fonts for each individual text element in a plot. If no parameter is set, the global value :rc:`mathtext.fontset` will be used.
es_es: El nuevo parámetro *math_fontfamily* puede utilizarse para cambiar la familia de fuentes de cada elemento de texto individual en un gráfico. Si no se establece ningún parámetro, se utilizará el valor global :rc:`mathtext.fontset`.

source: ``TextArea``/``AnchoredText`` support *horizontalalignment*
es_es: ``TextArea``/``AnchoredText`` soporta *horizontalalignment*

source: The horizontal alignment of text in a `.TextArea` or `.AnchoredText` may now be specified, which is mostly effective for multiline text:
es_es: Ahora se puede especificar la alineación horizontal del texto en un `.TextArea` o `.AnchoredText`, lo que es más efectivo para el texto multilínea:

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-21.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-21.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-21.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-21.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-21.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-21.pdf>`__)

source: PDF supports URLs on ``Text`` artists
es_es: El PDF es compatible con las URL de los artists de ``Text``

source: URLs on `.text.Text` artists (i.e., from `.Artist.set_url`) will now be saved in PDF files.
es_es: Las URLs de los artists `.text.Text` (es decir, de `.Artist.set_url`) se guardarán ahora en archivos PDF.

source: rcParams improvements
es_es: mejoras en rcParams

source: New rcParams for dates: set converter and whether to use interval_multiples
es_es: Nuevos rcParams para las fechas: establecer el convertidor y si usar interval_multiples

source: The new :rc:`date.converter` allows toggling between `matplotlib.dates.DateConverter` and `matplotlib.dates.ConciseDateConverter` using the strings 'auto' and 'concise' respectively.
es_es: El nuevo :rc:`date.converter` permite alternar entre `matplotlib.dates.DateConverter` y `matplotlib.dates.ConciseDateConverter` utilizando las cadenas 'auto' y 'concise' respectivamente.

source: The new :rc:`date.interval_multiples` allows toggling between the dates locator trying to pick ticks at set intervals (i.e., day 1 and 15 of the month), versus evenly spaced ticks that start wherever the timeseries starts:
es_es: El nuevo :rc:`date.interval_multiples` permite alternar entre el localizador de fechas que trata de elegir ticks en intervalos establecidos (por ejemplo, el día 1 y el 15 del mes), frente a ticks uniformemente espaciados que comienzan dondequiera que comience la serie temporal:

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-22.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-22.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-22.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-22.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-22.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-22.pdf>`__)

source: Date formatters now respect *usetex* rcParam
es_es: Los formateadores de fechas ahora respetan *usetex* rcParam

source: The `.AutoDateFormatter` and `.ConciseDateFormatter` now respect :rc:`text.usetex`, and will thus use fonts consistent with TeX rendering of the default (non-date) formatter. TeX rendering may also be enabled/disabled by passing the *usetex* parameter when creating the formatter instance.
es_es: Los formateadores `.AutoDateFormatter` y `.ConciseDateFormatter` respetan ahora :rc:`text.usetex`, por lo que utilizarán fuentes consistentes con la representación TeX del formateador por defecto (sin fecha). La representación de TeX también puede activado/desactivado pasando el parámetro *usetex* al crear la instancia del formateador.

source: In the following plot, both the x-axis (dates) and y-axis (numbers) now use the same (TeX) font:
es_es: En el siguiente gráfico, tanto el eje x (fechas) como el eje y (números) utilizan ahora la misma fuente (TeX):

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-23.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-23.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-23.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-23.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-23.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-23.pdf>`__)

source: Setting *image.cmap* to a ``Colormap``
es_es: Establecer *image.cmap* a ``Colormap``

source: It is now possible to set :rc:`image.cmap` to a `.Colormap` instance, such as a colormap created with the new `~.Colormap.set_extremes` above. (This can only be done from Python code, not from the :file:`matplotlibrc` file.)
es_es: Ahora es posible establecer :rc:`image.cmap` a una instancia de `.Colormap`, como un mapa de colores creado con el nuevo `~.Colormap.set_extremes` anterior. (Esto sólo puede hacerse desde el código de Python, no desde el archivo :file:`matplotlibrc`.)

source: Tick and tick label colors can be set independently using rcParams
es_es: Los colores de las etiquetas de las marcas del eje se pueden establecer de forma independiente utilizando rcParams

source: Previously, :rc:`xtick.color` defined both the tick color and the label color. The label color can now be set independently using :rc:`xtick.labelcolor`. It defaults to ``'inherit'`` which will take the value from :rc:`xtick.color`. The same holds for ``ytick.[label]color``. For instance, to set the ticks to light grey and the tick labels to black, one can use the following code in a script::
es_es: Anteriormente, :rc:`xtick.color` definía tanto el color del tick como el de la etiqueta. Ahora, el color de la etiqueta puede establecerse de forma independiente utilizando :rc:`xtick.labelcolor`. El valor por defecto es ``'inherit'``, que tomará el valor de :rc:`xtick.color`. Lo mismo ocurre con ``ytick.[label]color``. Por ejemplo, para establecer los ticks en gris claro y las etiquetas de los ticks en negro, se puede utilizar el siguiente código en un script::

source: Or by adding the following lines to the :ref:`matplotlibrc <customizing-with-matplotlibrc-files>` file, or a Matplotlib style file:
es_es: O añadiendo las siguientes líneas al archivo :ref:`matplotlibrc <customizing-with-matplotlibrc-files>`, o a un archivo de estilo de Matplotlib:

source: 3D Axes improvements
es_es: Mejoras en los ejes 3D

source: Errorbar method in 3D Axes
es_es: Método de la barra de error en los ejes 3D

source: The errorbar function `.Axes.errorbar` is ported into the 3D Axes framework in its entirety, supporting features such as custom styling for error lines and cap marks, control over errorbar spacing, upper and lower limit marks.
es_es: La función de la barra de error `.Axes.errorbar` se ha incorporado al framework de ejes 3D en su totalidad, soportando características como el estilo personalizado para las líneas de error y las marcas de tope, el control sobre el espaciado de la barra de error, y las marcas de límite superior e inferior.

source: Stem plots in 3D Axes
es_es: Gráficos de tallo en ejes 3D

source: Stem plots are now supported on 3D Axes. Much like 2D stems, `~.axes3d.Axes3D.stem3D` supports plotting the stems in various orientations:
es_es: Los gráficos de tallo son ahora compatibles con los ejes 3D. Al igual que los tallos 2D, `~.axes3d.Axes3D.stem3D` permite graficar los tallos en varias orientaciones:

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-24.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-24.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-24.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-24.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-24.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-24.pdf>`__)

source: See also the :doc:`/gallery/mplot3d/stem3d_demo` demo.
es_es: Ver también la demostración :doc:`/gallery/mplot3d/stem3d_demo`.

source: 3D Collection properties are now modifiable
es_es: Las propiedades de la Colección 3D son ahora modificables

source: Previously, properties of a 3D Collection that were used for 3D effects (e.g., colors were modified to produce depth shading) could not be changed after it was created.
es_es: Anteriormente, las propiedades de una colección 3D que se utilizaban para los efectos 3D (por ejemplo, los colores se modificaban para producir un sombreado de profundidad) no podían modificarse después de su creación.

source: Now it is possible to modify all properties of 3D Collections at any time.
es_es: Ahora es posible modificar todas las propiedades de las Colecciones 3D en cualquier momento.

source: Panning in 3D Axes
es_es: Desplazamiento en ejes 3D

source: Click and drag with the middle mouse button to pan 3D Axes.
es_es: Haga clic y arrastre con el botón central del ratón para desplazar los ejes 3D.

source: Interactive tool improvements
es_es: Mejoras en las herramientas interactivas

source: New ``RangeSlider`` widget
es_es: Nuevo widget ``RangeSlider``

source: `.widgets.RangeSlider` allows for creating a slider that defines a range rather than a single value.
es_es: `.widgets.RangeSlider` permite crear un deslizador que define un rango en lugar de un solo valor.

source: (`Source code <../../users/prev_whats_new/whats_new_3-4-0-25.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-25.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-25.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-4-0-25.py>`__, `png <../../users/prev_whats_new/whats_new_3-4-0-25.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-4-0-25.pdf>`__)
