Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_1.4.po
Languages: es_es

source: Controls whether figures are saved with a transparent background by default. Previously `~.Figure.savefig` always defaulted to a non-transparent background.
es_es: Controla si las figuras se guardan con un fondo transparente por defecto. Anteriormente `~.Figure.savefig` siempre tenía un fondo no transparente por defecto.

source: Added rcParam to control the weight of the title
es_es: Añadido rcParam para controlar el peso del título

source: ``axes.formatter.useoffset`` added
es_es: ``axes.formatter.useoffset`` añadido

source: Controls the default value of *useOffset* in `.ScalarFormatter`. If `True` and the data range is much smaller than the data average, then an offset will be determined such that the tick labels are meaningful. If `False` then the full number will be formatted in all conditions.
es_es: Controla el valor por defecto de *useOffset* en `.ScalarFormatter`. Si `True` y el rango de datos es mucho más pequeño que la media de los datos, entonces se determinará un desplazamiento tal que las etiquetas de las marcas del eje tengan sentido. Si `False` entonces el número completo será formateado en todas las condiciones.

source: ``nbagg.transparent`` added
es_es: ``nbagg.transparent`` añadido

source: Controls whether nbagg figures have a transparent background. ``nbagg.transparent`` is ``True`` by default.
es_es: Controla si las figuras nbagg tienen un fondo transparente. ``nbagg.transparent`` es ``True`` por defecto.

source: XDG compliance
es_es: Cumplimiento de XDG

source: Matplotlib now looks for configuration files (both rcparams and style) in XDG compliant locations.
es_es: Matplotlib ahora busca los archivos de configuración (tanto rcparams como style) en ubicaciones compatibles con XDG.

source: ``style`` package added
es_es: Paquete ``style`` añadido

source: You can now easily switch between different styles using the new ``style`` package::
es_es: Ahora puedes cambiar fácilmente entre diferentes estilos utilizando el nuevo paquete ``style``::

source: Subsequent plots will use updated colors, sizes, etc. To list all available styles, use::
es_es: Los gráficos posteriores utilizarán colores, tamaños, etc. actualizados. Para listar todos los estilos disponibles, utilice::

source: You can add your own custom ``<style name>.mplstyle`` files to ``~/.matplotlib/stylelib`` or call ``use`` with a URL pointing to a file with ``matplotlibrc`` settings.
es_es: Puedes añadir tus propios archivos personalizados ``<style name>.mplstyle`` a ``~/.matplotlib/stylelib`` o invocar ``use`` con una URL que apunte a un archivo con la configuración de ``matplotlibrc``.

source: *Note that this is an experimental feature*, and the interface may change as users test out this new feature.
es_es: *Tenga en cuenta que se trata de una característica experimental*, y que la interfaz puede cambiar a medida que los usuarios prueben esta nueva característica.

source: Martin Fitzpatrick and Tom Badran implemented a Qt5 backend. The differences in namespace locations between Qt4 and Qt5 was dealt with by shimming Qt4 to look like Qt5, thus the Qt5 implementation is the primary implementation. Backwards compatibility for Qt4 is maintained by wrapping the Qt5 implementation.
es_es: Martin Fitzpatrick y Tom Badran implementaron un backend de Qt5. Las diferencias en las ubicaciones de los espacios de nombres entre Qt4 y Qt5 se han solucionado ajustando Qt4 para que se parezca a Qt5, por lo que la implementación de Qt5 es la principal. La compatibilidad con Qt4 se mantiene con la implementación de Qt5.

source: The Qt5Agg backend currently does not work with IPython's %matplotlib magic.
es_es: El backend Qt5Agg actualmente no funciona con la fórmula %matplotlib de IPython.

source: The 1.4.0 release has a known bug where the toolbar is broken. This can be fixed by: ::
es_es: La versión 1.4.0 tiene un error conocido donde la barra de herramientas está rota. Esto puede ser arreglado por: ::

source: Rudolf Höfler changed the appearance of the subplottool. All sliders are vertically arranged now, buttons for tight layout and reset were added. Furthermore, the subplottool is now implemented as a modal dialog. It was previously a QMainWindow, leaving the SPT open if one closed the plot window.
es_es: Rudolf Höfler ha cambiado la apariencia de la herramienta del subgráfico. Todos los carruseles están ahora dispuestos verticalmente, y se han añadido botones para layout ajustado y el reinicio. Además, las herramientas del subgráfico se implementan ahora como un diálogo modal. Anteriormente era un QMainWindow, dejando el SPT abierto si uno cerraba la ventana de gráfico.

source: In the figure options dialog one can now choose to (re-)generate a simple automatic legend. Any explicitly set legend entries will be lost, but changes to the curves' label, linestyle, et cetera will now be updated in the legend.
es_es: En el cuadro de diálogo de opciones de la figura, ahora se puede elegir (re)generar una leyenda automática simple. Cualquier entrada de la leyenda establecida explícitamente se perderá, pero los cambios en la etiqueta de las curvas, el estilo de línea, etc., se actualizarán en la leyenda.

source: Interactive performance of the Qt4 backend has been dramatically improved under windows.
es_es: El rendimiento interactivo del backend Qt4 se ha mejorado notablemente en Windows.

source: The mapping of key-signals from Qt to values matplotlib understands was greatly improved (For both Qt4 and Qt5).
es_es: El mapeo de las señales clave de Qt a los valores que entiende matplotlib se ha mejorado mucho (tanto para Qt4 como para Qt5).

source: Cairo backends
es_es: Backends de Cairo

source: The Cairo backends are now able to use the `cairocffi bindings <https://github.com/SimonSapin/cairocffi>`__ which are more actively maintained than the `pycairo bindings <https://www.cairographics.org/pycairo/>`__.
es_es: Los backends de Cairo pueden ahora utilizar los enlaces `cairocffi <https://github.com/SimonSapin/cairocffi>`__ que se mantienen más activamente que los enlaces `pycairo <https://www.cairographics.org/pycairo/>`__.

source: Gtk3Agg backend
es_es: Backend Gtk3Agg

source: The Gtk3Agg backend now works on Python 3.x, if the `cairocffi bindings <https://github.com/SimonSapin/cairocffi>`__ are installed.
es_es: El backend Gtk3Agg ahora funciona en Python 3.x, si el enlace `cairocffi <https://github.com/SimonSapin/cairocffi>`__ está instalado.

source: PDF backend
es_es: Backend PDF

source: Added context manager for saving to multi-page PDFs.
es_es: Se ha añadido un gestor de contexto para guardar en PDFs de varias páginas.

source: Text
es_es: Texto

source: Text URLs supported by SVG backend
es_es: URLs de texto compatibles con el backend SVG

source: The SVG backend will now render :class:`~matplotlib.text.Text` objects' url as a link in output SVGs. This allows one to make clickable text in saved figures using the url kwarg of the :class:`~matplotlib.text.Text` class.
es_es: El backend SVG ahora renderizará la url de los objetos :class:`~matplotlib.text` como un enlace en los SVG de salida. Esto permite hacer un texto clicable en las figuras guardadas utilizando el kwarg url de la clase :class:`~matplotlib.text.Text`.

source: Anchored sizebar font
es_es: Fuente de la barra de tamaño anclada

source: Added the ``fontproperties`` kwarg to `~mpl_toolkits.axes_grid1.anchored_artists.AnchoredSizeBar` to control the font properties.
es_es: Se ha añadido el kwarg ``fontproperties`` a `~mpl_toolkits.axes_grid1.anchored_artists.AnchoredSizeBar` para controlar las propiedades de las fuentes.

source: Sphinx extensions
es_es: Extensiones de Sphinx

source: The ``:context:`` directive in the `~matplotlib.sphinxext.plot_directive` Sphinx extension can now accept an optional ``reset`` setting, which will cause the context to be reset. This allows more than one distinct context to be present in documentation. To enable this option, use ``:context: reset`` instead of ``:context:`` any time you want to reset the context.
es_es: La directiva ``:context:`` en la extensión de Sphinx `~matplotlib.sphinxext.plot_directive` ahora puede aceptar un ajuste opcional ``reset``, que hará que el contexto se restablezca. Esto permite que haya más de un contexto distinto en la documentación. Para activar esta opción, utilice ``:context: reset`` en lugar de ``:context:`` cada vez que desee restablecer el contexto.

source: Legend and PathEffects documentation
es_es: Leyenda y documentación de PathEffects

source: The :doc:`/tutorials/intermediate/legend_guide` and :doc:`/tutorials/advanced/patheffects_guide` have both been updated to better reflect the full potential of each of these powerful features.
es_es: El :doc:`/tutorials/intermediate/legend_guide` y el :doc:`/tutorials/advanced/patheffects_guide` se han actualizado para reflejar mejor todo el potencial de cada una de estas potentes características.

source: Span Selector
es_es: Selector de span

source: Added an option ``span_stays`` to the :class:`~matplotlib.widgets.SpanSelector` which makes the selector rectangle stay on the axes after you release the mouse.
es_es: Se ha añadido una opción ``span_stays`` a la :class:`~matplotlib.widgets.SpanSelector` que hace que el rectángulo del selector permanezca en los ejes después de soltar el ratón.

source: GAE integration
es_es: Integración de GAE

source: Matplotlib will now run on google app engine.
es_es: Matplotlib ahora se ejecutará en google app engine.
