Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_0.98.4.po
Languages: es_es

source: What's new in Matplotlib 0.98.4
es_es: Novedades en Matplotlib 0.98.4

source: Table of Contents
es_es: Tabla de Contenidos

source: It's been four months since the last matplotlib release, and there are a lot of new features and bug-fixes.
es_es: Han pasado cuatro meses desde la última versión de matplotlib, y hay un montón de nuevas características y correcciones de errores.

source: Thanks to Charlie Moad for testing and preparing the source release, including binaries for OS X and Windows for python 2.4 and 2.5 (2.6 and 3.0 will not be available until numpy is available on those releases). Thanks to the many developers who contributed to this release, with contributions from Jae-Joon Lee, Michael Droettboom, Ryan May, Eric Firing, Manuel Metz, Jouni K. Seppänen, Jeff Whitaker, Darren Dale, David Kaplan, Michiel de Hoon and many others who submitted patches
es_es: Gracias a Charlie Moad por probar y preparar el lanzamiento de la fuente, incluyendo binarios para OS X y Windows para python 2.4 y 2.5 (2.6 y 3.0 no estarán disponibles hasta que numpy esté disponible en esas versiones). Gracias a los numerosos desarrolladores que han contribuido a esta versión, con aportaciones de Jae-Joon Lee, Michael Droettboom, Ryan May, Eric Firing, Manuel Metz, Jouni K. Seppänen, Jeff Whitaker, Darren Dale, David Kaplan, Michiel de Hoon y muchos otros que enviaron parches

source: Legend enhancements
es_es: Mejoras en la leyenda

source: Jae-Joon has rewritten the legend class, and added support for multiple columns and rows, as well as fancy box drawing. See :func:`~matplotlib.pyplot.legend` and :class:`matplotlib.legend.Legend`.
es_es: Jae-Joon ha reescrito la clase de leyenda, y ha añadido soporte para múltiples columnas y filas, así como el dibujo de cajas de fantasía. Ver :func:`~matplotlib.pyplot.legend` y :class:`matplotlib.legend.Legend`.

source: Fancy annotations and arrows
es_es: Anotaciones y flechas de fantasía

source: Jae-Joon has added lots of support to annotations for drawing fancy boxes and connectors in annotations. See :func:`~matplotlib.pyplot.annotate` and :class:`~matplotlib.patches.BoxStyle`, :class:`~matplotlib.patches.ArrowStyle`, and :class:`~matplotlib.patches.ConnectionStyle`.
es_es: Jae-Joon ha añadido mucho soporte a las anotaciones para dibujar cajas y conectores de fantasía en las anotaciones. Ver :func:`~matplotlib.pyplot.annotate` y :class:`~matplotlib.patches.BoxStyle`, :class:`~matplotlib.patches.ArrowStyle`, y :class:`~matplotlib.patches.ConnectionStyle`.

source: Native OS X backend
es_es: Backend nativo de OS X

source: Michiel de Hoon has provided a native Mac OSX backend that is almost completely implemented in C. The backend can therefore use Quartz directly and, depending on the application, can be orders of magnitude faster than the existing backends. In addition, no third-party libraries are needed other than Python and NumPy. The backend is interactive from the usual terminal application on Mac using regular Python. It hasn't been tested with ipython yet, but in principle it should to work there as well. Set 'backend : macosx' in your matplotlibrc file, or run your script with::
es_es: Michiel de Hoon ha proporcionado un backend nativo para Mac OSX que está implementado casi por completo en C. El backend puede por tanto utilizar Quartz directamente y, dependiendo de la aplicación, puede ser órdenes de magnitud más rápido que los backends existentes. Además, no se necesitan librerías de terceros aparte de Python y NumPy. El backend es interactivo desde la aplicación de terminal habitual en Mac utilizando Python normal. Todavía no se ha probado con ipython, pero en principio también debería funcionar allí. Establezca 'backend : macosx' en su archivo matplotlibrc, o ejecute su script con::

source: psd amplitude scaling
es_es: escalado de amplitud psd

source: Ryan May did a lot of work to rationalize the amplitude scaling of :func:`~matplotlib.pyplot.psd` and friends. See :doc:`/gallery/lines_bars_and_markers/psd_demo`. The changes should increase MATLAB compatibility and increase scaling options.
es_es: Ryan May ha trabajado mucho para racionalizar el escalado de amplitud de :func:`~matplotlib.pyplot.psd` y sus amigos. Ver :doc:`/gallery/lines_bars_and_markers/psd_demo`. Los cambios deberían aumentar la compatibilidad con MATLAB y aumentar las opciones de escalado.

source: Fill between
es_es: Relleno entre

source: Added a :func:`~matplotlib.pyplot.fill_between` function to make it easier to do shaded region plots in the presence of masked data. You can pass an *x* array and a *ylower* and *yupper* array to fill between, and an optional *where* argument which is a logical mask where you want to do the filling.
es_es: Se ha añadido una función :func:`~matplotlib.pyplot.fill_between` para facilitar la realización de gráficos de regiones sombreadas en presencia de datos enmascarados. Puedes pasar un array *x* y un array *ylower* y *yupper* para rellenar entre ellos, y un argumento opcional *where* que es una máscara lógica donde quieres hacer el relleno.

source: Lots more
es_es: Mucho más

source: Here are the 0.98.4 notes from the CHANGELOG::
es_es: Aquí están las notas de 0.98.4 del CHANGELOG::
