Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_1.3.po
Languages: es_es

source: What's new in Matplotlib 1.3 (Aug 01, 2013)
es_es: Novedades en Matplotlib 1.3 (01 de agosto de 2013)

source: Table of Contents
es_es: Tabla de Contenidos

source: matplotlib 1.3 supports Python 2.6, 2.7, 3.2, and 3.3
es_es: matplotlib 1.3 soporta Python 2.6, 2.7, 3.2 y 3.3

source: New in 1.3.1
es_es: Nuevo en 1.3.1

source: 1.3.1 is a bugfix release, primarily dealing with improved setup and handling of dependencies, and correcting and enhancing the documentation.
es_es: 1.3.1 es una versión de corrección de errores, que se ocupa principalmente de mejorar la configuración y el manejo de las dependencias, y de corregir y mejorar la documentación.

source: The following changes were made in 1.3.1 since 1.3.0.
es_es: En la versión 1.3.1 se han realizado los siguientes cambios desde la versión 1.3.0.

source: Enhancements
es_es: Mejoras

source: Added a context manager for creating multi-page pdfs (see `matplotlib.backends.backend_pdf.PdfPages`).
es_es: Se ha añadido un gestor de contexto para crear pdfs multipágina (ver `matplotlib.backends.backend_pdf.PdfPages`).

source: The WebAgg backend should now have lower latency over heterogeneous Internet connections.
es_es: El backend WebAgg ahora debería tener menor latencia en conexiones de Internet heterogéneas.

source: Bug fixes
es_es: Correcciones de errores

source: Histogram plots now contain the endline.
es_es: Los gráficos de histograma contienen ahora la línea final.

source: Fixes to the Molleweide projection.
es_es: Se ha arreglado la proyección Molleweide.

source: Handling recent fonts from Microsoft and Macintosh-style fonts with non-ascii metadata is improved.
es_es: Se ha mejorado el manejo de fuentes recientes de Microsoft y de fuentes de estilo Macintosh con metadatos no ascii.

source: Hatching of fill between plots now works correctly in the PDF backend.
es_es: El sombreado del relleno entre parcelas ahora funciona correctamente en el backend del PDF.

source: Tight bounding box support now works in the PGF backend.
es_es: La compatibilidad con el cuadro delimitador ajustado ahora funciona en el backend de PGF.

source: Transparent figures now display correctly in the Qt4Agg backend.
es_es: Las figuras transparentes ahora se muestran correctamente en el backend Qt4Agg.

source: Drawing lines from one subplot to another now works.
es_es: Ahora funciona el trazado de líneas de un subgrupo a otro.

source: Unit handling on masked arrays has been improved.
es_es: Se ha mejorado el manejo de unidades en matrices enmascaradas.

source: Setup and dependencies
es_es: Configuración y dependencias

source: Now works with any version of pyparsing 1.5.6 or later, without displaying hundreds of warnings.
es_es: Ahora funciona con cualquier versión de pyparsing 1.5.6 o posterior, sin mostrar cientos de advertencias.

source: Now works with 64-bit versions of Ghostscript on MS-Windows.
es_es: Ahora funciona con versiones de 64 bits de Ghostscript en MS-Windows.

source: When installing from source into an environment without Numpy, Numpy will first be downloaded and built and then used to build matplotlib.
es_es: Cuando se instala desde el código fuente en un entorno sin Numpy, Numpy se descargará y construirá primero y luego se utilizará para construir matplotlib.

source: Externally installed backends are now always imported using a fully-qualified path to the module.
es_es: Los backends instalados externamente se importan ahora siempre utilizando una ruta completamente calificada al módulo.

source: Works with newer version of wxPython.
es_es: Funciona con la nueva versión de wxPython.

source: Can now build with a PyCXX installed globally on the system from source.
es_es: Ahora se puede construir con un PyCXX instalado globalmente en el sistema desde la fuente.

source: Better detection of Gtk3 dependencies.
es_es: Mejor detección de las dependencias de Gtk3.

source: Testing
es_es: Prueba

source: Tests should now work in non-English locales.
es_es: Las pruebas deberían funcionar ahora en idiomas distintos al inglés.

source: PEP8 conformance tests now report on locations of issues.
es_es: Las pruebas de conformidad PEP8 ahora informan sobre la ubicación de los problemas.

source: New plotting features
es_es: Nuevas características de trazado

source: `~.xkcd`-style sketch plotting
es_es: Trazado de bocetos estilo `~.xkcd`

source: To give your plots a sense of authority that they may be missing, Michael Droettboom (inspired by the work of many others in :ghpull:`1329`) has added an `xkcd-style <https://xkcd.com/>`__ sketch plotting mode. To use it, simply call `matplotlib.pyplot.xkcd` before creating your plot. For really fine control, it is also possible to modify each artist's sketch parameters individually with :meth:`matplotlib.artist.Artist.set_sketch_params`.
es_es: Para dar a sus gráficos una sensación de autoridad que puede faltar, Michael Droettboom (inspirado por el trabajo de muchos otros en :ghpull:`1329`) ha añadido un modo de trazado de bocetos estilo `xkcd <https://xkcd.com/>`__. Para usarlo, simplemente llame a `matplotlib.pyplot.xkcd` antes de crear su gráfico. Para un control realmente fino, también es posible modificar los parámetros de boceto de cada artista individualmente con :meth:`matplotlib.artist.Artist.set_sketch_params`.

source: Updated Axes3D.contour methods
es_es: Actualización de los métodos Axes3D.contour

source: Damon McDougall updated the :meth:`~mpl_toolkits.mplot3d.axes3d.Axes3D.tricontour` and :meth:`~mpl_toolkits.mplot3d.axes3d.Axes3D.tricontourf` methods to allow 3D contour plots on abitrary unstructured user-specified triangulations.
es_es: Damon McDougall ha actualizado los métodos :meth:`~mpl_toolkits.mplot3d.axes3d.Axes3D.tricontour` y :meth:`~mpl_toolkits.mplot3d.axes3d.Axes3D.tricontourf` para permitir el trazado de contornos 3D en triangulaciones abitrarias no estructuradas especificadas por el usuario.

source: New eventplot plot type
es_es: Nuevo tipo de gráfico eventplot

source: Todd Jennings added a :func:`~matplotlib.pyplot.eventplot` function to create multiple rows or columns of identical line segments
es_es: Todd Jennings ha añadido una función :func:`~matplotlib.pyplot.eventplot` para crear múltiples filas o columnas de segmentos de línea idénticos

source: As part of this feature, there is a new :class:`~matplotlib.collections.EventCollection` class that allows for plotting and manipulating rows or columns of identical line segments.
es_es: Como parte de esta función, hay una nueva clase :class:`~matplotlib.collections.EventCollection` que permite trazar y manipular filas o columnas de segmentos de línea idénticos.

source: Triangular grid interpolation
es_es: Interpolación de rejillas triangulares

source: Geoffroy Billotey and Ian Thomas added classes to perform interpolation within triangular grids: (:class:`~matplotlib.tri.LinearTriInterpolator` and :class:`~matplotlib.tri.CubicTriInterpolator`) and a utility class to find the triangles in which points lie (:class:`~matplotlib.tri.TrapezoidMapTriFinder`). A helper class to perform mesh refinement and smooth contouring was also added (:class:`~matplotlib.tri.UniformTriRefiner`). Finally, a class implementing some basic tools for triangular mesh improvement was added (:class:`~matplotlib.tri.TriAnalyzer`).
es_es: Geoffroy Billotey e Ian Thomas han añadido clases para realizar la interpolación dentro de mallas triangulares: (:class:`~matplotlib.tri.LinearTriInterpolator` y :class:`~matplotlib.tri.CubicTriInterpolator`) y una clase de utilidad para encontrar los triángulos en los que se encuentran los puntos (:class:`~matplotlib.tri.TrapezoidMapTriFinder`). También se ha añadido una clase de ayuda para realizar el refinamiento de la malla y el contorno suave (:class:`~matplotlib.tri.UniformTriRefiner`). Por último, se ha añadido una clase que implementa algunas herramientas básicas para la mejora de mallas triangulares (:class:`~matplotlib.tri.TriAnalyzer`).

source: Baselines for stackplot
es_es: Líneas de base para stackplot

source: Till Stensitzki added non-zero baselines to :func:`~matplotlib.pyplot.stackplot`. They may be symmetric or weighted.
es_es: Till Stensitzki ha añadido líneas de base no nulas a :func:`~matplotlib.pyplot.stackplot`. Pueden ser simétricas o ponderadas.

source: Rectangular colorbar extensions
es_es: Extensiones de barras de color rectangulares

source: Andrew Dawson added a new keyword argument *extendrect* to :meth:`~matplotlib.pyplot.colorbar` to optionally make colorbar extensions rectangular instead of triangular.
es_es: Andrew Dawson ha añadido un nuevo argumento de palabra clave *extendrect* a :meth:`~matplotlib.pyplot.colorbar` para hacer opcionalmente que las extensiones de las barras de color sean rectangulares en lugar de triangulares.

source: More robust boxplots
es_es: Boxplots más robustos

source: Paul Hobson provided a fix to the :func:`~matplotlib.pyplot.boxplot` method that prevent whiskers from being drawn inside the box for oddly distributed data sets.
es_es: Paul Hobson ha arreglado el método :func:`~matplotlib.pyplot.boxplot` para evitar que los bigotes se dibujen dentro de la caja en el caso de conjuntos de datos distribuidos de forma extraña.

source: Calling subplot() without arguments
es_es: Llamada a subplot() sin argumentos

source: A call to :func:`~matplotlib.pyplot.subplot` without any arguments now acts the same as ``subplot(111)`` or ``subplot(1, 1, 1)`` -- it creates one axes for the whole figure. This was already the behavior for both :func:`~matplotlib.pyplot.axes` and :func:`~matplotlib.pyplot.subplots`, and now this consistency is shared with :func:`~matplotlib.pyplot.subplot`.
es_es: Una llamada a :func:`~matplotlib.pyplot.subplot` sin argumentos actúa ahora igual que ``subplot(111)`` o ``subplot(1, 1, 1)`` -- crea un eje para toda la figura. Este era ya el comportamiento de :func:`~matplotlib.pyplot.axes` y :func:`~matplotlib.pyplot.subplots`, y ahora esta consistencia se comparte con :func:`~matplotlib.pyplot.subplot`.

source: Drawing
es_es: Diseño

source: Independent alpha values for face and edge colors
es_es: AlfaValores alfa independientes para los colores de las caras y los bordes

source: Wes Campaigne modified how :class:`~matplotlib.patches.Patch` objects are drawn such that (for backends supporting transparency) you can set different alpha values for faces and edges, by specifying their colors in RGBA format. Note that if you set the alpha attribute for the patch object (e.g. using :meth:`~matplotlib.patches.Patch.set_alpha` or the ``alpha`` keyword argument), that value will override the alpha components set in both the face and edge colors.
es_es: Wes Campaigne ha modificado la forma en que se dibujan los objetos :class:`~matplotlib.patches.Patch` de forma que (para los backends que soportan transparencia) se pueden establecer valores alfa diferentes para las caras y los bordes, especificando sus colores en formato RGBA. Tenga en cuenta que si establece el atributo alfa para el objeto parche (por ejemplo, utilizando :meth:`~matplotlib.patches.Patch.set_alpha` o el argumento de la palabra clave ``alpha``), ese valor anulará los componentes alfa establecidos en los colores de las caras y los bordes.

source: Path effects on lines
es_es: Efectos de trayectoria en las líneas

source: Thanks to Jae-Joon Lee, path effects now also work on plot lines.
es_es: Gracias a Jae-Joon Lee, los efectos de trayectoria ahora también funcionan en las líneas de trazado.

source: Easier creation of colormap and normalizer for levels with colors
es_es: Creación más fácil del mapa de colores y del normalizador para los niveles con colores

source: Phil Elson added the :func:`matplotlib.colors.from_levels_and_colors` function to easily create a colormap and normalizer for representation of discrete colors for plot types such as :func:`matplotlib.pyplot.pcolormesh`, with a similar interface to that of `matplotlib.pyplot.contourf`.
es_es: Phil Elson ha añadido la función :func:`matplotlib.colors.from_levels_and_colors` para crear fácilmente un mapa de colores y un normalizador para la representación de colores discretos para tipos de gráficos como :func:`matplotlib.pyplot.pcolormesh`, con una interfaz similar a la de `matplotlib.pyplot.contourf`.

source: Full control of the background color
es_es: Control total del color de fondo

source: Wes Campaigne and Phil Elson fixed the Agg backend such that PNGs are now saved with the correct background color when ``fig.patch.get_alpha()`` is not 1.
es_es: Wes Campaigne y Phil Elson han arreglado el backend de Agg para que los PNG se guarden con el color de fondo correcto cuando ``fig.patch.get_alpha()`` no es 1.

source: Improved ``bbox_inches="tight"`` functionality
es_es: Se ha mejorado la funcionalidad de ``bbox_inches="tight"``

source: Passing ``bbox_inches="tight"`` through to `.pyplot.savefig` now takes into account *all* artists on a figure - this was previously not the case and led to several corner cases which did not function as expected.
es_es: Al pasar ``bbox_inches="tight"`` a `.pyplot.savefig` ahora se tienen en cuenta *todos* los artistas de una figura - antes no era así y daba lugar a varios casos de esquina que no funcionaban como se esperaba.

source: Initialize a rotated rectangle
es_es: Inicializar un rectángulo girado

source: Damon McDougall extended the :class:`~matplotlib.patches.Rectangle` constructor to accept an *angle* kwarg, specifying the rotation of a rectangle in degrees.
es_es: Damon McDougall extendió el constructor :class:`~matplotlib.patches.Rectangle` para aceptar un kwarg de *ángulo*, especificando la rotación de un rectángulo en grados.

source: Text
es_es: Texto

source: Anchored text support
es_es: Soporte de texto anclado

source: The SVG and pgf backends are now able to save text alignment information to their output formats. This allows to edit text elements in saved figures, using Inkscape for example, while preserving their intended position. For SVG please note that you'll have to disable the default text-to-path conversion (``mpl.rc('svg', fonttype='none')``).
es_es: Los backends SVG y pgf son ahora capaces de guardar la información de alineación del texto en sus formatos de salida. Esto permite editar los elementos de texto en las figuras guardadas, usando Inkscape por ejemplo, preservando su posición prevista. Para SVG, tenga en cuenta que tendrá que desactivar la conversión por defecto de texto a ruta (``mpl.rc('svg', fonttype='none')``).

source: Better vertical text alignment and multi-line text
es_es: Mejor alineación vertical del texto y texto de varias líneas

source: The vertical alignment of text is now consistent across backends. You may see small differences in text placement, particularly with rotated text.
es_es: La alineación vertical del texto es ahora consistente en todos los backends. Es posible que se observen pequeñas diferencias en la colocación del texto, en particular con el texto girado.

source: If you are using a custom backend, note that the `~.RendererBase.draw_text` renderer method is now passed the location of the baseline, not the location of the bottom of the text bounding box.
es_es: Si estás utilizando un backend personalizado, ten en cuenta que al método del renderizador `~.RendererBase.draw_text` se le pasa ahora la ubicación de la línea de base, no la ubicación de la parte inferior de la caja delimitadora del texto.

source: Multi-line text will now leave enough room for the height of very tall or very low text, such as superscripts and subscripts.
es_es: El texto de varias líneas ahora dejará suficiente espacio para la altura del texto muy alto o muy bajo, como los superíndices y subíndices.

source: Left and right side axes titles
es_es: Títulos de los ejes laterales izquierdo y derecho

source: Andrew Dawson added the ability to add axes titles flush with the left and right sides of the top of the axes using a new keyword argument *loc* to :func:`~matplotlib.pyplot.title`.
es_es: Andrew Dawson ha añadido la posibilidad de añadir títulos de ejes a ras de los lados izquierdo y derecho de la parte superior de los ejes utilizando un nuevo argumento de palabra clave *loc* a :func:`~matplotlib.pyplot.title`.

source: Improved manual contour plot label positioning
es_es: Mejora del posicionamiento de las etiquetas de los trazados de contorno manuales

source: Brian Mattern modified the manual contour plot label positioning code to interpolate along line segments and find the actual closest point on a contour to the requested position. Previously, the closest path vertex was used, which, in the case of straight contours was sometimes quite distant from the requested location. Much more precise label positioning is now possible.
es_es: Brian Mattern ha modificado el código de posicionamiento manual de etiquetas de contorno para interpolar a lo largo de segmentos de línea y encontrar el punto más cercano en un contorno a la posición solicitada. Anteriormente, se utilizaba el vértice de la trayectoria más cercana, que, en el caso de los contornos rectos, a veces estaba bastante alejado de la ubicación solicitada. Ahora es posible un posicionamiento de etiquetas mucho más preciso.

source: Configuration (rcParams)
es_es: Configuración (rcParams)

source: Quickly find rcParams
es_es: Encontrar rápidamente rcParams

source: Phil Elson made it easier to search for rcParameters by passing a valid regular expression to :func:`matplotlib.RcParams.find_all`. :class:`matplotlib.RcParams` now also has a pretty repr and str representation so that search results are printed prettily:
es_es: Phil Elson ha facilitado la búsqueda de rcParameters pasando una expresión regular válida a :func:`matplotlib.RcParams.find_all`. :class:`matplotlib.RcParams` ahora también tiene una bonita representación repr y str para que los resultados de la búsqueda se impriman de forma bonita:

source: ``axes.xmargin`` and ``axes.ymargin`` added to rcParams
es_es: ``axes.xmargin`` y ``axes.ymargin`` añadidos a rcParams

source: :rc:`axes.xmargin` and :rc:`axes.ymargin` were added to configure the default margins used. Previously they were hard-coded to default to 0, default value of both rcParam values is 0.
es_es: Se ha añadido :rc:`axes.xmargin` y :rc:`axes.ymargin` para configurar los márgenes por defecto. Anteriormente estaban codificados por defecto a 0, el valor por defecto de ambos valores rcParam es 0.

source: Changes to font rcParams
es_es: Cambios a la fuente rcParams

source: The ``font.*`` rcParams now affect only text objects created after the rcParam has been set, and will not retroactively affect already existing text objects. This brings their behavior in line with most other rcParams.
es_es: Los rcParam ``font.*`` afectan ahora sólo a los objetos de texto creados después de que el rcParam haya sido establecido, y no afectarán retroactivamente a los objetos de texto ya existentes. Esto hace que su comportamiento esté en línea con la mayoría de los otros rcParam.

source: Added :rc:`savefig.jpeg_quality`
es_es: Se ha añadido :rc:`savefig.jpeg_quality`

source: rcParam value :rc:`savefig.jpeg_quality` was added so that the user can configure the default quality used when a figure is written as a JPEG. The default quality is 95; previously, the default quality was 75. This change minimizes the artifacting inherent in JPEG images, particularly with images that have sharp changes in color as plots often do.
es_es: se ha añadido el valor de rcParam :rc:`savefig.jpeg_quality` para que el usuario pueda configurar la calidad por defecto utilizada cuando una figura se escribe como JPEG. La calidad por defecto es 95; anteriormente, la calidad por defecto era 75. Este cambio minimiza los artefactos inherentes a las imágenes JPEG, en particular con las imágenes que tienen cambios bruscos de color, como ocurre a menudo con los gráficos.

source: WebAgg backend
es_es: Backend WebAgg

source: Michael Droettboom, Phil Elson and others have developed a new backend, WebAgg, to display figures in a web browser. It works with animations as well as being fully interactive.
es_es: Michael Droettboom, Phil Elson y otros han desarrollado un nuevo backend, WebAgg, para mostrar figuras en un navegador web. Funciona con animaciones, además de ser totalmente interactivo.

source: Future versions of matplotlib will integrate this backend with the IPython notebook for a fully web browser based plotting frontend.
es_es: Las futuras versiones de matplotlib integrarán este backend con el cuaderno IPython para un frontend de ploteo totalmente basado en el navegador web.

source: Remember save directory
es_es: Recordar el directorio de guardado

source: Martin Spacek made the save figure dialog remember the last directory saved to. The default is configurable with the new :rc:`savefig.directory` rcParam in :file:`matplotlibrc`.
es_es: Martin Spacek ha hecho que el diálogo de guardar figura recuerde el último directorio en el que se guardó. El valor por defecto es configurable con el nuevo rcParam :rc:`savefig.directory` en :file:`matplotlibrc`.

source: Documentation and examples
es_es: Documentación y ejemplos

source: Numpydoc docstrings
es_es: Documentación de Numpydoc

source: Nelle Varoquaux has started an ongoing project to convert matplotlib's docstrings to numpydoc format. See `MEP10 <https://github.com/matplotlib/matplotlib/wiki/Mep10>`__ for more information.
es_es: Nelle Varoquaux ha iniciado un proyecto para convertir los docstrings de matplotlib al formato numpydoc. Ver `MEP10 <https://github.com/matplotlib/matplotlib/wiki/Mep10>`__ para más información.

source: Example reorganization
es_es: Reorganización de ejemplos

source: Tony Yu has begun work reorganizing the examples into more meaningful categories. The new gallery page is the fruit of this ongoing work. See `MEP12 <https://github.com/matplotlib/matplotlib/wiki/MEP12>`__ for more information.
es_es: Tony Yu ha comenzado a trabajar en la reorganización de los ejemplos en categorías más significativas. La nueva página de la galería es el fruto de este trabajo en curso. Ver `MEP12 <https://github.com/matplotlib/matplotlib/wiki/MEP12>`__ para más información.

source: Examples now use subplots()
es_es: Los ejemplos ahora utilizan subplots()

source: For the sake of brevity and clarity, most of the :ref:`examples <examples-index>` now use the newer :func:`~matplotlib.pyplot.subplots`, which creates a figure and one (or multiple) axes object(s) in one call. The old way involved a call to :func:`~matplotlib.pyplot.figure`, followed by one (or multiple) :func:`~matplotlib.pyplot.subplot` calls.
es_es: En aras de la brevedad y la claridad, la mayoría de los :ref:`ejemplos <ejemplos-index>` utilizan ahora la nueva :func:`~matplotlib.pyplot.subplots`, que crea una figura y uno (o varios) objetos eje en una sola llamada. La forma antigua implicaba una llamada a :func:`~matplotlib.pyplot.figure`, seguida de una (o varias) llamadas a :func:`~matplotlib.pyplot.subplot`.

source: Infrastructure
es_es: Infraestructura

source: Housecleaning
es_es: Limpieza de la casa

source: A number of features that were deprecated in 1.2 or earlier, or have not been in a working state for a long time have been removed. Highlights include removing the Qt version 3 backends, and the FltkAgg and Emf backends. See :ref:`changes_in_1_3` for a complete list.
es_es: Se han eliminado una serie de características que estaban obsoletas en la versión 1.2 o anterior, o que no han estado funcionando durante mucho tiempo. Lo más destacado es la eliminación de los backends de la versión 3 de Qt, y de los backends FltkAgg y Emf. Ver :ref:`changes_in_1_3` para una lista completa.

source: New setup script
es_es: Nuevo script de configuración
