Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_3.2.0.po
Languages: es_es

source: What's new in Matplotlib 3.2 (Mar 04, 2020)
es_es: Novedades en Matplotlib 3.2 (Mar 04, 2020)

source: For a list of all of the issues and pull requests since the last revision, see the :ref:`github-stats`.
es_es: Para una lista de todas las incidencias y pull requests desde la última revisión, ver el :ref:`github-stats`.

source: Table of Contents
es_es: Tabla de Contenidos

source: Unit converters recognize subclasses
es_es: Los convertidores de unidades reconocen las subclases

source: Unit converters now also handle instances of subclasses of the class they have been registered for.
es_es: Los convertidores de unidades ahora también manejan instancias de subclases de la clase para la que han sido registrados.

source: `~.pyplot.imsave` accepts metadata and PIL options
es_es: `~.pyplot.imsave` acepta metadatos y opciones PIL

source: `~.pyplot.imsave` has gained support for the ``metadata`` and ``pil_kwargs`` parameters. These parameters behave similarly as for the `.Figure.savefig()` method.
es_es: `~.pyplot.imsave` ha ganado soporte para los parámetros ``metadata`` y ``pil_kwargs``. Estos parámetros se comportan de forma similar al método `.Figure.savefig()`.

source: `.cbook.normalize_kwargs` now presents a convenient interface to normalize artist properties (e.g., from "lw" to "linewidth"):
es_es: `.cbook.normalize_kwargs` presenta ahora una cómoda interfaz para normalizar las propiedades del artist (por ejemplo, de "lw" a "linewidth"):

source: The first argument is the mapping to be normalized, and the second argument can be an artist class or an artist instance (it can also be a mapping in a specific format; see the function's docstring for details).
es_es: El primer argumento es el mapeo que se va a normalizar, y el segundo argumento puede ser una clase de artist o una instancia de artist (también puede ser un mapeo en un formato específico; ver la cadena de documentación de la función para más detalles).

source: `.FontProperties` accepts `os.PathLike`
es_es: `.FontProperties` acepta `os.Path.U`

source: The *fname* argument to `.FontProperties` can now be an `os.PathLike`, e.g.
es_es: El argumento *fname* de `.FontProperties` ahora puede ser un `os.PathLike`, por ejemplo

source: Gouraud-shading alpha channel in PDF backend
es_es: Canal alfa de sombreado Gouraud en el backend del PDF

source: The pdf backend now supports an alpha channel in Gouraud-shaded triangle meshes.
es_es: El backend pdf ahora soporta un canal alfa en mallas triangulares sombreadas por Gouraud.

source: Kerning adjustments now use correct values
es_es: Los ajustes de kerning utilizan ahora los valores correctos

source: Due to an error in how kerning adjustments were applied, previous versions of Matplotlib would under-correct kerning. This version will now correctly apply kerning (for fonts supported by FreeType). To restore the old behavior (e.g., for test images), you may set :rc:`text.kerning_factor` to 6 (instead of 0). Other values have undefined behavior.
es_es: Debido a un error en la forma de aplicar los ajustes de interletraje, las versiones anteriores de Matplotlib no corregían el interletraje correctamente. Esta versión ahora aplicará correctamente el kerning (para las fuentes soportadas por FreeType). Para restaurar el comportamiento anterior (por ejemplo, para imágenes de prueba), puede establecer :rc:`text.kerning_factor` a 6 (en lugar de 0). Otros valores tienen un comportamiento indefinido.

source: (`Source code <../../users/prev_whats_new/whats_new_3-2-0-1.py>`__, `png <../../users/prev_whats_new/whats_new_3-2-0-1.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-2-0-1.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-2-0-1.py>`__, `png <../../users/prev_whats_new/whats_new_3-2-0-1.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-2-0-1.pdf>`__)

source: Note how the spacing between characters is uniform between their bounding boxes (above). With corrected kerning (below), slanted characters (e.g., AV or VA) will be spaced closer together, as well as various other character pairs, depending on font support (e.g., T and e, or the period after the W).
es_es: Obsérvese que el espaciado entre los caracteres es uniforme entre sus cajas delimitadoras (arriba). Con el kerning corregido (abajo), los caracteres inclinados (por ejemplo, AV o VA) estarán más espaciados, así como otros pares de caracteres, dependiendo del soporte de la fuente (por ejemplo, T y e, o el punto después de la W).

source: (`Source code <../../users/prev_whats_new/whats_new_3-2-0-2.py>`__, `png <../../users/prev_whats_new/whats_new_3-2-0-2.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-2-0-2.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_3-2-0-2.py>`__, `png <../../users/prev_whats_new/whats_new_3-2-0-2.png>`__, `pdf <../../users/prev_whats_new/whats_new_3-2-0-2.pdf>`__)

source: bar3d lightsource shading
es_es: bar3d sombreado de fuentes de luz

source: :meth:`~.Axes3D.bar3d` now supports lighting from different angles when the *shade* parameter is ``True``, which can be configured using the ``lightsource`` parameter.
es_es: :meth:`~.Axes3D.bar3d` ahora soporta la iluminación desde diferentes ángulos cuando el parámetro *shade* es ``True``, que puede ser configurado usando el parámetro ``lightsource``.

source: Shifting errorbars
es_es: Barras de error cambiantes

source: Previously, `~.Axes.errorbar()` accepted a keyword argument *errorevery* such that the command ``plt.errorbar(x, y, yerr, errorevery=6)`` would add error bars to datapoints ``x[::6], y[::6]``.
es_es: Anteriormente, `~.Axes.errorbar()` aceptaba un argumento de palabra clave *errorevery* de forma que el comando ``plt.errorbar(x, y, yerr, errorevery=6)`` añadía barras de error a los puntos de datos ``x[::6], y[::6]``.

source: `~.Axes.errorbar()` now also accepts a tuple for *errorevery* such that ``plt.errorbar(x, y, yerr, errorevery=(start, N))`` adds error bars to points ``x[start::N], y[start::N]``.
es_es: `~.Axes.errorbar()` ahora también acepta una tupla para *errorevery* tal que ``plt.errorbar(x, y, yerr, errorevery=(start, N))`` añade barras de error a los puntos ``x[start::N], y[start::N]``.

source: Improvements in Logit scale ticker and formatter
es_es: Mejoras en el ticker y el formateador de la escala Logit

source: Introduced in version 1.5, the logit scale didn't have an appropriate ticker and formatter. Previously, the location of ticks was not zoom dependent, too many labels were displayed causing overlapping which broke readability, and label formatting did not adapt to precision.
es_es: Introducida en la versión 1.5, la escala logit no tenía un ticker y un formateador adecuados. Anteriormente, la ubicación de los ticks no dependía del zoom, se mostraban demasiadas etiquetas provocando un solapamiento que rompía la legibilidad, y el formato de las etiquetas no se adaptaba a la precisión.

source: Starting from this version, the logit locator has nearly the same behavior as the locator for the log scale or the linear scale, depending on used zoom. The number of ticks is controlled. Some minor labels are displayed adaptively as sublabels in log scale. Formatting is adapted for probabilities and the precision adapts to the scale.
es_es: A partir de esta versión, el localizador logit tiene casi el mismo comportamiento que el localizador para la escala logarítmica o la escala lineal, dependiendo del zoom utilizado. Se controla el número de ticks. Algunas etiquetas menores se muestran de forma adaptativa como sub-etiquetas en la escala logarítmica. El formato se adapta a las probabilidades y la precisión se adapta a la escala.

source: rcParams for axes title location and color
es_es: rcParams para la ubicación y el color del título de los ejes

source: Two new rcParams have been added: :rc:`axes.titlelocation` denotes the default axes title alignment, and :rc:`axes.titlecolor` the default axes title color.
es_es: Se han añadido dos nuevos rcParams: :rc:`axes.titlelocation` denota la alineación por defecto del título de los ejes, y :rc:`axes.titlecolor` el color por defecto del título de los ejes.

source: Valid values for ``axes.titlelocation`` are: left, center, and right. Valid values for ``axes.titlecolor`` are: auto or a color. Setting it to auto will fall back to previous behaviour, which is using the color in ``text.color``.
es_es: Los valores válidos para ``axes.titlelocation`` son: izquierda, centro y derecha. Los valores válidos para ``axes.titlecolor`` son: auto o un color. Si se establece como auto, se volverá al comportamiento anterior, que es utilizar el color de ``text.color``.

source: 3-digit and 4-digit hex colors
es_es: Colores hexadecimales de 3 y 4 dígitos

source: Colors can now be specified using 3-digit or 4-digit hex colors, shorthand for the colors obtained by duplicating each character, e.g. ``#123`` is equivalent to ``#112233`` and ``#123a`` is equivalent to ``#112233aa``.
es_es: Los colores se pueden especificar ahora utilizando colores hexadecimales de 3 o 4 dígitos, abreviatura de los colores que se obtienen duplicando cada carácter, por ejemplo, ``#123`` equivale a ``#112233`` y ``#123a`` equivale a ``#112233aa``.

source: Added support for RGB(A) images in pcolorfast
es_es: Se ha añadido soporte para imágenes RGB(A) en pcolorfast

source: `.Axes.pcolorfast` now accepts 3D images (RGB or RGBA) arrays.
es_es: `.Axes.pcolorfast` ahora acepta matrices de imágenes de arreglos 3D (RGB o RGBA).
