Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_1.1.po
Languages: es_es

source: What's new in Matplotlib 1.1 (Nov 02, 2011)
es_es: Novedades en Matplotlib 1.1 (02 de noviembre de 2011)

source: Table of Contents
es_es: Tabla de Contenidos

source: matplotlib 1.1 supports Python 2.4 to 2.7
es_es: matplotlib 1.1 soporta Python 2.4, y 2.7

source: Sankey Diagrams
es_es: Diagramas Sankey

source: Kevin Davies has extended Yannick Copin's original Sankey example into a module (:mod:`~matplotlib.sankey`) and provided new examples (:doc:`/gallery/specialty_plots/sankey_basics`, :doc:`/gallery/specialty_plots/sankey_links`, :doc:`/gallery/specialty_plots/sankey_rankine`).
es_es: Kevin Davies ha ampliado el ejemplo original de Sankey de Yannick Copin en un módulo (:mod:`~matplotlib.sankey`) y ha proporcionado nuevos ejemplos (:doc:`/gallery/specialty_plots/sankey_basics`, :doc:`/gallery/specialty_plots/sankey_links`, :doc:`/gallery/specialty_plots/sankey_rankine`).

source: Animation
es_es: Animación

source: Ryan May has written a backend-independent framework for creating animated figures. The :mod:`~matplotlib.animation` module is intended to replace the backend-specific examples formerly in the :ref:`examples-index` listings. Examples using the new framework are in :ref:`animation-examples-index`; see the entrancing :file:`double pendulum <gallery/animation/double_pendulum_sgskip.py>` which uses :meth:`matplotlib.animation.Animation.save` to create the movie below.
es_es: Ryan May ha escrito un marco de trabajo independiente de los soportes para crear figuras animadas. El módulo :mod:`~matplotlib.animation` está pensado para reemplazar los ejemplos específicos de backend que antes estaban en los listados de :ref:`examples-index`. Los ejemplos que utilizan el nuevo marco de trabajo están en :ref:`animation-examples-index`; vea el fascinante :file:`double pendulum <gallery/animation/double_pendulum_sgskip.py>` que utiliza :meth:`matplotlib.animation.Animation.save` para crear la película que se muestra a continuación.

source: This should be considered as a beta release of the framework; please try it and provide feedback.
es_es: Esto debe ser considerado como una versión beta del framework; por favor, pruébalo y danos tu opinión.

source: Tight Layout
es_es: Diseño ajustado

source: A frequent issue raised by users of matplotlib is the lack of a layout engine to nicely space out elements of the plots. While matplotlib still adheres to the philosophy of giving users complete control over the placement of plot elements, Jae-Joon Lee created the :mod:`~matplotlib.tight_layout` module and introduced a new command :func:`~matplotlib.pyplot.tight_layout` to address the most common layout issues.
es_es: Un problema frecuente planteado por los usuarios de matplotlib es la falta de un motor de diseño para espaciar bien los elementos de los gráficos. Aunque matplotlib todavía se adhiere a la filosofía de dar a los usuarios un control completo sobre la colocación de los elementos del gráfico, Jae-Joon Lee creó el módulo :mod:`~matplotlib.tight_layout` e introdujo un nuevo comando :func:`~matplotlib.pyplot.tight_layout` para abordar los problemas de diseño más comunes.

source: The usage of this functionality can be as simple as ::
es_es: El uso de esta funcionalidad puede ser tan simple como::

source: and it will adjust the spacing between subplots so that the axis labels do not overlap with neighboring subplots. A :doc:`/tutorials/intermediate/tight_layout_guide` has been created to show how to use this new tool.
es_es: y ajustará el espacio entre los subplots para que las etiquetas de los ejes no se solapen con los subplots vecinos. Se ha creado un :doc:`/tutorials/intermediate/tight_layout_guide` para mostrar cómo utilizar esta nueva herramienta.

source: PyQT4, PySide, and IPython
es_es: PyQT4, PySide, y IPython

source: Gerald Storer made the Qt4 backend compatible with PySide as well as PyQT4. At present, however, PySide does not support the PyOS_InputHook mechanism for handling gui events while waiting for text input, so it cannot be used with the new version 0.11 of `IPython <http://ipython.org>`__. Until this feature appears in PySide, IPython users should use the PyQT4 wrapper for QT4, which remains the matplotlib default.
es_es: Gerald Storer ha hecho que el backend de Qt4 sea compatible con PySide y con PyQT4. Sin embargo, en la actualidad, PySide no soporta el mecanismo PyOS_InputHook para el manejo de eventos IGU mientras se espera la entrada de texto, por lo que no se puede utilizar con la nueva versión 0.11 de `IPython <http://ipython.org>`__. Hasta que esta característica aparezca en PySide, los usuarios de IPython deberían utilizar el wrapper de PyQT4 para QT4, que sigue siendo el predeterminado de matplotlib.

source: An rcParam entry, "backend.qt4", has been added to allow users to select PyQt4, PyQt4v2, or PySide. The latter two use the Version 2 Qt API. In most cases, users can ignore this rcParam variable; it is available to aid in testing, and to provide control for users who are embedding matplotlib in a PyQt4 or PySide app.
es_es: Se ha añadido una entrada rcParam, "backend.qt4", para permitir a los usuarios seleccionar PyQt4, PyQt4v2, o PySide. Estos dos últimos utilizan la versión 2 de la API de Qt. En la mayoría de los casos, los usuarios pueden ignorar esta variable rcParam; está disponible para ayudar en las pruebas, y para proporcionar control a los usuarios que están incrustando matplotlib en una aplicación PyQt4 o PySide.

source: Legend
es_es: Leyenda

source: Jae-Joon Lee has improved plot legends. First, legends for complex plots such as :meth:`~matplotlib.pyplot.stem` plots will now display correctly. Second, the 'best' placement of a legend has been improved in the presence of NANs.
es_es: Jae-Joon Lee ha mejorado las leyendas de los gráficos. En primer lugar, las leyendas de los gráficos complejos, como los gráficos :meth:`~matplotlib.pyplot.stem` ahora se mostrarán correctamente. En segundo lugar, se ha mejorado la "mejor" colocación de una leyenda en presencia de NANs.

source: See the :doc:`/tutorials/intermediate/legend_guide` for more detailed explanation and examples.
es_es: Ver el :doc:`/tutorials/intermediate/legend_guide` para una explicación más detallada y ejemplos.

source: In continuing the efforts to make 3D plotting in matplotlib just as easy as 2D plotting, Ben Root has made several improvements to the :mod:`~mpl_toolkits.mplot3d` module.
es_es: Continuando con los esfuerzos para hacer que el trazado en 3D en matplotlib sea tan fácil como el trazado en 2D, Ben Root ha realizado varias mejoras en el módulo :mod:`~mpl_toolkits.mplot3d`.

source: :class:`~mpl_toolkits.mplot3d.axes3d.Axes3D` has been improved to bring the class towards feature-parity with regular Axes objects
es_es: :class:`~mpl_toolkits.mplot3d.axes3d.Axes3D` ha sido mejorada para acercar la clase a la paridad de características con los objetos Axes normales

source: Documentation for :doc:`/tutorials/toolkits/mplot3d` was significantly expanded
es_es: Se ha ampliado significativamente la documentación de :doc:`/tutorials/toolkits/mplot3d`

source: Axis labels and orientation improved
es_es: Se han mejorado las etiquetas y la orientación de los ejes

source: Most 3D plotting functions now support empty inputs
es_es: La mayoría de las funciones de trazado 3D ahora admiten entradas vacías

source: Ticker offset display added:
es_es: Se ha añadido la visualización del desplazamiento del ticker:

source: :meth:`~mpl_toolkits.mplot3d.axes3d.Axes3D.contourf` gains *zdir* and *offset* kwargs. You can now do this:
es_es: :meth:`~mpl_toolkits.mplot3d.axes3d.Axes3D.contourf` gana los kwargs *zdir* y *offset*. Ahora se puede hacer esto:

source: Numerix support removed
es_es: Eliminado el soporte de Numerix

source: After more than two years of deprecation warnings, Numerix support has now been completely removed from matplotlib.
es_es: Después de más de dos años de advertencias de desaprobación, el soporte de Numerix ha sido eliminado completamente de matplotlib.

source: Markers
es_es: Marcadores

source: The list of available markers for :meth:`~matplotlib.pyplot.plot` and :meth:`~matplotlib.pyplot.scatter` has now been merged. While they were mostly similar, some markers existed for one function, but not the other. This merge did result in a conflict for the 'd' diamond marker. Now, 'd' will be interpreted to always mean "thin" diamond while 'D' will mean "regular" diamond.
es_es: La lista de marcadores disponibles para :meth:`~matplotlib.pyplot.plot` y :meth:`~matplotlib.pyplot.scatter` se ha fusionado. Aunque la mayoría eran similares, algunos marcadores existían para una función, pero no para la otra. Esta fusión dio lugar a un conflicto para el marcador de diamante 'd'. Ahora, 'd' se interpretará siempre como diamante "fino", mientras que 'D' significará diamante "normal".

source: Thanks to Michael Droettboom for this effort.
es_es: Gracias a Michael Droettboom por este esfuerzo.

source: Other improvements
es_es: Otras mejoras

source: Unit support for polar axes and :func:`~matplotlib.axes.Axes.arrow`
es_es: Soporte unitario para ejes polares y :func:`~matplotlib.axes.Axes.arrow`

source: :class:`~matplotlib.projections.polar.PolarAxes` gains getters and setters for "theta_direction", and "theta_offset" to allow for theta to go in either the clock-wise or counter-clockwise direction and to specify where zero degrees should be placed. :meth:`~matplotlib.projections.polar.PolarAxes.set_theta_zero_location` is an added convenience function.
es_es: :class:`~matplotlib.projections.polar.PolarAxes` gana getters y setters para "theta_direction", y "theta_offset" para permitir que theta vaya en el sentido de las agujas del reloj o en sentido contrario y para especificar dónde se deben colocar los cero grados. :meth:`~matplotlib.projections.polar.PolarAxes.set_theta_zero_location` es una función de conveniencia añadida.

source: Fixed error in argument handling for tri-functions such as :meth:`~matplotlib.pyplot.tripcolor`
es_es: Se ha arreglado un error en el manejo de los argumentos de las trifunciones como :meth:`~matplotlib.pyplot.tripcolor`

source: ``axes.labelweight`` parameter added to rcParams.
es_es: Se ha añadido el parámetro ``axes.labelweight`` a rcParams.

source: For :meth:`~matplotlib.pyplot.imshow`, *interpolation='nearest'* will now always perform an interpolation. A "none" option has been added to indicate no interpolation at all.
es_es: Para :meth:`~matplotlib.pyplot.imshow`, *interpolation='nearest'* ahora siempre realizará una interpolación. Se ha añadido una opción "none" para indicar que no se realice ninguna interpolación.

source: An error in the Hammer projection has been fixed.
es_es: Se ha arreglado un error en la proyección Hammer.

source: *clabel* for :meth:`~matplotlib.pyplot.contour` now accepts a callable. Thanks to Daniel Hyams for the original patch.
es_es: *clabel* para :meth:`~matplotlib.pyplot.contour` ahora acepta una llamada. Gracias a Daniel Hyams por el parche original.

source: Jae-Joon Lee added the `~mpl_toolkits.axes_grid1.axes_divider.HBoxDivider` and `~mpl_toolkits.axes_grid1.axes_divider.VBoxDivider` classes.
es_es: Jae-Joon Lee ha añadido las clases `~mpl_toolkits.axes_grid1.axes_divider.HBoxDivider` y `~mpl_toolkits.axes_grid1.axes_divider.VBoxDivider`.

source: Christoph Gohlke reduced memory usage in :meth:`~matplotlib.pyplot.imshow`.
es_es: Christoph Gohlke ha reducido el uso de memoria en :meth:`~matplotlib.pyplot.imshow`.

source: :meth:`~matplotlib.pyplot.scatter` now accepts empty inputs.
es_es: :meth:`~matplotlib.pyplot.scatter` ahora acepta entradas vacías.

source: The behavior for 'symlog' scale has been fixed, but this may result in some minor changes to existing plots. This work was refined by ssyr.
es_es: Se ha arreglado el comportamiento de la escala 'symlog', pero esto puede dar lugar a algunos cambios menores en los gráficos existentes. Este trabajo fue perfeccionado por ssyr.

source: Peter Butterworth added named figure support to :func:`~matplotlib.pyplot.figure`.
es_es: Peter Butterworth ha añadido soporte para figuras con nombre a :func:`~matplotlib.pyplot.figure`.

source: Michiel de Hoon has modified the MacOSX backend to make its interactive behavior consistent with the other backends.
es_es: Michiel de Hoon ha modificado el backend de MacOSX para que su comportamiento interactivo sea consistente con los otros backends.

source: Pim Schellart added a new colormap called "cubehelix". Sameer Grover also added a colormap called "coolwarm". See it and all other colormaps :ref:`here <color-colormaps_reference>`.
es_es: Pim Schellart ha añadido un nuevo mapa de colores llamado "cubehelix". Sameer Grover también ha añadido un mapa de colores llamado "coolwarm". Véalo y todos los demás mapas de colores :ref:`aquí <color-colormaps_reference>`.

source: Many bug fixes and documentation improvements.
es_es: Se han arreglado muchos errores y se ha mejorado la documentación.
