Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_2.1.0.po
Languages: es_es

source: ``streamplot`` streamline generation more configurable
es_es: Generación de streamline ``streamplot`` más configurable

source: The starting point, direction, and length of the stream lines can now be configured. This allows to follow the vector field for a longer time and can enhance the visibility of the flow pattern in some use cases.
es_es: Ahora se puede configurar el punto de partida, la dirección y la longitud de las líneas de flujo. Esto permite seguir el campo vectorial durante más tiempo y puede mejorar la visibilidad del patrón de flujo en algunos casos de uso.

source: ``Axis.set_tick_params`` now responds to *rotation*
es_es: ``Axis.set_tick_params`` ahora responde a *rotation*

source: Bulk setting of tick label rotation is now possible via :func:`~matplotlib.axes.Axes.tick_params` using the *rotation* keyword.
es_es: El ajuste masivo de la rotación de las etiquetas de marca de eje es ahora posible a través de :func:`~matplotlib.axes.Axes.tick_params` utilizando la palabra clave *rotation*.

source: Ticklabels are turned off instead of being invisible
es_es: Etiqueta de la marca del eje se desactivan en lugar de ser invisibles

source: Internally, the `.Tick`'s ``matplotlib.axis.Tick.label1On`` attribute is now used to hide tick labels instead of setting the visibility on the tick label objects. This improves overall performance and fixes some issues. As a consequence, in case those labels ought to be shown, :func:`~matplotlib.axes.Axes.tick_params` needs to be used, e.g.
es_es: Internamente, el atributo ``matplotlib.axis.Tick.label1On`` de `.Tick` se utiliza ahora para ocultar las etiquetas de las marcas del eje en lugar de establecer la visibilidad en los objetos de etiquetas de las marcas de eje. Esto mejora el rendimiento general y soluciona algunas inidencias. Como consecuencia, en caso de que esas etiquetas deban mostrarse, es necesario utilizar :func:`~matplotlib.axes.Axes.tick_params`, por ejemplo.

source: Shading in 3D bar plots
es_es: Sombreado en gráficos de barras 3D

source: A new ``shade`` parameter has been added the 3D `~mpl_toolkits.mplot3d.axes3d.Axes3D.bar` plotting method. The default behavior remains to shade the bars, but now users have the option of setting ``shade`` to ``False``.
es_es: Se ha añadido un nuevo parámetro ``shade`` al método de trazado 3D `~mpl_toolkits.mplot3d.axes3d.Axes3D.bar`. El comportamiento por defecto sigue siendo sombrear las barras, pero ahora los usuarios tienen la opción de establecer ``shade`` a ``False``.

source: (`Source code <../../users/prev_whats_new/whats_new_2-1-0-4.py>`__, `png <../../users/prev_whats_new/whats_new_2-1-0-4.png>`__, `pdf <../../users/prev_whats_new/whats_new_2-1-0-4.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_2-1-0-4.py>`__, `png <../../users/prev_whats_new/whats_new_2-1-0-4.png>`__, `pdf <../../users/prev_whats_new/whats_new_2-1-0-4.pdf>`__)

source: New ``which`` Parameter for ``autofmt_xdate``
es_es: Nuevo parámetro ``which`` para ``autofmt_xdate``

source: A ``which`` parameter now exists for the method :func:`~matplotlib.figure.Figure.autofmt_xdate`. This allows a user to format ``major``, ``minor`` or ``both`` tick labels selectively. The default behavior will rotate and align the ``major`` tick labels.
es_es: Ahora existe un parámetro ``que`` para el método :func:`~matplotlib.figure.Figure.autofmt_xdate`. Esto permite al usuario formatear selectivamente las etiquetas de las marcas ``major``, ``minor`` o ``both``. El comportamiento por defecto girará y alineará las etiquetas de marca ``major``.

source: New Figure Parameter for ``subplot2grid``
es_es: Nuevo parámetro de figura para ``subplot2grid``

source: A ``fig`` parameter now exists for the function :func:`~matplotlib.pyplot.subplot2grid`. This allows a user to specify the figure where the subplots will be created. If ``fig`` is ``None`` (default) then the method will use the current figure retrieved by :func:`~matplotlib.pyplot.gcf`.
es_es: Ahora existe un parámetro ``fig`` para la función :func:`~matplotlib.pyplot.subplot2grid`. Esto permite al usuario especificar la figura donde se crearán los subgráficos. Si ``fig`` es ``None`` (por defecto) entonces el método utilizará la figura actual recuperada por :func:`~matplotlib.pyplot.gcf`.

source: Interpolation in ``fill_betweenx``
es_es: Interpolación en ``fill_betweenx``

source: The ``interpolate`` parameter now exists for the method :func:`~matplotlib.axes.Axes.fill_betweenx`. This allows a user to interpolate the data and fill the areas in the crossover points, similarly to :func:`~matplotlib.axes.Axes.fill_between`.
es_es: El parámetro ``interpolate`` existe ahora para el método :func:`~matplotlib.axes.Axes.fill_betweenx`. Esto permite al usuario interpolar los datos y rellenar las áreas en los puntos de cruce, de forma similar a :func:`~matplotlib.axes.Axes.fill_between`.

source: New keyword argument ``sep`` for EngFormatter
es_es: Nuevo argumento de palabra clave ``sep`` para EngFormatter

source: A new ``sep`` keyword argument has been added to :class:`~matplotlib.ticker.EngFormatter` and provides a means to define the string that will be used between the value and its unit. The default string is ``" "``, which preserves the former behavior. Additionally, the separator is now present between the value and its unit even in the absence of SI prefix. There was formerly a bug that was causing strings like ``"3.14V"`` to be returned instead of the expected ``"3.14 V"`` (with the default behavior).
es_es: Se ha añadido un nuevo argumento de palabra clave ``sep`` a :class:`~matplotlib.ticker.EngFormatter` y proporciona un medio para definir la cadena que se utilizará entre el valor y su unidad. La cadena por defecto es ``" "``, que conserva el comportamiento anterior. Además, el separador está ahora presente entre el valor y su unidad incluso en ausencia del prefijo SI. Antes había un error que hacía que se devolvieran cadenas como ``"3,14V"`` en lugar de la esperada ``"3,14 V"`` (con el comportamiento por defecto).

source: Extend ``MATPLOTLIBRC`` behavior
es_es: Ampliar el comportamiento de ``MATPLOTLIBRC``

source: The environmental variable can now specify the full file path or the path to a directory containing a :file:`matplotlibrc` file.
es_es: La variable de entorno puede ahora especificar la ruta completa del archivo o la ruta de un directorio que contenga un archivo :file:`matplotlibrc`.

source: ``density`` kwarg to hist
es_es: ``density`` kwarg a hist

source: The :meth:`~matplotlib.axes.Axes.hist` method now prefers ``density`` to ``normed`` to control if the histogram should be normalized, following a change upstream to NumPy. This will reduce confusion as the behavior has always been that the integral of the histogram is 1 (rather than sum or maximum value).
es_es: El método :meth:`~matplotlib.axes.Axes.hist` ahora prefiere ``density`` a ``normed`` para controlar si el histograma debe ser normalizado, siguiendo un cambio en NumPy. Esto reducirá la confusión, ya que el comportamiento siempre ha sido que la integral del histograma es 1 (en lugar de la suma o el valor máximo).

source: Internals
es_es: Interiores

source: New TransformedPatchPath caching object
es_es: Nuevo objeto de caché TransformedPatchPath

source: A newly added :class:`~matplotlib.transforms.TransformedPatchPath` provides a means to transform a :class:`~matplotlib.patches.Patch` into a :class:`~matplotlib.path.Path` via a :class:`~matplotlib.transforms.Transform` while caching the resulting path. If neither the patch nor the transform have changed, a cached copy of the path is returned.
es_es: La nueva clase :class:`~matplotlib.transforms.TransformedPatchPath` proporciona un medio para transformar un :class:`~matplotlib.patches.Patch` en un :class:`~matplotlib.path.Path` a través de un :class:`~matplotlib.transforms.Transform` mientras se almacena en caché la ruta resultante. Si ni el parche ni la transformación han cambiado, se devuelve una copia en caché de la ruta.

source: This class differs from the older :class:`~matplotlib.transforms.TransformedPath` in that it is able to refresh itself based on the underlying patch while the older class uses an immutable path.
es_es: Esta clase difiere de la anterior :class:`~matplotlib.transforms.TransformedPath` en que es capaz de refrescarse a sí misma basándose en el parche subyacente mientras que la clase anterior utiliza una ruta inmutable.

source: Abstract base class for movie writers
es_es: Clase base abstracta para escritores de películas

source: The new :class:`~matplotlib.animation.AbstractMovieWriter` class defines the API required by a class that is to be used as the ``writer`` in the :meth:`matplotlib.animation.Animation.save` method. The existing :class:`~matplotlib.animation.MovieWriter` class now derives from the new abstract base class.
es_es: La nueva clase :class:`~matplotlib.animation.AbstractMovieWriter` define la API requerida por una clase que va a ser utilizada como ``writer`` en el método :meth:`matplotlib.animation.Animation.save`. La clase :class:`~matplotlib.animation.MovieWriter` existente deriva ahora de la nueva clase base abstracta.

source: Stricter validation of line style rcParams
es_es: Validación más estricta del estilo de línea rcParams

source: The validation of rcParams that are related to line styles (``lines.linestyle``, ``boxplot.*.linestyle``, ``grid.linestyle`` and ``contour.negative_linestyle``) now effectively checks that the values are valid line styles. Strings like ``'dashed'`` or ``'--'`` are accepted, as well as even-length sequences of on-off ink like ``[1, 1.65]``. In this latter case, the offset value is handled internally and should *not* be provided by the user.
es_es: La validación de los rcParams relacionados con los estilos de línea (``lines.linestyle``, ``boxplot.*.linestyle``, ``grid.linestyle`` y ``contour.negative_linestyle``) ahora comprueba efectivamente que los valores son estilos de línea válidos. Se aceptan cadenas como ``'dashed'`` o ``'--'``, así como secuencias de longitud par de tinta on-off como ``[1, 1.65]``. En este último caso, el valor del desplazamiento se maneja internamente y *no* debe ser proporcionado por el usuario.

source: The new validation scheme replaces the former one used for the ``contour.negative_linestyle`` rcParams, that was limited to ``'solid'`` and ``'dashed'`` line styles.
es_es: El nuevo esquema de validación sustituye al anterior utilizado para los rcParams ``contour.negative_linestyle``, que se limitaba a los estilos de línea ``'solid'`` y ``'dashed'``.

source: The validation is case-insensitive. The following are now valid:
es_es: La validación no distingue entre mayúsculas y minúsculas. Ahora son válidos los siguientes:

source: The automated tests have been switched from nose_ to pytest_.
es_es: Las pruebas automatizadas se han cambiado de nose_ a pytest_.

source: Performance
es_es: Rendimiento

source: Path simplification updates
es_es: Actualizaciones de la simplificación de rutas

source: Line simplification controlled by the ``path.simplify`` and ``path.simplify_threshold`` parameters has been improved. You should notice better rendering performance when plotting large amounts of data (as long as the above parameters are set accordingly). Only the line segment portion of paths will be simplified -- if you are also drawing markers and experiencing problems with rendering speed, you should consider using the ``markevery`` option to `~matplotlib.axes.Axes.plot`. See the :ref:`performance` section in the usage tutorial for more information.
es_es: Se ha mejorado la simplificación de líneas controlada por los parámetros ``path.simplify`` y ``path.simplify_threshold``. Deberías notar un mejor rendimiento de renderizado al graficar grandes cantidades de datos (siempre y cuando los parámetros anteriores estén configurados adecuadamente). Sólo se simplificará la parte de los segmentos de línea de los trazados -- si también se dibujan marcadores y se experimentan problemas con la velocidad de renderizado, se debe considerar el uso de la opción ``markevery`` de `~matplotlib.axes.Axes.plot`. Ver la sección :ref:`performance` en el tutorial de uso para más información.

source: The simplification works by iteratively merging line segments into a single vector until the next line segment's perpendicular distance to the vector (measured in display-coordinate space) is greater than the ``path.simplify_threshold`` parameter. Thus, higher values of ``path.simplify_threshold`` result in quicker rendering times. If you are plotting just to explore data and not for publication quality, pixel perfect plots, then a value of ``1.0`` can be safely used. If you want to make sure your plot reflects your data *exactly*, then you should set ``path.simplify`` to false and/or ``path.simplify_threshold`` to ``0``. Matplotlib currently defaults to a conservative value of ``1/9``, smaller values are unlikely to cause any visible differences in your plots.
es_es: La simplificación funciona fusionando iterativamente los segmentos de línea en un único vector hasta que la distancia perpendicular del siguiente segmento de línea al vector (medida en el espacio de coordenadas de la pantalla) sea mayor que el parámetro ``path.simplify_threshold``. Por lo tanto, los valores más altos de ``path.simplify_threshold`` dan lugar a tiempos de renderizado más rápidos. Si usted está trazando sólo para explorar los datos y no para la calidad de la publicación, gráficos perfectos de píxeles, entonces un valor de ``1.0`` puede ser utilizado con seguridad. Si deseas asegurarte de que tu gráfico refleja tus datos *exactamente*, entonces debes establecer ``path.simplify`` a false y/o ``path.simplify_threshold`` a ``0``. Matplotlib actualmente tiene por defecto un valor conservador de ``1/9``, valores más pequeños es poco probable que causen diferencias visibles en sus gráficos.

source: Implement intersects_bbox in c++
es_es: Implementar intersects_bbox en c++

source: :meth:`~matplotlib.path.Path.intersects_bbox` has been implemented in c++ which improves the performance of automatically placing the legend.
es_es: :meth:`~matplotlib.path.Path.intersects_bbox` ha sido implementado en c++ lo que mejora el rendimiento de la colocación automática de la leyenda.
