Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_1.3.po
Languages: es_es

source: matplotlib 1.3 includes an entirely rewritten setup script. We now ship fewer dependencies with the tarballs and installers themselves. Notably, pytz_, dateutil_, pyparsing_ and six_ are no longer included with matplotlib. You can either install them manually first, or let pip_ install them as dependencies along with matplotlib. It is now possible to not include certain subcomponents, such as the unit test data, in the install. See :file:`setup.cfg.template` for more information.
es_es: matplotlib 1.3 incluye un script de instalación completamente reescrito. Ahora enviamos menos dependencias con los tarballs y los propios instaladores. En particular, pytz_, dateutil_, pyparsing_ y six_ ya no se incluyen con matplotlib. Puede instalarlos manualmente primero, o dejar que pip_ los instale como dependencias junto con matplotlib. Ahora es posible no incluir ciertos subcomponentes, como los datos de pruebas unitarias, en la instalación. Ver :file:`setup.cfg.template` para más información.

source: XDG base directory support
es_es: Soporte para directorio base XDG

source: On Linux, matplotlib now uses the `XDG base directory specification <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>`_ to find the :file:`matplotlibrc` configuration file. :file:`matplotlibrc` should now be kept in :file:`~/.config/matplotlib`, rather than :file:`~/.matplotlib`. If your configuration is found in the old location, it will still be used, but a warning will be displayed.
es_es: En Linux, matplotlib ahora utiliza la especificación del directorio base `XDG <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>`_ para encontrar el archivo de configuración :file:`matplotlibrc`. :file:`matplotlibrc` ahora debe mantenerse en :file:`~/.config/matplotlib`, en lugar de :file:`~/.matplotlib`. Si su configuración se encuentra en la antigua ubicación, se seguirá utilizando, pero se mostrará una advertencia.

source: Catch opening too many figures using pyplot
es_es: Captura abriendo demasiadas figuras usando pyplot

source: Figures created through `.pyplot.figure` are retained until they are explicitly closed. It is therefore common for new users of matplotlib to run out of memory when creating a large series of figures in a loop without closing them.
es_es: Las figuras creadas a través de `.pyplot.figure` se conservan hasta que se cierran explícitamente. Por lo tanto, es común que los nuevos usuarios de matplotlib se queden sin memoria al crear una gran serie de figuras en un bucle sin cerrarlas.

source: matplotlib will now display a `RuntimeWarning` when too many figures have been opened at once. By default, this is displayed for 20 or more figures, but the exact number may be controlled using the ``figure.max_open_warning`` rcParam.
es_es: matplotlib mostrará ahora un `RuntimeWarning` cuando se hayan abierto demasiadas figuras a la vez. Por defecto, esto se muestra para 20 o más figuras, pero el número exacto puede ser controlado usando el ``figure.max_open_warning`` rcParam.
