Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_3.5.0.po
Languages: es_es

source: The `~.widgets.EllipseSelector`, `~.widgets.RectangleSelector` and `~.widgets.SpanSelector` selectors have a new keyword argument, *ignore_event_outside*, which when set to `True` will ignore events outside of the current selection. The handles or the new dragging functionality can instead be used to change the selection.
es_es: Los selectores `~.widgets.EllipseSelector`, `~.widgets.RectangleSelector` y `~.widgets.SpanSelector` tienen un nuevo argumento de palabra clave, *ignore_event_outside*, que cuando se establece como `True` ignorará los eventos fuera de la selección actual. En su lugar se pueden utilizar los tiradores o la nueva funcionalidad de arrastre para cambiar la selección.

source: ``CallbackRegistry`` objects gain a method to temporarily block signals
es_es: Los objetos ``CallbackRegistry`` ganan un método para bloquear temporalmente las señales

source: The context manager `~matplotlib.cbook.CallbackRegistry.blocked` can be used to block callback signals from being processed by the ``CallbackRegistry``. The optional keyword, *signal*, can be used to block a specific signal from being processed and let all other signals pass.
es_es: El gestor de contexto `~matplotlib.cbook.CallbackRegistry.blocked` se puede utilizar para bloquear las señales de devolución de llamada para que no sean procesadas por el ``CallbackRegistry``. La palabra clave opcional, *señal*, se puede utilizar para bloquear una señal específica para que no sea procesada y dejar pasar todas las demás señales.

source: Directional sizing cursors
es_es: Cursores de tamaño direccional

source: Canvases now support setting directional sizing cursors, i.e., horizontal and vertical double arrows. These are used in e.g., selector widgets. Try the :doc:`/gallery/widgets/mouse_cursor` example to see the cursor in your desired backend.
es_es: Los lienzos ahora soportan la configuración de cursores de tamaño direccional, es decir, flechas dobles horizontales y verticales. Se utilizan, por ejemplo, en los widgets de selección. Pruebe el ejemplo de :doc:`/gallery/widgets/mouse_cursor` para ver el cursor en su backend deseado.

source: Sphinx extensions
es_es: Extensiones de Sphinx

source: More configuration of ``mathmpl`` sphinx extension
es_es: Más configuración de la extensión ``mathmpl`` de sphinx

source: The `matplotlib.sphinxext.mathmpl` sphinx extension supports two new configuration options that may be specified in your ``conf.py``:
es_es: La extensión sphinx `matplotlib.sphinxext.mathmpl` soporta dos nuevas opciones de configuración que pueden ser especificadas en su ``conf.py``:

source: ``mathmpl_fontsize`` (float), which sets the font size of the math text in points;
es_es: ``mathmpl_fontsize`` (float), que establece el tamaño de la fuente del texto matemático en puntos;

source: ``mathmpl_srcset`` (list of str), which provides a list of sizes to support `responsive resolution images <https://developer.mozilla.org/en-US/docs/Learn/HTML/Multimedia_and_embedding/Responsive_images>`__ The list should contain additional x-descriptors (``'1.5x'``, ``'2x'``, etc.) to generate (1x is the default and always included.)
es_es: ``mathmpl_srcset`` (lista de str), que proporciona una lista de tamaños para soportar las `imágenes de resolución adaptativa <https://developer.mozilla.org/en-US/docs/Learn/HTML/Multimedia_and_embedding/Responsive_images>`__ La lista debe contener descriptores x adicionales (``'1.5x``, ``'2x``, etc.) para generar (1x es el valor por defecto y siempre se incluye)

source: Backend-specific improvements
es_es: Mejoras específicas del backend

source: GTK backend
es_es: Backend GTK

source: A backend supporting GTK4_ has been added. Both Agg and Cairo renderers are supported. The GTK4 backends may be selected as GTK4Agg or GTK4Cairo.
es_es: Se ha añadido un backend compatible con GTK4_. Se soportan los renderizadores Agg y Cairo. Los backends GTK4 pueden ser seleccionados como GTK4Agg o GTK4Cairo.

source: Qt backends
es_es: Backends de Qt

source: Support for Qt6 (using either PyQt6_ or PySide6_) has been added, with either the Agg or Cairo renderers. Simultaneously, support for Qt4 has been dropped. Both Qt6 and Qt5 are supported by a combined backend (QtAgg or QtCairo), and the loaded version is determined by modules already imported, the :envvar:`QT_API` environment variable, and available packages. See :ref:`QT_API-usage` for details. The versioned Qt5 backend names (Qt5Agg or Qt5Cairo) remain supported for backwards compatibility.
es_es: Se ha añadido soporte para Qt6 (usando PyQt6_ o PySide6_), con los renderizadores Agg o Cairo. Simultáneamente, se ha eliminado el soporte para Qt4. Tanto Qt6 como Qt5 están soportados por un backend combinado (QtAgg o QtCairo), y la versión cargada está determinada por los módulos ya importados, la variable de entorno :envvar:`QT_API`, y los paquetes disponibles. Ver :ref:`QT_API-usage` para más detalles. Los nombres de backend Qt5 versionados (Qt5Agg o Qt5Cairo) siguen siendo soportados por compatibilidad con versiones anteriores.

source: HiDPI support in Cairo-based, GTK, and Tk backends
es_es: Soporte HiDPI en los backends basados en Cairo, GTK y Tk

source: The GTK3 backends now support HiDPI fully, including mixed monitor cases (on Wayland only). The newly added GTK4 backends also support HiDPI.
es_es: Los backends GTK3 ahora soportan HiDPI completamente, incluyendo casos de monitores mixtos (sólo en Wayland). Los nuevos backends GTK4 también soportan HiDPI.

source: The TkAgg backend now supports HiDPI **on Windows only**, including mixed monitor cases.
es_es: El backend TkAgg ahora soporta HiDPI **sólo en Windows**, incluyendo casos de monitores mixtos.

source: All Cairo-based backends correctly support HiDPI as well as their Agg counterparts did (i.e., if the toolkit supports HiDPI, then the \*Cairo backend will now support it, but not otherwise.)
es_es: Todos los backends basados en Cairo soportan correctamente HiDPI al igual que lo hacían sus homólogos de Agg (es decir, si el kit de herramientas soporta HiDPI, entonces el backend \*Cairo lo soportará ahora, pero no en caso contrario)

source: Qt figure options editor improvements
es_es: Mejoras en el editor de opciones de figuras de Qt

source: The figure options editor in the Qt backend now also supports editing the left and right titles (plus the existing centre title). Editing Axis limits is better supported when using a date converter. The ``symlog`` option is now available in Axis scaling options. All entries with the same label are now shown in the Curves tab.
es_es: El editor de opciones de figuras en el backend de Qt ahora también soporta la edición de los títulos izquierdo y derecho (además del título central existente). La edición de los límites de los ejes está mejor soportada cuando se utiliza un convertidor de fecha. La opción ``symlog`` está ahora disponible en las opciones de escala de los ejes. Todas las entradas con la misma etiqueta se muestran ahora en la pestaña Curvas.

source: WX backends support mouse navigation buttons
es_es: Los backends WX soportan los botones de navegación del ratón

source: The WX backends now support navigating through view states using the mouse forward/backward buttons, as in other backends.
es_es: Los backends WX ahora soportan la navegación a través de los estados de la vista usando los botones de avance/retroceso del ratón, como en otros backends.

source: WebAgg uses asyncio instead of Tornado
es_es: WebAgg utiliza asyncio en lugar de Tornado

source: The WebAgg backend defaults to using `asyncio` over Tornado for timer support. This allows using the WebAgg backend in JupyterLite.
es_es: El backend WebAgg utiliza por defecto `asyncio` en lugar de Tornado para el soporte de temporizadores. Esto permite usar el backend WebAgg en JupyterLite.

source: Version information
es_es: Información de la versión

source: We switched to the `release-branch-semver`_ version scheme of setuptools-scm. This only affects the version information for development builds. Their version number now describes the targeted release, i.e. 3.5.0.dev820+g6768ef8c4c is 820 commits after the previous release and is scheduled to be officially released as 3.5.0 later.
es_es: Cambiamos al esquema de versión `release-branch-semver`_ de setuptools-scm. Esto sólo afecta a la información de la versión para las construcciones de desarrollo. Su número de versión ahora describe la versión prevista, es decir, 3.5.0.dev820+g6768ef8c4c es 820 commits después de la versión anterior y está programado para ser lanzado oficialmente como 3.5.0 más tarde.

source: In addition to the string ``__version__``, there is now a namedtuple ``__version_info__`` as well, which is modelled after `sys.version_info`_. Its primary use is safely comparing version information, e.g. ``if __version_info__ >= (3, 4, 2)``.
es_es: Además de la cadena ``versión__``, ahora hay también una namedtuple ``versión_info__``, que está modelada según ``sys.version_info`_. Su uso principal es la comparación segura de la información de la versión, por ejemplo, ``si __version_info__ >= (3, 4, 2)``.
