Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_1.4.po
Languages: es_es

source: What's new in Matplotlib 1.4 (Aug 25, 2014)
es_es: Novedades en Matplotlib 1.4 (25 de agosto de 2014)

source: Thomas A. Caswell served as the release manager for the 1.4 release.
es_es: Thomas A. Caswell sirvió como gestor de lanzamientos para la versión 1.4.

source: Table of Contents
es_es: Tabla de Contenidos

source: matplotlib 1.4 supports Python 2.6, 2.7, 3.3, and 3.4
es_es: matplotlib 1.4 soporta Python 2.6, 2.7, 3.3 y 3.4

source: New colormap
es_es: Nuevo mapa de colores

source: In heatmaps, a green-to-red spectrum is often used to indicate intensity of activity, but this can be problematic for the red/green colorblind. A new, colorblind-friendly colormap is now available at ``matplotlib.cm.Wistia``. This colormap maintains the red/green symbolism while achieving deuteranopic legibility through brightness variations. See `here <https://github.com/wistia/heatmap-palette>`__ for more information.
es_es: En los mapas de calor, a menudo se utiliza un espectro de verde a rojo para indicar la intensidad de la actividad, pero esto puede ser problemático para los daltónicos rojos/verdes. En ``matplotlib.cm.Wistia`` está disponible un nuevo mapa de colores para daltónicos. Este mapa de colores mantiene el simbolismo rojo/verde al mismo tiempo que logra la legibilidad deuteranópica a través de variaciones de brillo. Consulta ``aquí <https://github.com/wistia/heatmap-palette>`__ para más información.

source: The nbagg backend
es_es: El backend de nbagg

source: Phil Elson added a new backend, named "nbagg", which enables interactive figures in a live IPython notebook session. The backend makes use of the infrastructure developed for the webagg backend, which itself gives standalone server backed interactive figures in the browser, however nbagg does not require a dedicated matplotlib server as all communications are handled through the IPython Comm machinery.
es_es: Phil Elson ha añadido un nuevo backend, llamado "nbagg", que permite activar figuras interactivas en una sesión de cuaderno IPython en vivo. El backend hace uso de la infraestructura desarrollada para el backend webagg, que a su vez da figuras interactivas independientes respaldadas por el servidor en el navegador, sin embargo nbagg no requiere un servidor matplotlib dedicado ya que todas las comunicaciones se manejan a través de la maquinaria IPython Comm.

source: As with other backends nbagg can be enabled inside the IPython notebook with::
es_es: Al igual que con otros backends nbagg puede ser activado dentro del cuaderno IPython con::

source: Once figures are created and then subsequently shown, they will placed in an interactive widget inside the notebook allowing panning and zooming in the same way as any other matplotlib backend. Because figures require a connection to the IPython notebook server for their interactivity, once the notebook is saved, each figure will be rendered as a static image - thus allowing non-interactive viewing of figures on services such as `nbviewer <https://nbviewer.ipython.org/>`__.
es_es: Una vez que las figuras son creadas y posteriormente mostradas, se colocarán en un widget interactivo dentro del cuaderno permitiendo el paneo y el zoom de la misma manera que cualquier otro backend de matplotlib. Dado que las figuras requieren una conexión con el servidor del cuaderno IPython para su interactividad, una vez que se guarda el cuaderno, cada figura se representará como una imagen estática - permitiendo así la visualización no interactiva de las figuras en servicios como `nbviewer <https://nbviewer.ipython.org/>`__.

source: New plotting features
es_es: Nuevas funciones de graficado

source: Power-law normalization
es_es: Normalización de la ley de potencia

source: Ben Gamari added a power-law normalization method, :class:`~matplotlib.colors.PowerNorm`. This class maps a range of values to the interval [0,1] with power-law scaling with the exponent provided by the constructor's *gamma* argument. Power law normalization can be useful for, e.g., emphasizing small populations in a histogram.
es_es: Ben Gamari ha añadido un método de normalización de ley de potencia, :class:`~matplotlib.colors.PowerNorm`. Esta clase asigna un rango de valores al intervalo [0,1] con un escalado de ley de potencia con el exponente proporcionado por el argumento *gamma* del constructor. La normalización de la ley de potencia puede ser útil para, por ejemplo, enfatizar las poblaciones pequeñas en un histograma.

source: Fully customizable boxplots
es_es: Gráficos de caja totalmente personalizables

source: Paul Hobson overhauled the :func:`~matplotlib.pyplot.boxplot` method such that it is now completely customizable in terms of the styles and positions of the individual artists. Under the hood, :func:`~matplotlib.pyplot.boxplot` relies on a new function (:func:`~matplotlib.cbook.boxplot_stats`), which accepts any data structure currently compatible with :func:`~matplotlib.pyplot.boxplot`, and returns a list of dictionaries containing the positions for each element of the boxplots. Then a second method, `~.Axes.bxp` is called to draw the boxplots based on the stats.
es_es: Paul Hobson ha revisado el método :func:`~matplotlib.pyplot.boxplot` de forma que ahora es completamente personalizable en cuanto a los estilos y posiciones de los artists individuales. Bajo el aspecto, :func:`~matplotlib.pyplot.boxplot` se basa en una nueva función (:func:`~matplotlib.cbook.boxplot_stats`), que acepta cualquier estructura de datos actualmente compatible con :func:`~matplotlib.pyplot.boxplot`, y devuelve una lista de diccionarios que contienen las posiciones de cada elemento de los gráficos de caja. Luego se llama a un segundo método, `~.Axes.bxp` para dibujar los gráficos de caja en base a las estadísticas.

source: The :func:`~matplotlib.pyplot.boxplot` function can be used as before to generate boxplots from data in one step. But now the user has the flexibility to generate the statistics independently, or to modify the output of :func:`~matplotlib.cbook.boxplot_stats` prior to plotting with `~.Axes.bxp`.
es_es: La función :func:`~matplotlib.pyplot.boxplot` puede utilizarse como antes para generar gráficos de caja a partir de los datos en un solo paso. Pero ahora el usuario tiene la flexibilidad de generar las estadísticas de forma independiente, o de modificar la salida de :func:`~matplotlib.cbook.boxplot_stats` antes de graficar con `~.Axes.bxp`.

source: Lastly, each artist (e.g., the box, outliers, cap, notches) can now be toggled on or off and their styles can be passed in through individual kwargs. See the examples: :doc:`/gallery/statistics/boxplot` and :doc:`/gallery/statistics/bxp`
es_es: Por último, cada artist (por ejemplo, la caja, los valores atípicos, la tapa, las muescas) puede ahora activarse o desactivarse y sus estilos pueden pasarse a través de kwargs individuales. Vea los ejemplos: :doc:`/gallery/statistics/boxplot` y :doc:`/gallery/statistics/bxp`

source: Added a bool kwarg, :code:`manage_xticks`, which if False disables the management of the ticks and limits on the x-axis by :func:`~matplotlib.axes.Axes.bxp`.
es_es: Se ha añadido un kwarg bool, :code:`manage_xticks`, que si es False desactiva la gestión de los ticks y límites en el eje x por :func:`~matplotlib.axes.Axes.bxp`.

source: Support for datetime axes in 2d plots
es_es: Soporte para los ejes de fecha en los gráficos 2d

source: Andrew Dawson added support for datetime axes to :func:`~matplotlib.pyplot.contour`, :func:`~matplotlib.pyplot.contourf`, :func:`~matplotlib.pyplot.pcolormesh` and :func:`~matplotlib.pyplot.pcolor`.
es_es: Andrew Dawson ha añadido soporte para ejes de fecha a :func:`~matplotlib.pyplot.contour`, :func:`~matplotlib.pyplot.contourf`, :func:`~matplotlib.pyplot.pcolormesh` y :func:`~matplotlib.pyplot.pcolor`.

source: Support for additional spectrum types
es_es: Soporte para tipos de espectro adicionales

source: Todd Jennings added support for new types of frequency spectrum plots: :func:`~matplotlib.pyplot.magnitude_spectrum`, :func:`~matplotlib.pyplot.phase_spectrum`, and :func:`~matplotlib.pyplot.angle_spectrum`, as well as corresponding functions in mlab.
es_es: Todd Jennings ha añadido soporte para nuevos tipos de gráficos de espectro de frecuencias: :func:`~matplotlib.pyplot.magnitude_spectrum`, :func:`~matplotlib.pyplot.phase_spectrum`, y :func:`~matplotlib.pyplot.angle_spectrum`, así como las funciones correspondientes en mlab.

source: He also added these spectrum types to :func:`~matplotlib.pyplot.specgram`, as well as adding support for linear scaling there (in addition to the existing dB scaling). Support for additional spectrum types was also added to :func:`~matplotlib.mlab.specgram`.
es_es: También añadió estos tipos de espectro a :func:`~matplotlib.pyplot.specgram`, además de añadir soporte para el escalado lineal allí (además del escalado en dB existente). También se añadió soporte para tipos de espectro adicionales a :func:`~matplotlib.mlab.specgram`.

source: He also increased the performance for all of these functions and plot types.
es_es: También ha aumentado el rendimiento de todas estas funciones y tipos de graficación.

source: Support for detrending and windowing 2D arrays in mlab
es_es: Soporte para la eliminación de la tendencia y las ventanas de los arreglos 2D en mlab

source: Todd Jennings added support for 2D arrays in the :func:`~matplotlib.mlab.detrend_mean`, :func:`~matplotlib.mlab.detrend_none`, and :func:`~matplotlib.mlab.detrend`, as well as adding ``matplotlib.mlab.apply_window`` which support windowing 2D arrays.
es_es: Todd Jennings ha añadido soporte para arreglos 2D en las funciones :func:`~matplotlib.mlab.detrend_mean`, :func:`~matplotlib.mlab.detrend_none`, y :func:`~matplotlib.mlab.detrend`, así como la adición de ``matplotlib.mlab.apply_window`` que soporta la ventana de arreglos 2D.

source: Support for strides in mlab
es_es: Apoyo a los avances en mlab

source: Todd Jennings added some functions to mlab to make it easier to use NumPy strides to create memory-efficient 2D arrays. This includes ``matplotlib.mlab.stride_repeat``, which repeats an array to create a 2D array, and :func:`~matplotlib.mlab.stride_windows`, which uses a moving window to create a 2D array from a 1D array.
es_es: Todd Jennings ha añadido algunas funciones a mlab para facilitar el uso de strides de NumPy para crear arreglos 2D eficientes en memoria. Esto incluye ``matplotlib.mlab.stride_repeat``, que repite un arreglo para crear un arrelo 2D, y :func:`~matplotlib.mlab.stride_windows`, que utiliza una ventana móvil para crear un arreglo 2D a partir de un arreglo 1D.

source: Formatter for new-style formatting strings
es_es: Formateador para cadenas de formato de nuevo estilo

source: Added `.StrMethodFormatter` which does the same job as `.FormatStrFormatter`, but accepts new-style formatting strings instead of printf-style formatting strings
es_es: Se ha añadido `.StrMethodFormatter` que hace el mismo trabajo que `.FormatStrFormatter`, pero acepta cadenas de formato de estilo nuevo en lugar de cadenas de formato de estilo printf

source: Consistent grid sizes in streamplots
es_es: Tamaños de malla coherentes en los gráficos de flujo

source: :func:`~matplotlib.pyplot.streamplot` uses a base grid size of 30x30 for both ``density=1`` and ``density=(1, 1)``. Previously a grid size of 30x30 was used for ``density=1``, but a grid size of 25x25 was used for ``density=(1, 1)``.
es_es: :func:`~matplotlib.pyplot.streamplot` utiliza un tamaño de malla base de 30x30 tanto para ``densidad=1`` como para ``densidad=(1, 1)``. Anteriormente se utilizaba un tamaño de malla de 30x30 para ``densidad=1``, pero se utilizaba un tamaño de malla de 25x25 para ``densidad=(1, 1)``.

source: Get a list of all tick labels (major and minor)
es_es: Obtenga una lista de todas las etiquetas de marcas del eje (mayores y menores)

source: Added the kwarg 'which' to `.Axes.get_xticklabels`, `.Axes.get_yticklabels` and `.Axis.get_ticklabels`. 'which' can be 'major', 'minor', or 'both' select which ticks to return, like `~.XAxis.set_ticks_position`. If 'which' is `None` then the old behaviour (controlled by the bool *minor*).
es_es: Se ha añadido el kwarg 'which' a `.Axes.get_xticklabels`, `.Axes.get_yticklabels` y `.Axis.get_ticklabels`. 'which' puede ser 'mayor', 'menor', o 'ambos' seleccionar qué marcas devolver, como `~.XAxis.set_ticks_position`. Si 'which' es `None` entonces el comportamiento antiguo (controlado por el bool *minor*).

source: Separate horizontal/vertical axes padding support in ImageGrid
es_es: Soporte de relleno de ejes horizontales/verticales separados en ImageGrid

source: The kwarg 'axes_pad' to :class:`mpl_toolkits.axes_grid1.axes_grid.ImageGrid` can now be a tuple if separate horizontal/vertical padding is needed. This is supposed to be very helpful when you have a labelled legend next to every subplot and you need to make some space for legend's labels.
es_es: El kwarg 'axes_pad' a :class:`mpl_toolkits.axes_grid1.axes_grid.ImageGrid` ahora puede ser una tupla si se necesita un relleno horizontal/vertical separado. Esto se supone que es muy útil cuando se tiene una leyenda etiquetada junto a cada subgráfico y se necesita hacer algo de espacio para las etiquetas de la leyenda.

source: Support for skewed transformations
es_es: Soporte para transformaciones sesgadas

source: The :class:`~matplotlib.transforms.Affine2D` gained additional methods `.skew` and `.skew_deg` to create skewed transformations. Additionally, matplotlib internals were cleaned up to support using such transforms in `~matplotlib.axes.Axes`. This transform is important for some plot types, specifically the Skew-T used in meteorology.
es_es: La :class:`~matplotlib.transforms.Affine2D` obtuvo métodos adicionales `.skew` y `.skew_deg` para crear transformaciones sesgadas. Además, se han limpiado las funciones internas de matplotlib para permitir el uso de dichas transformaciones en `~matplotlib.axes.Axes`. Esta transformación es importante para algunos tipos de gráficos, específicamente el Skew-T utilizado en meteorología.

source: Support for specifying properties of wedge and text in pie charts.
es_es: Soporte para especificar las propiedades de la cuña y el texto en los Diagrama de sectores.

source: Added the kwargs 'wedgeprops' and 'textprops' to `~.Axes.pie` to accept properties for wedge and text objects in a pie. For example, one can specify wedgeprops = {'linewidth':3} to specify the width of the borders of the wedges in the pie. For more properties that the user can specify, look at the docs for the wedge and text objects.
es_es: Se han añadido los kwargs 'wedgeprops' y 'textprops' a `~.Axes.pie` para aceptar las propiedades de los objetos cuña y texto en un sector. Por ejemplo, se puede especificar wedgeprops = {'linewidth':3} para especificar el ancho de los bordes de las cuñas en el sector. Para ver más propiedades que el usuario puede especificar, consulte los documentos de los objetos cuña y texto.

source: Fixed the direction of errorbar upper/lower limits
es_es: Se ha corregido la dirección de los límites superior/inferior de la barra de error

source: Larry Bradley fixed the :func:`~matplotlib.pyplot.errorbar` method such that the upper and lower limits (*lolims*, *uplims*, *xlolims*, *xuplims*) now point in the correct direction.
es_es: Larry Bradley ha arreglado el método :func:`~matplotlib.pyplot.errorbar` para que los límites superior e inferior (*lolims*, *uplims*, *xlolims*, *xuplims*) apunten ahora en la dirección correcta.

source: More consistent add-object API for Axes
es_es: API de adición de objetos más consistente para los ejes

source: Added the Axes method `~matplotlib.axes.Axes.add_image` to put image handling on a par with artists, collections, containers, lines, patches, and tables.
es_es: Se ha añadido el método Axes `~matplotlib.axes.Axes.add_image` para equiparar el manejo de imágenes con el de artists, colecciones, contenedores, líneas, parches y tablas.

source: Violin Plots
es_es: Gráficos de violín

source: Per Parker, Gregory Kelsie, Adam Ortiz, Kevin Chan, Geoffrey Lee, Deokjae Donald Seo, and Taesu Terry Lim added a basic implementation for violin plots. Violin plots can be used to represent the distribution of sample data. They are similar to box plots, but use a kernel density estimation function to present a smooth approximation of the data sample used. The added features are:
es_es: Per Parker, Gregory Kelsie, Adam Ortiz, Kevin Chan, Geoffrey Lee, Deokjae Donald Seo y Taesu Terry Lim han añadido una implementación básica para los gráficos de violín. Los gráficos de violín pueden utilizarse para representar la distribución de los datos de la muestra. Son similares a los gráficos de caja, pero utilizan una función de estimación de la densidad del núcleo para presentar una aproximación suave de la muestra de datos utilizada. Las características añadidas son:

source: `~.Axes.violin` - Renders a violin plot from a collection of statistics. :func:`~matplotlib.cbook.violin_stats` - Produces a collection of statistics suitable for rendering a violin plot. :func:`~matplotlib.pyplot.violinplot` - Creates a violin plot from a set of sample data. This method makes use of :func:`~matplotlib.cbook.violin_stats` to process the input data, and :func:`~matplotlib.cbook.violin_stats` to do the actual rendering. Users are also free to modify or replace the output of :func:`~matplotlib.cbook.violin_stats` in order to customize the violin plots to their liking.
es_es: `~.Axes.violin` - Renderiza un gráfico de violín a partir de una colección de estadísticas. :func:`~matplotlib.cbook.violin_stats` - Produce una colección de estadísticas adecuadas para renderizar un gráfico de violín. :func:`~matplotlib.pyplot.violinplot` - Crea un gráfico de violín a partir de un conjunto de datos de muestra. Este método utiliza :func:`~matplotlib.cbook.violin_stats` para procesar los datos de entrada, y :func:`~matplotlib.cbook.violin_stats` para realizar la representación. Los usuarios también son libres de modificar o reemplazar la salida de :func:`~matplotlib.cbook.violin_stats` para personalizar los gráficos de violín a su gusto.

source: This feature was implemented for a software engineering course at the University of Toronto, Scarborough, run in Winter 2014 by Anya Tafliovich.
es_es: Esta característica se implementó para un curso de ingeniería de software en la Universidad de Toronto, Scarborough, dirigido en el invierno de 2014 por Anya Tafliovich.

source: More *markevery* options to show only a subset of markers
es_es: Más opciones de *markevery* para mostrar sólo un subconjunto de marcadores

source: Rohan Walker extended the *markevery* property in :class:`~matplotlib.lines.Line2D`. You can now specify a subset of markers to show with an int, slice object, numpy fancy indexing, or float. Using a float shows markers at approximately equal display-coordinate-distances along the line.
es_es: Rohan Walker extendió la propiedad *markevery* en :class:`~matplotlib.lines.Line2D`. Ahora puedes especificar un subconjunto de marcadores para mostrar con un int, un objeto slice, una indexación numpy fancy o un punto flotante (float). El uso de un punto flotante muestra marcadores a distancias de coordenadas de visualización aproximadamente iguales a lo largo de la línea.

source: Added size related functions to specialized `.Collection`\s
es_es: Se han añadido funciones relacionadas con el tamaño a las colecciones especializadas `.Collection`s

source: Added the ``get_size`` and ``set_size`` functions to control the size of elements of specialized collections ( :class:`~matplotlib.collections.AsteriskPolygonCollection` :class:`~matplotlib.collections.BrokenBarHCollection` :class:`~matplotlib.collections.CircleCollection` :class:`~matplotlib.collections.PathCollection` :class:`~matplotlib.collections.PolyCollection` :class:`~matplotlib.collections.RegularPolyCollection` :class:`~matplotlib.collections.StarPolygonCollection`).
es_es: Se han añadido las funciones ``get_size`` y ``set_size`` para controlar el tamaño de los elementos de las colecciones especializadas ( :class:`~matplotlib.collections.AsteriskPolygonCollection` :class:`~matplotlib.collections.BrokenBarHCollection` :class:`~matplotlib.collections.CircleCollection` :class:`~matplotlib.collections.PathCollection` :class:`~matplotlib.collections.PolyCollection` :class:`~matplotlib.collections.RegularPolyCollection` :class:`~matplotlib.collections.StarPolygonCollection`).

source: Fixed the mouse coordinates giving the wrong theta value in Polar graph
es_es: Se ha corregido el hecho de que las coordenadas del ratón den un valor de theta erróneo en el gráfico polar

source: Added code to `~.polar.InvertedPolarTransform.transform_non_affine` to ensure that the calculated theta value was between the range of 0 and 2 * pi since the problem was that the value can become negative after applying the direction and rotation to the theta calculation.
es_es: Se ha añadido código a `~.polar.InvertedPolarTransform.transform_non_affine` para asegurar que el valor de theta calculado estaba entre el rango de 0 y 2 * pi ya que el problema era que el valor puede volverse negativo después de aplicar la dirección y la rotación al cálculo de theta.

source: Simple quiver plot for mplot3d toolkit
es_es: Gráfico de quiver simple para el kit de herramientas mplot3d

source: A team of students in an *Engineering Large Software Systems* course, taught by Prof. Anya Tafliovich at the University of Toronto, implemented a simple version of a quiver plot in 3D space for the mplot3d toolkit as one of their term project. This feature is documented in :func:`~mpl_toolkits.mplot3d.Axes3D.quiver`. The team members are: Ryan Steve D'Souza, Victor B, xbtsw, Yang Wang, David, Caradec Bisesar and Vlad Vassilovski.
es_es: Un equipo de estudiantes de un curso de *Ingeniería de Grandes Sistemas de Software*, impartido por la profesora Anya Tafliovich en la Universidad de Toronto, implementó una versión simple de un gráfico de quiver en el espacio 3D para el kit de herramientas mplot3d como uno de sus proyectos del trimestre. Esta función está documentada en :func:`~mpl_toolkits.mplot3d.Axes3D.quiver`. Los miembros del equipo son: Ryan Steve D'Souza, Victor B, xbtsw, Yang Wang, David, Caradec Bisesar y Vlad Vassilovski.

source: polar-plot r-tick locations
es_es: gráfico polar ubicaciones de r-tick

source: Added the ability to control the angular position of the r-tick labels on a polar plot via `~.PolarAxes.set_rlabel_position`.
es_es: Se ha añadido la posibilidad de controlar la posición angular de las etiquetas r-tick en un gráfico polar mediante `~.PolarAxes.set_rlabel_position`.

source: Date handling
es_es: Gestión de fechas

source: n-d array support for date conversion
es_es: soporte de arreglos n-d para la conversión de fechas

source: Andrew Dawson added support for n-d array handling to :func:`matplotlib.dates.num2date`, :func:`matplotlib.dates.date2num` and :func:`matplotlib.dates.datestr2num`. Support is also added to the unit conversion interfaces :class:`matplotlib.dates.DateConverter` and :class:`matplotlib.units.Registry`.
es_es: Andrew Dawson ha añadido soporte para el manejo de arreglos n-d a :func:`matplotlib.dates.num2date`, :func:`matplotlib.dates.date2num` y :func:`matplotlib.datestr2num`. También se añade soporte a las interfaces de conversión de unidades :class:`matplotlib.dates.DateConverter` y :class:`matplotlib.units.Registry`.

source: Configuration (rcParams)
es_es: Configuración (rcParams)

source: ``savefig.transparent`` added
es_es: ``savefig.transparent`` añadido
