Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_2.2.po
Languages: es_es

source: What's new in Matplotlib 2.2 (Mar 06, 2018)
es_es: Novedades en Matplotlib 2.2 (Mar 06, 2018)

source: Constrained Layout Manager
es_es: Gestor de layout restringido

source: Constrained Layout is **experimental**. The behaviour and API are subject to change, or the whole functionality may be removed without a deprecation period.
es_es: Constrained Layout es **experimental**. El comportamiento y la API están sujetos a cambios, o toda la funcionalidad puede ser eliminada sin un periodo de obsolescencia.

source: A new method to automatically decide spacing between subplots and their organizing ``GridSpec`` instances has been added. It is meant to replace the venerable ``tight_layout`` method. It is invoked via a new ``constrained_layout=True`` kwarg to `~.figure.Figure` or `~.Figure.subplots`.
es_es: Se ha añadido un nuevo método para decidir automáticamente el espaciado entre las subplots y sus instancias organizadoras ``GridSpec``. Está pensado para sustituir al método tradicional ``tight_layout``. Se invoca mediante un nuevo kwarg ``constrained_layout=True`` a `~.figure.Figure` o `~.Figure.subplots`.

source: There are new `.rcParams` for this package, and spacing can be more finely tuned with the new `~.set_constrained_layout_pads`.
es_es: Hay nuevos `.rcParams` para este paquete, y el espaciado puede ajustarse más finamente con el nuevo `~.set_constrained_layout_pads`.

source: Features include:
es_es: Las características incluyen:

source: Automatic spacing for subplots with a fixed-size padding in inches around subplots and all their decorators, and space between as a fraction of subplot size between subplots.
es_es: Espaciado automático para los subplot con un relleno de tamaño fijo en pulgadas alrededor de los subplots y todos sus decoradores, y espacio entre ellas como una fracción del tamaño de las subplots.

source: Spacing for `~.Figure.suptitle`, and colorbars that are attached to more than one axes.
es_es: Espaciado para `~.Figure.suptitle`, y barras de colores que se adjuntan a más de un eje.

source: Nested `~.GridSpec` layouts using `~.GridSpecFromSubplotSpec`.
es_es: Diseños anidados de `~.GridSpec` utilizando `~.GridSpecFromSubplotSpec`.

source: For more details and capabilities please see the new tutorial: :doc:`/tutorials/intermediate/constrainedlayout_guide`
es_es: Para más detalles y capacidades, consulte el nuevo tutorial: :doc:`/tutorials/intermediate/constrainedlayout_guide`

source: Note the new API to access this:
es_es: Ten en cuenta la nueva API para acceder a esto:

source: New ``plt.figure`` and ``plt.subplots`` kwarg: ``constrained_layout``
es_es: Nuevo kwarg ``plt.figure`` y ``plt.subplots``: ``constrained_layout``

source: :meth:`~matplotlib.pyplot.figure` and :meth:`~matplotlib.pyplot.subplots` can now be called with ``constrained_layout=True`` kwarg to enable constrained_layout.
es_es: :meth:`~matplotlib.pyplot.figure` y :meth:`~matplotlib.pyplot.subplots` ahora se pueden llamar con el kwarg ``constrained_layout=True`` para habilitar constrained_layout.

source: New ``ax.set_position`` behaviour
es_es: Nuevo comportamiento de ``ax.set_position``

source: `.Axes.set_position` now makes the specified axis no longer responsive to ``constrained_layout``, consistent with the idea that the user wants to place an axis manually.
es_es: Ahora `.Axes.set_position` hace que el eje especificado ya no responda a ``constrained_layout``, en consonancia con la idea de que el usuario quiera colocar un eje manualmente.

source: Internally, this means that old ``ax.set_position`` calls *inside* the library are changed to private ``ax._set_position`` calls so that ``constrained_layout`` will still work with these axes.
es_es: Internamente, esto significa que las antiguas llamadas a ``ax.set_position`` *dentro* de la biblioteca se cambian por llamadas privadas a ``ax._set_position`` para que ``constrained_layout`` siga funcionando con estos ejes.

source: New ``figure`` kwarg for ``GridSpec``
es_es: Nuevo kwarg de ``figure`` para ``GridSpec`

source: In order to facilitate ``constrained_layout``, ``GridSpec`` now accepts a ``figure`` keyword. This is backwards compatible, in that not supplying this will simply cause ``constrained_layout`` to not operate on the subplots orgainzed by this ``GridSpec`` instance. Routines that use ``GridSpec`` (e.g. ``fig.subplots``) have been modified to pass the figure to ``GridSpec``.
es_es: Para facilitar el uso de ``constrained_layout``, ``GridSpec`` acepta ahora la palabra clave ``figure``. Esto es compatible con versiones anteriores, ya que si no se proporciona esta palabra, ``constrained_layout`` no funcionará en los subplots organizados por esta instancia de ``GridSpec``. Las rutinas que utilizan ``GridSpec`` (por ejemplo, ``fig.subplots``) se han modificado para pasar la figura a ``GridSpec``.

source: xlabels and ylabels can now be automatically aligned
es_es: xlabels y ylabels ahora pueden ser alineados automáticamente

source: Subplot axes ``ylabels`` can be misaligned horizontally if the tick labels are very different widths. The same can happen to ``xlabels`` if the ticklabels are rotated on one subplot (for instance). The new methods on the `.Figure` class: `.Figure.align_xlabels` and `.Figure.align_ylabels` will now align these labels horizontally or vertically. If the user only wants to align some axes, a list of axes can be passed. If no list is passed, the algorithm looks at all the labels on the figure.
es_es: Los ejes de los subplots ``ylabels`` pueden estar mal alineados horizontalmente si las etiquetas de las marcas son de anchos muy diferentes. Lo mismo puede ocurrir con las "etiquetas x" si las etiquetas de los ticks están giradas en un subplot (por ejemplo). Los nuevos métodos de la clase `.Figure`: `.Figure.align_xlabels` y `.Figure.align_ylabels` ahora alinearán estas etiquetas horizontal o verticalmente. Si el usuario sólo quiere alinear algunos ejes, se puede pasar una lista de ejes. Si no se pasa ninguna lista, el algoritmo mira todas las etiquetas de la figura.

source: Only labels that have the same subplot locations are aligned. i.e. the ylabels are aligned only if the subplots are in the same column of the subplot layout.
es_es: Sólo se alinean las etiquetas que tienen las mismas ubicaciones de subplot. Es decir, las etiquetas y se alinean sólo si los subplots están en la misma columna del diseño de subplot.

source: Alignment is persistent and automatic after these are called.
es_es: La alineación es persistente y automática después de llamar a estas funciones.

source: A convenience wrapper `.Figure.align_labels` calls both functions at once.
es_es: Una envoltura de conveniencia `.Figure.align_labels` llama a ambas funciones a la vez.

source: Axes legends now included in tight_bbox
es_es: Las leyendas de los ejes ahora se incluyen en tight_bbox

source: Legends created via ``ax.legend`` can sometimes overspill the limits of the axis. Tools like ``fig.tight_layout()`` and ``fig.savefig(bbox_inches='tight')`` would clip these legends. A change was made to include them in the ``tight`` calculations.
es_es: Las leyendas creadas a través de ``ax.legend`` a veces pueden sobrepasar los límites del eje. Herramientas como ``fig.tight_layout()`` y ``fig.savefig(bbox_inches='tight')`` recortaban estas leyendas. Se ha realizado un cambio para incluirlas en los cálculos de ``tight``.

source: Cividis colormap
es_es: Mapa de colores Cividis

source: A new dark blue/yellow colormap named 'cividis' was added. Like viridis, cividis is perceptually uniform and colorblind friendly. However, cividis also goes a step further: not only is it usable by colorblind users, it should actually look effectively identical to colorblind and non-colorblind users. For more details see `Nuñez J, Anderton C, and Renslow R: "Optimizing colormaps with consideration for color vision deficiency to enable accurate interpretation of scientific data" <https://doi.org/10.1371/journal.pone.0199239>`_.
es_es: Se ha añadido un nuevo mapa de colores azul oscuro/amarillo llamado 'cividis'. Al igual que viridis, cividis es perceptualmente uniforme y amigable con los daltónicos. Sin embargo, cividis va un paso más allá: no sólo es utilizable por los usuarios daltónicos, sino que debería parecer idéntico a los usuarios daltónicos y no daltónicos. Para más detalles, véase `Nuñez J, Anderton C, y Renslow R: "Optimizing colormaps with consideration for color vision deficiency to enable accurate interpretation of scientific data" <https://doi.org/10.1371/journal.pone.0199239>`_.

source: New style colorblind-friendly color cycle
es_es: Nuevo estilo de ciclo de colores para daltónicos

source: A new style defining a color cycle has been added, tableau-colorblind10, to provide another option for colorblind-friendly plots. A demonstration of this new style can be found in the reference_ of style sheets. To load this color cycle in place of the default one::
es_es: Se ha añadido un nuevo estilo que define un ciclo de color, tableau-colorblind10, para ofrecer otra opción para los gráficos aptos para daltónicos. Se puede encontrar una demostración de este nuevo estilo en la reference_ de las hojas de estilo. Para cargar este ciclo de color en lugar del predeterminado::

source: Support for numpy.datetime64
es_es: Soporte para numpy.datetime64

source: Matplotlib has supported `datetime.datetime` dates for a long time in `matplotlib.dates`. We now support `numpy.datetime64` dates as well. Anywhere that `datetime.datetime` could be used, `numpy.datetime64` can be used. eg::
es_es: Matplotlib ha soportado las fechas `datetime.datetime` durante mucho tiempo en `matplotlib.dates`. Ahora también soportamos las fechas `numpy.datetime64`. En cualquier lugar donde se pueda utilizar `datetime.datetime`, se puede utilizar `numpy.datetime64`::

source: Writing animations with Pillow
es_es: Escribir animaciones con Pillow

source: It is now possible to use Pillow as an animation writer. Supported output formats are currently gif (Pillow>=3.4) and webp (Pillow>=5.0). Use e.g. as ::
es_es: Ahora es posible utilizar Pillow como escritor de animaciones. Los formatos de salida soportados son actualmente gif (Pillow>=3.4) y webp (Pillow>=5.0). Utiliza, por ejemplo, como ::

source: Slider UI widget can snap to discrete values
es_es: El widget carrusel de la IU puede ajustarse a valores discretos

source: The slider UI widget can take the optional argument *valstep*. Doing so forces the slider to take on only discrete values, starting from *valmin* and counting up to *valmax* with steps of size *valstep*.
es_es: El widget de carrusel de la IU puede tomar el argumento opcional *valstep*. Esto obliga al deslizador a tomar sólo valores discretos, empezando por *valmin* y contando hasta *valmax* con pasos de tamaño *valstep*.

source: If *closedmax==True*, then the slider will snap to *valmax* as well.
es_es: Si *closedmax==True*, el carrusel también se ajustará a *valmax*.

source: ``capstyle`` and ``joinstyle`` attributes added to `.Collection`
es_es: Atributos ``capstyle`` y ``joinstyle`` añadidos a `.Collection`

source: The `.Collection` class now has customizable ``capstyle`` and ``joinstyle`` attributes. This allows the user for example to set the ``capstyle`` of errorbars.
es_es: La clase `.Collection` tiene ahora atributos personalizables ``capstyle`` y ``joinstyle``. Esto permite al usuario, por ejemplo, establecer el ``capstyle`` de las barras de error.

source: *pad* kwarg added to ax.set_title
es_es: Se ha añadido el kwarg *pad* a ax.set_title

source: The method `.Axes.set_title` now has a *pad* kwarg, that specifies the distance from the top of an axes to where the title is drawn. The units of *pad* is points, and the default is the value of the (already-existing) :rc:`axes.titlepad`.
es_es: El método `.Axes.set_title` ahora tiene un kwarg *pad*, que especifica la distancia desde la parte superior de un eje hasta donde se dibuja el título. Las unidades de *pad* son puntos, y el valor por defecto es el valor del (ya existente) :rc:`axes.titlepad`.

source: Comparison of 2 colors in Matplotlib
es_es: Comparación de 2 colores en Matplotlib

source: As the colors in Matplotlib can be specified with a wide variety of ways, the `matplotlib.colors.same_color` method has been added which checks if two `~matplotlib.colors` are the same.
es_es: Como los colores en Matplotlib se pueden especificar con una amplia variedad de formas, se ha añadido el método `matplotlib.colors.same_color` que comprueba si dos `~matplotlib.colors` son iguales.

source: Autoscaling a polar plot snaps to the origin
es_es: Ajuste automático de un gráfico polar al origen

source: Setting the limits automatically in a polar plot now snaps the radial limit to zero if the automatic limit is nearby. This means plotting from zero doesn't automatically scale to include small negative values on the radial axis.
es_es: La configuración automática de los límites en un gráfico polar ahora ajusta el límite radial a cero si el límite automático está cerca. Esto significa que el trazado desde cero no se escala automáticamente para incluir pequeños valores negativos en el eje radial.

source: The limits can still be set manually in the usual way using `~.Axes.set_ylim`.
es_es: Los límites se pueden seguir estableciendo manualmente de la forma habitual utilizando `~.Axes.set_ylim`.

source: PathLike support
es_es: Soporte de PathLike

source: On Python 3.6+, `~matplotlib.pyplot.savefig`, `~matplotlib.pyplot.imsave`, `~matplotlib.pyplot.imread`, and animation writers now accept `os.PathLike`\s as input.
es_es: En Python 3.6+, `~matplotlib.pyplot.savefig`, `~matplotlib.pyplot.imsave`, `~matplotlib.pyplot.imread`, y los creadores de animación ahora aceptan `os.PathLike` como entrada.

source: `.Axes.tick_params` can set gridline properties
es_es: `.Axes.tick_params` puede establecer las propiedades de las líneas de la cuadrícula

source: `.Tick` objects hold gridlines as well as the tick mark and its label. `.Axis.set_tick_params`, `.Axes.tick_params` and `.pyplot.tick_params` now have keyword arguments 'grid_color', 'grid_alpha', 'grid_linewidth', and 'grid_linestyle' for overriding the defaults in `.rcParams`: 'grid.color', etc.
es_es: Los objetos `.Tick` contienen las líneas de la rejilla así como la marca del tick y su etiqueta. Los objetos `.Axis.set_tick_params`, `.Axes.tick_params` y `.pyplot.tick_params` tienen ahora argumentos de palabra clave 'grid_color', 'grid_alpha', 'grid_linewidth', y 'grid_linestyle' para sobreescribir los valores por defecto en `.rcParams`: 'grid.color', etc.

source: `.Axes.imshow` clips RGB values to the valid range
es_es: `.Axes.imshow` recorta los valores RGB al rango válido

source: When `.Axes.imshow` is passed an RGB or RGBA value with out-of-range values, it now logs a warning and clips them to the valid range. The old behaviour, wrapping back in to the range, often hid outliers and made interpreting RGB images unreliable.
es_es: Cuando a `.Axes.imshow` se le pasa un valor RGB o RGBA con valores fuera de rango, ahora registra una advertencia y los ajusta al rango válido. El antiguo comportamiento, que recortaba al rango, a menudo ocultaba los valores atípicos y hacía que la interpretación de las imágenes RGB no fuera fiable.

source: Properties in :file:`matplotlibrc` to place xaxis and yaxis tick labels
es_es: Propiedades en :file:`matplotlibrc` para colocar las etiquetas de los ejes X e Y

source: Introducing four new boolean properties in :file:`matplotlibrc` for default positions of xaxis and yaxis tick labels, namely, :rc:`xtick.labeltop`, :rc:`xtick.labelbottom`, :rc:`ytick.labelright` and :rc:`ytick.labelleft`. These can also be changed in rcParams.
es_es: Introducimos cuatro nuevas propiedades booleanas en :file:`matplotlibrc` para las posiciones por defecto de las etiquetas de los ticks del eje x y del eje y, a saber, :rc:`xtick.labeltop`, :rc:`xtick.labelbottom`, :rc:`ytick.labelright` y :rc:`ytick.labelleft`. Estos también se pueden cambiar en rcParams.

source: PGI bindings for gtk3
es_es: Enlaces PGI para gtk3

source: The GTK3 backends can now use PGI_ instead of PyGObject_. PGI is a fairly incomplete binding for GObject, thus its use is not recommended; its main benefit is its availability on Travis (thus allowing CI testing for the gtk3agg and gtk3cairo backends).
es_es: Los backends de GTK3 ahora pueden usar PGI_ en lugar de PyGObject_. PGI es un enlace bastante incompleto para GObject, por lo que no se recomienda su uso; su principal beneficio es su disponibilidad en Travis (permitiendo así pruebas de CI para los backends gtk3agg y gtk3cairo).

source: The binding selection rules are as follows: - if ``gi`` has already been imported, use it; else - if ``pgi`` has already been imported, use it; else - if ``gi`` can be imported, use it; else - if ``pgi`` can be imported, use it; else - error out.
es_es: Las reglas de selección de enlaces son las siguientes - si ``gi`` ya ha sido importado, úsalo; de lo contrario - si ``pgi`` ya ha sido importado, úsalo; en caso contrario - si ``gi`` puede ser importado, úsalo; de lo contrario - si ``pgi`` puede ser importado, úsalo; caso contrario - error.

source: Thus, to force usage of PGI when both bindings are installed, import it first.
es_es: Por lo tanto, para forzar el uso de PGI cuando ambos enlaces están instalados, impórtalo primero.

source: Cairo rendering for Qt, WX, and Tk canvases
es_es: Renderizado de Cairo para lienzos Qt, WX y Tk

source: The new ``Qt4Cairo``, ``Qt5Cairo``, ``WXCairo``, and ``TkCairo`` backends allow Qt, Wx, and Tk canvases to use Cairo rendering instead of Agg.
es_es: Los nuevos backends ``Qt4Cairo``, ``Qt5Cairo``, ``WXCairo`` y ``TkCairo`` permiten a los lienzos Qt, Wx y Tk utilizar el renderizado Cairo en lugar de Agg.

source: Added support for QT in new ToolManager
es_es: Añadido soporte para QT en el nuevo ToolManager

source: Now it is possible to use the ToolManager with Qt5 For example
es_es: Ahora es posible utilizar el ToolManager con Qt5 Por ejemplo

source: import matplotlib
es_es: importar matplotlib

source: Treat the new Tool classes experimental for now, the API will likely change and perhaps the rcParam as well
es_es: Trata las nuevas clases de herramientas como experimentales por ahora, la API probablemente cambiará y quizás el rcParam también

source: The main example :doc:`/gallery/user_interfaces/toolmanager_sgskip` shows more details, just adjust the header to use QT instead of GTK3
es_es: El ejemplo principal :doc:`/gallery/user_interfaces/toolmanager_sgskip` muestra más detalles, sólo hay que ajustar la cabecera para usar QT en lugar de GTK3

source: TkAgg backend reworked to support PyPy
es_es: El backend de TkAgg ha sido revisado para soportar PyPy

source: PyPy_ can now plot using the TkAgg backend, supported on PyPy 5.9 and greater (both PyPy for python 2.7 and PyPy for python 3.5).
es_es: PyPy_ ahora puede trazar usando el backend TkAgg, soportado en PyPy 5.9 y superior (tanto PyPy para python 2.7 como PyPy para python 3.5).

source: Python logging library used for debug output
es_es: Biblioteca de registro de Python utilizada para la salida de depuración

source: Matplotlib has in the past (sporadically) used an internal verbose-output reporter. This version converts those calls to using the standard python `logging` library.
es_es: Matplotlib ha utilizado en el pasado (esporádicamente) una biblioteca interna de salida detallada. Esta versión convierte esas llamadas en el uso de la biblioteca estándar de python `logging`.

source: Support for the old `.rcParams` ``verbose.level`` and ``verbose.fileo`` is dropped.
es_es: Se elimina el soporte para los antiguos `.rcParams` ``verbose.level`` y ``verbose.fileo``.

source: The command-line options ``--verbose-helpful`` and ``--verbose-debug`` are still accepted, but deprecated. They are now equivalent to setting ``logging.INFO`` and ``logging.DEBUG``.
es_es: Las opciones de línea de comandos ``--verbose-helpful`` y ``--verbose-debug`` siguen siendo aceptadas, pero están obsoletas. Ahora equivalen a establecer ``logging.INFO`` y ``logging.DEBUG``.

source: The logger's root name is ``matplotlib`` and can be accessed from programs as::
es_es: El nombre raíz del registro es ``matplotlib`` y se puede acceder a él desde los programas como::

source: Instructions for basic usage are in :ref:`troubleshooting-faq` and for developers in :ref:`contributing`.
es_es: Las instrucciones para el uso básico están en :ref:`troubleshooting-faq` y para quienes desarrollan en :ref:`contributing`.

source: Improved `repr` for `.Transform`\s
es_es: Mejora de `repr` para `.Transform``\s

source: `.Transform`\s now indent their `repr`\s in a more legible manner:
es_es: Ahora los `.Transform`\s tienen sangría en sus `repr`\s de una manera más legible:
