Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_3.0.po
Languages: es_es

source: What's new in Matplotlib 3.0 (Sep 18, 2018)
es_es: Novedades en Matplotlib 3.0 (Mar 18, 2018)

source: Improved default backend selection
es_es: Mejora de la selección del backend por defecto

source: The default backend no longer must be set as part of the build process. Instead, at run time, the builtin backends are tried in sequence until one of them imports.
es_es: El backend por defecto ya no debe establecerse como parte del proceso de construcción. En su lugar, en el momento de ejecución, los backends incorporados se prueban en secuencia hasta que uno de ellos se importa.

source: Headless Linux servers (identified by the DISPLAY environment variable not being defined) will not select a GUI backend.
es_es: Los servidores Linux sin cabeza (identificados por la variable de entorno DISPLAY no definida) no seleccionarán un backend IGU.

source: Cyclic colormaps
es_es: Mapas de color cíclicos

source: Two new colormaps named 'twilight' and 'twilight_shifted' have been added. These colormaps start and end on the same color, and have two symmetric halves with equal lightness, but diverging color. Since they wrap around, they are a good choice for cyclic data such as phase angles, compass directions, or time of day. Like *viridis* and *cividis*, *twilight* is perceptually uniform and colorblind friendly.
es_es: Se han añadido dos nuevos mapas de colores llamados 'twilight' y 'twilight_shifted'. Estos mapas de colores comienzan y terminan en el mismo color, y tienen dos mitades simétricas con igual luminosidad, pero con colores divergentes. Al ser envolventes, son una buena opción para datos cíclicos como los ángulos de fase, las direcciones de la brújula o la hora del día. Al igual que *viridis* y *cividis*, *twilight* es perceptualmente uniforme y apto para daltónicos.

source: Ability to scale axis by a fixed order of magnitude
es_es: Posibilidad de escalar los ejes en un orden de magnitud fijo

source: To scale an axis by a fixed order of magnitude, set the *scilimits* argument of `.Axes.ticklabel_format` to the same (non-zero) lower and upper limits. Say to scale the y axis by a million (1e6), use
es_es: Para escalar un eje por un orden de magnitud fijo, establezca el argumento *scilimits* de `.Axes.ticklabel_format` a los mismos límites inferior y superior (no nulos). Digamos que para escalar el eje y por un millón (1e6), utilice

source: The behavior of ``scilimits=(0, 0)`` is unchanged. With this setting, Matplotlib will adjust the order of magnitude depending on the axis values, rather than keeping it fixed. Previously, setting ``scilimits=(m, m)`` was equivalent to setting ``scilimits=(0, 0)``.
es_es: El comportamiento de ``scilimits=(0, 0)`` no cambia. Con esta configuración, Matplotlib ajustará el orden de magnitud dependiendo de los valores del eje, en lugar de mantenerlo fijo. Anteriormente, establecer ``scilimits=(m, m)`` era equivalente a establecer ``scilimits=(0, 0)``.

source: Add ``AnchoredDirectionArrows`` feature to mpl_toolkits
es_es: Añadir la función ``AnchoredDirectionArrows`` a mpl_toolkits

source: A new mpl_toolkits class :class:`~mpl_toolkits.axes_grid1.anchored_artists.AnchoredDirectionArrows` draws a pair of orthogonal arrows to indicate directions on a 2D plot. A minimal working example takes in the transformation object for the coordinate system (typically ax.transAxes), and arrow labels. There are several optional parameters that can be used to alter layout. For example, the arrow pairs can be rotated and the color can be changed. By default the labels and arrows have the same color, but the class may also pass arguments for customizing arrow and text layout, these are passed to :class:`matplotlib.textpath.TextPath` and `matplotlib.patches.FancyArrowPatch`. Location, length and width for both arrow tail and head can be adjusted, the direction arrows and labels can have a frame. Padding and separation parameters can be adjusted.
es_es: Una nueva clase de mpl_toolkits :class:`~mpl_toolkits.axes_grid1.anchored_artists.AnchoredDirectionArrows` dibuja un par de flechas ortogonales para indicar direcciones en un gráfico 2D. Un ejemplo mínimo de trabajo toma el objeto de transformación para el sistema de coordenadas (típicamente ax.transAxes), y las etiquetas de las flechas. Hay varios parámetros opcionales que se pueden utilizar para alterar el diseño. Por ejemplo, los pares de flechas pueden ser rotados y el color puede ser cambiado. Por defecto las etiquetas y las flechas tienen el mismo color, pero la clase también puede pasar argumentos para personalizar el diseño de las flechas y el texto, estos se pasan a :class:`matplotlib.textpath.TextPath` y `matplotlib.patches.FancyArrowPatch`. Se puede ajustar la ubicación, la longitud y la anchura tanto de la cola como de la cabeza de la flecha, las flechas de dirección y las etiquetas pueden tener un marco. Se pueden ajustar los parámetros de relleno y separación.

source: Add ``minorticks_on()/off()`` methods for colorbar
es_es: Añadir métodos ``minorticks_on()/off()`` para la barra de colores

source: A new method ``ColorbarBase.minorticks_on`` has been added to correctly display minor ticks on a colorbar. This method doesn't allow the minor ticks to extend into the regions beyond vmin and vmax when the *extend* keyword argument (used while creating the colorbar) is set to 'both', 'max' or 'min'. A complementary method ``ColorbarBase.minorticks_off`` has also been added to remove the minor ticks on the colorbar.
es_es: Se ha añadido un nuevo método ``ColorbarBase.minorticks_on`` para mostrar correctamente los ticks menores en una barra de color. Este método no permite que los ticks menores se extiendan a las regiones más allá de vmin y vmax cuando el argumento de la palabra clave *extend* (utilizado mientras se crea la barra de colores) se establece en 'both', 'max' o 'min'. También se ha añadido un método complementario ``ColorbarBase.minorticks_off`` para eliminar los ticks menores de la barra de colores.

source: Colorbar ticks can now be automatic
es_es: Los ticks de la barra de colores ahora pueden ser automáticos

source: The number of ticks placed on colorbars was previously appropriate for a large colorbar, but looked bad if the colorbar was made smaller (i.e. via the *shrink* keyword argument). This has been changed so that the number of ticks is now responsive to how large the colorbar is.
es_es: El número de ticks colocados en las barras de color era anteriormente apropiado para una barra de color grande, pero se veía mal si la barra de color se hacía más pequeña (es decir, a través del argumento de la palabra clave *shrink*). Esto se ha cambiado para que el número de ticks responda ahora a lo grande que sea la barra de colores.

source: Don't automatically rename duplicate file names
es_es: No renombrar automáticamente los nombres de archivo duplicados

source: Previously, when saving a figure to a file using the GUI's save dialog box, if the default filename (based on the figure window title) already existed on disk, Matplotlib would append a suffix (e.g. ``Figure_1-1.png``), preventing the dialog from prompting to overwrite the file. This behaviour has been removed. Now if the file name exists on disk, the user is prompted whether or not to overwrite it. This eliminates guesswork, and allows intentional overwriting, especially when the figure name has been manually set using ``figure.canvas.set_window_title()``.
es_es: Anteriormente, cuando se guardaba una figura en un archivo utilizando el cuadro de diálogo de la IGU, si el nombre de archivo por defecto (basado en el título de la ventana de la figura) ya existía en el disco, Matplotlib añadía un sufijo (por ejemplo, ``Figura_1-1.png``), evitando que el cuadro de diálogo pidiera sobrescribir el archivo. Este comportamiento se ha eliminado. Ahora, si el nombre del archivo existe en el disco, se le pide al usuario que lo sobrescriba o no. Esto elimina las conjeturas y permite la sobreescritura intencionada, especialmente cuando el nombre de la figura se ha establecido manualmente usando ``figure.canvas.set_window_title()``.

source: Legend now has a *title_fontsize* keyword argument (and rcParam)
es_es: La leyenda tiene ahora un argumento de palabra clave *title_fontsize* (y rcParam)

source: The title for a `.Figure.legend` and `.Axes.legend` can now have its font size set via the *title_fontsize* keyword argument. There is also a new :rc:`legend.title_fontsize`. Both default to ``None``, which means the legend title will have the same font size as the axes default font size (*not* the legend font size, set by the *fontsize* keyword argument or :rc:`legend.fontsize`).
es_es: El título de una `.Figure.legend` y `.Axes.legend` puede ahora tener su tamaño de fuente establecido a través del argumento de palabra clave *title_fontsize*. También hay un nuevo :rc:`legend.title_fontsize`. Ambos tienen por defecto el valor ``None``, lo que significa que el título de la leyenda tendrá el mismo tamaño de fuente que el tamaño de fuente por defecto de los ejes (*no* el tamaño de fuente de la leyenda, establecido por el argumento de la palabra clave *fontsize* o :rc:`legend.fontsize`).

source: Support for axes.prop_cycle property *markevery* in rcParams
es_es: Soporte para la propiedad axes.prop_cycle *markevery* en rcParams

source: The Matplotlib ``rcParams`` settings object now supports configuration of the attribute :rc:`axes.prop_cycle` with cyclers using the *markevery* Line2D object property. An example of this feature is provided at :doc:`/gallery/lines_bars_and_markers/markevery_prop_cycle`.
es_es: El objeto de configuración ``rcParams`` de Matplotlib soporta ahora la configuración del atributo :rc:`axes.prop_cycle` con cicladores utilizando la propiedad del objeto *markevery* Line2D. Un ejemplo de esta característica se proporciona en :doc:`/gallery/lines_bars_and_markers/markevery_prop_cycle`.

source: Multi-page PDF support for pgf backend
es_es: Soporte de PDF de varias páginas para el backend pgf

source: The pgf backend now also supports multi-page PDF files.
es_es: El backend pgf ahora también soporta archivos PDF multipágina.

source: Pie charts are now circular by default
es_es: Los gráficos de torta son ahora circulares por defecto

source: We acknowledge that the majority of people do not like egg-shaped pies. Therefore, an axes to which a pie chart is plotted will be set to have equal aspect ratio by default. This ensures that the pie appears circular independent on the axes size or units. To revert to the previous behaviour set the axes' aspect ratio to automatic by using ``ax.set_aspect("auto")`` or ``plt.axis("auto")``.
es_es: Reconocemos que a la mayoría de la gente no le gustan las tartas en forma de huevo. Por lo tanto, los ejes en los que se traza un gráfico de tartas se configurarán para que tengan la misma relación de aspecto por defecto. Esto garantiza que la tarta sea circular independientemente del tamaño de los ejes o de las unidades. Para volver al comportamiento anterior, establezca la relación de aspecto de los ejes como automática utilizando ``ax.set_aspect("auto")`` o ``plt.axis("auto")``.

source: Add ``ax.get_gridspec`` to `.SubplotBase`
es_es: Añadir ``ax.get_gridspec`` a `.SubplotBase`

source: New method `.SubplotBase.get_gridspec` is added so that users can easily get the gridspec that went into making an axes:
es_es: Se añade el nuevo método `.SubplotBase.get_gridspec` para que los usuarios puedan obtener fácilmente la especificación de la rejilla que se utilizó para crear un eje:

source: Axes titles will no longer overlap xaxis
es_es: Los títulos de los ejes ya no se superponen al eje x

source: Previously an axes title had to be moved manually if an xaxis overlapped (usually when the xaxis was put on the top of the axes). Now, the title will be automatically moved above the xaxis and its decorators (including the xlabel) if they are at the top.
es_es: Anteriormente, el título de un eje tenía que ser movido manualmente si un eje x se superponía (normalmente cuando el eje x se ponía en la parte superior de los ejes). Ahora, el título se moverá automáticamente por encima del eje x y sus decoradores (incluyendo la etiqueta x) si están en la parte superior.

source: If desired, the title can still be placed manually. There is a slight kludge; the algorithm checks if the y-position of the title is 1.0 (the default), and moves if it is. If the user places the title in the default location (i.e. ``ax.title.set_position(0.5, 1.0)``), the title will still be moved above the xaxis. If the user wants to avoid this, they can specify a number that is close (i.e. ``ax.title.set_position(0.5, 1.01)``) and the title will not be moved via this algorithm.
es_es: Si se desea, el título puede seguir colocándose manualmente. Hay un pequeño error; el algoritmo comprueba si la posición y del título es 1.0 (el valor por defecto), y se mueve si lo es. Si el usuario coloca el título en la posición por defecto (es decir, ``ax.title.set_position(0.5, 1.0)``), el título se seguirá moviendo por encima del eje x. Si el usuario quiere evitar esto, puede especificar un número cercano (por ejemplo, ``ax.title.set_position(0.5, 1.01)``) y el título no se moverá mediante este algoritmo.

source: New convenience methods for GridSpec
es_es: Nuevos métodos de conveniencia para GridSpec

source: There are new convenience methods for `.gridspec.GridSpec` and `.gridspec.GridSpecFromSubplotSpec`. Instead of the former we can now call `.Figure.add_gridspec` and for the latter `.SubplotSpec.subgridspec`.
es_es: Hay nuevos métodos de conveniencia para `.gridspec.GridSpec` y `.gridspec.GridSpecFromSubplotSpec`. En lugar del primero, ahora podemos llamar a `.Figure.add_gridspec` y para el segundo a `.SubplotSpec.subgridspec`.

source: Figure has an `~.figure.Figure.add_artist` method
es_es: Figure tiene un método `~.figure.Figure.add_artist`

source: A method `~.figure.Figure.add_artist` has been added to the :class:`~.figure.Figure` class, which allows artists to be added directly to a figure. E.g. ::
es_es: Se ha añadido un método `~.figure.Figure.add_artist` a la clase :class:`~.figure.Figure`, que permite añadir artists directamente a una figura. Por ejemplo ::

source: In case the added artist has no transform set previously, it will be set to the figure transform (``fig.transFigure``). This new method may be useful for adding artists to figures without axes or to easily position static elements in figure coordinates.
es_es: En caso de que el artist añadido no tenga ninguna transformación establecida previamente, se establecerá la transformación de la figura (``fig.transFigure``). Este nuevo método puede ser útil para añadir artists a figuras sin ejes o para posicionar fácilmente elementos estáticos en coordenadas de la figura.

source: ``:math:`` directive renamed to ``:mathmpl:``
es_es: La directiva ``:math:`` ha sido renombrada a ``:mathmpl:``

source: The ``:math:`` rst role provided by `matplotlib.sphinxext.mathmpl` has been renamed to ``:mathmpl:`` to avoid conflicting with the ``:math:`` role that Sphinx 1.8 provides by default. (``:mathmpl:`` uses Matplotlib to render math expressions to images embedded in html, whereas Sphinx uses MathJax.)
es_es: El rol ``:math:`` proporcionado por `matplotlib.sphinxext.mathmpl` ha sido renombrado a ``:mathmpl:`` para evitar conflictos con el rol ``:math:`` que Sphinx 1.8 proporciona por defecto. (``:mathmpl:`` utiliza Matplotlib para renderizar expresiones matemáticas en imágenes incrustadas en html, mientras que Sphinx utiliza MathJax)

source: When using Sphinx<1.8, both names (``:math:`` and ``:mathmpl:``) remain available for backwards-compatibility.
es_es: Cuando se utiliza Sphinx<1.8, ambos nombres (``:math:`` y ``:mathmpl:``) siguen estando disponibles por compatibilidad con versiones anteriores.
