Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/prev_whats_new/whats_new_2.1.0.po
Languages: es_es

source: What's new in Matplotlib 2.1.0 (Oct 7, 2017)
es_es: Novedades en Matplotlib 2.1.0 (7 de octubre de 2017)

source: Documentation
es_es: Documentación

source: The examples have been migrated to use `sphinx gallery <https://sphinx-gallery.readthedocs.io/en/latest/>`__. This allows better mixing of prose and code in the examples, provides links to download the examples as both a Python script and a Jupyter notebook, and improves the thumbnail galleries. The examples have been re-organized into :ref:`tutorials` and a :ref:`gallery`.
es_es: Los ejemplos han sido migrados para utilizar `sphinx gallery <https://sphinx-gallery.readthedocs.io/en/latest/>`__. Esto permite mezclar mejor la prosa y el código en los ejemplos, proporciona enlaces para descargar los ejemplos como un script de Python y un cuaderno de Jupyter, y mejora las galerías de miniaturas. Los ejemplos se han reorganizado en :ref:`tutorials` y una :ref:`gallery`.

source: Many docstrings and examples have been clarified and improved.
es_es: Se han aclarado y mejorado muchas cadenas de documentaciones y ejemplos.

source: New features
es_es: Nuevas características

source: String categorical values
es_es: Cadena de valores categóricos

source: All plotting functions now support string categorical values as input. For example:
es_es: Todas las funciones de graficación ahora soportan valores categóricos de cadena como entrada. Por ejemplo:

source: (`Source code <../../users/prev_whats_new/whats_new_2-1-0-1.py>`__, `png <../../users/prev_whats_new/whats_new_2-1-0-1.png>`__, `pdf <../../users/prev_whats_new/whats_new_2-1-0-1.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_2-1-0-1.py>`__, `png <../../users/prev_whats_new/whats_new_2-1-0-1.png>`__, `pdf <../../users/prev_whats_new/whats_new_2-1-0-1.pdf>`__)

source: Interactive JS widgets for animation
es_es: Widgets JS interactivos para la animación

source: Jake Vanderplas' JSAnimation package has been merged into Matplotlib. This adds to Matplotlib the `~matplotlib.animation.HTMLWriter` class for generating a JavaScript HTML animation, suitable for the IPython notebook. This can be activated by default by setting the ``animation.html`` rc parameter to ``jshtml``. One can also call the `~matplotlib.animation.Animation.to_jshtml` method to manually convert an animation. This can be displayed using IPython's ``HTML`` display class::
es_es: El paquete JSAnimation de Jake Vanderplas se ha fusionado con Matplotlib. Esto añade a Matplotlib la clase `~matplotlib.animation.HTMLWriter` para generar una animación HTML de JavaScript, adecuada para el cuaderno IPython. Esto puede ser activado por defecto estableciendo el parámetro rc ``animation.html`` a ``jshtml``. También se puede invocar el método `~matplotlib.animation.Animation.to_jshtml` para convertir manualmente una animación. Esto puede ser mostrado usando la clase de visualización ``HTML`` de IPython::

source: The `~matplotlib.animation.HTMLWriter` class can also be used to generate an HTML file by asking for the ``html`` writer.
es_es: La clase `~matplotlib.animation.HTMLWriter` también puede utilizarse para generar un archivo HTML solicitando el escritor ``html``.

source: Enhancements to polar plot
es_es: Mejoras en el gráfico polar

source: The polar axes transforms have been greatly re-factored to allow for more customization of view limits and tick labelling. Additional options for view limits allow for creating an annulus, a sector, or some combination of the two.
es_es: Las transformaciones de los ejes polares se han refactorizado en gran medida para permitir una mayor personalización de los límites de la vista y el etiquetado de tick. Las opciones adicionales para los límites de la vista permiten crear un círculo, un sector o una combinación de ambos.

source: The :meth:`~matplotlib.projections.polar.PolarAxes.set_rorigin` method may be used to provide an offset to the minimum plotting radius, producing an annulus.
es_es: El método :meth:`~matplotlib.projections.polar.PolarAxes.set_rorigin` se puede utilizar para proporcionar un desplazamiento al radio mínimo de trazado, produciendo un anillo.

source: The :meth:`~matplotlib.projections.polar.PolarAxes.set_theta_zero_location` method now has an optional :code:`offset` argument. This argument may be used to further specify the zero location based on the given anchor point.
es_es: El método :meth:`~matplotlib.projections.polar.PolarAxes.set_theta_zero_location` tiene ahora un argumento opcional :code:`offset`. Este argumento puede usarse para especificar más la ubicación del cero basándose en el punto de anclaje dado.

source: Polar Offset Demo
es_es: Demostración del desplazamiento polar

source: The :meth:`~matplotlib.projections.polar.PolarAxes.set_thetamin` and :meth:`~matplotlib.projections.polar.PolarAxes.set_thetamax` methods may be used to limit the range of angles plotted, producing sectors of a circle.
es_es: Los métodos :meth:`~matplotlib.projections.polar.PolarAxes.set_thetamin` y :meth:`~matplotlib.projections.polar.PolarAxes.set_thetamax` pueden utilizarse para limitar el rango de ángulos graficados, produciendo sectores de un círculo.

source: Polar Sector Demo
es_es: Demostración del Sector Polar

source: Previous releases allowed plots containing negative radii for which the negative values are simply used as labels, and the real radius is shifted by the configured minimum. This release also allows negative radii to be used for grids and ticks, which were previously silently ignored.
es_es: Las versiones anteriores permitían gráficos que contenían radios negativos para los cuales los valores negativos se utilizan simplemente como etiquetas, y el radio real se desplaza por el mínimo configurado. Esta versión también permite utilizar radios negativos para mallas y ticks, que antes se ignoraban silenciosamente.

source: Radial ticks have been modified to be parallel to the circular grid line, and angular ticks have been modified to be parallel to the grid line. It may also be useful to rotate tick *labels* to match the boundary. Calling ``ax.tick_params(rotation='auto')`` will enable the new behavior: radial tick labels will be parallel to the circular grid line, and angular tick labels will be perpendicular to the grid line (i.e., parallel to the outer boundary). Additionally, tick labels now obey the padding settings that previously only worked on Cartesian plots. Consequently, the ``frac`` argument to `.PolarAxes.set_thetagrids` is no longer applied. Tick padding can be modified with the ``pad`` argument to `.Axes.tick_params` or `.Axis.set_tick_params`.
es_es: Los ticks radiales se han modificado para que sean paralelos a la línea de la malla circular, y los angulares para que sean paralelos a la línea de la malla. También puede ser útil rotar las *etiquetas* de los ticks para que coincidan con el límite. Invocando ``ax.tick_params(rotation='auto')`` se activará el nuevo comportamiento: las etiquetas de los ticks radiales serán paralelas a la línea de la malla circular, y las etiquetas de los ticks angulares serán perpendiculares a la línea de la malla (es decir, paralelas al límite exterior). Además, las etiquetas de la marca del eje ahora obedecen a los ajustes de relleno que antes sólo funcionaban en los gráficos cartesianos. En consecuencia, el argumento ``frac`` para `.PolarAxes.set_thetagrids` ya no se aplica. El relleno de las marcas puede modificarse con el argumento ``pad`` de `.Axes.tick_params` o `.Axis.set_tick_params`.

source: ``Figure`` class now has ``subplots`` method
es_es: La clase ``Figure`` ahora tiene el método ``subplots``

source: The :class:`~matplotlib.figure.Figure` class now has a :meth:`~matplotlib.figure.Figure.subplots` method which behaves the same as :func:`.pyplot.subplots` but on an existing figure.
es_es: La clase :class:`~matplotlib.figure.Figure` tiene ahora un método :meth:`~matplotlib.figure.Figure.subplots` que se comporta igual que :func:`.pyplot.subplots` pero sobre una figura existente.

source: Metadata savefig keyword argument
es_es: Argumento de la palabra clave savefig de los metadatos

source: :func:`~matplotlib.pyplot.savefig` now accepts ``metadata`` as a keyword argument. It can be used to store key/value pairs in the image metadata.
es_es: :func:`~matplotlib.pyplot.savefig` ahora acepta ``metadata`` como argumento de palabra clave. Se puede utilizar para almacenar pares clave/valor en los metadatos de la imagen.

source: 'png' with Agg backend
es_es: 'png' con Agg backend

source: 'pdf' with PDF backend (see :func:`~matplotlib.backends.backend_pdf.PdfFile.writeInfoDict` for a list of supported keywords)
es_es: 'pdf' con backend PDF (ver :func:`~matplotlib.backends.backend_pdf.PdfFile.writeInfoDict` para una lista de palabras clave soportadas)

source: 'eps' and 'ps' with PS backend (only 'Creator' key is accepted)
es_es: 'eps' y 'ps' con backend PS (sólo se acepta la clave 'Creator')

source: The interactive GUI backends will now change the cursor to busy when Matplotlib is rendering the canvas.
es_es: Los backends de la IGU interactiva ahora cambiarán el cursor a ocupado cuando Matplotlib esté renderizando el lienzo.

source: A :class:`~matplotlib.widgets.PolygonSelector` class has been added to :mod:`matplotlib.widgets`. See :doc:`/gallery/widgets/polygon_selector_demo` for details.
es_es: Se ha añadido una clase :class:`~matplotlib.widgets.PolygonSelector` a :mod:`matplotlib.widgets`. Ver :doc:`/gallery/widgets/polygon_selector_demo` para más detalles.

source: Added `matplotlib.ticker.PercentFormatter`
es_es: Se ha añadido `matplotlib.ticker.PercentFormatter`

source: The new `~matplotlib.ticker.PercentFormatter` formatter has some nice features like being able to convert from arbitrary data scales to percents, a customizable percent symbol and either automatic or manual control over the decimal points.
es_es: El nuevo formateador `~matplotlib.ticker.PercentFormatter` tiene algunas características interesantes como poder convertir de escalas de datos arbitrarias a porcentajes, un símbolo de porcentaje personalizable y control automático o manual sobre los puntos decimales.

source: Reproducible PS, PDF and SVG output
es_es: Resultados reproducibles en PS, PDF y SVG

source: The ``SOURCE_DATE_EPOCH`` environment variable can now be used to set the timestamp value in the PS and PDF outputs. See `source date epoch <https://reproducible-builds.org/specs/source-date-epoch/>`__.
es_es: La variable de entorno ``SOURCE_DATE_EPOCH`` puede utilizarse ahora para establecer el valor de la marca de tiempo en las salidas PS y PDF. Ver `source date epoch <https://reproducible-builds.org/specs/source-date-epoch/>`__.

source: Alternatively, calling ``savefig`` with ``metadata={'CreationDate': None}`` will omit the timestamp altogether for the PDF backend.
es_es: Alternativamente, invocar ``savefig`` con ``metadata={'CreationDate': None}`` omitirá la marca de tiempo para el backend del PDF.

source: The reproducibility of the output from the PS and PDF backends has so far been tested using various plot elements but only default values of options such as ``{ps,pdf}.fonttype`` that can affect the output at a low level, and not with the mathtext or usetex features. When Matplotlib calls external tools (such as PS distillers or LaTeX) their versions need to be kept constant for reproducibility, and they may add sources of nondeterminism outside the control of Matplotlib.
es_es: La reproducibilidad de la salida de los backends PS y PDF ha sido probada hasta ahora usando varios elementos de gráficos pero sólo los valores por defecto de opciones como ``{ps,pdf}.fonttype`` que pueden afectar a la salida a bajo nivel, y no con las características mathtext o usetex. Cuando Matplotlib invoca herramientas externas (como destiladores PS o LaTeX) sus versiones deben mantenerse constantes para la reproducibilidad, y pueden añadir fuentes de no determinación fuera del control de Matplotlib.

source: For SVG output, the ``svg.hashsalt`` rc parameter has been added in an earlier release. This parameter changes some random identifiers in the SVG file to be deterministic. The downside of this setting is that if more than one file is generated using deterministic identifiers and they end up as parts of one larger document, the identifiers can collide and cause the different parts to affect each other.
es_es: Para la salida de SVG, se ha añadido el parámetro rc ``svg.hashsalt`` en una versión anterior. Este parámetro cambia algunos identificadores aleatorios en el archivo SVG para que sean deterministas. La desventaja de este parámetro es que si se genera más de un archivo utilizando identificadores deterministas y terminan como partes de un documento más grande, los identificadores pueden colisionar y hacer que las diferentes partes se afecten entre sí.

source: These features are now enabled in the tests for the PDF and SVG backends, so most test output files (but not all of them) are now deterministic.
es_es: Estas características están ahora activadas en las pruebas para los backends PDF y SVG, por lo que la mayoría de los archivos de salida de las pruebas (pero no todos) son ahora deterministas.

source: Orthographic projection for mplot3d
es_es: Proyección ortográfica para mplot3d

source: :class:`~mpl_toolkits.mplot3d.axes3d.Axes3D` now accepts ``proj_type`` keyword argument and has a method :meth:`~mpl_toolkits.mplot3d.axes3d.Axes3D.set_proj_type`. The default option is ``'persp'`` as before, and supplying ``'ortho'`` enables orthographic view.
es_es: :class:`~mpl_toolkits.mplot3d.axes3d.Axes3D` ahora acepta el argumento de palabra clave ``proj_type`` y tiene un método :meth:`~mpl_toolkits.mplot3d.axes3d.Axes3D.set_proj_type`. La opción por defecto es ``'persp'`` como antes, y suministrando ``'ortho'`` se activa la vista ortográfica.

source: Compare the z-axis which is vertical in orthographic view, but slightly skewed in the perspective view.
es_es: Compara el eje z, que es vertical en la vista ortográfica, pero ligeramente sesgado en la vista en perspectiva.

source: (`Source code <../../users/prev_whats_new/whats_new_2-1-0-2.py>`__, `png <../../users/prev_whats_new/whats_new_2-1-0-2.png>`__, `pdf <../../users/prev_whats_new/whats_new_2-1-0-2.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_2-1-0-2.py>`__, `png <../../users/prev_whats_new/whats_new_2-1-0-2.png>`__, `pdf <../../users/prev_whats_new/whats_new_2-1-0-2.pdf>`__)

source: ``voxels`` function for mplot3d
es_es: Función ``voxels`` para mplot3d

source: :class:`~mpl_toolkits.mplot3d.axes3d.Axes3D` now has a `~mpl_toolkits.mplot3d.axes3d.Axes3D.voxels` method, for visualizing boolean 3D data. Uses could include plotting a sparse 3D heat map, or visualizing a volumetric model.
es_es: :class:`~mpl_toolkits.mplot3d.axes3d.Axes3D` tiene ahora un método `~mpl_toolkits.mplot3d.axes3d.Axes3D.voxels`, para visualizar datos booleanos en 3D. Los usos podrían incluir el trazado de un mapa de calor 3D disperso, o la visualización de un modelo volumétrico.

source: Voxel Demo
es_es: Demo de Voxel

source: Improvements
es_es: Mejoras

source: CheckButtons widget ``get_status`` function
es_es: Función ``get_status`` del widget CheckButtons

source: A :func:`~matplotlib.widgets.CheckButtons.get_status` method has been added to the :class:`matplotlib.widgets.CheckButtons` class. This ``get_status`` method allows user to query the status (True/False) of all of the buttons in the ``CheckButtons`` object.
es_es: Se ha añadido un método :func:`~matplotlib.widgets.CheckButtons.get_status` a la clase :class:`matplotlib.widgets.CheckButtons`. Este método ``get_status`` permite al usuario consultar el estado (Verdadero/Falso) de todos los botones del objeto ``CheckButtons``.

source: Add ``fill_bar`` argument to ``AnchoredSizeBar``
es_es: Añadir el argumento ``fill_bar`` a ``AnchoredSizeBar``

source: The ``mpl_toolkits`` class :class:`~mpl_toolkits.axes_grid1.anchored_artists.AnchoredSizeBar` now has an additional ``fill_bar`` argument, which makes the size bar a solid rectangle instead of just drawing the border of the rectangle. The default is ``None``, and whether or not the bar will be filled by default depends on the value of ``size_vertical``. If ``size_vertical`` is nonzero, ``fill_bar`` will be set to ``True``. If ``size_vertical`` is zero then ``fill_bar`` will be set to ``False``. If you wish to override this default behavior, set ``fill_bar`` to ``True`` or ``False`` to unconditionally always or never use a filled patch rectangle for the size bar.
es_es: La clase ``mpl_toolkits`` :class:`~mpl_toolkits.axes_grid1.anchored_artists.AnchoredSizeBar` ahora tiene un argumento adicional ``fill_bar``, que hace que la barra de tamaño sea un rectángulo sólido en lugar de dibujar sólo el borde del rectángulo. El valor por defecto es ``None``, y si la barra se rellena o no por defecto depende del valor de ``size_vertical``. Si ``size_vertical`` es distinto de cero, ``fill_bar`` se establecerá como ``True``. Si ``size_vertical`` es cero, ``fill_bar`` se establecerá en ``False``. Si deseas anular este comportamiento por defecto, establece ``fill_bar`` como ``True`` o ``False`` para utilizar incondicionalmente siempre o nunca un rectángulo de parche relleno para la barra de tamaño.

source: (`Source code <../../users/prev_whats_new/whats_new_2-1-0-3.py>`__, `png <../../users/prev_whats_new/whats_new_2-1-0-3.png>`__, `pdf <../../users/prev_whats_new/whats_new_2-1-0-3.pdf>`__)
es_es: (`Código fuente <../../users/prev_whats_new/whats_new_2-1-0-3.py>`__, `png <../../users/prev_whats_new/whats_new_2-1-0-3.png>`__, `pdf <../../users/prev_whats_new/whats_new_2-1-0-3.pdf>`__)

source: Annotation can use a default arrow style
es_es: La anotación puede utilizar un estilo de flecha por defecto

source: Annotations now use the default arrow style when setting ``arrowprops={}``, rather than no arrow (the new behavior actually matches the documentation).
es_es: Las anotaciones ahora utilizan el estilo de flecha por defecto cuando se establece ``arrowprops={}``, en lugar de ninguna flecha (el nuevo comportamiento corresponde con la documentación).

source: Barbs and Quiver Support Dates
es_es: Fechas de soporte Barbs y Quiver

source: When using the :func:`~matplotlib.axes.Axes.quiver` and :func:`~matplotlib.axes.Axes.barbs` plotting methods, it is now possible to pass dates, just like for other methods like :func:`~matplotlib.axes.Axes.plot`. This also allows these functions to handle values that need unit-conversion applied.
es_es: Al utilizar los métodos de graficado :func:`~matplotlib.axes.Axes.quiver` y :func:`~matplotlib.axes.Axes.barbs`, ahora es posible pasar fechas, al igual que para otros métodos como :func:`~matplotlib.axes.Axes.plot`. Esto también permite que estas funciones manejen valores que necesitan que se les aplique la conversión de unidades.

source: Hexbin default line color
es_es: Color de línea por defecto de Hexbin

source: The default ``linecolor`` keyword argument for :func:`~matplotlib.axes.Axes.hexbin` is now ``'face'``, and supplying ``'none'`` now prevents lines from being drawn around the hexagons.
es_es: El argumento por defecto de la palabra clave ``linecolor`` para :func:`~matplotlib.axes.Axes.hexbin` es ahora ``'face'``, y suministrar ``'none'`` evita que se dibujen líneas alrededor de los hexágonos.

source: Figure.legend() can be called without arguments
es_es: Figure.legend() puede invocarse sin argumentos

source: Calling :meth:`.Figure.legend` can now be done with no arguments. In this case a legend will be created that contains all the artists on all the axes contained within the figure.
es_es: Invocar :meth:`.Figura.leyenda` puede hacerse ahora sin argumentos. En este caso se creará una leyenda que contiene todos los artists en todos los ejes contenidos en la figura.

source: Multiple legend keys for legend entries
es_es: Múltiples claves de leyenda para las entradas de leyenda

source: A legend entry can now contain more than one legend key. The extended `~matplotlib.legend_handler.HandlerTuple` class now accepts two parameters: ``ndivide`` divides the legend area in the specified number of sections; ``pad`` changes the padding between the legend keys.
es_es: Una entrada de leyenda ahora puede contener más de una clave de leyenda. La clase extendida `~matplotlib.legend_handler.HandlerTuple` acepta ahora dos parámetros: ``ndivide`` divide el área de la leyenda en el número especificado de secciones; ``pad`` cambia el relleno entre las claves de la leyenda.

source: Multiple Legend Keys
es_es: Múltiples claves de leyenda

source: New parameter *clear* for :func:`~matplotlib.pyplot.figure`
es_es: Nuevo parámetro *clear* para :func:`~matplotlib.pyplot.figure`

source: When the pyplot's function :func:`~matplotlib.pyplot.figure` is called with a ``num`` parameter, a new window is only created if no existing window with the same value exists. A new bool parameter *clear* was added for explicitly clearing its existing contents. This is particularly useful when utilized in interactive sessions. Since :func:`~matplotlib.pyplot.subplots` also accepts keyword arguments from :func:`~matplotlib.pyplot.figure`, it can also be used there::
es_es: Cuando se invoca la función de pyplot :func:`~matplotlib.pyplot.figure` con un parámetro ``num``, sólo se crea una nueva ventana si no existe ninguna con el mismo valor. Se ha añadido un nuevo parámetro bool *clear* para borrar explícitamente el contenido existente. Esto es particularmente útil cuando se utiliza en sesiones interactivas. Dado que :func:`~matplotlib.pyplot.subplots` también acepta argumentos de palabra clave de :func:`~matplotlib.pyplot.figure`, también puede utilizarse allí::

source: Specify minimum value to format as scalar for ``LogFormatterMathtext``
es_es: Especifica el valor mínimo a formatear como escalar para ``LogFormatterMathtext``

source: :class:`~matplotlib.ticker.LogFormatterMathtext` now includes the option to specify a minimum value exponent to format as a scalar (i.e., 0.001 instead of 10\ :sup:`-3`).
es_es: :class:`~matplotlib.ticker.LogFormatterMathtext` incluye ahora la opción de especificar un exponente de valor mínimo para formatear como escalar (es decir, 0,001 en lugar de 10\ :sup:`-3`).

source: New quiverkey angle keyword argument
es_es: Nuevo argumento de la palabra clave quiverkey angle

source: Plotting a :func:`~matplotlib.axes.Axes.quiverkey` now admits the ``angle`` keyword argument, which sets the angle at which to draw the key arrow.
es_es: El graficado de una :func:`~matplotlib.axes.Axes.quiverkey` admite ahora el argumento de la palabra clave ``angle``, que establece el ángulo con el que se dibujará la flecha clave.

source: Colormap reversed method
es_es: Método de inversión del mapa de colores

source: The methods :meth:`matplotlib.colors.LinearSegmentedColormap.reversed` and :meth:`matplotlib.colors.ListedColormap.reversed` return a reversed instance of the Colormap. This implements a way for any Colormap to be reversed.
es_es: Los métodos :meth:`matplotlib.colors.LinearSegmentedColormap.reversed` y :meth:`matplotlib.colors.ListedColormap.reversed` devuelven una instancia invertida del Colormap. Esto implementa una forma de invertir cualquier Colormap.

source: `.artist.setp` (and `.pyplot.setp`) accept a *file* argument
es_es: `.artist.setp` (y `.pyplot.setp`) aceptan un argumento *file*

source: The argument is keyword-only. It allows an output file other than `sys.stdout` to be specified. It works exactly like the *file* argument to `print`.
es_es: El argumento es sólo de palabra clave. Permite especificar un archivo de salida distinto de `sys.stdout`. Funciona exactamente como el argumento *file* de `print`.
