Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/pie_and_polar_charts/nested_pie.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_pie_and_polar_charts_nested_pie.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_pie_and_polar_charts_nested_pie.py>` para descargar el código de ejemplo completo

source: Nested pie charts
es_es: Gráficos circulares anidados

source: The following examples show two ways to build a nested pie chart in Matplotlib. Such charts are often referred to as donut charts.
es_es: Los siguientes ejemplos muestran dos formas de construir un gráfico circular anidado en Matplotlib. Este tipo de gráficos suelen denominarse gráficos de donuts.

source: The most straightforward way to build a pie chart is to use the `~matplotlib.axes.Axes.pie` method.
es_es: La forma más sencilla de construir un gráfico de tarta es utilizar el método `~matplotlib.axes.Axes.pie`.

source: In this case, pie takes values corresponding to counts in a group. We'll first generate some fake data, corresponding to three groups. In the inner circle, we'll treat each number as belonging to its own group. In the outer circle, we'll plot them as members of their original 3 groups.
es_es: En este caso, pie toma los valores correspondientes a los recuentos en un grupo. Primero generaremos unos datos falsos, correspondientes a tres grupos. En el círculo interior, trataremos cada número como perteneciente a su propio grupo. En el círculo exterior, los representaremos como miembros de sus 3 grupos originales.

source: The effect of the donut shape is achieved by setting a ``width`` to the pie's wedges through the *wedgeprops* argument.
es_es: El efecto de la forma de donut se consigue estableciendo un ``ancho`` a las cuñas del pastel a través del argumento *wedgeprops*.

source: However, you can accomplish the same output by using a bar plot on axes with a polar coordinate system. This may give more flexibility on the exact design of the plot.
es_es: Sin embargo, puede conseguir el mismo resultado utilizando un gráfico de barras en los ejes con un sistema de coordenadas polares. Esto puede dar más flexibilidad en el diseño exacto de la trama.

source: In this case, we need to map x-values of the bar chart onto radians of a circle. The cumulative sum of the values are used as the edges of the bars.
es_es: En este caso, necesitamos mapear los valores x del gráfico de barras en radianes de un círculo. La suma acumulada de los valores se utiliza como los bordes de las barras.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: nested_pie.py <nested_pie.py>`
es_es: :download:`Descarga el código fuente de Python: nested_pie.py <nested_pie.py>`

source: :download:`Download Jupyter notebook: nested_pie.ipynb <nested_pie.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: nested_pie.ipynb <nested_pie.ipynb>`
