Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/pie_and_polar_charts/pie_features.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_pie_and_polar_charts_pie_features.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_pie_and_polar_charts_pie_features.py>` para descargar el código completo del ejemplo

source: Basic pie chart
es_es: Gráfico de tarta básico

source: Demo of a basic pie chart plus a few additional features.
es_es: Demo de un gráfico de tarta básico más algunas características adicionales.

source: In addition to the basic pie chart, this demo shows a few optional features:
es_es: Además del gráfico de tarta básico, esta demo muestra algunas características opcionales:

source: slice labels
es_es: etiquetas de las rebanadas

source: auto-labeling the percentage
es_es: autoetiquetado del porcentaje

source: offsetting a slice with "explode"
es_es: desplazamiento de una rebanada con "explotar"

source: custom start angle
es_es: ángulo de inicio personalizado

source: Note about the custom start angle:
es_es: Nota sobre el ángulo de inicio personalizado:

source: The default ``startangle`` is 0, which would start the "Frogs" slice on the positive x-axis. This example sets ``startangle = 90`` such that everything is rotated counter-clockwise by 90 degrees, and the frog slice starts on the positive y-axis.
es_es: El valor por defecto de ``startangle`` es 0, lo que iniciaría la rebanada "Ranas" en el eje x positivo. Este ejemplo establece ``startangle = 90`` de tal manera que todo se gira 90 grados en sentido contrario a las agujas del reloj, y la rebanada de rana comienza en el eje Y positivo.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: pie_features.py <pie_features.py>`
es_es: :download:`Descarga el código fuente de Python: pie_features.py <pie_features.py>`

source: :download:`Download Jupyter notebook: pie_features.ipynb <pie_features.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: pie_features.ipynb <pie_features.ipynb>`
