Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/pie_and_polar_charts/polar_scatter.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_pie_and_polar_charts_polar_scatter.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_pie_and_polar_charts_polar_scatter.py>` para descargar el código de ejemplo completo

source: Scatter plot on polar axis
es_es: Gráfico de dispersión en el eje polar

source: Size increases radially in this example and color increases with angle (just to verify the symbols are being scattered correctly).
es_es: El tamaño aumenta radialmente en este ejemplo y el color aumenta con el ángulo (sólo para verificar que los símbolos se dispersan correctamente).

source: Scatter plot on polar axis, with offset origin
es_es: Gráfico de dispersión en el eje polar, con origen desplazado

source: The main difference with the previous plot is the configuration of the origin radius, producing an annulus. Additionally, the theta zero location is set to rotate the plot.
es_es: La principal diferencia con el trazado anterior es la configuración del radio del origen, generando un círculo. Además, la ubicación del cero de theta se establece para girar la parcela.

source: Scatter plot on polar axis confined to a sector
es_es: Gráfico de dispersión en el eje polar confinado en un sector

source: The main difference with the previous plots is the configuration of the theta start and end limits, producing a sector instead of a full circle.
es_es: La principal diferencia con los gráficos anteriores es la configuración de los límites inicial y final de theta, generando un sector en lugar de un círculo completo.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.271 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.271 segundos)

source: :download:`Download Python source code: polar_scatter.py <polar_scatter.py>`
es_es: :download:`Descargar el código fuente de Python: polar_scatter.py <polar_scatter.py>`

source: :download:`Download Jupyter notebook: polar_scatter.ipynb <polar_scatter.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: polar_scatter.ipynb <polar_scatter.ipynb>`
