Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/misc/cursor_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_misc_cursor_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_misc_cursor_demo.py>` para descargar el código de ejemplo completo

source: Cross hair cursor
es_es: Cursor en forma de cruz

source: This example adds a cross hair as a data cursor. The cross hair is implemented as regular line objects that are updated on mouse move.
es_es: Este ejemplo añade una cruceta como cursor de datos. La cruceta se implementa como objetos de línea regulares que se actualizan al mover el ratón.

source: We show three implementations:
es_es: Mostramos tres implementaciones:

source: A simple cursor implementation that redraws the figure on every mouse move. This is a bit slow and you may notice some lag of the cross hair movement.
es_es: Una implementación simple del cursor que redibuja la figura en cada movimiento del ratón. Esto es un poco lento y puedes notar algo de retraso en el movimiento de la cruz.

source: A cursor that uses blitting for speedup of the rendering.
es_es: Un cursor que utiliza el blitting para acelerar el renderizado.

source: A cursor that snaps to data points.
es_es: Un cursor que se ajusta a los puntos de datos.

source: Faster cursoring is possible using native GUI drawing, as in :doc:`/gallery/user_interfaces/wxcursor_demo_sgskip`.
es_es: Es posible realizar un cursor más rápido utilizando el dibujo nativo de la GUI, como en :doc:`/gallery/user_interfaces/wxcursor_demo_sgskip`.

source: The mpldatacursor__ and mplcursors__ third-party packages can be used to achieve a similar effect.
es_es: Los paquetes de terceros mpldatacursor__ y mplcursors__ pueden utilizarse para conseguir un efecto similar.

source: Out:
es_es: Salida:

source: Faster redrawing using blitting
es_es: Redibujo más rápido usando blitting

source: This technique stores the rendered plot as a background image. Only the changed artists (cross hair lines and text) are rendered anew. They are combined with the background using blitting.
es_es: Esta técnica almacena el gráfico renderizado como imagen de fondo. Sólo los artists modificados (líneas de cruces y texto) se renderizan de nuevo. Se combinan con el fondo utilizando el blitting.

source: This technique is significantly faster. It requires a bit more setup because the background has to be stored without the cross hair lines (see ``create_new_background()``). Additionally, a new background has to be created whenever the figure changes. This is achieved by connecting to the ``'draw_event'``.
es_es: Esta técnica es significativamente más rápida. Requiere un poco más de configuración porque el fondo tiene que ser almacenado sin las líneas del pelo cruzado (ver ``create_new_background()``). Además, hay que crear un nuevo fondo cada vez que la figura cambia. Esto se consigue conectando con el ``'draw_event``.

source: Snapping to data points
es_es: Ajustar a los puntos de datos

source: The following cursor snaps its position to the data points of a `.Line2D` object.
es_es: El siguiente cursor ajusta su posición a los puntos de datos de un objeto `.Line2D`.

source: To save unnecessary redraws, the index of the last indicated data point is saved in ``self._last_index``. A redraw is only triggered when the mouse moves far enough so that another data point must be selected. This reduces the lag due to many redraws. Of course, blitting could still be added on top for additional speedup.
es_es: Para ahorrar redibujos innecesarios, el índice del último punto de datos indicado se guarda en ``self._last_index``. Un redibujo sólo se activa cuando el ratón se mueve lo suficientemente lejos como para que otro punto de datos deba ser seleccionado. Esto reduce el retraso debido a muchos redibujos. Por supuesto, se puede añadir el blitting para aumentar la velocidad.

source: **Total running time of the script:** ( 0 minutes 1.161 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.161 segundos)

source: :download:`Download Python source code: cursor_demo.py <cursor_demo.py>`
es_es: :download:`Descargar el código fuente de Python: cursor_demo.py <cursor_demo.py>`

source: :download:`Download Jupyter notebook: cursor_demo.ipynb <cursor_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: cursor_demo.ipynb <cursor_demo.ipynb>`
