Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/misc/multiprocess_sgskip.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_misc_multiprocess_sgskip.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_misc_multiprocess_sgskip.py>` para descargar el código de ejemplo completo

source: Multiprocess
es_es: Multiproceso

source: Demo of using multiprocessing for generating data in one process and plotting in another.
es_es: Demostración del uso del multiproceso para generar datos en un proceso y graficar en otro.

source: Written by Robert Cimrman
es_es: Escrito por Robert Cimrman

source: Processing Class
es_es: Clase de procesamiento

source: This class plots data it receives from a pipe.
es_es: Esta clase traza los datos que recibe de una tubería.

source: Plotting class
es_es: Clase de trazado

source: This class uses multiprocessing to spawn a process to run code from the class above. When initialized, it creates a pipe and an instance of ``ProcessPlotter`` which will be run in a separate process.
es_es: Esta clase utiliza el multiprocesamiento para generar un proceso que ejecute el código de la clase anterior. Cuando se inicializa, crea una tubería y una instancia de ``ProcessPlotter`` que se ejecutará en un proceso separado.

source: When run from the command line, the parent process sends data to the spawned process which is then plotted via the callback function specified in ``ProcessPlotter:__call__``.
es_es: Cuando se ejecuta desde la línea de comandos, el proceso padre envía los datos al proceso generado, que se trazan a través de la función de devolución de llamada especificada en ``ProcessPlotter:__call__``.

source: :download:`Download Python source code: multiprocess_sgskip.py <multiprocess_sgskip.py>`
es_es: :download:`Descarga el código fuente de Python: multiprocess_sgskip.py <multiprocess_sgskip.py>`

source: :download:`Download Jupyter notebook: multiprocess_sgskip.ipynb <multiprocess_sgskip.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: multiprocess_sgskip.ipynb <multiprocess_sgskip.ipynb>`
