Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/misc/pythonic_matplotlib.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_misc_pythonic_matplotlib.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_misc_pythonic_matplotlib.py>` para descargar el código de ejemplo completo

source: Some people prefer to write more pythonic, object-oriented code rather than use the pyplot interface to matplotlib. This example shows you how.
es_es: Algunas personas prefieren escribir un código más pitónico y orientado a objetos en lugar de utilizar la interfaz pyplot de matplotlib. Este ejemplo le muestra cómo.

source: Unless you are an application developer, I recommend using part of the pyplot interface, particularly the figure, close, subplot, axes, and show commands. These hide a lot of complexity from you that you don't need to see in normal figure creation, like instantiating DPI instances, managing the bounding boxes of the figure elements, creating and realizing GUI windows and embedding figures in them.
es_es: A menos que seas un desarrollador de aplicaciones, te recomiendo que utilices parte de la interfaz de pyplot, particularmente los comandos figure, close, subplot, axes y show. Estos te ocultan mucha complejidad que no necesitas ver en la creación normal de figuras, como la instanciación de instancias DPI, la gestión de los cuadros delimitadores de los elementos de la figura, la creación y realización de ventanas GUI y la incrustación de figuras en ellas.

source: If you are an application developer and want to embed matplotlib in your application, follow the lead of examples/embedding_in_wx.py, examples/embedding_in_gtk.py or examples/embedding_in_tk.py. In this case you will want to control the creation of all your figures, embedding them in application windows, etc.
es_es: Si eres un desarrollador de aplicaciones y quieres incrustar matplotlib en tu aplicación, sigue el ejemplo de examples/embedding_in_wx.py, examples/embedding_in_gtk.py o examples/embedding_in_tk.py. En este caso querrás controlar la creación de todas tus figuras, incrustándolas en las ventanas de la aplicación, etc.

source: If you are a web application developer, you may want to use the example in webapp_demo.py, which shows how to use the backend agg figure canvas directly, with none of the globals (current figure, current axes) that are present in the pyplot interface. Note that there is no reason why the pyplot interface won't work for web application developers, however.
es_es: Si eres un desarrollador de aplicaciones web, puede que quieras usar el ejemplo en webapp_demo.py, que muestra cómo usar el lienzo de figuras agg del backend directamente, sin ninguno de los globales (figura actual, ejes actuales) que están presentes en la interfaz de pyplot. Ten en cuenta que no hay ninguna razón por la que la interfaz de pyplot no funcione para los desarrolladores de aplicaciones web, sin embargo.

source: If you see an example in the examples dir written in pyplot interface, and you want to emulate that using the true python method calls, there is an easy mapping. Many of those examples use 'set' to control figure properties. Here's how to map those commands onto instance methods
es_es: Si ves un ejemplo en el dir de ejemplos escrito en la interfaz de pyplot, y quieres emularlo usando las verdaderas llamadas a métodos de python, hay un mapeo fácil. Muchos de esos ejemplos utilizan 'set' para controlar las propiedades de las figuras. Así es como se mapean esos comandos en métodos de instancia

source: The syntax of set is::
es_es: La sintaxis de set es::

source: if called with an object, set calls::
es_es: si se llama con un objeto, se llama a set::

source: if called with a sequence, set does::
es_es: si se llama con una secuencia, set hace::

source: So for your example, if a is your axes object, you can do::
es_es: Así que para tu ejemplo, si a es tu objeto ejes, puedes hacer::

source: :download:`Download Python source code: pythonic_matplotlib.py <pythonic_matplotlib.py>`
es_es: :download:`Descarga el código fuente de Python: pythonic_matplotlib.py <pythonic_matplotlib.py>`

source: :download:`Download Jupyter notebook: pythonic_matplotlib.ipynb <pythonic_matplotlib.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: pythonic_matplotlib.ipynb <pythonic_matplotlib.ipynb>`
