Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/misc/rasterization_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_misc_rasterization_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_misc_rasterization_demo.py>` para descargar el código de ejemplo completo

source: Rasterization for vector graphics
es_es: Rasterización para gráficos vectoriales

source: Rasterization converts vector graphics into a raster image (pixels). It can speed up rendering and produce smaller files for large data sets, but comes at the cost of a fixed resolution.
es_es: La rasterización convierte los gráficos vectoriales en una imagen rasterizada (píxeles). Puede acelerar el renderizado y generar archivos más pequeños para grandes conjuntos de datos, pero tiene el coste de una resolución fija.

source: Whether rasterization should be used can be specified per artist. This can be useful to reduce the file size of large artists, while maintaining the advantages of vector graphics for other artists such as the axes and text. For instance a complicated `~.Axes.pcolormesh` or `~.Axes.contourf` can be made significantly simpler by rasterizing. Setting rasterization only affects vector backends such as PDF, SVG, or PS.
es_es: Se puede especificar si se debe utilizar la rasterización por artist. Esto puede ser útil para reducir el tamaño del archivo de los artistas grandes, manteniendo las ventajas de los gráficos vectoriales para otros artistas como los ejes y el texto. Por ejemplo, un complicado `~.Axes.pcolormesh` o `~.Axes.contourf` puede simplificarse significativamente mediante la rasterización. La configuración de la rasterización sólo afecta a los backends vectoriales como PDF, SVG o PS.

source: Rasterization is disabled by default. There are two ways to enable it, which can also be combined:
es_es: La rasterización está desactivada por defecto. Hay dos formas de habilitarla, que también se pueden combinar:

source: Set `~.Artist.set_rasterized` on individual artists, or use the keyword argument *rasterized* when creating the artist.
es_es: Establece `~.Artist.set_rasterized` en artistas individuales, o utiliza el argumento de la palabra clave *rasterized* al crear el artista.

source: Set `.Axes.set_rasterization_zorder` to rasterize all artists with a zorder less than the given value.
es_es: Establece `.Axes.set_rasterization_zorder` para rasterizar todos los artists con un zorder menor que el valor dado.

source: The storage size and the resolution of the rasterized artist is determined by its physical size and the value of the ``dpi`` parameter passed to `~.Figure.savefig`.
es_es: El tamaño de almacenamiento y la resolución del artista rasterizado se determina por su tamaño físico y el valor del parámetro ``dpi`` pasado a `~.Figure.savefig`.

source: The image of this example shown in the HTML documentation is not a vector graphic. Therefore, it cannot illustrate the rasterization effect. Please run this example locally and check the generated graphics files.
es_es: La imagen de este ejemplo mostrada en la documentación HTML no es un gráfico vectorial. Por lo tanto, no puedes ilustrar el efecto de rasterización. Por favor, ejecuta este ejemplo localmente y comprueba los archivos gráficos generados.

source: Out:
es_es: Salida:

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 2.703 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2.703 segundos)

source: :download:`Download Python source code: rasterization_demo.py <rasterization_demo.py>`
es_es: :download:`Descarga el código fuente de Python: rasterization_demo.py <rasterization_demo.py>`

source: :download:`Download Jupyter notebook: rasterization_demo.ipynb <rasterization_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: rasterization_demo.ipynb <rasterization_demo.ipynb>`
