Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/misc/set_and_get.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_misc_set_and_get.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_misc_set_and_get.py>` para descargar el código de ejemplo completo

source: Set and get properties
es_es: Establecer y obtener propiedades

source: The pyplot interface allows you to use ``setp`` and ``getp`` to set and get object properties respectively, as well as to do introspection on the object.
es_es: La interfaz de pyplot permite utilizar ``setp`` y ``getp`` para establecer y obtener propiedades del objeto respectivamente, así como para hacer introspección sobre el objeto.

source: Setting with ``setp``
es_es: Configuración con ``setp``

source: To set the linestyle of a line to be dashed, you use ``setp``::
es_es: Para establecer que el estilo de línea de una línea sea discontinuo, se utiliza ``setp``::

source: If you want to know the valid types of arguments, you can provide the name of the property you want to set without a value::
es_es: Si quieres conocer los tipos de argumentos válidos, puedes proporcionar el nombre de la propiedad que quieres establecer sin un valor::

source: If you want to see all the properties that can be set, and their possible values, you can do::
es_es: Si quieres ver todas las propiedades que se pueden establecer, y sus posibles valores, puedes hacer::

source: ``setp`` operates on a single instance or a list of instances. If you are in query mode introspecting the possible values, only the first instance in the sequence is used. When actually setting values, all the instances will be set. For example, suppose you have a list of two lines, the following will make both lines thicker and red::
es_es: ``setp`` opera sobre una única instancia o una lista de instancias. Si está en modo de consulta introspección de los posibles valores, sólo se utiliza la primera instancia de la secuencia. Cuando se establecen los valores, se establecen todas las instancias. Por ejemplo, imagínate que tienes una lista de dos líneas, lo siguiente hará que ambas líneas sean más gruesas y rojas::

source: Getting with ``getp``
es_es: Obteniendo con ``getp``

source: ``getp`` returns the value of a given attribute. You can use it to query the value of a single attribute::
es_es: ``getp`` devuelve el valor de un atributo dado. Se puede utilizar para consultar el valor de un solo atributo::

source: or all the attribute/value pairs::
es_es: o todos los pares atributo/valor::

source: To reduce keystrokes in interactive mode, a number of properties have short aliases, e.g., 'lw' for 'linewidth' and 'mec' for 'markeredgecolor'. When calling set or get in introspection mode, these properties will be listed as 'fullname' or 'aliasname'.
es_es: Para reducir las pulsaciones en el modo interactivo, algunas propiedades tienen alias cortos, por ejemplo, "lw" para "linewidth" y "mec" para "markeredgecolor". Al llamar a set o get en modo introspección, estas propiedades aparecerán como 'fullname' o 'aliasname'.

source: Out:
es_es: Salida:

source: :download:`Download Python source code: set_and_get.py <set_and_get.py>`
es_es: :download:`Descarga el código fuente de Python: set_and_get.py <set_and_get.py>`

source: :download:`Download Jupyter notebook: set_and_get.ipynb <set_and_get.ipynb>`
es_es: :download: `Descarga el cuaderno Jupyter: set_and_get.ipynb <set_and_get.ipynb>`
