Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/misc/tickedstroke_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_misc_tickedstroke_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_misc_tickedstroke_demo.py>` para descargar el código de ejemplo completo

source: Matplotlib's :mod:`.patheffects` can be used to alter the way paths are drawn at a low enough level that they can affect almost anything.
es_es: El :mod:`.patheffects` de Matplotlib se puede utilizar para alterar la forma en que se dibujan las trayectorias a un nivel lo suficientemente bajo como para que puedan afectar a casi cualquier cosa.

source: The :doc:`patheffects guide</tutorials/advanced/patheffects_guide>` details the use of patheffects.
es_es: La :doc:`guía de efectos de trayectoria</tutorials/advanced/patheffects_guide>` detalla el uso de los efectos de trayectoria.

source: The `~matplotlib.patheffects.TickedStroke` patheffect illustrated here draws a path with a ticked style. The spacing, length, and angle of ticks can be controlled.
es_es: El efecto `~matplotlib.patheffects.TickedStroke` que se ilustra aquí dibuja un trazado con un estilo marcado. El espaciado, la longitud y el ángulo de los marcadores pueden ser controlados.

source: See also the :doc:`contour demo example </gallery/lines_bars_and_markers/lines_with_ticks_demo>`.
es_es: Ver también el :doc:`ejemplo de demostración de contorno </gallery/lines_bars_and_markers/lines_with_ticks_demo>`.

source: See also the :doc:`contours in optimization example </gallery/images_contours_and_fields/contours_in_optimization_demo>`.
es_es: Ver también el :doc:`contornos en ejemplo de optimización </gallery/images_contours_and_fields/contours_in_optimization_demo>`.

source: Applying TickedStroke to paths
es_es: Aplicación de TickedStroke a trayectos

source: Applying TickedStroke to lines
es_es: Aplicando TickedStroke a las líneas

source: Applying TickedStroke to contour plots
es_es: Aplicación de TickedStroke a los gráficos de contorno

source: Contour plot with objective and constraints. Curves generated by contour to represent a typical constraint in an optimization problem should be plotted with angles between zero and 180 degrees.
es_es: Gráfico de contorno con objetivo y restricciones. Las curvas generadas por el contorno para representar una restricción típica en un problema de optimización deben ser trazadas con ángulos entre cero y 180 grados.

source: **Total running time of the script:** ( 0 minutes 1.426 seconds)
es_es: *Tiempo total de ejecución del script:** ( 0 minutos 1.426 segundos)

source: :download:`Download Python source code: tickedstroke_demo.py <tickedstroke_demo.py>`
es_es: :download:`Descarga el código fuente de Python: tickedstroke_demo.py <tickedstroke_demo.py>`

source: :download:`Download Jupyter notebook: tickedstroke_demo.ipynb <tickedstroke_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: tickedstroke_demo.ipynb <tickedstroke_demo.ipynb>`
