Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/bar_label_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_bar_label_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_bar_label_demo.py>` para descargar el código de ejemplo completo

source: Bar Label Demo
es_es: Demo de la etiqueta de la barra

source: This example shows how to use the `~.Axes.bar_label` helper function to create bar chart labels.
es_es: Este ejemplo muestra cómo usar la función de ayuda `~.Axes.bar_label` para crear etiquetas de gráficos de barras.

source: See also the :doc:`grouped bar </gallery/lines_bars_and_markers/barchart>`, :doc:`stacked bar </gallery/lines_bars_and_markers/bar_stacked>` and :doc:`horizontal bar chart </gallery/lines_bars_and_markers/barh>` examples.
es_es: Consulta también los ejemplos :doc:`barra agrupada </gallery/lines_bars_and_markers/barchart>`, :doc:`barra apilada </gallery/lines_bars_and_markers/bar_stacked>` y :doc:`gráfico de barras horizontales </gallery/lines_bars_and_markers/barh>`.

source: Define the data
es_es: Definir los datos

source: Stacked bar plot with error bars
es_es: Gráfico de barras apiladas con barras de error

source: Horizontal bar chart
es_es: Gráfico de barras horizontales

source: Some of the more advanced things that one can do with bar labels
es_es: Algunas de las cosas más avanzadas que se pueden hacer con las etiquetas de barras

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.179 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.179 segundos)

source: :download:`Download Python source code: bar_label_demo.py <bar_label_demo.py>`
es_es: :download:`Descarga el código fuente de Python: bar_label_demo.py <bar_label_demo.py>`

source: :download:`Download Jupyter notebook: bar_label_demo.ipynb <bar_label_demo.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: bar_label_demo.ipynb <bar_label_demo.ipynb>`
