Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/curve_error_band.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_curve_error_band.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_curve_error_band.py>` para descargar el código de ejemplo completo

source: Curve with error band
es_es: Curva con banda de error

source: This example illustrates how to draw an error band around a parametrized curve.
es_es: Este ejemplo ilustra cómo dibujar una banda de error alrededor de una curva parametrizada.

source: A parametrized curve x(t), y(t) can directly be drawn using `~.Axes.plot`.
es_es: Una curva parametrizada x(t), y(t) puede dibujarse directamente utilizando `~.Axes.plot`.

source: Out:
es_es: Salida:

source: An error band can be used to indicate the uncertainty of the curve. In this example we assume that the error can be given as a scalar *err* that describes the uncertainty perpendicular to the curve in every point.
es_es: Se puede utilizar una banda de error para indicar la incertidumbre de la curva. En este ejemplo suponemos que el error puede darse como un escalar *err* que describe la incertidumbre perpendicular a la curva en cada punto.

source: We visualize this error as a colored band around the path using a `.PathPatch`. The patch is created from two path segments *(xp, yp)*, and *(xn, yn)* that are shifted by +/- *err* perpendicular to the curve *(x, y)*.
es_es: Visualizamos este error como una banda de color alrededor de la trayectoria utilizando un `.PathPatch`. El parche se crea a partir de dos segmentos de trayectoria *(xp, yp)*, y *(xn, yn)* que se desplazan en +/- *err* perpendicularmente a la curva *(x, y)*.

source: Note: This method of using a `.PathPatch` is suited to arbitrary curves in 2D. If you just have a standard y-vs.-x plot, you can use the simpler `~.Axes.fill_between` method (see also :doc:`/gallery/lines_bars_and_markers/fill_between_demo`).
es_es: Nota: Este método de usar un `.PathPatch` es adecuado para curvas arbitrarias en 2D. Si sólo tiene un gráfico estándar y-vs.-x, puede utilizar el método más sencillo `~.Axes.fill_between` ( ver también :doc:`/gallery/lines_bars_and_markers/fill_between_demo`).

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: curve_error_band.py <curve_error_band.py>`
es_es: :download:`Descarga el código fuente de Python: curve_error_band.py <curve_error_band.py>`

source: :download:`Download Jupyter notebook: curve_error_band.ipynb <curve_error_band.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: curve_error_band.ipynb <curve_error_band.ipynb>`
