Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/errorbar_limits_simple.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_errorbar_limits_simple.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_errorbar_limits_simple.py>` para descargar el código de ejemplo completo

source: Errorbar limit selection
es_es: Selección del límite de la barra de error

source: Illustration of selectively drawing lower and/or upper limit symbols on errorbars using the parameters ``uplims``, ``lolims`` of `~.pyplot.errorbar`.
es_es: Ilustración de cómo dibujar selectivamente los símbolos de límite inferior y/o superior en las barras de error utilizando los parámetros ``uplims``, ``lolims`` de `~.pyplot.errorbar``.

source: Alternatively, you can use 2xN values to draw errorbars in only one direction.
es_es: Alternativamente, puede utilizar valores 2xN para dibujar barras de error en una sola dirección.

source: Out:
es_es: Salida:

source: Similarly ``xuplims`` and ``xlolims`` can be used on the horizontal ``xerr`` errorbars.
es_es: Del mismo modo, ``xuplims`` y ``xlolims`` pueden utilizarse en las barras de error horizontales ``xerr``.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: errorbar_limits_simple.py <errorbar_limits_simple.py>`
es_es: :download:`Descarga el código fuente de Python: errorbar_limits_simple.py <errorbar_limits_simple.py>`

source: :download:`Download Jupyter notebook: errorbar_limits_simple.ipynb <errorbar_limits_simple.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: errorbar_limits_simple.ipynb <errorbar_limits_simple.ipynb>`
