Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/fill.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_fill.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_fill.py>` para descargar el código de ejemplo completo

source: Filled polygon
es_es: Polígono relleno

source: `~.Axes.fill()` draws a filled polygon based based on lists of point coordinates *x*, *y*.
es_es: `~.Axes.fill()` dibuja un polígono relleno basado en listas de coordenadas de puntos *x*, *y*.

source: This example uses the `Koch snowflake`_ as an example polygon.
es_es: Este ejemplo utiliza el "copo de nieve de Koch" como polígono de ejemplo.

source: Basic usage:
es_es: Uso básico:

source: Use keyword arguments *facecolor* and *edgecolor* to modify the colors of the polygon. Since the *linewidth* of the edge is 0 in the default Matplotlib style, we have to set it as well for the edge to become visible.
es_es: Utiliza los argumentos de la palabra clave *facecolor* y *edgecolor* para modificar los colores del polígono. Dado que el *linewidth* de la arista es 0 en el estilo Matplotlib por defecto, tenemos que establecerlo también para que la arista sea visible.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: fill.py <fill.py>`
es_es: :download:`Descargar el código fuente de Python: fill.py <fill.py>`

source: :download:`Download Jupyter notebook: fill.ipynb <fill.ipynb>`
es_es: :download:`Descargar notebook de Jupyter: fill.ipynb <fill.ipynb>`
