Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/fill_between_alpha.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_fill_between_alpha.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_fill_between_alpha.py>` para descargar el código de ejemplo completo

source: Fill Between and Alpha
es_es: Rellenar entre y alfa

source: The `~matplotlib.axes.Axes.fill_between` function generates a shaded region between a min and max boundary that is useful for illustrating ranges. It has a very handy ``where`` argument to combine filling with logical ranges, e.g., to just fill in a curve over some threshold value.
es_es: La función `~matplotlib.axes.Axes.fill_between` genera una región sombreada entre un límite mínimo y máximo que resulta útil para ilustrar rangos. Tiene un argumento muy útil ``where`` para combinar el relleno con rangos lógicos, por ejemplo, para rellenar simplemente una curva por encima de algún valor umbral.

source: At its most basic level, ``fill_between`` can be use to enhance a graphs visual appearance. Let's compare two graphs of a financial times with a simple line plot on the left and a filled line on the right.
es_es: En su nivel más básico, ``fill_between`` puede utilizarse para mejorar el aspecto visual de un grafo. Comparemos dos gráficos de tiempos financieros con una línea simple a la izquierda y una línea rellena a la derecha.

source: The alpha channel is not necessary here, but it can be used to soften colors for more visually appealing plots. In other examples, as we'll see below, the alpha channel is functionally useful as the shaded regions can overlap and alpha allows you to see both. Note that the postscript format does not support alpha (this is a postscript limitation, not a matplotlib limitation), so when using alpha save your figures in PNG, PDF or SVG.
es_es: El canal alfa no es necesario en este caso, pero puede utilizarse para suavizar los colores y conseguir gráficos más atractivos. En otros ejemplos, como veremos más adelante, el canal alfa es funcionalmente útil ya que las regiones sombreadas pueden superponerse y el alfa permite ver ambas. Ten en cuenta que el formato postscript no soporta alfa (esto es una limitación de postscript, no una limitación de matplotlib), así que cuando uses alfa guarda tus figuras en PNG, PDF o SVG.

source: Our next example computes two populations of random walkers with a different mean and standard deviation of the normal distributions from which the steps are drawn. We use filled regions to plot +/- one standard deviation of the mean position of the population. Here the alpha channel is useful, not just aesthetic.
es_es: Nuestro siguiente ejemplo calcula dos poblaciones de caminantes aleatorios con una media y una desviación estándar diferentes de las distribuciones normales de las que se extraen los pasos. Utilizamos regiones rellenas para graficar +/- una desviación estándar de la posición media de la población. Aquí el canal alfa es útil, no sólo estético.

source: The ``where`` keyword argument is very handy for highlighting certain regions of the graph. ``where`` takes a boolean mask the same length as the x, ymin and ymax arguments, and only fills in the region where the boolean mask is True. In the example below, we simulate a single random walker and compute the analytic mean and standard deviation of the population positions. The population mean is shown as the dashed line, and the plus/minus one sigma deviation from the mean is shown as the filled region. We use the where mask ``X > upper_bound`` to find the region where the walker is outside the one sigma boundary, and shade that region red.
es_es: El argumento de la palabra clave ``where`` es muy útil para resaltar ciertas regiones del grafo. ``where`` toma una máscara booleana de la misma longitud que los argumentos x, ymin y ymax, y sólo rellena la región donde la máscara booleana es True. En el siguiente ejemplo, simulamos un único caminante aleatorio y calculamos la media analítica y la desviación estándar de las posiciones de la población. La media de la población se muestra como la línea discontinua, y la desviación de más/menos un sigma de la media se muestra como la región rellena. Usamos la máscara ``X > upper_bound`` para encontrar la región donde el caminante está fuera del límite de una sigma, y sombreamos esa región en rojo.

source: Another handy use of filled regions is to highlight horizontal or vertical spans of an axes -- for that Matplotlib has the helper functions `~matplotlib.axes.Axes.axhspan` and `~matplotlib.axes.Axes.axvspan`. See :doc:`/gallery/subplots_axes_and_figures/axhspan_demo`.
es_es: Otro uso práctico de las regiones rellenas es resaltar los tramos horizontales o verticales de un eje -- para ello Matplotlib tiene las funciones de ayuda `~matplotlib.axes.Axes.axhspan` y `~matplotlib.axes.Axvspan`. Ver :doc:`/gallery/subplots_axes_and_figures/axhspan_demo`.

source: **Total running time of the script:** ( 0 minutes 1.574 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.574 segundos)

source: :download:`Download Python source code: fill_between_alpha.py <fill_between_alpha.py>`
es_es: :download:`Descargar código fuente de Python: fill_between_alpha.py <fill_between_alpha.py>`

source: :download:`Download Jupyter notebook: fill_between_alpha.ipynb <fill_between_alpha.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: fill_between_alpha.ipynb <fill_between_alpha.ipynb>`
