Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/fill_between_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_fill_between_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_fill_between_demo.py>` para descargar el código de ejemplo completo

source: Filling the area between lines
es_es: Rellenar el área entre líneas

source: This example shows how to use `~.axes.Axes.fill_between` to color the area between two lines.
es_es: Este ejemplo muestra cómo utilizar `~.axes.Axes.fill_between` para colorear el área entre dos líneas.

source: Basic usage
es_es: Uso básico

source: The parameters *y1* and *y2* can be scalars, indicating a horizontal boundary at the given y-values. If only *y1* is given, *y2* defaults to 0.
es_es: Los parámetros *y1* y *y2* pueden ser escalares, indicando un límite horizontal en los valores y dados. Si sólo se da *y1*, *y2* es por defecto 0.

source: Example: Confidence bands
es_es: Ejemplo: Bandas de confianza

source: A common application for `~.axes.Axes.fill_between` is the indication of confidence bands.
es_es: Una aplicación común para `~.axes.Axes.fill_between` es la indicación de bandas de confianza.

source: `~.axes.Axes.fill_between` uses the colors of the color cycle as the fill color. These may be a bit strong when applied to fill areas. It is therefore often a good practice to lighten the color by making the area semi-transparent using *alpha*.
es_es: `~.axes.Axes.fill_between` utiliza los colores del ciclo de color como color de relleno. Estos pueden ser un poco fuertes cuando se aplican a las áreas de relleno. Por lo tanto, suele ser una buena práctica aligerar el color haciendo que el área sea semitransparente utilizando *alfa*.

source: Out:
es_es: Salida:

source: Selectively filling horizontal regions
es_es: Relleno selectivo de regiones horizontales

source: The parameter *where* allows to specify the x-ranges to fill. It's a boolean array with the same size as *x*.
es_es: El parámetro *where* permite especificar los rangos x a rellenar. Es un arreglo booleano con el mismo tamaño que *x*.

source: Only x-ranges of contiguous *True* sequences are filled. As a result the range between neighboring *True* and *False* values is never filled. This often undesired when the data points should represent a contiguous quantity. It is therefore recommended to set ``interpolate=True`` unless the x-distance of the data points is fine enough so that the above effect is not noticeable. Interpolation approximates the actual x position at which the *where* condition will change and extends the filling up to there.
es_es: Sólo se rellenan los rangos x de secuencias contiguas *True*. Como resultado, el rango entre valores *True* y *False* vecinos nunca se rellena. Esto no suele ser deseable cuando los puntos de datos deben representar una cantidad contigua. Por lo tanto, se recomienda establecer ``interpolar=True`` a menos que la distancia x de los puntos de datos sea lo suficientemente fina como para que el efecto anterior no se note. La interpolación aproxima la posición x real en la que cambiará la condición *donde* y extiende el relleno hasta allí.

source: Similar gaps will occur if *y1* or *y2* are masked arrays. Since missing values cannot be approximated, *interpolate* has no effect in this case. The gaps around masked values can only be reduced by adding more data points close to the masked values.
es_es: Se producirán vacíos similares si *y1* o *y2* son arreglos enmascarados. Como los valores que faltan no pueden aproximarse, *interpolate* no tiene efecto en este caso. Los huecos alrededor de los valores enmascarados sólo pueden reducirse añadiendo más puntos de datos cerca de los valores enmascarados.

source: Selectively marking horizontal regions across the whole Axes
es_es: Marcar selectivamente regiones horizontales en todo el Eje

source: The same selection mechanism can be applied to fill the full vertical height of the axes. To be independent of y-limits, we add a transform that interprets the x-values in data coorindates and the y-values in axes coordinates.
es_es: El mismo mecanismo de selección puede aplicarse para llenar toda la altura vertical de los ejes. Para no depender de los límites de y, añadimos una transformación que interpreta los valores x en coordenadas de datos y los valores y en coordenadas de ejes.

source: The following example marks the regions in which the y-data are above a given threshold.
es_es: En el siguiente ejemplo se marcan las regiones en las que los datos Y están por encima de un umbral determinado.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.334 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.334 segundos)

source: :download:`Download Python source code: fill_between_demo.py <fill_between_demo.py>`
es_es: :download:`Descargar código fuente de Python: fill_between_demo.py <fill_between_demo.py>`

source: :download:`Download Jupyter notebook: fill_between_demo.ipynb <fill_between_demo.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: fill_between_demo.ipynb <fill_between_demo.ipynb>`
