Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/filled_step.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_filled_step.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_filled_step.py>` para descargar el código de ejemplo completo

source: Hatch-filled histograms
es_es: Histogramas rellenos de sombreado

source: Hatching capabilities for plotting histograms.
es_es: Capacidades de sombreado para graficar histogramas.

source: Work with plain arrays
es_es: Trabajar con arreglos simples

source: Out:
es_es: Salida:

source: Work with labeled data
es_es: Trabajar con datos etiquetados

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: filled_step.py <filled_step.py>`
es_es: :download:`Descarga el código fuente de Python: filled_step.py <filled_step.py>`

source: :download:`Download Jupyter notebook: filled_step.ipynb <filled_step.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: filled_step.ipynb <filled_step.ipynb>`
