Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/markevery_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_markevery_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_markevery_demo.py>` para descargar el código de ejemplo completo

source: Markevery Demo
es_es: Demo de Markevery

source: This example demonstrates the various options for showing a marker at a subset of data points using the ``markevery`` property of a Line2D object.
es_es: Este ejemplo demuestra las diversas opciones para mostrar un marcador en un subconjunto de puntos de datos usando la propiedad ``markevery`` de un objeto Line2D.

source: Integer arguments are fairly intuitive. e.g. ``markevery=5`` will plot every 5th marker starting from the first data point.
es_es: Los argumentos enteros son bastante intuitivos. Por ejemplo, ``markevery=5`` graficará cada quinto marcador comenzando por el primer punto de datos.

source: Float arguments allow markers to be spaced at approximately equal distances along the line. The theoretical distance along the line between markers is determined by multiplying the display-coordinate distance of the axes bounding-box diagonal by the value of ``markevery``. The data points closest to the theoretical distances will be shown.
es_es: Los argumentos flotantes permiten espaciar los marcadores a distancias aproximadamente iguales a lo largo de la línea. La distancia teórica a lo largo de la línea entre los marcadores se determina multiplicando la distancia de las coordenadas de visualización de la diagonal de la caja delimitadora de los ejes por el valor de ``markevery``. Se mostrarán los puntos de datos más cercanos a las distancias teóricas.

source: A slice or list/array can also be used with ``markevery`` to specify the markers to show.
es_es: También se puede utilizar un slice o una lista/arreglo con ``markevery`` para especificar los marcadores a mostrar.

source: Plot each markevery case for linear x and y scales
es_es: Gráficar cada caso de markevery para escalas lineales de x e y

source: Plot each markevery case for log x and y scales
es_es: Grafica cada caso de markevery para las escalas log x y y

source: Plot each markevery case for linear x and y scales but zoomed in note the behaviour when zoomed in. When a start marker offset is specified it is always interpreted with respect to the first data point which might be different to the first visible data point.
es_es: Grafica cada marcador en todos los casos para escalas lineales de x e y pero ampliadas nota el comportamiento cuando se amplía. Cuando se especifica un desplazamiento del marcador de inicio, siempre se interpreta con respecto al primer punto de datos, que puede ser diferente del primer punto de datos visible.

source: Plot each markevery case for polar plots
es_es: Graficar cada caso de markevery para gráficos polares

source: **Total running time of the script:** ( 0 minutes 13.962 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 13.962 segundos)

source: :download:`Download Python source code: markevery_demo.py <markevery_demo.py>`
es_es: :download:`Descargar el código fuente de Python: markevery_demo.py <markevery_demo.py>`

source: :download:`Download Jupyter notebook: markevery_demo.ipynb <markevery_demo.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: markevery_demo.ipynb <markevery_demo.ipynb>`
