Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/marker_reference.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_marker_reference.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_marker_reference.py>` para descargar el código de ejemplo completo

source: Marker reference
es_es: Referencia del indicador

source: Matplotlib supports multiple categories of markers which are selected using the ``marker`` parameter of plot commands:
es_es: Matplotlib soporta múltiples categorías de marcadores que se seleccionan utilizando el parámetro ``marker`` de los comandos de graficación:

source: For a list of all markers see also the `matplotlib.markers` documentation.
es_es: Para una lista de todos los marcadores, ver también la documentación `matplotlib.markers`.

source: For example usages see :doc:`/gallery/lines_bars_and_markers/scatter_star_poly`.
es_es: Para ver ejemplos de uso, ver :doc:`/gallery/lines_bars_and_markers/scatter_star_poly`.

source: Unfilled markers
es_es: Marcadores sin rellenar

source: Unfilled markers are single-colored.
es_es: Los marcadores sin rellenar son de un solo color.

source: Filled markers
es_es: Marcadores rellenos

source: Marker fill styles
es_es: Estilos de relleno de los marcadores

source: The edge color and fill color of filled markers can be specified separately. Additionally, the ``fillstyle`` can be configured to be unfilled, fully filled, or half-filled in various directions. The half-filled styles use ``markerfacecoloralt`` as secondary fill color.
es_es: El color del borde y el color de relleno de los marcadores rellenos pueden especificarse por separado. Además, el ``fillstyle`` puede configurarse para ser sin relleno, con relleno completo o con medio relleno en varias direcciones. Los estilos semillenos utilizan ``markerfacecoloralt`` como color de relleno secundario.

source: Markers created from TeX symbols
es_es: Marcadores creados a partir de símbolos TeX

source: Use :doc:`MathText </tutorials/text/mathtext>`, to use custom marker symbols, like e.g. ``"$\u266B$"``. For an overview over the STIX font symbols refer to the `STIX font table <http://www.stixfonts.org/allGlyphs.html>`_. Also see the :doc:`/gallery/text_labels_and_annotations/stix_fonts_demo`.
es_es: Utiliza :doc:`MathText </tutorials/text/mathtext>`, para utilizar símbolos de marcador personalizados, como por ejemplo ``"$\u266B$"``. Para una visión general de los símbolos de fuentes STIX, consulta la tabla de fuentes `STIX <http://www.stixfonts.org/allGlyphs.html>`_. Consulta también el :doc:`/gallery/text_labels_and_annotations/stix_fonts_demo`.

source: Markers created from Paths
es_es: Marcadores creados a partir de rutas

source: Any `~.path.Path` can be used as a marker. The following example shows two simple paths *star* and *circle*, and a more elaborate path of a circle with a cut-out star.
es_es: Cualquier `~.path.Path` puede utilizarse como marcador. El siguiente ejemplo muestra dos caminos simples *estrella* y *círculo*, y un camino más elaborado de un círculo con una estrella recortada.

source: **Total running time of the script:** ( 0 minutes 1.112 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.112 segundos)

source: :download:`Download Python source code: marker_reference.py <marker_reference.py>`
es_es: :download:`Descargar el código fuente de Python: marker_reference.py <marker_reference.py>`

source: :download:`Download Jupyter notebook: marker_reference.ipynb <marker_reference.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: marker_reference.ipynb <marker_reference.ipynb>`
