Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/masked_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_masked_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_masked_demo.py>` para descargar el código de ejemplo completo

source: Plotting masked and NaN values
es_es: Graficar valores enmascarados y NaN

source: Sometimes you need to plot data with missing values.
es_es: A veces es necesario graficar datos con valores faltantes.

source: One possibility is to simply remove undesired data points. The line plotted through the remaining data will be continuous, and not indicate where the missing data is located.
es_es: Una posibilidad es simplemente eliminar los puntos de datos no deseados. La línea graficada a través de los datos restantes será continua, y no indicará dónde se encuentran los datos que faltan.

source: If it is useful to have gaps in the line where the data is missing, then the undesired points can be indicated using a `masked array`_ or by setting their values to NaN. No marker will be drawn where either x or y are masked and, if plotting with a line, it will be broken there.
es_es: Si es útil tener huecos en la línea donde faltan los datos, entonces los puntos no deseados pueden ser indicados usando un `masked array`_ o estableciendo sus valores a NaN. No se dibujará ningún marcador donde x o y estén enmascarados y, si se grafica con una línea, ésta se romperá allí.

source: The following example illustrates the three cases:
es_es: El siguiente ejemplo ilustra los tres casos:

source: Removing points.
es_es: Eliminar puntos.

source: Masking points.
es_es: Enmascarar puntos.

source: Setting to NaN.
es_es: Establecer en NaN.

source: :download:`Download Python source code: masked_demo.py <masked_demo.py>`
es_es: :download:`Descarga el código fuente de Python: masked_demo.py <masked_demo.py>`

source: :download:`Download Jupyter notebook: masked_demo.ipynb <masked_demo.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: masked_demo.ipynb <masked_demo.ipynb>`
