Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/psd_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_psd_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_psd_demo.py>` para descargar el código de ejemplo completo

source: Psd Demo
es_es: Demo de Psd

source: Plotting Power Spectral Density (PSD) in Matplotlib.
es_es: Graficar la densidad espectral de potencia (PSD) en Matplotlib.

source: The PSD is a common plot in the field of signal processing. NumPy has many useful libraries for computing a PSD. Below we demo a few examples of how this can be accomplished and visualized with Matplotlib.
es_es: La PSD es un gráfico común en el campo del procesamiento de señales. NumPy tiene muchas bibliotecas útiles para calcular una PSD. A continuación mostramos algunos ejemplos de cómo se puede lograr y visualizar con Matplotlib.

source: Compare this with the equivalent Matlab code to accomplish the same thing::
es_es: Compara esto con el código Matlab equivalente para lograr lo mismo::

source: Below we'll show a slightly more complex example that demonstrates how padding affects the resulting PSD.
es_es: A continuación mostraremos un ejemplo algo más complejo que demuestra cómo el relleno afecta al PSD resultante.

source: This is a ported version of a MATLAB example from the signal processing toolbox that showed some difference at one time between Matplotlib's and MATLAB's scaling of the PSD.
es_es: Se trata de una versión adaptada de un ejemplo de MATLAB de la caja de herramientas de procesamiento de señales que mostró alguna diferencia en su momento entre el escalamiento de la PSD de Matplotlib y MATLAB.

source: It uses a complex signal so we can see that complex PSD's work properly.
es_es: Utiliza una señal compleja para que podamos ver que los PSD complejos funcionan correctamente.

source: **Total running time of the script:** ( 0 minutes 2.037 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 2.037 segundos)

source: :download:`Download Python source code: psd_demo.py <psd_demo.py>`
es_es: :download:`Descarga el código fuente de Python: psd_demo.py <psd_demo.py>`

source: :download:`Download Jupyter notebook: psd_demo.ipynb <psd_demo.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: psd_demo.ipynb <psd_demo.ipynb>`
