Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/scatter_hist.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_scatter_hist.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_scatter_hist.py>` para descargar el código de ejemplo completo

source: Scatter plot with histograms
es_es: Gráfico de dispersión con histogramas

source: Show the marginal distributions of a scatter as histograms at the sides of the plot.
es_es: Mostrar las distribuciones marginales de una dispersión como histogramas a los lados del gráfico.

source: For a nice alignment of the main axes with the marginals, two options are shown below.
es_es: Para una buena alineación de los ejes principales con los marginales, se muestran dos opciones a continuación.

source: the axes positions are defined in terms of rectangles in figure coordinates
es_es: las posiciones de los ejes se definen en términos de rectángulos en coordenadas de la figura

source: the axes positions are defined via a gridspec
es_es: las posiciones de los ejes se definen a través de un gridspec

source: An alternative method to produce a similar figure using the ``axes_grid1`` toolkit is shown in the :doc:`/gallery/axes_grid1/scatter_hist_locatable_axes` example.
es_es: Un método alternativo para producir una figura similar utilizando el kit de herramientas ``axes_grid1`` se muestra en el ejemplo :doc:`/gallery/axes_grid1/scatter_hist_locatable_axes`.

source: Let us first define a function that takes x and y data as input, as well as three axes, the main axes for the scatter, and two marginal axes. It will then create the scatter and histograms inside the provided axes.
es_es: En primer lugar, definamos una función que tome los datos x e y como entrada, así como tres ejes, los ejes principales para la dispersión, y dos ejes marginales. A continuación, creará la dispersión y los histogramas dentro de los ejes proporcionados.

source: Axes in figure coordinates
es_es: Ejes en coordenadas de figuras

source: To define the axes positions, `.Figure.add_axes` is provided with a rectangle ``[left, bottom, width, height]`` in figure coordinates. The marginal axes share one dimension with the main axes.
es_es: Para definir las posiciones de los ejes, se proporciona a `.Figure.add_axes` un rectángulo ``[left, bottom, width, height]`` en coordenadas de la figura. Los ejes marginales comparten una dimensión con los ejes principales.

source: Using a gridspec
es_es: Utilización de un gridspec

source: We may equally define a gridspec with unequal width- and height-ratios to achieve desired layout. Also see the :doc:`/tutorials/intermediate/arranging_axes` tutorial.
es_es: También podemos definir una cuadrícula con proporciones desiguales de anchura y altura para lograr un layout deseado. Ver también el tutorial :doc:`/tutorials/intermediate/arranging_axes`.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.150 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.150 segundos)

source: :download:`Download Python source code: scatter_hist.py <scatter_hist.py>`
es_es: :download:`Descargar el código fuente de Python: scatter_hist.py <scatter_hist.py>`

source: :download:`Download Jupyter notebook: scatter_hist.ipynb <scatter_hist.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: scatter_hist.ipynb <scatter_hist.ipynb>`
