Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/scatter_with_legend.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_scatter_with_legend.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_scatter_with_legend.py>` para descargar el código de ejemplo completo

source: Scatter plots with a legend
es_es: Gráficos de dispersión con leyenda

source: To create a scatter plot with a legend one may use a loop and create one `~.Axes.scatter` plot per item to appear in the legend and set the ``label`` accordingly.
es_es: Para crear un gráfico de dispersión con una leyenda se puede utilizar un bucle y crear un gráfico `~.Axes.scatter` por elemento que aparezca en la leyenda y establecer la ``etiqueta`` en consecuencia.

source: The following also demonstrates how transparency of the markers can be adjusted by giving ``alpha`` a value between 0 and 1.
es_es: A continuación se muestra también cómo se puede ajustar la transparencia de los marcadores dando a ``alpha`` un valor entre 0 y 1.

source: Automated legend creation
es_es: Creación automática de leyenda

source: Another option for creating a legend for a scatter is to use the `.PathCollection.legend_elements` method. It will automatically try to determine a useful number of legend entries to be shown and return a tuple of handles and labels. Those can be passed to the call to `~.axes.Axes.legend`.
es_es: Otra opción para crear una leyenda para una dispersión es utilizar el método `.PathCollection.legend_elements`. Intentará determinar automáticamente un número útil de entradas de leyenda que se mostrarán y devolverá una tupla de manejadores y etiquetas. Estos pueden ser pasados a la llamada a `~.axes.Axes.legend`.

source: Further arguments to the `.PathCollection.legend_elements` method can be used to steer how many legend entries are to be created and how they should be labeled. The following shows how to use some of them.
es_es: Se pueden utilizar otros argumentos para el método `.PathCollection.legend_elements` para dirigir cuántas entradas de la leyenda deben crearse y cómo deben ser etiquetadas. A continuación se muestra cómo utilizar algunos de ellos.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.662 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.662 segundos)

source: :download:`Download Python source code: scatter_with_legend.py <scatter_with_legend.py>`
es_es: :download:`Descargar código fuente de Python: scatter_with_legend.py <scatter_with_legend.py>`

source: :download:`Download Jupyter notebook: scatter_with_legend.ipynb <scatter_with_legend.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: scatter_with_legend.ipynb <scatter_with_legend.ipynb>`
