Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/stairs_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_stairs_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_stairs_demo.py>` para descargar el código de ejemplo completo

source: Stairs Demo
es_es: Demo de escaleras

source: This example demonstrates the use of `~.matplotlib.pyplot.stairs` for stepwise constant functions. A common use case is histogram and histogram-like data visualization.
es_es: Este ejemplo demuestra el uso de `~.matplotlib.pyplot.stairs` para funciones constantes escalonadas. Un caso de uso común es la visualización de histogramas y datos similares a los histogramas.

source: *baseline* can take an array to allow for stacked histogram plots
es_es: *baseline* puede tomar un arreglo para permitir gráficos de histograma apilados

source: Comparison of `.pyplot.step` and `.pyplot.stairs`
es_es: Comparación de `.pyplot.step` y `.pyplot.stairs`

source: `.pyplot.step` defines the positions of the steps as single values. The steps extend left/right/both ways from these reference values depending on the parameter *where*. The number of *x* and *y* values is the same.
es_es: `.pyplot.step` define las posiciones de los pasos como valores individuales. Los pasos se extienden a la izquierda/derecha/en ambos sentidos desde estos valores de referencia dependiendo del parámetro *where*. El número de valores *x* e *y* es el mismo.

source: In contrast, `.pyplot.stairs` defines the positions of the steps via their bounds *edges*, which is one element longer than the step values.
es_es: Por el contrario, `.pyplot.stairs` define las posiciones de los pasos a través de sus límites *aristas*, que es un elemento más largo que los valores de los pasos.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.545 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.545 segundos)

source: :download:`Download Python source code: stairs_demo.py <stairs_demo.py>`
es_es: :download:`Descarga el código fuente de Python: stairs_demo.py <stairs_demo.py>`

source: :download:`Download Jupyter notebook: stairs_demo.ipynb <stairs_demo.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: stairs_demo.ipynb <stairs_demo.ipynb>`
