Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/step_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_step_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_step_demo.py>` para descargar el código de ejemplo completo

source: Step Demo
es_es: Demo del escalón

source: This example demonstrates the use of `.pyplot.step` for piece-wise constant curves. In particular, it illustrates the effect of the parameter *where* on the step position.
es_es: Este ejemplo demuestra el uso de `.pyplot.step` para curvas constantes a trozos. En particular, ilustra el efecto del parámetro *donde* en la posición del paso.

source: For the common case that you know the edge positions, use `.pyplot.stairs` instead.
es_es: Para el caso común de que conozcas las posiciones de las aristas, utiliza `.pyplot.stairs` en su lugar.

source: The circular markers created with `.pyplot.plot` show the actual data positions so that it's easier to see the effect of *where*.
es_es: Los marcadores circulares creados con `.pyplot.plot` muestran las posiciones reales de los datos para que sea más fácil ver el efecto de *donde*.

source: The same behavior can be achieved by using the ``drawstyle`` parameter of `.pyplot.plot`.
es_es: El mismo comportamiento se puede conseguir utilizando el parámetro ``drawstyle`` de `.pyplot.plot`.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: step_demo.py <step_demo.py>`
es_es: :download:`Descarga el código fuente de Python: step_demo.py <step_demo.py>`

source: :download:`Download Jupyter notebook: step_demo.ipynb <step_demo.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: step_demo.ipynb <step_demo.ipynb>`
