Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/lines_bars_and_markers/timeline.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_lines_bars_and_markers_timeline.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_lines_bars_and_markers_timeline.py>` para descargar el código de ejemplo completo

source: Creating a timeline with lines, dates, and text
es_es: Creación de una línea de tiempo con líneas, fechas y texto

source: How to create a simple timeline using Matplotlib release dates.
es_es: Cómo crear una línea de tiempo simple usando las fechas de lanzamiento de Matplotlib.

source: Timelines can be created with a collection of dates and text. In this example, we show how to create a simple timeline using the dates for recent releases of Matplotlib. First, we'll pull the data from GitHub.
es_es: Las líneas de tiempo se pueden crear con una colección de fechas y texto. En este ejemplo, mostramos cómo crear una línea de tiempo sencilla utilizando las fechas de las últimas versiones de Matplotlib. Primero, sacaremos los datos de GitHub.

source: Next, we'll create a stem plot with some variation in levels as to distinguish even close-by events. We add markers on the baseline for visual emphasis on the one-dimensional nature of the time line.
es_es: A continuación, crearemos un gráfico de tallo con cierta variación de niveles para distinguir incluso los eventos más cercanos. Añadimos marcadores en la línea de base para enfatizar visualmente la naturaleza unidimensional de la línea de tiempo.

source: For each event, we add a text label via `~.Axes.annotate`, which is offset in units of points from the tip of the event line.
es_es: Para cada evento, añadimos una etiqueta de texto a través de `~.Axes.annotate`, que está desplazada en unidades de puntos desde la punta de la línea del evento.

source: Note that Matplotlib will automatically plot datetime inputs.
es_es: Tenga en cuenta que Matplotlib graficará automáticamente las entradas de fecha y hora.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.368 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.368 segundos)

source: :download:`Download Python source code: timeline.py <timeline.py>`
es_es: :download:`Descargar código fuente de Python: timeline.py <timeline.py>`

source: :download:`Download Jupyter notebook: timeline.ipynb <timeline.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: timeline.ipynb <timeline.ipynb>`
