Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/intermediate/artists.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_intermediate_artists.py>` to download the full example code
es_es: Has clic en :ref:`aquí <sphx_glr_download_tutorials_intermediate_artists.py>` para descargar el código de ejemplo completo

source: Artist tutorial
es_es: Tutorial de artistas

source: Using Artist objects to render on the canvas.
es_es: Usando objetos Artist para renderizar en el lienzo.

source: There are three layers to the Matplotlib API.
es_es: Hay tres capas en la API de Matplotlib.

source: the :class:`matplotlib.backend_bases.FigureCanvas` is the area onto which the figure is drawn
es_es: la :clase:`matplotlib.backend_bases.FigureCanvas` es el área sobre la que se dibuja la figura

source: the :class:`matplotlib.backend_bases.Renderer` is the object which knows how to draw on the :class:`~matplotlib.backend_bases.FigureCanvas`
es_es: la :class:`matplotlib.backend_bases.Renderer` es el objeto que sabe cómo dibujar en el :class:`~matplotlib.backend_bases.FigureCanvas`

source: and the :class:`matplotlib.artist.Artist` is the object that knows how to use a renderer to paint onto the canvas.
es_es: y el :class:`matplotlib.artist.Artist` es el objeto que sabe utilizar un renderizador para pintar en el lienzo.

source: The :class:`~matplotlib.backend_bases.FigureCanvas` and :class:`~matplotlib.backend_bases.Renderer` handle all the details of talking to user interface toolkits like `wxPython <https://www.wxpython.org>`_ or drawing languages like PostScript®, and the ``Artist`` handles all the high level constructs like representing and laying out the figure, text, and lines. The typical user will spend 95% of their time working with the ``Artists``.
es_es: La :class:`~matplotlib.backend_bases.FigureCanvas` y la :class:`~matplotlib.backend_bases.Renderer` se encargan de todos los detalles de comunicarse con kits de herramientas de interfaz de usuario como `wxPython <https://www.wxpython.org>`_ o lenguajes de dibujo como PostScript®, y el ``Artist`` se encarga de todas las construcciones de alto nivel como la representación y la disposición de la figura, el texto y las líneas. El usuario típico pasará el 95% de su tiempo trabajando con los ``Artists``.

source: There are two types of ``Artists``: primitives and containers. The primitives represent the standard graphical objects we want to paint onto our canvas: :class:`~matplotlib.lines.Line2D`, :class:`~matplotlib.patches.Rectangle`, :class:`~matplotlib.text.Text`, :class:`~matplotlib.image.AxesImage`, etc., and the containers are places to put them (:class:`~matplotlib.axis.Axis`, :class:`~matplotlib.axes.Axes` and :class:`~matplotlib.figure.Figure`). The standard use is to create a :class:`~matplotlib.figure.Figure` instance, use the ``Figure`` to create one or more :class:`~matplotlib.axes.Axes` or :class:`~matplotlib.axes.Subplot` instances, and use the ``Axes`` instance helper methods to create the primitives. In the example below, we create a ``Figure`` instance using :func:`matplotlib.pyplot.figure`, which is a convenience method for instantiating ``Figure`` instances and connecting them with your user interface or drawing toolkit ``FigureCanvas``. As we will discuss below, this is not necessary -- you can work directly with PostScript, PDF Gtk+, or wxPython ``FigureCanvas`` instances, instantiate your ``Figures`` directly and connect them yourselves -- but since we are focusing here on the ``Artist`` API we'll let :mod:`~matplotlib.pyplot` handle some of those details for us::
es_es: Hay dos tipos de ``Artists``: las primitivas y los contenedores. Las primitivas representan los objetos gráficos estándar que queremos pintar en nuestro lienzo: :class:`~matplotlib.lines.Line2D`, :class:`~matplotlib.patches.Rectangle`, :class:`~matplotlib.text.Text`, :class:`~matplotlib.image.AxesImage`, etc., y los contenedores son lugares para ponerlos (:class:`~matplotlib.axis.Axis`, :class:`~matplotlib.axes.Axes` y :class:`~matplotlib.figure.Figure`). El modo estándar de utilizarlos es creando una instancia de :class:`~matplotlib.figure.Figure`, usando la ``Figure`` para crear una o más instancias de :class:`~matplotlib.axes.Axes` o :class:`~matplotlib.axes.Subplot`, y usar los métodos de ayuda de la instancia ``Axes`` para crear las primitivas. En el siguiente ejemplo, creamos una instancia de ``Figure`` utilizando :func:`matplotlib.pyplot.figure`, que es un método conveniente para crear instancias de ``Figure`` y conectarlas con tu interfaz de usuario o con el ``FigureCanvas`` del kit de herramientas de dibujo. Como discutiremos más adelante, esto no es necesario -- puedes trabajar directamente con instancias PostScript, PDF Gtk+, o wxPython ``FigureCanvas``, instanciar tus ``Figuras`` directamente y conectarlas tú mismo -- pero como nos estamos centrando aquí en la API ``Artist`` dejaremos que :mod:`~matplotlib.pyplot` se encargue de algunos de esos detalles por nosotros::

source: The :class:`~matplotlib.axes.Axes` is probably the most important class in the Matplotlib API, and the one you will be working with most of the time. This is because the ``Axes`` is the plotting area into which most of the objects go, and the ``Axes`` has many special helper methods (:meth:`~matplotlib.axes.Axes.plot`, :meth:`~matplotlib.axes.Axes.text`, :meth:`~matplotlib.axes.Axes.hist`, :meth:`~matplotlib.axes.Axes.imshow`) to create the most common graphics primitives (:class:`~matplotlib.lines.Line2D`, :class:`~matplotlib.text.Text`, :class:`~matplotlib.patches.Rectangle`, :class:`~matplotlib.image.AxesImage`, respectively). These helper methods will take your data (e.g., ``numpy`` arrays and strings) and create primitive ``Artist`` instances as needed (e.g., ``Line2D``), add them to the relevant containers, and draw them when requested. Most of you are probably familiar with the :class:`~matplotlib.axes.Subplot`, which is just a special case of an ``Axes`` that lives on a regular rows by columns grid of ``Subplot`` instances. If you want to create an ``Axes`` at an arbitrary location, simply use the :meth:`~matplotlib.figure.Figure.add_axes` method which takes a list of ``[left, bottom, width, height]`` values in 0-1 relative figure coordinates::
es_es: La clase :`~matplotlib.axes.Axes` es probablemente la clase más importante de la API de Matplotlib, y con la que trabajarás la mayor parte del tiempo. Esto se debe a que el ``Axes`` es el área de trazado en la que van la mayoría de los objetos, y el ``Axes`` tiene muchos métodos especiales de ayuda (:meth:`~matplotlib.axes.Axes.plot`, :meth:`~matplotlib.axes.Axes.text`, :meth:`~matplotlib.axes.Axes. hist`, :meth:`~matplotlib.axes.Axes.imshow`) para crear las primitivas gráficas más comunes (:class:`~matplotlib.lines.Line2D`, :class:`~matplotlib.text.Text`, :class:`~matplotlib.patches.Rectangle`, :class:`~matplotlib.image.AxesImage`, respectivamente). Estos métodos de ayuda tomarán tus datos (por ejemplo, arreglos ``numpy`` y cadenas) y crearán instancias primitivas de ``Artista`` según sea necesario (por ejemplo, ``Line2D``), las añadirán a los contenedores pertinentes y las dibujarán cuando se les solicite. La mayoría de ustedes probablemente estén familiarizados con la :clase:`~matplotlib.axes.Subplot``, que no es más que un caso especial de un ``Axes`` que vive en una Cuadrícula regular de filas por columnas de instancias ``Subplot``. Si quieres crear un ``Axes`` en una ubicación arbitraria, simplemente utiliza el método :meth:`~matplotlib.figure.Figure.add_axes` que toma una lista de valores ``[izquierda, fondo, ancho, alto]`` en coordenadas relativas de la figura 0-1::

source: Continuing with our example::
es_es: Continuando con nuestro ejemplo::

source: In this example, ``ax`` is the ``Axes`` instance created by the ``fig.add_subplot`` call above (remember ``Subplot`` is just a subclass of ``Axes``) and when you call ``ax.plot``, it creates a ``Line2D`` instance and adds it to the :attr:`Axes.lines <matplotlib.axes.Axes.lines>` list. In the interactive `IPython <https://ipython.org/>`_ session below, you can see that the ``Axes.lines`` list is length one and contains the same line that was returned by the ``line, = ax.plot...`` call:
es_es: En este ejemplo, ``ax`` es la instancia de ``Axes`` creada por la llamada ``fig.add_subplot`` de arriba (recuerda que ``Subplot`` es sólo una subclase de ``Axes``) y cuando llamas a ``ax.plot``, crea una instancia de ``Line2D`` y la añade a la lista :attr:`Axes.lines <matplotlib.axes.Axes.lines>`. En la sesión interactiva `IPython <https://ipython.org/>`_ que se muestra a continuación, se puede ver que la lista ``Axes.lines`` es de longitud uno y contiene la misma línea que fue devuelta por la llamada ``line, = ax.plot...``:

source: If you make subsequent calls to ``ax.plot`` (and the hold state is "on" which is the default) then additional lines will be added to the list. You can remove lines later simply by calling the list methods; either of these will work::
es_es: Si haces llamadas posteriores a ``ax.plot`` (y el estado de hold es "on" que es el predeterminado) entonces se añadirán líneas adicionales a la lista. Puedes eliminar líneas más tarde simplemente llamando a los métodos de la lista; cualquiera de estos funcionará::

source: The Axes also has helper methods to configure and decorate the x-axis and y-axis tick, tick labels and axis labels::
es_es: Los ejes también tienen métodos de ayuda para configurar y decorar el tick del eje x y del eje y, las etiquetas del tick y las etiquetas del eje::

source: When you call :meth:`ax.set_xlabel <matplotlib.axes.Axes.set_xlabel>`, it passes the information on the :class:`~matplotlib.text.Text` instance of the :class:`~matplotlib.axis.XAxis`. Each ``Axes`` instance contains an :class:`~matplotlib.axis.XAxis` and a :class:`~matplotlib.axis.YAxis` instance, which handle the layout and drawing of the ticks, tick labels and axis labels.
es_es: Cuando llamas a :meth:`ax.set_xlabel <matplotlib.axes.Axes.set_xlabel>`, pasa la información de la instancia :class:`~matplotlib.text.Text` del :class:`~matplotlib.axis.XAxis`. Cada instancia de ``Axes`` contiene una instancia :class:`~matplotlib.axis.XAxis` y una instancia :class:`~matplotlib.axis.YAxis`, que se encargan de la disposición y el dibujo de los ticks, las etiquetas de los ticks y las etiquetas de los ejes.

source: Try creating the figure below.
es_es: Intenta crear la siguiente figura.

source: Customizing your objects
es_es: Personalizar sus objetos

source: Every element in the figure is represented by a Matplotlib :class:`~matplotlib.artist.Artist`, and each has an extensive list of properties to configure its appearance. The figure itself contains a :class:`~matplotlib.patches.Rectangle` exactly the size of the figure, which you can use to set the background color and transparency of the figures. Likewise, each :class:`~matplotlib.axes.Axes` bounding box (the standard white box with black edges in the typical Matplotlib plot, has a ``Rectangle`` instance that determines the color, transparency, and other properties of the Axes. These instances are stored as member variables :attr:`Figure.patch <matplotlib.figure.Figure.patch>` and :attr:`Axes.patch <matplotlib.axes.Axes.patch>` ("Patch" is a name inherited from MATLAB, and is a 2D "patch" of color on the figure, e.g., rectangles, circles and polygons). Every Matplotlib ``Artist`` has the following properties
es_es: Cada elemento de la figura está representado por un :class:`~matplotlib.artist.Artist`, y cada uno tiene una extensa lista de propiedades para configurar su apariencia. La figura en sí contiene un :class:`~matplotlib.patches.Rectangle` de tamaño exacto a la figura, que se puede utilizar para configurar el color de fondo y la transparencia de las figuras. Del mismo modo, cada caja delimitadora :class:`~matplotlib.axes.Axes` (la caja blanca estándar con bordes negros en el típico gráfico de Matplotlib, tiene una instancia ``Rectangle`` que determina el color, la transparencia y otras propiedades de los ejes. Estas instancias se almacenan como variables miembro :attr:`Figure.patch <matplotlib.figure.Figure.patch>` y :attr:`Axes.patch <matplotlib.axes.Axes.patch>` ("Patch" es un nombre heredado de MATLAB, y es un "parche" 2D de color en la figura, por ejemplo, rectángulos, círculos y polígonos). Cada ``Artist`` de Matplotlib tiene las siguientes propiedades

source: Property
es_es: Propiedad

source: Description
es_es: Descripción

source: alpha
es_es: alfa

source: The transparency - a scalar from 0-1
es_es: La transparencia - un escalar de 0-1

source: animated
es_es: animado

source: A boolean that is used to facilitate animated drawing
es_es: Un booleano que se usa para facilitar el dibujo animado

source: axes
es_es: ejes

source: The Axes that the Artist lives in, possibly None
es_es: Los ejes en los que vive el Artist, posiblemente ninguno

source: clip_box
es_es: Los ejes en los que vive el Artist, posiblemente ninguno

source: The bounding box that clips the Artist
es_es: La caja delimitadora que recorta al Artist

source: Whether clipping is enabled
es_es: Si el recorte está activado

source: The path the artist is clipped to
es_es: La ruta en la que se recorta el artist

source: contains
es_es: contiene

source: A picking function to test whether the artist contains the pick point
es_es: Una función de selección para comprobar si el artista contiene el punto de selección

source: figure
es_es: figura

source: The figure instance the artist lives in, possibly None
es_es: La instancia de la figura en la que vive el Artist, posiblemente None

source: label
es_es: etiqueta

source: A text label (e.g., for auto-labeling)
es_es: Una etiqueta de texto (por ejemplo, para el autoetiquetado)

source: picker
es_es: selector

source: A python object that controls object picking
es_es: Un objeto python que controla la selección de objetos

source: transform
es_es: transformar

source: The transformation
es_es: La transformación

source: A boolean whether the artist should be drawn
es_es: Un booleano si el artist debe ser dibujado

source: A number which determines the drawing order
es_es: Un número que determina el orden de los dibujos

source: rasterized
es_es: rasterizado

source: Boolean; Turns vectors into raster graphics (for compression & EPS transparency)
es_es: Booleano; Convierte los vectores en gráficos rasterizados (para la compresión y la transparencia EPS)

source: Each of the properties is accessed with an old-fashioned setter or getter (yes we know this irritates Pythonistas and we plan to support direct access via properties or traits but it hasn't been done yet). For example, to multiply the current alpha by a half::
es_es: Cada una de las propiedades se accede con un setter o getter a la antigua usanza (sí, sabemos que esto irrita a los Pythonistas y planeamos soportar el acceso directo a través de propiedades o traits, pero aún no se ha hecho). Por ejemplo, para multiplicar el alfa actual por la mitad::

source: If you want to set a number of properties at once, you can also use the ``set`` method with keyword arguments. For example::
es_es: Si quieres establecer un número de propiedades a la vez, también puedes usar el método ``set`` con argumentos de palabras clave. Por ejemplo::

source: If you are working interactively at the python shell, a handy way to inspect the ``Artist`` properties is to use the :func:`matplotlib.artist.getp` function (simply :func:`~matplotlib.pyplot.getp` in pyplot), which lists the properties and their values. This works for classes derived from ``Artist`` as well, e.g., ``Figure`` and ``Rectangle``. Here are the ``Figure`` rectangle properties mentioned above:
es_es: Si estás trabajando de forma interactiva en el shell de python, una forma práctica de inspeccionar las propiedades de ``Artist`` es utilizar la función :func:`matplotlib.artist.getp` (simplemente :func:`~matplotlib.pyplot.getp` en pyplot), que lista las propiedades y sus valores. Esto funciona también para las clases derivadas de ``Artist``, por ejemplo, ``Figure`` y ``Rectangule``. Aquí están las propiedades del rectángulo de ``Figure`` mencionadas anteriormente:

source: The docstrings for all of the classes also contain the ``Artist`` properties, so you can consult the interactive "help" or the :ref:`artist-api` for a listing of properties for a given object.
es_es: Los docstrings de todas las clases también contienen las propiedades de ``Artist``, por lo que puedes consultar la "ayuda" interactiva o la :ref:`artist-api` para obtener un listado de propiedades de un objeto determinado.

source: Object containers
es_es: Contenedores de objetos

source: Now that we know how to inspect and set the properties of a given object we want to configure, we need to know how to get at that object. As mentioned in the introduction, there are two kinds of objects: primitives and containers. The primitives are usually the things you want to configure (the font of a :class:`~matplotlib.text.Text` instance, the width of a :class:`~matplotlib.lines.Line2D`) although the containers also have some properties as well -- for example the :class:`~matplotlib.axes.Axes` :class:`~matplotlib.artist.Artist` is a container that contains many of the primitives in your plot, but it also has properties like the ``xscale`` to control whether the xaxis is 'linear' or 'log'. In this section we'll review where the various container objects store the ``Artists`` that you want to get at.
es_es: Ahora que sabemos cómo inspeccionar y establecer las propiedades de un objeto determinado que queremos configurar, necesitamos saber cómo llegar a ese objeto. Como se mencionó en la introducción, hay dos tipos de objetos: primitivos y contenedores. Las primitivas son normalmente las cosas que quieres configurar (la fuente de una instancia :class:`~matplotlib.text`, el ancho de una :class:`~matplotlib.lines.Line2D`) aunque los contenedores también tienen algunas propiedades -- por ejemplo la :class:`~matplotlib. axes.Axes` :class:`~matplotlib.artist.Artist` es un contenedor que contiene muchas de las primitivas de su gráfico, pero también tiene propiedades como la ``xscale`` para controlar si el eje x es 'lineal' o 'log'. En esta sección repasaremos dónde los distintos objetos contenedores almacenan los ``Artists`` que quieres conseguir.

source: Figure container
es_es: Contenedor de figura

source: The top level container ``Artist`` is the :class:`matplotlib.figure.Figure`, and it contains everything in the figure. The background of the figure is a :class:`~matplotlib.patches.Rectangle` which is stored in :attr:`Figure.patch <matplotlib.figure.Figure.patch>`. As you add subplots (:meth:`~matplotlib.figure.Figure.add_subplot`) and axes (:meth:`~matplotlib.figure.Figure.add_axes`) to the figure these will be appended to the :attr:`Figure.axes <matplotlib.figure.Figure.axes>`. These are also returned by the methods that create them:
es_es: El contenedor de nivel superior ``Artist`` es la :class:`matplotlib.figure.Figure`, y contiene todo lo que hay en la figura. El fondo de la figura es un :class:`~matplotlib.patches.Rectangle` que se almacena en :attr:`Figure.patch <matplotlib.figure.Figure.patch>`. A medida que se añaden subtramas (:meth:`~matplotlib.figure.Figure.add_subplot`) y ejes (:meth:`~matplotlib.figure.Figure.add_axes`) a la figura, éstos se añadirán al :attr:`Figure.axes <matplotlib.figure.Figure.axes>`. Estos también son devueltos por los métodos que los crean:

source: Because the figure maintains the concept of the "current Axes" (see :meth:`Figure.gca <matplotlib.figure.Figure.gca>` and :meth:`Figure.sca <matplotlib.figure.Figure.sca>`) to support the pylab/pyplot state machine, you should not insert or remove Axes directly from the Axes list, but rather use the :meth:`~matplotlib.figure.Figure.add_subplot` and :meth:`~matplotlib.figure.Figure.add_axes` methods to insert, and the `Axes.remove <matplotlib.artist.Artist.remove>` method to delete. You are free however, to iterate over the list of Axes or index into it to get access to ``Axes`` instances you want to customize. Here is an example which turns all the Axes grids on::
es_es: Debido a que la figura mantiene el concepto de "Ejes actuales" (ver :meth:`Figure.gca <matplotlib.figure.Figure.gca>` y :meth:`Figure.sca <matplotlib.figure.Figure. sca>`) para soportar la máquina de estado de pylab/pyplot, no se debe insertar o eliminar ejes directamente de la lista de ejes, sino que se debe utilizar los métodos :meth:`~matplotlib.figure.Figure.add_subplot` y :meth:`~matplotlib.figure.Figure.add_axes` para insertar, y el método `Axes.remove <matplotlib.artist.Artist.remove>` para eliminarlos. Sin embargo, eres libre de iterar sobre la lista de ejes o indexar en ella para acceder a las instancias de ``Axes`` que quieras personalizar. Aquí hay un ejemplo que activa todas las Cuadrículas de los Ejes::

source: The figure also has its own ``images``, ``lines``, ``patches`` and ``text`` attributes, which you can use to add primitives directly. When doing so, the default coordinate system for the ``Figure`` will simply be in pixels (which is not usually what you want). If you instead use Figure-level methods to add Artists (e.g., using `.Figure.text` to add text), then the default coordinate system will be "figure coordinates" where (0, 0) is the bottom-left of the figure and (1, 1) is the top-right of the figure.
es_es: La figura también tiene sus propios atributos ``imágenes``, ``líneas``, ``parches`` y ``texto``, que puedes utilizar para añadir primitivas directamente. Al hacerlo, el sistema de coordenadas por defecto de la "Figura" será simplemente en píxeles (que normalmente no es lo que quieres). Si, en cambio, utilizas métodos a nivel de Figura para añadir Artistas (por ejemplo, usando `.Figure.texto` para añadir texto), entonces el sistema de coordenadas por defecto será "coordenadas de figura" donde (0, 0) es la parte inferior izquierda de la figura y (1, 1) es la parte superior derecha de la figura.

source: As with all ``Artist``\s, you can control this coordinate system by setting the transform property. You can explicitly use "figure coordinates" by setting the ``Artist`` transform to :attr:`fig.transFigure <matplotlib.figure.Figure.transFigure>`:
es_es: Como con todos los ``Artists``, puedes controlar este sistema de coordenadas estableciendo la propiedad transform. Puedes usar explícitamente "coordenadas de figura" estableciendo la transformación ``Artist`` a :attr:`fig.transFigure <matplotlib.figure.Figure.transFigure>`:

source: Here is a summary of the Artists the Figure contains
es_es: Este es un resumen de los artistas que contiene la figura

source: Figure attribute
es_es: Atributo de la figura

source: A list of `~.axes.Axes` instances (includes Subplot)
es_es: Una lista de instancias de `~.axes.Axes` (incluye Subplot)

source: patch
es_es: parche

source: The `.Rectangle` background
es_es: El fondo `.Rectangle`

source: images
es_es: imágenes

source: A list of `.FigureImage` patches - useful for raw pixel display
es_es: Una lista de parches `.FigureImage` - útiles para la visualización de píxeles en bruto

source: legends
es_es: leyendas

source: A list of Figure `.Legend` instances (different from ``Axes.legends``)
es_es: Una lista de instancias de figuras `.Legend` (diferente de ``Axes.legends``)

source: lines
es_es: líneas

source: A list of Figure `.Line2D` instances (rarely used, see ``Axes.lines``)
es_es: Una lista de instancias de figuras `.Line2D` (raramente usadas, ver ``Axes.lines``)

source: patches
es_es: parches

source: A list of Figure `.Patch`\s (rarely used, see ``Axes.patches``)
es_es: Una lista de figuras `.Patch` (raramente usadas, ver ``Axes.patches``)

source: texts
es_es: textos

source: A list Figure `.Text` instances
es_es: Una lista de instancias de `.Text`
