Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/intermediate/artists.po
Languages: es_es

source: Axes container
es_es: Contenedor de ejes

source: The :class:`matplotlib.axes.Axes` is the center of the Matplotlib universe -- it contains the vast majority of all the ``Artists`` used in a figure with many helper methods to create and add these ``Artists`` to itself, as well as helper methods to access and customize the ``Artists`` it contains. Like the :class:`~matplotlib.figure.Figure`, it contains a :class:`~matplotlib.patches.Patch` :attr:`~matplotlib.axes.Axes.patch` which is a :class:`~matplotlib.patches.Rectangle` for Cartesian coordinates and a :class:`~matplotlib.patches.Circle` for polar coordinates; this patch determines the shape, background and border of the plotting region::
es_es: La :class:`matplotlib.axes.Axes` es el centro del universo Matplotlib -- contiene la gran mayoría de todos los ``Artists`` utilizados en una figura con muchos métodos de ayuda para crear y añadir estos ``Artists`` a sí mismo, así como métodos de ayuda para acceder y personalizar los ``Artists`` que contiene. Al igual que la :class:`~matplotlib.figure.Figure`, contiene un :class:`~matplotlib.patches.Patch` :attr:`~matplotlib.axes.Axes.patch` que es un :class:`~matplotlib.patches.Rectangle` para coordenadas cartesianas y un :class:`~matplotlib.patches.Circle` para coordenadas polares; este parche determina la forma, el fondo y el borde de la región de trazado::

source: When you call a plotting method, e.g., the canonical :meth:`~matplotlib.axes.Axes.plot` and pass in arrays or lists of values, the method will create a :meth:`matplotlib.lines.Line2D` instance, update the line with all the ``Line2D`` properties passed as keyword arguments, add the line to the :attr:`Axes.lines <matplotlib.axes.Axes.lines>` container, and returns it to you:
es_es: Cuando llamas a un método de trazado, por ejemplo, el canónico :meth:`~matplotlib.axes.Axes.plot` y le pasas arreglos o listas de valores, el método creará una instancia :meth:`matplotlib.lines.Line2D`, actualizará la línea con todas las propiedades ``Line2D`` pasadas como argumentos de palabra clave, añadirá la línea al contenedor :attr:`Axes.lines <matplotlib.axes.Axes.lines>`, y te la devolverá:

source: ``plot`` returns a list of lines because you can pass in multiple x, y pairs to plot, and we are unpacking the first element of the length one list into the line variable. The line has been added to the ``Axes.lines`` list:
es_es: ``plot`` devuelve una lista de líneas porque puedes pasar múltiples pares x, y para trazar, y estamos desempaquetando el primer elemento de la lista de longitud uno en la variable línea. La línea se ha añadido a la lista ``Axes.lines``:

source: Similarly, methods that create patches, like :meth:`~matplotlib.axes.Axes.bar` creates a list of rectangles, will add the patches to the :attr:`Axes.patches <matplotlib.axes.Axes.patches>` list:
es_es: Del mismo modo, los métodos que crean parches, como :meth:`~matplotlib.axes.Axes.bar` crea una lista de rectángulos, añadirá los parches a la lista :attr:`Axes.patches <matplotlib.axes.Axes.patches>`:

source: You should not add objects directly to the ``Axes.lines`` or ``Axes.patches`` lists unless you know exactly what you are doing, because the ``Axes`` needs to do a few things when it creates and adds an object. It sets the figure and axes property of the ``Artist``, as well as the default ``Axes`` transformation (unless a transformation is set). It also inspects the data contained in the ``Artist`` to update the data structures controlling auto-scaling, so that the view limits can be adjusted to contain the plotted data. You can, nonetheless, create objects yourself and add them directly to the ``Axes`` using helper methods like :meth:`~matplotlib.axes.Axes.add_line` and :meth:`~matplotlib.axes.Axes.add_patch`. Here is an annotated interactive session illustrating what is going on:
es_es: No deberías añadir objetos directamente a las listas ``Axes.lines`` o ``Axes.patches`` a menos que sepas exactamente lo que estás haciendo, porque ``Axes`` necesita hacer algunas cosas cuando crea y añade un objeto. Establece la figura y la propiedad de los ejes del ``Artist``, así como la transformación por defecto de ``Axes`` (a menos que se establezca una transformación). También inspecciona los datos contenidos en el ``Artist`` para actualizar las estructuras de datos que controlan el auto-escalado, de modo que los límites de la vista puedan ser ajustados para contener los datos trazados. No obstante, puedes crear objetos tú mismo y añadirlos directamente a los ``Axes`` utilizando métodos de ayuda como :meth:`~matplotlib.axes.Axes.add_line` y :meth:`~matplotlib.axes.Axes.add_patch`. Aquí hay una sesión interactiva anotada que ilustra lo que está pasando:

source: There are many, many ``Axes`` helper methods for creating primitive ``Artists`` and adding them to their respective containers. The table below summarizes a small sampling of them, the kinds of ``Artist`` they create, and where they store them
es_es: Hay muchos, muchos métodos de ayuda de ``Axes`` para crear ``Artists`` primitivos y añadirlos a sus respectivos contenedores. La siguiente tabla resume una pequeña muestra de ellos, los tipos de ``Artists`` que crean, y dónde los almacenan

source: Axes helper method
es_es: Método de ayuda de los ejes

source: Container
es_es: Contenedor

source: `~.axes.Axes.annotate` - text annotations
es_es: `~.axes.Axes.annotate` - anotaciones de texto

source: `~.axes.Axes.bar` - bar charts
es_es: `~.axes.Axes.bar` - gráficos de barras

source: `~.axes.Axes.errorbar` - error bar plots
es_es: `~.axes.Axes.errorbar` - gráficos de barras de error

source: `.Line2D` and `.Rectangle`
es_es: `.Línea2D` y `.Rectangule`

source: ax.lines and ax.patches
es_es: ax.lines y ax.patches

source: `~.axes.Axes.fill` - shared area
es_es: `~.ejes.Ejes.relleno` - área compartida

source: `~.axes.Axes.hist` - histograms
es_es: `~.axes.Axes.hist` - histogramas

source: `~.axes.Axes.imshow` - image data
es_es: `~.axes.Axes.imshow` - datos de la imagen

source: `~.axes.Axes.legend` - Axes legends
es_es: `~.axes.Axes.legend` - Leyendas de los ejes

source: `~.axes.Axes.plot` - xy plots
es_es: `~.axes.Axes.plot` - gráficos xy

source: `~.axes.Axes.scatter` - scatter charts
es_es: `~.axes.Axes.scatter` - gráficos de dispersión

source: `~.axes.Axes.text` - text
es_es: `~.axes.Axes.text` - texto

source: In addition to all of these ``Artists``, the ``Axes`` contains two important ``Artist`` containers: the :class:`~matplotlib.axis.XAxis` and :class:`~matplotlib.axis.YAxis`, which handle the drawing of the ticks and labels. These are stored as instance variables :attr:`~matplotlib.axes.Axes.xaxis` and :attr:`~matplotlib.axes.Axes.yaxis`. The ``XAxis`` and ``YAxis`` containers will be detailed below, but note that the ``Axes`` contains many helper methods which forward calls on to the :class:`~matplotlib.axis.Axis` instances so you often do not need to work with them directly unless you want to. For example, you can set the font color of the ``XAxis`` ticklabels using the ``Axes`` helper method::
es_es: Además de todos estos ``Artistas``, el ``Axes`` contiene dos importantes contenedores ``Artists``: el :class:`~matplotlib.axis.XAxis` y el :class:`~matplotlib.axis.YAxis`, que se encargan de dibujar los ticks y las etiquetas. Se almacenan como variables de instancia :attr:`~matplotlib.axes.Axes.xaxis` y :attr:`~matplotlib.axes.Axes.yaxis`. Los contenedores ``XAxis`` y ``YAxis`` se detallarán más adelante, pero ten en cuenta que los ``Axes`` contienen muchos métodos de ayuda que reenvían las llamadas a las instancias de :class:`~matplotlib.axis.Axis` por lo que a menudo no es necesario trabajar con ellos directamente a menos que lo desees. Por ejemplo, puedes establecer el color de la fuente de las etiquetas del ``EjeX`` utilizando el método de ayuda ``Axes``::

source: Below is a summary of the Artists that the Axes contains
es_es: A continuación se muestra un resumen de los Artists que contiene el Eje

source: Axes attribute
es_es: Atributo de los ejes

source: A list of `.Artist` instances
es_es: Una lista de instancias de `.Artist`

source: `.Rectangle` instance for Axes background
es_es: Instancia de `.Rectangle` para el fondo de los Ejes

source: collections
es_es: colecciones

source: A list of `.Collection` instances
es_es: Una lista de instancias de `.Collection`

source: A list of `.AxesImage`
es_es: Una lista de instancias de `.AxesImage`

source: A list of `.Legend` instances
es_es: Una lista de instancias de `.Legend`

source: A list of `.Line2D` instances
es_es: Una lista de instancias de `.Line2D`

source: A list of `.Patch` instances
es_es: Una lista de instancias de `.Patch`

source: A list of `.Text` instances
es_es: Una lista de instancias de `.Text`

source: A `matplotlib.axis.XAxis` instance
es_es: Una instancia de `matplotlib.axis.XAxis`

source: A `matplotlib.axis.YAxis` instance
es_es: Una instancia de `matplotlib.axis.YAxis`

source: Axis containers
es_es: Contenedores de ejes

source: The :class:`matplotlib.axis.Axis` instances handle the drawing of the tick lines, the grid lines, the tick labels and the axis label. You can configure the left and right ticks separately for the y-axis, and the upper and lower ticks separately for the x-axis. The ``Axis`` also stores the data and view intervals used in auto-scaling, panning and zooming, as well as the :class:`~matplotlib.ticker.Locator` and :class:`~matplotlib.ticker.Formatter` instances which control where the ticks are placed and how they are represented as strings.
es_es: Las instancias :class:`matplotlib.axis.Axis` se encargan de dibujar las líneas de marcador, las líneas de Cuadrícula, las etiquetas de marcador y la etiqueta del eje. Puedes configurar los marcadores izquierdo y derecho por separado para el eje y, y los marcadores superior e inferior por separado para el eje x. El ``Axis`` también almacena los datos y los intervalos de vista utilizados en el autoescalado, la panorámica y el zoom, así como las instancias :class:`~matplotlib.ticker.Locator` y :class:`~matplotlib.ticker.Formatter` que controlan dónde se colocan los marcadores y cómo se representan como cadenas.

source: Each ``Axis`` object contains a :attr:`~matplotlib.axis.Axis.label` attribute (this is what :mod:`.pyplot` modifies in calls to `~.pyplot.xlabel` and `~.pyplot.ylabel`) as well as a list of major and minor ticks. The ticks are `.axis.XTick` and `.axis.YTick` instances, which contain the actual line and text primitives that render the ticks and ticklabels. Because the ticks are dynamically created as needed (e.g., when panning and zooming), you should access the lists of major and minor ticks through their accessor methods `.axis.Axis.get_major_ticks` and `.axis.Axis.get_minor_ticks`. Although the ticks contain all the primitives and will be covered below, ``Axis`` instances have accessor methods that return the tick lines, tick labels, tick locations etc.:
es_es: Cada objeto ``Axis`` contiene un atributo :attr:`~matplotlib.axis.Axis.label` (esto es lo que modifica :mod:`.pyplot` en las llamadas a `~.pyplot.xlabel` y `~.pyplot.ylabel`) así como una lista de marcadores mayores y menores. Los marcadores son instancias de `.axis.XTick` y `.axis.YTick`, que contienen las primitivas de línea y texto que representan los marcadores y las etiquetas. Dado que los marcadores se crean dinámicamente cuando se necesitan (por ejemplo, cuando se hace paneo y zoom), debes acceder a las listas de marcadores mayores y menores a través de sus métodos de acceso `.axis.Axis.get_major_ticks` y `.axis.Axis.get_minor_ticks`. Aunque los ticks contienen todas las primitivas y se cubrirán más adelante, las instancias de ``Axis`` tienen métodos de acceso que devuelven las líneas de los marcadores, las etiquetas de los marcadores, las ubicaciones de los marcadores, etc:

source: Out:
es_es: Salida:

source: note there are twice as many ticklines as labels because by default there are tick lines at the top and bottom but only tick labels below the xaxis; however, this can be customized.
es_es: nota que hay el doble de líneas de marcación que de etiquetas porque por defecto hay líneas de marcación en la parte superior e inferior pero sólo etiquetas de marcación debajo del eje x; sin embargo, esto puede ser personalizado.

source: And with the above methods, you only get lists of major ticks back by default, but you can also ask for the minor ticks:
es_es: Y con los métodos anteriores, sólo se obtienen listas de marcadores mayores por defecto, pero también se pueden pedir los marcadores menores:

source: Here is a summary of some of the useful accessor methods of the ``Axis`` (these have corresponding setters where useful, such as :meth:`~matplotlib.axis.Axis.set_major_formatter`.)
es_es: Aquí hay un resumen de algunos de los métodos accesores útiles del ``Axis`` (estos tienen sus correspondientes setters cuando son útiles, como :meth:`~matplotlib.axis.Axis.set_major_formatter`)

source: Axis accessor method
es_es: Método de acceso al eje

source: The scale of the Axis, e.g., 'log' or 'linear'
es_es: La escala del Axis, por ejemplo, 'log' o 'lineal'

source: The interval instance of the Axis view limits
es_es: La instancia del intervalo de los límites de la vista del eje

source: The interval instance of the Axis data limits
es_es: La instancia de intervalo de los límites de datos del Eje

source: A list of grid lines for the Axis
es_es: Una lista de líneas de cuadrícula para el Eje

source: The Axis label - a `.Text` instance
es_es: La etiqueta del eje - una instancia `.Text`

source: The Axis offset text - a `.Text` instance
es_es: El texto de desplazamiento del eje - una instancia `.Text`

source: A list of `.Text` instances - keyword minor=True|False
es_es: Una lista de instancias `.Text` - palabra clave minor=True|False

source: A list of `.Line2D` instances - keyword minor=True|False
es_es: Una lista de instancias de `.Line2D` - palabra clave minor=True|False

source: A list of Tick locations - keyword minor=True|False
es_es: Una lista de ubicaciones de Marcadores - palabra clave minor=True|False

source: The `.ticker.Locator` instance for major ticks
es_es: La instancia `.ticker.Locator` para los marcadores mayores

source: The `.ticker.Formatter` instance for major ticks
es_es: La instancia `.ticker.Formatter` para los marcadores mayores

source: The `.ticker.Locator` instance for minor ticks
es_es: La instancia `.ticker.Locator` para los ticks menores

source: The `.ticker.Formatter` instance for minor ticks
es_es: La instancia `.ticker.Formatter` para marcadores menores

source: A list of `.Tick` instances for major ticks
es_es: Una lista de instancias `.Tick` para marcadores mayores

source: A list of `.Tick` instances for minor ticks
es_es: Una lista de instancias `.Tick` para los marcadores menores

source: Turn the grid on or off for the major or minor ticks
es_es: Activa o desactiva la Cuadrícula para los marcadores mayores o menores

source: Here is an example, not recommended for its beauty, which customizes the Axes and Tick properties.
es_es: Aquí hay un ejemplo, no recomendado por su belleza, que personaliza las propiedades de Ejes y Marcadores.

source: Tick containers
es_es: Contenedores de marcadores

source: The :class:`matplotlib.axis.Tick` is the final container object in our descent from the :class:`~matplotlib.figure.Figure` to the :class:`~matplotlib.axes.Axes` to the :class:`~matplotlib.axis.Axis` to the :class:`~matplotlib.axis.Tick`. The ``Tick`` contains the tick and grid line instances, as well as the label instances for the upper and lower ticks. Each of these is accessible directly as an attribute of the ``Tick``.
es_es: El :class:`matplotlib.axis.Tick` es el último objeto contenedor en nuestro descenso desde el :class:`~matplotlib.figure.Figure` al :class:`~matplotlib.axes.Axes` al :class:`~matplotlib.axis.Axis` al :class:`~matplotlib.axis.Tick`. El ``Tick`` contiene las instancias de los marcadores y de las líneas de la cuadrícula, así como las instancias de las etiquetas de los marcadores superiores e inferiores. Cada uno de ellos es accesible directamente como un atributo del ``Tick``.

source: Tick attribute
es_es: Atributo del marcador

source: A `.Line2D` instance
es_es: Una instancia de `.Line2D`

source: A `.Text` instance
es_es: Una instancia de `.Text`

source: Here is an example which sets the formatter for the right side ticks with dollar signs and colors them green on the right side of the yaxis.
es_es: Aquí hay un ejemplo que establece el formateador para los marcadores del lado derecho con signos de dólar y los colorea de verde en el lado derecho del eje y.

source: **Total running time of the script:** ( 0 minutes 1.225 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.225 segundos)

source: :download:`Download Python source code: artists.py <artists.py>`
es_es: :download:`Descargar código fuente de Python: artists.py <artists.py>`

source: :download:`Download Jupyter notebook: artists.ipynb <artists.ipynb>`
es_es: :download:`Descargar Jupyter notebook: artists.ipynb <artists.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
