Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/intermediate/autoscale.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_intermediate_autoscale.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_tutorials_intermediate_autoscale.py>` para descargar el código de ejemplo completo

source: Autoscaling
es_es: Autoescalado

source: The limits on an axis can be set manually (e.g. ``ax.set_xlim(xmin, xmax)``) or Matplotlib can set them automatically based on the data already on the axes. There are a number of options to this autoscaling behaviour, discussed below.
es_es: Los límites de un eje pueden establecerse manualmente (por ejemplo, ``ax.set_xlim(xmin, xmax)``) o Matplotlib puede establecerlos automáticamente basándose en los datos ya existentes en los ejes. Hay una serie de opciones para este comportamiento de autoescalado, que se discuten a continuación.

source: We will start with a simple line plot showing that autoscaling extends the axis limits 5% beyond the data limits (-2π, 2π).
es_es: Comenzaremos con un simple gráfico de líneas que muestra que el autoescalado extiende los límites del eje un 5% más allá de los límites de los datos (-2π, 2π).

source: Out:
es_es: Salida:

source: Margins
es_es: Márgenes

source: The default margin around the data limits is 5%:
es_es: El margen por defecto alrededor de los límites de los datos es del 5%:

source: The margins can be made larger using `~matplotlib.axes.Axes.margins`:
es_es: Los márgenes pueden hacerse más grandes usando `~matplotlib.axes.Axes.margins`:

source: In general, margins can be in the range (-0.5, ∞), where negative margins set the axes limits to a subrange of the data range, i.e. they clip data. Using a single number for margins affects both axes, a single margin can be customized using keyword arguments ``x`` or ``y``, but positional and keyword interface cannot be combined.
es_es: En general, los márgenes pueden estar en el rango (-0.5, ∞), donde los márgenes negativos establecen los límites de los ejes en un subrango del rango de datos, es decir, recortan los datos. El uso de un único número para los márgenes afecta a ambos ejes, un único margen puede personalizarse utilizando argumentos de palabra clave ``x`` o ``y``, pero la interfaz posicional y la de palabra clave no pueden combinarse.

source: Sticky edges
es_es: Bordes pegajosos

source: There are plot elements (`.Artist`\s) that are usually used without margins. For example false-color images (e.g. created with `.Axes.imshow`) are not considered in the margins calculation.
es_es: Hay elementos de trazado (`.Artist`s) que normalmente se utilizan sin márgenes. Por ejemplo, las imágenes de falso color (por ejemplo, creadas con `.Axes.imshow`) no se tienen en cuenta en el cálculo de los márgenes.

source: This override of margins is determined by "sticky edges", a property of `.Artist` class that can suppress adding margins to axis limits. The effect of sticky edges can be disabled on an Axes by changing `~matplotlib.axes.Axes.use_sticky_edges`. Artists have a property `.Artist.sticky_edges`, and the values of sticky edges can be changed by writing to ``Artist.sticky_edges.x`` or ``Artist.sticky_edges.y``.
es_es: Esta sobreescritura de los márgenes está determinada por "sticky edges", una propiedad de la clase `.Artist` que puede suprimir la adición de márgenes a los límites de los ejes. El efecto de los bordes pegajosos puede desactivarse en un eje cambiando `~matplotlib.axes.Axes.use_sticky_edges`. Los artists tienen una propiedad `.Artist.sticky_edges`, y los valores de los bordes pegajosos se pueden cambiar escribiendo en ``Artist.sticky_edges.x`` o ``Artist.sticky_edges.y``.

source: The following example shows how overriding works and when it is needed.
es_es: El siguiente ejemplo muestra cómo funciona la sobreescritura (overriding) y cuándo es necesario.

source: We can see that setting ``use_sticky_edges`` to *False* renders the image with requested margins.
es_es: Podemos ver que al establecer ``use_sticky_edges`` a *False* se renderiza la imagen con los márgenes solicitados.

source: While sticky edges don't increase the axis limits through extra margins, negative margins are still taken into account. This can be seen in the reduced limits of the third image.
es_es: Aunque los bordes pegajosos no aumentan los límites de los ejes mediante márgenes adicionales, los márgenes negativos se siguen teniendo en cuenta. Esto puede verse en los límites reducidos de la tercera imagen.

source: Controlling autoscale
es_es: Controlando la autoescala

source: By default, the limits are recalculated every time you add a new curve to the plot:
es_es: Por defecto, los límites se recalculan cada vez que se añade una nueva curva al gráfico:

source: However, there are cases when you don't want to automatically adjust the viewport to new data.
es_es: Sin embargo, hay casos en los que no se quiere ajustar automáticamente la ventana gráfica a los nuevos datos.

source: One way to disable autoscaling is to manually set the axis limit. Let's say that we want to see only a part of the data in greater detail. Setting the ``xlim`` persists even if we add more curves to the data. To recalculate the new limits calling `.Axes.autoscale` will toggle the functionality manually.
es_es: Una forma de desactivar el autoescalado es establecer manualmente el límite de los ejes. Digamos que queremos ver sólo una parte de los datos con mayor detalle. La configuración del ``xlim`` persiste incluso si añadimos más curvas a los datos. Para recalcular los nuevos límites llamando a `.Axes.autoscale` se activará la funcionalidad manualmente.

source: We can check that the first plot has autoscale disabled and that the second plot has it enabled again by using `.Axes.get_autoscale_on()`:
es_es: Podemos comprobar que el primer gráfico tiene la autoescala desactivada y que el segundo lo tiene activado de nuevo utilizando `.Axes.get_autoscale_on()`:

source: Arguments of the autoscale function give us precise control over the process of autoscaling. A combination of arguments ``enable``, and ``axis`` sets the autoscaling feature for the selected axis (or both). The argument ``tight`` sets the margin of the selected axis to zero. To preserve settings of either ``enable`` or ``tight`` you can set the opposite one to *None*, that way it should not be modified. However, setting ``enable`` to *None* and tight to *True* affects both axes regardless of the ``axis`` argument.
es_es: Los argumentos de la función autoscale nos dan un control preciso sobre el proceso de autoescalado. Una combinación de argumentos ``enable``, y ``axis`` establece la función de autoescalado para el eje seleccionado (o ambos). El argumento ``tight`` establece el margen del eje seleccionado a cero. Para preservar los ajustes de ``enable`` o ``tight`` puedes establecer el opuesto a *None*, de esta forma no se modificará. Sin embargo, establecer ``enable`` a *None* y tight a *True* afecta a ambos ejes independientemente del argumento ``axis``.

source: Working with collections
es_es: Trabajando con colecciones

source: Autoscale works out of the box for all lines, patches, and images added to the axes. One of the artists that it won't work with is a `.Collection`. After adding a collection to the axes, one has to manually trigger the `~matplotlib.axes.Axes.autoscale_view()` to recalculate axes limits.
es_es: La autoescala funciona de forma inmediata para todas las líneas, parches e imágenes añadidas a los ejes. Uno de los artists con los que no funcionará es un `.Collection`. Después de añadir una colección a los ejes, uno tiene que activar manualmente el `~matplotlib.axes.Axes.autoscale_view()` para recalcular los límites de los ejes.

source: **Total running time of the script:** ( 0 minutes 4.990 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 4.990 segundos)

source: :download:`Download Python source code: autoscale.py <autoscale.py>`
es_es: :download:`Descargar código fuente de Python: autoscale.py <autoscale.py>`

source: :download:`Download Jupyter notebook: autoscale.ipynb <autoscale.ipynb>`
es_es: :download:`Descargar Jupyter notebook: autoscale.ipynb <autoscale.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
