Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/intermediate/color_cycle.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_intermediate_color_cycle.py>` to download the full example code
es_es: Pulsa :ref:`aquí <sphx_glr_download_tutorials_intermediate_color_cycle.py>` para descargar el código de ejemplo completo

source: Styling with cycler
es_es: Estilización con cycler

source: Demo of custom property-cycle settings to control colors and other style properties for multi-line plots.
es_es: Demostración de la configuración del ciclo de propiedades personalizado para controlar los colores y otras propiedades de estilo para los gráficos multilínea.

source: More complete documentation of the ``cycler`` API can be found `here <https://matplotlib.org/cycler/>`_.
es_es: Una documentación más completa de la API ``cycler`` puede encontrarse `aquí <https://matplotlib.org/cycler/>`.

source: This example demonstrates two different APIs:
es_es: Este ejemplo demuestra dos APIs diferentes:

source: Setting the rc parameter specifying the default property cycle. This affects all subsequent axes (but not axes already created).
es_es: Estableciendo el parámetro rc que especifica el ciclo de la propiedad por defecto. Esto afecta a todos los ejes posteriores (pero no a los ejes ya creados).

source: Setting the property cycle for a single pair of axes.
es_es: Establecer el ciclo de propiedades para un solo par de ejes.

source: First we'll generate some sample data, in this case, four offset sine curves.
es_es: Primero generaremos algunos datos de muestra, en este caso, cuatro curvas sinusoidales desplazadas.

source: Now ``yy`` has shape
es_es: Ahora ``yy`` tiene forma

source: Out:
es_es: Salida:

source: So ``yy[:, i]`` will give you the ``i``-th offset sine curve. Let's set the default ``prop_cycle`` using :func:`matplotlib.pyplot.rc`. We'll combine a color cycler and a linestyle cycler by adding (``+``) two ``cycler``'s together. See the bottom of this tutorial for more information about combining different cyclers.
es_es: Así que ``yy[:, i]`` te dará la curva sinusoidal de desplazamiento ``i``. Vamos a configurar el ``prop_cycle`` por defecto usando :func:`matplotlib.pyplot.rc`. Combinaremos un ciclador de color y un ciclador de estilo de línea añadiendo (``+``) dos ``cicladores`` juntos. Consulta la parte inferior de este tutorial para obtener más información sobre la combinación de diferentes cicladores.

source: Now we'll generate a figure with two axes, one on top of the other. On the first axis, we'll plot with the default cycler. On the second axis, we'll set the ``prop_cycle`` using :func:`matplotlib.axes.Axes.set_prop_cycle`, which will only set the ``prop_cycle`` for this :mod:`matplotlib.axes.Axes` instance. We'll use a second ``cycler`` that combines a color cycler and a linewidth cycler.
es_es: Ahora generaremos una figura con dos ejes, uno encima del otro. En el primer eje, trazaremos con el ciclador por defecto. En el segundo eje, estableceremos el ``prop_cycle`` usando :func:`matplotlib.axes.Axes.set_prop_cycle`, que sólo establecerá el ``prop_cycle`` para esta instancia de :mod:`matplotlib.axes.Axes`. Usaremos un segundo ``ciclador`` que combina un ciclador de color y un ciclador de ancho de línea.

source: Setting ``prop_cycle`` in the :file:`matplotlibrc` file or style files
es_es: Establecer ``prop_cycle`` en el archivo :file:`matplotlibrc` o en los archivos de estilo

source: Remember, a custom cycler can be set in your :file:`matplotlibrc` file or a style file (:file:`style.mplstyle`) under ``axes.prop_cycle``:
es_es: Recuerde que puede establecer un ciclador personalizado en su archivo :file:`matplotlibrc` o en un archivo de estilo (:file:`style.mplstyle`) en ``axes.prop_cycle``:

source: Cycling through multiple properties
es_es: Ciclo a través de múltiples propiedades

source: You can add cyclers:
es_es: Puedes añadir cicladores:

source: Results in:
es_es: Resulta en:

source: You can multiply cyclers:
es_es: Puedes multiplicar los ciclos:

source: :download:`Download Python source code: color_cycle.py <color_cycle.py>`
es_es: :download:`Descargar código fuente de Python: color_cycle.py <color_cycle.py>`

source: :download:`Download Jupyter notebook: color_cycle.ipynb <color_cycle.ipynb>`
es_es: :download:`Descargar Jupyter notebook: color_cycle.ipynb <color_cycle.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
