Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/intermediate/constrainedlayout_guide.po
Languages: es_es

source: where ``bbox`` is the tight bounding box of the axes, and ``pos`` its position. Note how the four margins encompass the axes decorations.
es_es: donde ``bbox`` es la caja delimitadora de los ejes, y ``pos`` su posición. Observe cómo los cuatro márgenes abarcan las decoraciones de los ejes.

source: Simple case: two Axes
es_es: Caso simple: dos Ejes

source: When there are multiple axes they have their layouts bound in simple ways. In this example the left axes has much larger decorations than the right, but they share a bottom margin, which is made large enough to accommodate the larger xlabel. Same with the shared top margin. The left and right margins are not shared, and hence are allowed to be different.
es_es: Cuando hay varios ejes, éstos tienen sus diseños limitados de forma sencilla. En este ejemplo el eje de la izquierda tiene decoraciones mucho más grandes que el de la derecha, pero comparten un margen inferior, que se hace lo suficientemente grande para acomodar la etiqueta x más grande. Lo mismo ocurre con el margen superior compartido. Los márgenes izquierdo y derecho no son compartidos, y por lo tanto se permite que sean diferentes.

source: Two Axes and colorbar
es_es: Dos ejes y barra de colores

source: A colorbar is simply another item that expands the margin of the parent layoutgrid cell:
es_es: Una barra de color es simplemente otro elemento que expande el margen de la celda del layoutgrid padre:

source: Colorbar associated with a Gridspec
es_es: Barra de colores asociada a una Gridspec

source: If a colorbar belongs to more than one cell of the grid, then it makes a larger margin for each:
es_es: Si una barra de color pertenece a más de una celda de la Cuadrícula, entonces hace un margen mayor para cada una:

source: Uneven sized Axes
es_es: Ejes de tamaño desigual

source: There are two ways to make axes have an uneven size in a Gridspec layout, either by specifying them to cross Gridspecs rows or columns, or by specifying width and height ratios.
es_es: Hay dos maneras de hacer que los ejes tengan un tamaño desigual en un diseño Gridspec, ya sea especificando que crucen las filas o columnas de Gridspecs, o especificando las relaciones de anchura y altura.

source: The first method is used here. Note that the middle ``top`` and ``bottom`` margins are not affected by the left-hand column. This is a conscious decision of the algorithm, and leads to the case where the two right-hand axes have the same height, but it is not 1/2 the height of the left-hand axes. This is consietent with how ``gridspec`` works without constrained layout.
es_es: Aquí se utiliza el primer método. Nótese que los márgenes centrales ``top`` y ``bottom`` no se ven afectados por la columna de la izquierda. Esta es una decisión consciente del algoritmo, y conduce al caso en que los dos ejes de la derecha tienen la misma altura, pero no es 1/2 la altura de los ejes de la izquierda. Esto es coherente con la forma en que ``gridspec`` funciona sin diseño restringido.

source: One case that requires finessing is if margins do not have any artists constraining their width. In the case below, the right margin for column 0 and the left margin for column 3 have no margin artists to set their width, so we take the maximum width of the margin widths that do have artists. This makes all the axes have the same size:
es_es: Un caso que requiere un ajuste es si los márgenes no tienen ningún artista que restrinja su anchura. En el caso de abajo, el margen derecho de la columna 0 y el margen izquierdo de la columna 3 no tienen artistas de margen que fijen su ancho, por lo que tomamos el ancho máximo de los anchos de margen que sí tienen artists. Esto hace que todos los ejes tengan el mismo tamaño:

source: **Total running time of the script:** ( 0 minutes 18.128 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 18,128 segundos)

source: :download:`Download Python source code: constrainedlayout_guide.py <constrainedlayout_guide.py>`
es_es: :download:`Descargar código fuente de Python: constrainedlayout_guide.py <constrainedlayout_guide.py>`

source: :download:`Download Jupyter notebook: constrainedlayout_guide.ipynb <constrainedlayout_guide.ipynb>`
es_es: :download:`Descargar Jupyter notebook: constrainedlayout_guide.ipynb <constrainedlayout_guide.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
