Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/intermediate/imshow_extent.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_intermediate_imshow_extent.py>` to download the full example code
es_es: Haga clic en :ref:`aquí <sphx_glr_download_tutorials_intermediate_imshow_extent.py>` para descargar el código de ejemplo completo

source: *origin* and *extent* in `~.Axes.imshow`
es_es: *origen* y *extensión* en `~.Axes.imshow`

source: :meth:`~.Axes.imshow` allows you to render an image (either a 2D array which will be color-mapped (based on *norm* and *cmap*) or a 3D RGB(A) array which will be used as-is) to a rectangular region in data space. The orientation of the image in the final rendering is controlled by the *origin* and *extent* keyword arguments (and attributes on the resulting `.AxesImage` instance) and the data limits of the axes.
es_es: :meth:`~.Axes.imshow` permite renderizar una imagen (ya sea un arreglo 2D que será mapeado en color (basado en *norm* y *cmap*) o un arreglo 3D RGB(A) que será usado tal cual) a una región rectangular en el espacio de datos. La orientación de la imagen en el renderizado final está controlada por los argumentos de la palabra clave *origin* y *extent* (y los atributos de la instancia resultante `.AxesImage`) y los límites de datos de los ejes.

source: The *extent* keyword arguments controls the bounding box in data coordinates that the image will fill specified as ``(left, right, bottom, top)`` in **data coordinates**, the *origin* keyword argument controls how the image fills that bounding box, and the orientation in the final rendered image is also affected by the axes limits.
es_es: Los argumentos de la palabra clave *extent* controlan el cuadro delimitador en coordenadas de datos que la imagen llenará especificado como ``(izquierda, derecha, abajo, arriba)`` en **coordenadas de datos**, el argumento de la palabra clave *origin* controla cómo la imagen llena ese cuadro delimitador, y la orientación en la imagen renderizada final también se ve afectada por los límites de los ejes.

source: Most of the code below is used for adding labels and informative text to the plots. The described effects of *origin* and *extent* can be seen in the plots without the need to follow all code details.
es_es: La mayor parte del código siguiente se utiliza para añadir etiquetas y texto informativo a los gráficos. Los efectos descritos de *origen* y *extensión* pueden verse en los gráficos sin necesidad de seguir todos los detalles del código.

source: For a quick understanding, you may want to skip the code details below and directly continue with the discussion of the results.
es_es: Para una rápida comprensión, es posible que quieras omitir los detalles del código a continuación y continuar directamente con la discusión de los resultados.

source: Default extent
es_es: Extensión por defecto

source: First, let's have a look at the default ``extent=None``
es_es: En primer lugar, vamos a echar un vistazo a la opción por defecto ``extent=None``

source: Out:
es_es: Salida:

source: Generally, for an array of shape (M, N), the first index runs along the vertical, the second index runs along the horizontal. The pixel centers are at integer positions ranging from 0 to ``N' = N - 1`` horizontally and from 0 to ``M' = M - 1`` vertically. *origin* determines how the data is filled in the bounding box.
es_es: Generalmente, para un arreglo de forma (M, N), el primer índice corre a lo largo de la vertical, el segundo índice corre a lo largo de la horizontal. Los centros de los píxeles están en posiciones enteras que van de 0 a ``N' = N - 1`` horizontalmente y de 0 a ``M' = M - 1`` verticalmente. *origin* determina cómo se rellenan los datos en el cuadro delimitador.

source: For ``origin='lower'``:
es_es: Para ``origin='lower'``:

source: [0, 0] is at (left, bottom)
es_es: [0, 0] está en (izquierda, abajo)

source: [M', 0] is at (left, top)
es_es: [M', 0] está en (izquierda, arriba)

source: [0, N'] is at (right, bottom)
es_es: [0, N'] está en (derecha, abajo)

source: [M', N'] is at (right, top)
es_es: [M', N'] está en (derecha, arriba)

source: ``origin='upper'`` reverses the vertical axes direction and filling:
es_es: ``origin='upper'`` invierte la dirección de los ejes verticales y el relleno:

source: [0, 0] is at (left, top)
es_es: [0, 0] está en (izquierda, arriba)

source: [M', 0] is at (left, bottom)
es_es: [M', 0] está en (izquierda, abajo)

source: [0, N'] is at (right, top)
es_es: [0, N'] está en (derecha, arriba)

source: [M', N'] is at (right, bottom)
es_es: [M', N'] está en (derecha, abajo)

source: In summary, the position of the [0, 0] index as well as the extent are influenced by *origin*:
es_es: En resumen, la posición del índice [0, 0] así como la extensión están influenciadas por *origen*:

source: origin
es_es: origen

source: [0, 0] position
es_es: Posición [0, 0]

source: extent
es_es: extensión

source: upper
es_es: superior

source: top left
es_es: arriba a la izquierda

source: lower
es_es: inferior

source: bottom left
es_es: abajo a la izquierda

source: The default value of *origin* is set by :rc:`image.origin` which defaults to ``'upper'`` to match the matrix indexing conventions in math and computer graphics image indexing conventions.
es_es: El valor por defecto de *origin* es establecido por :rc:`image.origin` que por defecto es ``'upper'`` para coincidir con las convenciones de indexación de matrices en matemáticas y gráficos por ordenador.

source: Explicit extent
es_es: Extensión explícita

source: By setting *extent* we define the coordinates of the image area. The underlying image data is interpolated/resampled to fill that area.
es_es: Al establecer *extent* definimos las coordenadas del área de la imagen. Los datos de la imagen subyacente se interpolan/remuestrean para llenar esa área.

source: If the axes is set to autoscale, then the view limits of the axes are set to match the *extent* which ensures that the coordinate set by ``(left, bottom)`` is at the bottom left of the axes! However, this may invert the axis so they do not increase in the 'natural' direction.
es_es: ¡Si los ejes están configurados en autoescala, entonces los límites de la vista de los ejes se establecen para que coincidan con el *extento*, lo que asegura que la coordenada establecida por ``(left, bottom)`` esté en la parte inferior izquierda de los ejes! Sin embargo, esto puede invertir los ejes para que no aumenten en la dirección "natural".

source: Explicit extent and axes limits
es_es: Límites explícitos de extensión y ejes

source: If we fix the axes limits by explicitly setting `~.axes.Axes.set_xlim` / `~.axes.Axes.set_ylim`, we force a certain size and orientation of the axes. This can decouple the 'left-right' and 'top-bottom' sense of the image from the orientation on the screen.
es_es: Si arreglamos los límites de los ejes estableciendo explícitamente `~.axes.Axes.set_xlim` / `~.axes.Axes.set_ylim`, forzamos un determinado tamaño y orientación de los ejes. Esto puede desacoplar el sentido 'izquierda-derecha' y 'arriba-abajo' de la imagen de la orientación en la pantalla.

source: In the example below we have chosen the limits slightly larger than the extent (note the white areas within the Axes).
es_es: En el ejemplo siguiente hemos elegido los límites ligeramente más grandes que la extensión (observe las áreas blancas dentro de los Ejes).

source: While we keep the extents as in the examples before, the coordinate (0, 0) is now explicitly put at the bottom left and values increase to up and to the right (from the viewer's point of view). We can see that:
es_es: Aunque mantenemos las extensiones como en los ejemplos anteriores, la coordenada (0, 0) se pone ahora explícitamente en la parte inferior izquierda y los valores aumentan hacia arriba y hacia la derecha (desde el punto de vista del espectador). Podemos ver que:

source: The coordinate ``(left, bottom)`` anchors the image which then fills the box going towards the ``(right, top)`` point in data space.
es_es: La coordenada ``(izquierda, abajo)`` ancla la imagen que luego llena la caja yendo hacia el punto ``(derecha, arriba)`` en el espacio de datos.

source: The first column is always closest to the 'left'.
es_es: La primera columna es siempre la más cercana a la 'izquierda'.

source: *origin* controls if the first row is closest to 'top' or 'bottom'.
es_es: *origin* controla si la primera fila es la más cercana a 'top' o 'bottom'.

source: The image may be inverted along either direction.
es_es: La imagen puede ser invertida en cualquier dirección.

source: The 'left-right' and 'top-bottom' sense of the image may be uncoupled from the orientation on the screen.
es_es: El sentido 'izquierda-derecha' y 'arriba-abajo' de la imagen puede desacoplarse de la orientación en la pantalla.

source: **Total running time of the script:** ( 0 minutes 3.394 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 3.394 segundos)

source: :download:`Download Python source code: imshow_extent.py <imshow_extent.py>`
es_es: :download:`Descargar código fuente de Python: imshow_extent.py <imshow_extent.py>`

source: :download:`Download Jupyter notebook: imshow_extent.ipynb <imshow_extent.ipynb>`
es_es: :download:`Descargar Jupyter notebook: imshow_extent.ipynb <imshow_extent.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
