Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/intermediate/legend_guide.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_intermediate_legend_guide.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_tutorials_intermediate_legend_guide.py>` para descargar el código de ejemplo completo

source: Legend guide
es_es: Guía de leyendas

source: Generating legends flexibly in Matplotlib.
es_es: Generación de leyendas de forma flexible en Matplotlib.

source: This legend guide is an extension of the documentation available at :func:`~matplotlib.pyplot.legend` - please ensure you are familiar with contents of that documentation before proceeding with this guide.
es_es: Esta guía de leyendas es una extensión de la documentación disponible en :func:`~matplotlib.pyplot.legend` - por favor, asegúrate de que te es familiar el contenido de esa documentación antes de continuar con esta guía.

source: This guide makes use of some common terms, which are documented here for clarity:
es_es: Esta guía hace uso de algunos términos comunes, que se documentan aquí para mayor claridad:

source: legend entry
es_es: entrada de la leyenda

source: A legend is made up of one or more legend entries. An entry is made up of exactly one key and one label.
es_es: Una leyenda se compone de una o más entradas de leyenda. Una entrada se compone exactamente de una clave y una etiqueta.

source: legend key
es_es: clave de la leyenda

source: The colored/patterned marker to the left of each legend label.
es_es: El marcador de color/patrón a la izquierda de cada etiqueta de leyenda.

source: legend label
es_es: etiqueta de la leyenda

source: The text which describes the handle represented by the key.
es_es: El texto que describe el mango representado por la llave.

source: legend handle
es_es: manejo de la leyenda

source: The original object which is used to generate an appropriate entry in the legend.
es_es: El objeto original que se utiliza para generar una entrada apropiada en la leyenda.

source: Controlling the legend entries
es_es: Control de las entradas de la leyenda

source: Calling :func:`legend` with no arguments automatically fetches the legend handles and their associated labels. This functionality is equivalent to::
es_es: Al llamar a :func:`legend` sin argumentos se obtienen automáticamente los manejadores de la leyenda y sus etiquetas asociadas. Esta funcionalidad es equivalente a::

source: The :meth:`~matplotlib.axes.Axes.get_legend_handles_labels` function returns a list of handles/artists which exist on the Axes which can be used to generate entries for the resulting legend - it is worth noting however that not all artists can be added to a legend, at which point a "proxy" will have to be created (see :ref:`proxy_legend_handles` for further details).
es_es: La función :meth:`~matplotlib.axes.Axes.get_legend_handles_labels` devuelve una lista de handles/artistas que existen en los Ejes y que pueden ser utilizados para generar entradas para la leyenda resultante - vale la pena señalar, sin embargo, que no todos los artists pueden ser añadidos a una leyenda, en cuyo caso habrá que crear un "proxy" (ver :ref:`proxy_legend_handles` para más detalles).

source: Those artists with an empty string as label or with a label starting with "_" will be ignored.
es_es: Aquellos artistas con una cadena vacía como etiqueta o con una etiqueta que empiece por "_" serán ignorados.

source: For full control of what is being added to the legend, it is common to pass the appropriate handles directly to :func:`legend`::
es_es: Para tener un control total de lo que se añade a la leyenda, es habitual pasar los manejadores adecuados directamente a :func:`legend`::

source: In some cases, it is not possible to set the label of the handle, so it is possible to pass through the list of labels to :func:`legend`::
es_es: En algunos casos, no es posible establecer la etiqueta del manejador, por lo que es posible pasar por la lista de etiquetas a :func:`legend`::

source: Creating artists specifically for adding to the legend (aka. Proxy artists)
es_es: Creación de artistas específicamente para añadir a la leyenda (aka. Proxy artists)

source: Not all handles can be turned into legend entries automatically, so it is often necessary to create an artist which *can*. Legend handles don't have to exist on the Figure or Axes in order to be used.
es_es: No todos los manejadores pueden convertirse en entradas de leyenda automáticamente, por lo que a menudo es necesario crear un artista que *pueda*. Los manejadores de leyenda no tienen que existir en la Figura o en los Ejes para poder ser utilizados.

source: Suppose we wanted to create a legend which has an entry for some data which is represented by a red color:
es_es: Supongamos que queremos crear una leyenda que tenga una entrada para algún dato que se represente con un color rojo:

source: There are many supported legend handles. Instead of creating a patch of color we could have created a line with a marker:
es_es: Hay muchos manejadores de leyendas soportados. En lugar de crear un parche de color podríamos haber creado una línea con un marcador:

source: Legend location
es_es: Ubicación de la leyenda

source: The location of the legend can be specified by the keyword argument *loc*. Please see the documentation at :func:`legend` for more details.
es_es: La ubicación de la leyenda se puede especificar mediante el argumento de palabra clave *loc*. Consulte la documentación en :func:`legend` para más detalles.

source: The ``bbox_to_anchor`` keyword gives a great degree of control for manual legend placement. For example, if you want your axes legend located at the figure's top right-hand corner instead of the axes' corner, simply specify the corner's location and the coordinate system of that location::
es_es: La palabra clave ``bbox_to_anchor`` da un gran grado de control para la colocación manual de la leyenda. Por ejemplo, si quieres que la leyenda de los ejes se sitúe en la esquina superior derecha de la figura en lugar de la esquina de los ejes, simplemente especifica la ubicación de la esquina y el sistema de coordenadas de esa ubicación::

source: More examples of custom legend placement:
es_es: Más ejemplos de colocación de leyendas personalizadas:

source: Multiple legends on the same Axes
es_es: Múltiples leyendas en los mismos ejes

source: Sometimes it is more clear to split legend entries across multiple legends. Whilst the instinctive approach to doing this might be to call the :func:`legend` function multiple times, you will find that only one legend ever exists on the Axes. This has been done so that it is possible to call :func:`legend` repeatedly to update the legend to the latest handles on the Axes. To keep old legend instances, we must add them manually to the Axes:
es_es: A veces es más claro dividir las entradas de la leyenda en varias leyendas. Mientras que el enfoque instintivo para hacer esto podría ser llamar a la función :func:`legend` varias veces, encontrarás que sólo una leyenda siempre existe en los Ejes. Esto se ha hecho para que sea posible llamar a :func:`legend` repetidamente para actualizar la leyenda a los últimos manejadores en los Ejes. Para mantener las instancias de leyenda antiguas, debemos añadirlas manualmente a los Ejes:

source: Legend Handlers
es_es: Manejadores de leyendas

source: Update :func:`~matplotlib.legend.Legend.get_legend_handler_map` with the value in the ``handler_map`` keyword.
es_es: Actualización :func:`~matplotlib.legend.Legend.get_legend_handler_map` con el valor de la palabra clave ``handler_map``.

source: Check if the ``handle`` is in the newly created ``handler_map``.
es_es: Comprueba si el ``handle`` está en el recién creado ``handler_map``.

source: Check if the type of ``handle`` is in the newly created ``handler_map``.
es_es: Comprueba si el tipo de ``manejo`` está en el recién creado ``handler_map``.

source: Check if any of the types in the ``handle``'s mro is in the newly created ``handler_map``.
es_es: Comprueba si alguno de los tipos del mro de ``handle`` está en el recién creado ``handler_map``.

source: For completeness, this logic is mostly implemented in :func:`~matplotlib.legend.Legend.get_legend_handler`.
es_es: Para completar, esta lógica se implementa principalmente en :func:`~matplotlib.legend.Legend.get_legend_handler`.

source: All of this flexibility means that we have the necessary hooks to implement custom handlers for our own type of legend key.
es_es: Toda esta flexibilidad hace que tengamos los ganchos necesarios para implementar manejadores personalizados para nuestro propio tipo de clave de leyenda.

source: The simplest example of using custom handlers is to instantiate one of the existing `.legend_handler.HandlerBase` subclasses. For the sake of simplicity, let's choose `.legend_handler.HandlerLine2D` which accepts a *numpoints* argument (numpoints is also a keyword on the :func:`legend` function for convenience). We can then pass the mapping of instance to Handler as a keyword to legend.
es_es: El ejemplo más sencillo de usar manejadores personalizados es instanciar una de las subclases existentes de `.legend_handler.HandlerBase`. Para simplificar, vamos a elegir `.legend_handler.HandlerLine2D` que acepta un argumento *numpoints* (numpoints es también una palabra clave en la función :func:`legend` para mayor comodidad). Podemos entonces pasar el mapeo de la instancia al Handler como una palabra clave a la leyenda.

source: Out:
es_es: Salida:

source: As you can see, "Line 1" now has 4 marker points, where "Line 2" has 2 (the default). Try the above code, only change the map's key from ``line1`` to ``type(line1)``. Notice how now both `.Line2D` instances get 4 markers.
es_es: Como puede ver, la "Línea 1" tiene ahora 4 puntos de marcador, mientras que la "Línea 2" tiene 2 (el valor por defecto). Prueba el código anterior, sólo cambia la clave del mapa de ``línea1`` a ``tipo(línea1)``. Observa cómo ahora ambas instancias de `.Line2D` tienen 4 marcadores.

source: Along with handlers for complex plot types such as errorbars, stem plots and histograms, the default ``handler_map`` has a special ``tuple`` handler (`.legend_handler.HandlerTuple`) which simply plots the handles on top of one another for each item in the given tuple. The following example demonstrates combining two legend keys on top of one another:
es_es: Junto con los manejadores para tipos de gráficos complejos como barras de error, gráficos de tallo e histogramas, el ``handler_map`` por defecto tiene un manejador especial de ``tupla`` (`.legend_handler.HandlerTuple`) que simplemente traza los manejadores uno encima de otro para cada elemento de la tupla dada. El siguiente ejemplo demuestra la combinación de dos claves de leyenda una encima de la otra:

source: The `.legend_handler.HandlerTuple` class can also be used to assign several legend keys to the same entry:
es_es: La clase `.legend_handler.HandlerTuple` también se puede utilizar para asignar varias claves de leyenda a la misma entrada:

source: Implementing a custom legend handler
es_es: Implementación de un manejador de leyenda personalizado

source: A custom handler can be implemented to turn any handle into a legend key (handles don't necessarily need to be matplotlib artists). The handler must implement a ``legend_artist`` method which returns a single artist for the legend to use. The required signature for ``legend_artist`` is documented at `~.legend_handler.HandlerBase.legend_artist`.
es_es: Se puede implementar un manejador personalizado para convertir cualquier manejador en una clave de leyenda (los manejadores no tienen que ser necesariamente artistas de matplotlib). El manejador debe implementar un método ``legend_artist`` que devuelva un único artista para que la leyenda lo utilice. La firma requerida para ``legend_artist`` está documentada en `~.legend_handler.HandlerBase.legend_artist`.

source: Alternatively, had we wanted to globally accept ``AnyObject`` instances without needing to manually set the *handler_map* keyword all the time, we could have registered the new handler with::
es_es: Alternativamente, si hubiéramos querido aceptar globalmente instancias de ``AnyObject`` sin necesidad de establecer manualmente la palabra clave *handler_map* todo el tiempo, podríamos haber registrado el nuevo manejador con::

source: Whilst the power here is clear, remember that there are already many handlers implemented and what you want to achieve may already be easily possible with existing classes. For example, to produce elliptical legend keys, rather than rectangular ones:
es_es: Aunque el poder aquí es claro, recuerda que ya hay muchos manejadores implementados y lo que quieres lograr ya puede ser fácilmente posible con las clases existentes. Por ejemplo, para producir claves de leyenda elípticas, en lugar de rectangulares:

source: **Total running time of the script:** ( 0 minutes 3.237 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 3.237 segundos)

source: :download:`Download Python source code: legend_guide.py <legend_guide.py>`
es_es: :download:`Descargar código fuente de Python: legend_guide.py <legend_guide.py>`

source: :download:`Download Jupyter notebook: legend_guide.ipynb <legend_guide.ipynb>`
es_es: :download:`Descargar Jupyter notebook: legend_guide.ipynb <legend_guide.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
