Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/intermediate/tight_layout_guide.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_intermediate_tight_layout_guide.py>` to download the full example code
es_es: Haga clic en :ref:`aquí <sphx_glr_download_tutorials_intermediate_tight_layout_guide.py>` para descargar el código de ejemplo completo

source: Tight Layout guide
es_es: Guía de diseño ajustado

source: How to use tight-layout to fit plots within your figure cleanly.
es_es: Cómo utilizar tight-layout para encajar las parcelas dentro de su figura limpiamente.

source: *tight_layout* automatically adjusts subplot params so that the subplot(s) fits in to the figure area. This is an experimental feature and may not work for some cases. It only checks the extents of ticklabels, axis labels, and titles.
es_es: *tight_layout* ajusta automáticamente los parámetros de las subtramas para que éstas encajen en el área de la figura. Se trata de una función experimental y puede no funcionar en algunos casos. Sólo comprueba las extensiones de las etiquetas de los ejes y los títulos.

source: An alternative to *tight_layout* is :doc:`constrained_layout </tutorials/intermediate/constrainedlayout_guide>`.
es_es: Una alternativa a *tight_layout* es :doc:`constrained_layout </tutorials/intermediate/constrainedlayout_guide>`.

source: Simple Example
es_es: Ejemplo simple

source: In matplotlib, the location of axes (including subplots) are specified in normalized figure coordinates. It can happen that your axis labels or titles (or sometimes even ticklabels) go outside the figure area, and are thus clipped.
es_es: En matplotlib, la ubicación de los ejes (incluidos los subplots) se especifica en coordenadas normalizadas de la figura. Puede ocurrir que las etiquetas de los ejes o los títulos (o a veces incluso las etiquetas de los puntos) se salgan del área de la figura y, por tanto, queden recortadas.

source: To prevent this, the location of axes needs to be adjusted. For subplots, this can be done manually by adjusting the subplot parameters using `.Figure.subplots_adjust`. `.Figure.tight_layout` does this automatically.
es_es: Para evitar esto, es necesario ajustar la ubicación de los ejes. En el caso de los subplots, esto se puede hacer manualmente ajustando los parámetros del subplot mediante `.Figure.subplots_adjust`. `.Figure.tight_layout` lo hace automáticamente.

source: Note that :func:`matplotlib.pyplot.tight_layout` will only adjust the subplot params when it is called. In order to perform this adjustment each time the figure is redrawn, you can call ``fig.set_tight_layout(True)``, or, equivalently, set :rc:`figure.autolayout` to ``True``.
es_es: Ten en cuenta que :func:`matplotlib.pyplot.tight_layout` sólo ajustará los parámetros de la subparcela cuando sea llamada. Para realizar este ajuste cada vez que se redibuja la figura, se puede llamar a ``fig.set_tight_layout(True)``, o, equivalentemente, establecer :rc:`figure.autolayout` a ``True``.

source: When you have multiple subplots, often you see labels of different axes overlapping each other.
es_es: Cuando se tienen varios subplots, a menudo se ven etiquetas de diferentes ejes superpuestas.

source: :func:`~matplotlib.pyplot.tight_layout` will also adjust spacing between subplots to minimize the overlaps.
es_es: :func:`~matplotlib.pyplot.tight_layout` también ajustará el espacio entre las subtramas para minimizar los solapamientos.

source: :func:`~matplotlib.pyplot.tight_layout` can take keyword arguments of *pad*, *w_pad* and *h_pad*. These control the extra padding around the figure border and between subplots. The pads are specified in fraction of fontsize.
es_es: :func:`~matplotlib.pyplot.tight_layout` puede tomar argumentos de palabra clave como *pad*, *w_pad* y *h_pad*. Éstos controlan el relleno extra alrededor del borde de la figura y entre los subplots. Los rellenos se especifican en fracción del tamaño de la fuente.

source: :func:`~matplotlib.pyplot.tight_layout` will work even if the sizes of subplots are different as far as their grid specification is compatible. In the example below, *ax1* and *ax2* are subplots of a 2x2 grid, while *ax3* is of a 1x2 grid.
es_es: :func:`~matplotlib.pyplot.tight_layout` funcionará incluso si los tamaños de las subparcelas son diferentes siempre que su especificación de cuadrícula sea compatible. En el ejemplo siguiente, *ax1* y *ax2* son subplots de una cuadrícula 2x2, mientras que *ax3* es de una cuadrícula 1x2.

source: It works with subplots created with :func:`~matplotlib.pyplot.subplot2grid`. In general, subplots created from the gridspec (:doc:`/tutorials/intermediate/arranging_axes`) will work.
es_es: Funciona con subplots creados con :func:`~matplotlib.pyplot.subplot2grid`. En general, funcionarán los subplots creados a partir de la gridspec (:doc:`/tutorials/intermediate/arranging_axes`).

source: Although not thoroughly tested, it seems to work for subplots with aspect != "auto" (e.g., axes with images).
es_es: Aunque no se ha probado a fondo, parece que funciona para los subplots con aspecto != "auto" (por ejemplo, ejes con imágenes).

source: Caveats
es_es: Recomendaciones

source: `~matplotlib.pyplot.tight_layout` considers all artists on the axes by default. To remove an artist from the layout calculation you can call `.Artist.set_in_layout`.
es_es: `~matplotlib.pyplot.tight_layout` considera todos los artists en los ejes por defecto. Para eliminar un artist del cálculo del layout se puede llamar a `.Artist.set_in_layout`.

source: ``tight_layout`` assumes that the extra space needed for artists is independent of the original location of axes. This is often true, but there are rare cases where it is not.
es_es: ``tight_layout`` asume que el espacio extra necesario para los artistas es independiente de la ubicación original de los ejes. Esto suele ser cierto, pero hay casos raros en los que no lo es.

source: ``pad=0`` can clip some texts by a few pixels. This may be a bug or a limitation of the current algorithm and it is not clear why it happens. Meanwhile, use of pad larger than 0.3 is recommended.
es_es: ``pad=0`` puede recortar algunos textos por unos pocos píxeles. Esto puede ser un error o una limitación del algoritmo actual y no está claro por qué ocurre. Mientras tanto, se recomienda el uso de un pad mayor de 0,3.

source: Use with GridSpec
es_es: Uso con GridSpec

source: GridSpec has its own `.GridSpec.tight_layout` method (the pyplot api `.pyplot.tight_layout` also works).
es_es: GridSpec tiene su propio método `.GridSpec.tight_layout` (la api de pyplot `.pyplot.tight_layout` también funciona).

source: You may provide an optional *rect* parameter, which specifies the bounding box that the subplots will be fit inside. The coordinates must be in normalized figure coordinates and the default is (0, 0, 1, 1).
es_es: Puedes proporcionar un parámetro opcional *rect*, que especifica la caja de delimitación dentro de la cual se ajustarán las subtramas. Las coordenadas deben estar en coordenadas numéricas normalizadas y el valor por defecto es (0, 0, 1, 1).

source: However, we do not recommend that this be used to manually construct more complicated layouts, like having one GridSpec in the left and one in the right side of the figure. For these use cases, one should instead take advantage of :doc:`/gallery/subplots_axes_and_figures/gridspec_nested`, or the :doc:`/gallery/subplots_axes_and_figures/subfigures`.
es_es: Sin embargo, no recomendamos que se utilice para construir manualmente diseños más complicados, como tener un GridSpec en la parte izquierda y otro en la derecha de la figura. Para estos casos de uso, se debería aprovechar :doc:`/gallery/subplots_axes_and_figures/gridspec_nested`, o el :doc:`/gallery/subplots_axes_and_figures/subfigures`.

source: Legends and Annotations
es_es: Leyendas y anotaciones

source: Pre Matplotlib 2.2, legends and annotations were excluded from the bounding box calculations that decide the layout. Subsequently these artists were added to the calculation, but sometimes it is undesirable to include them. For instance in this case it might be good to have the axes shrink a bit to make room for the legend:
es_es: Antes de Matplotlib 2.2, las leyendas y las anotaciones se excluían de los cálculos de la caja delimitadora que deciden el diseño. Posteriormente estos artists se añadieron al cálculo, pero a veces no es deseable incluirlos. Por ejemplo, en este caso sería bueno que los ejes se encogieran un poco para dejar espacio a la leyenda:

source: However, sometimes this is not desired (quite often when using ``fig.savefig('outname.png', bbox_inches='tight')``). In order to remove the legend from the bounding box calculation, we simply set its bounding ``leg.set_in_layout(False)`` and the legend will be ignored.
es_es: Sin embargo, a veces esto no es deseable (muy a menudo cuando se utiliza ``fig.savefig('nombre_de_fuera.png', bbox_inches='tight')``). Para eliminar la leyenda del cálculo de la caja delimitadora, simplemente establecemos su delimitación ``leg.set_in_layout(False)`` y la leyenda será ignorada.

source: Use with AxesGrid1
es_es: Usar con AxesGrid1

source: While limited, :mod:`mpl_toolkits.axes_grid1` is also supported.
es_es: Aunque limitado, :mod:`mpl_toolkits.axes_grid1` también es compatible.

source: Colorbar
es_es: Barra de colores

source: If you create a colorbar with `.Figure.colorbar`, the created colorbar is drawn in a Subplot as long as the parent axes is also a Subplot, so `.Figure.tight_layout` will work.
es_es: Si creas una barra de colores con `.Figure.colorbar`, la barra de colores creada se dibuja en un Subplot siempre que el eje padre sea también un Subplot, por lo que `.Figure.tight_layout` funcionará.

source: Another option is to use the AxesGrid1 toolkit to explicitly create an axes for the colorbar.
es_es: Otra opción es utilizar el kit de herramientas AxesGrid1 para crear explícitamente un eje para la barra de colores.

source: **Total running time of the script:** ( 0 minutes 5.271 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 5.271 segundos)

source: :download:`Download Python source code: tight_layout_guide.py <tight_layout_guide.py>`
es_es: :download:`Descargar código fuente de Python: tight_layout_guide.py <tight_layout_guide.py>`

source: :download:`Download Jupyter notebook: tight_layout_guide.ipynb <tight_layout_guide.ipynb>`
es_es: :download:`Descargar Jupyter notebook: tight_layout_guide.ipynb <tight_layout_guide.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
