Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/coding_guide.po
Languages: es_es

source: If the bot is not working as expected, please report issues to `Meeseeksdev <https://github.com/MeeseeksBox/MeeseeksDev>`__.
es_es: Si el bot no funciona como se espera, por favor informa de los problemas a `Meeseeksdev <https://github.com/MeeseeksBox/MeeseeksDev>`__.

source: Manual backports
es_es: Backports manuales

source: When doing backports please copy the form used by meeseekdev, ``Backport PR #XXXX: TITLE OF PR``. If you need to manually resolve conflicts make note of them and how you resolved them in the commit message.
es_es: Cuando hagas backports por favor copia el formulario usado por meeseekdev, ``Backport PR #XXXX: TITLE OF PR``. Si necesitas resolver manualmente los conflictos, anótalos en el mensaje de confirmación.

source: We do a backport from master to v2.2.x assuming:
es_es: Hacemos un backport del master a la v2.2.x suponiendo:

source: ``matplotlib`` is a read-only remote branch of the matplotlib/matplotlib repo
es_es: ``matplotlib`` es una rama remota de sólo lectura del repo de matplotlib/matplotlib

source: The ``TARGET_SHA`` is the hash of the merge commit you would like to backport. This can be read off of the GitHub PR page (in the UI with the merge notification) or through the git CLI tools.
es_es: El ``TARGET_SHA`` es el hash de la confirmación de la fusión que te gustaría respaldar. Se puede leer en la página de GitHub PR (en la interfaz de usuario con la notificación de fusión) o a través de las herramientas de la CLI de git.

source: Assuming that you already have a local branch ``v2.2.x`` (if not, then ``git checkout -b v2.2.x``), and that your remote pointing to ``https://github.com/matplotlib/matplotlib`` is called ``upstream``:
es_es: Asumiendo que ya tienes una rama local ``v2.2.x`` (si no, entonces ``git checkout -b v2.2.x``), y que tu remoto apunta a ``https://github.com/matplotlib/matplotlib`` se llama ``upstream``:

source: Files with conflicts can be listed by ``git status``, and will have to be fixed by hand (search on ``>>>>>``). Once the conflict is resolved, you will have to re-add the file(s) to the branch and then continue the cherry pick:
es_es: Los ficheros con conflictos pueden ser listados por ``git status``, y tendrán que ser arreglados a mano (buscar en ``>>>>>``). Una vez resuelto el conflicto, tendrás que volver a añadir el/los fichero/s a la rama y continuar con el cherry pick:

source: Use your discretion to push directly to upstream or to open a PR; be sure to push or PR against the ``v2.2.x`` upstream branch, not ``master``!
es_es: Usa tu criterio para hacer push directamente a upstream o para abrir un PR; ¡asegúrate de hacer push o PR contra la rama upstream ``v2.2.x``, no ``master``!
