Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/coding_guide.po
Languages: es_es

source: Pull request guidelines
es_es: Guía de pull requests

source: Pull requests (PRs) are the mechanism for contributing to Matplotlibs code and documentation.
es_es: Los pull requests (PRs) son el mecanismo para contribuir al código y la documentación de Matplotlibs.

source: Summary for PR authors
es_es: Resumen para los autores de PR

source: We value contributions from people with all levels of experience. In particular if this is your first PR not everything has to be perfect. We'll guide you through the PR process.
es_es: Valoramos las contribuciones de personas con todos los niveles de experiencia. En particular si este es tu primer PR no todo tiene que ser perfecto. Te guiaremos a través del proceso de PR.

source: Nevertheless, try to follow the guidelines below as well as you can to help make the PR process quick and smooth.
es_es: No obstante, intenta seguir las siguientes directrices lo mejor que puedas para ayudar a que el proceso de PR sea rápido y sin problemas.

source: Be patient with reviewers. We try our best to respond quickly, but we have limited bandwidth. If there is no feedback within a couple of days, please ping us by posting a comment to your PR.
es_es: Ten paciencia con los revisores. Hacemos lo posible por responder rápidamente, pero tenemos un ancho de banda limitado. Si no hay respuesta dentro de un par de días, por favor recuérdanoslo mediante la publicación de un comentario a tu PR.

source: When making a PR, pay attention to:
es_es: Al hacer un PR, presta atención a:

source: :ref:`Target the master branch <pr-branch-selection>`.
es_es: :ref:`Apuntar a la rama principal <pr-branch-selection>`.

source: Adhere to the :ref:`coding_guidelines`.
es_es: Adherirse a la :ref:`guía_de_codificación`.

source: Update the :ref:`documentation <pr-documentation>` if necessary.
es_es: Actualiza la :ref:`documentación <pr-documentación>` si es necesario.

source: Aim at making the PR as "ready-to-go" as you can. This helps to speed up the review process.
es_es: Intenta que el PR esté tan "listo para funcionar" como puedas. Esto ayuda a acelerar el proceso de revisión.

source: It is ok to open incomplete or work-in-progress PRs if you need help or feedback from the developers. You may mark these as `draft pull requests <https://docs.github.com/en/github/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/about-pull-requests#draft-pull-requests>`_ on GitHub.
es_es: Está bien abrir PRs incompletos o en proceso si necesitas ayuda o comentarios de los desarrolladores. Puedes marcarlos como `draft pull requests <https://docs.github.com/en/github/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/about-pull-requests#draft-pull-requests>`_ en GitHub.

source: When updating your PR, instead of adding new commits to fix something, please consider amending your initial commit(s) to keep the history clean. You can achieve this using
es_es: Cuando actualices tu PR, en lugar de añadir nuevos commits para arreglar algo, por favor considera modificar tu(s) commit(s) inicial(es) para mantener el historial limpio. Puedes conseguirlo utilizando

source: See also :ref:`contributing` for how to make a PR.
es_es: Ver también :ref:`contributing` para saber cómo hacer un PR.

source: Summary for PR reviewers
es_es: Resumen para los revisores del PR

source: If you have commit rights, then you are trusted to use them. **Please help review and merge PRs!**
es_es: Si tienes derechos de commit, entonces eres de confianza para usarlos. **¡Por favor, ayuda a revisar y fusionar PRs!**

source: Be patient and `kind <https://youtu.be/tzFWz5fiVKU?t=49m30s>`__ with contributors.
es_es: Sé paciente y `amable <https://youtu.be/tzFWz5fiVKU?t=49m30s>`__ con los colaboradores.

source: Content topics:
es_es: Temas de contenido:

source: Is the feature / bugfix reasonable?
es_es: ¿Es razonable la función/corrección de errores?

source: Does the PR conform with the :ref:`coding_guidelines`?
es_es: ¿Cumple el PR con la :ref:`guía_de_codificación`?

source: Is the :ref:`documentation <pr-documentation>` (docstrings, examples, what's new, API changes) updated?
es_es: ¿Está actualizada la :ref:`documentación <pr-documentación>` (docstrings, ejemplos, novedades, cambios en la API)?

source: Organizational topics:
es_es: Temas de organización:

source: Make sure all :ref:`automated tests <pr-automated-tests>` pass.
es_es: Asegúrate de que pasen todas las pruebas :ref:`automatizadas <pr-automated-tests>`.

source: The PR should :ref:`target the master branch <pr-branch-selection>`.
es_es: El PR debe :ref:`apuntar a la rama principal <pr-branch-selection>`.

source: Tag with descriptive :ref:`labels <pr-labels>`.
es_es: Etiqueta con descriptivo :ref:`etiquetas <pr-etiquetas>`.

source: Set the :ref:`milestone <pr-milestones>`.
es_es: Establece la :ref:`milestone <pr-milestones>`.

source: Keep an eye on the :ref:`number of commits <pr-squashing>`.
es_es: Vigila el :ref:`número de commits <pr-squashing>`.

source: Approve if all of the above topics are handled.
es_es: Aprueba si se manejan todos los temas anteriores.

source: :ref:`Merge <pr-merging>` if a sufficient number of approvals is reached.
es_es: :ref:`Fusiona <pr-merging>` si se alcanza un número suficiente de aprobaciones.

source: Detailed guidelines
es_es: Guías detalladas

source: Documentation
es_es: Documentación

source: Every new feature should be documented. If it's a new module, don't forget to add a new rst file to the API docs.
es_es: Cada nueva característica debe ser documentada. Si se trata de un nuevo módulo, no olvides añadir un nuevo archivo rst a la documentación de la API.

source: Each high-level plotting function should have a small example in the ``Examples`` section of the docstring. This should be as simple as possible to demonstrate the method. More complex examples should go into a dedicated example file in the :file:`examples` directory, which will be rendered to the examples gallery in the documentation.
es_es: Cada función de trazado de alto nivel debería tener un pequeño ejemplo en la sección ``Ejemplos`` del docstring. Debe ser lo más sencillo posible para demostrar el método. Los ejemplos más complejos deben ir en un archivo de ejemplo dedicado en el directorio :file:`examples`, que se renderizará a la galería de ejemplos en la documentación.

source: Build the docs and make sure all formatting warnings are addressed.
es_es: Construye los documentos y asegúrate de que todas las advertencias de formato son atendidas.

source: See :ref:`documenting-matplotlib` for our documentation style guide.
es_es: Ver :ref:`documenting-matplotlib` para nuestra guía de estilo de documentación.

source: If your change is a major new feature, add an entry to :file:`doc/users/whats_new.rst`.
es_es: Si tu cambio es una nueva característica importante, añade una entrada a :file:`doc/users/whats_new.rst`.

source: If you change the API in a backward-incompatible way, please document it by adding a file in the relevant subdirectory of :file:`doc/api/next_api_changes/`, probably in the ``behavior/`` subdirectory.
es_es: Si cambias la API de forma incompatible con el pasado, documéntalo añadiendo un archivo en el subdirectorio correspondiente de :file:`doc/api/next_api_changes/`, probablemente en el subdirectorio ``behavior/``.

source: Labels
es_es: Etiquetas

source: If you have the rights to set labels, tag the PR with descriptive labels. See the `list of labels <https://github.com/matplotlib/matplotlib/labels>`__.
es_es: Si tienes los derechos para establecer etiquetas, etiqueta el PR con etiquetas descriptivas. Mira la `lista de etiquetas <https://github.com/matplotlib/matplotlib/labels>`__.

source: Milestones
es_es: Hitos

source: Set the milestone according to these rules:
es_es: Establecer el hito de acuerdo con estas reglas:

source: *New features and API changes* are milestoned for the next minor release ``v3.X.0``.
es_es: *Las nuevas características y los cambios en la API* están previstos para la próxima versión menor ``v3.X.0``.

source: *Bugfixes and docstring changes* are milestoned for the next patch release ``v3.X.Y``
es_es: *Las correcciones de errores y los cambios en el docstring* son milestones para la próxima versión del parche ``v3.X.Y``

source: *Documentation changes* (all .rst files and examples) are milestoned ``v3.X-doc``
es_es: *Los cambios en la documentación* (todos los archivos .rst y los ejemplos) son milestones ``v3.X-doc``

source: If multiple rules apply, choose the first matching from the above list.
es_es: Si se aplican varias reglas, elige la primera que coincida de la lista anterior.

source: Setting a milestone does not imply or guarantee that a PR will be merged for that release, but if it were to be merged what release it would be in.
es_es: Establecer un hito no implica ni garantiza que se fusione un PR para esa versión, pero si la versión en que estaría en caso de fusionarse.

source: All of these PRs should target the master branch. The milestone tag triggers an :ref:`automatic backport <automated-backports>` for milestones which have a corresponding branch.
es_es: Todos estos PRs deben dirigirse a la rama maestra. La etiqueta de hito activa un :ref:`automatic backport <automated-backports>` para los hitos que tienen una rama correspondiente.

source: Documentation and examples may be merged by the first reviewer. Use the threshold "is this better than it was?" as the review criteria.
es_es: La documentación y los ejemplos pueden ser fusionados por el primer revisor. Utiliza el umbral "¿es esto mejor que lo que era?" como criterio de revisión.

source: For code changes (anything in ``src`` or ``lib``) at least two core developers (those with commit rights) should review all pull requests. If you are the first to review a PR and approve of the changes use the GitHub `'approve review' <https://docs.github.com/en/github/collaborating-with-pull-requests/reviewing-changes-in-pull-requests>`__ tool to mark it as such. If you are a subsequent reviewer please approve the review and if you think no more review is needed, merge the PR.
es_es: Para los cambios de código (cualquier cosa en ``src`` o ``lib``) al menos dos desarrolladores principales (aquellos con derechos de confirmación) deben revisar todas las solicitudes de pull request. Si eres el primero en revisar un PR y apruebas los cambios, utiliza la herramienta de GitHub `'approve review' <https://docs.github.com/en/github/collaborating-with-pull-requests/reviewing-changes-in-pull-requests>`__ para marcarlo como tal. Si eres un revisor posterior, por favor, aprueba la revisión y si crees que no se necesita más revisión, fusiona el PR.

source: Ensure that all API changes are documented in a file in one of the subdirectories of :file:`doc/api/next_api_changes`, and significant new features have an entry in :file:`doc/user/whats_new`.
es_es: Asegúrate de que todos los cambios de la API están documentados en un archivo en uno de los subdirectorios de :file:`doc/api/next_api_changes`, y de que las nuevas características significativas tienen una entrada en :file:`doc/user/whats_new`.

source: If a PR already has a positive review, a core developer (e.g. the first reviewer, but not necessarily) may champion that PR for merging. In order to do so, they should ping all core devs both on GitHub and on the dev mailing list, and label the PR with the "Merge with single review?" label. Other core devs can then either review the PR and merge or reject it, or simply request that it gets a second review before being merged. If no one asks for such a second review within a week, the PR can then be merged on the basis of that single review.
es_es: Si un PR ya tiene una revisión positiva, un desarrollador del núcleo (por ejemplo el primer revisor, pero no necesariamente) puede abogar por ese PR para su fusión. Para ello, debes enviar un mensaje a todos los desarrolladores del núcleo, tanto en GitHub como en la lista de correo de desarrolladores, y etiquetar el PR con la etiqueta "¿Fusionar con una sola revisión?". Los otros desarrolladores del núcleo pueden entonces revisar el PR y fusionarlo o rechazarlo, o simplemente solicitar que reciba una segunda revisión antes de ser fusionado. Si nadie pide una segunda revisión en el plazo de una semana, el PR puede fusionarse sobre la base de esa única revisión.

source: A core dev should only champion one PR at a time and we should try to keep the flow of championed PRs reasonable.
es_es: Un desarrollador del núcleo sólo debería abpgar por un PR a la vez y deberíamos intentar mantener un flujo razonable de PRs defendidos.

source: Do not self merge, except for 'small' patches to un-break the CI or when another reviewer explicitly allows it (ex, "Approve modulo CI passing, may self merge when green").
es_es: No autofusionar, excepto para parches "pequeños" para descifrar el CI o cuando otro revisor lo permita explícitamente (por ejemplo, "Aprueba el paso del CI por modulo, puede autofusionarse cuando esté en verde").

source: Automated tests
es_es: Pruebas automatizadas

source: Whenever a pull request is created or updated, various automated test tools will run on all supported platforms and versions of Python.
es_es: Cada vez que se crea o actualiza un pull request, se ejecutan varias herramientas de prueba automatizadas en todas las plataformas y versiones de Python soportadas.

source: Make sure the Linting, GitHub Actions, AppVeyor, CircleCI, and Azure pipelines are passing before merging (All checks are listed at the bottom of the GitHub page of your pull request). Here are some tips for finding the cause of the test failure:
es_es: Asegúrate de que los pipelines en Linting, GitHub Actions, AppVeyor, CircleCI y Azure están pasando antes de fusionar (Todas las comprobaciones están listadas en la parte inferior de la página de GitHub de tu pull request). Aquí hay algunos consejos para encontrar la causa del fallo de la prueba:

source: If *Linting* fails, you have a code style issue, which will be listed as annotations on the pull request's diff.
es_es: Si *Linting* falla, tienes un problema de estilo de código, que aparecerá como anotaciones en el diff del pull request.

source: If a GitHub Actions or AppVeyor run fails, search the log for ``FAILURES``. The subsequent section will contain information on the failed tests.
es_es: Si una ejecución de GitHub Actions o AppVeyor falla, busca en el registro ``FAILURES``. La sección siguiente contendrá información sobre las pruebas fallidas.

source: If CircleCI fails, likely you have some reStructuredText style issue in the docs. Search the CircleCI log for ``WARNING``.
es_es: Si CircleCI falla, es probable que tengas algún problema de estilo reStructuredText en los documentos. Busca en el registro de CircleCI ``WARNING``.

source: If Azure pipelines fail with an image comparison error, you can find the images as *artifacts* of the Azure job:
es_es: Si los pipelines de Azure fallan con un error de comparación de imágenes, puedes encontrar las imágenes como *artifacts* del trabajo de Azure:

source: Click *Details* on the check on the GitHub PR page.
es_es: Haz clic en *Detalles* en la comprobación de la página de GitHub PR.

source: Click *View more details on Azure Pipelines* to go to Azure.
es_es: Haz clic en *Ver más detalles sobre Azure Pipelines* para ir a Azure.

source: On the overview page *artifacts* are listed in the section *Related*.
es_es: En la página de descripción general, los *artifacts* aparecen en la sección *Related*.

source: Codecov and LGTM are currently for information only. Their failure is not necessarily a blocker.
es_es: Actualmente, Codecov y LGTM son sólo informativos. Un fallo no es necesariamente un bloqueo.

source: tox_ is not used in the automated testing. It is supported for testing locally.
es_es: tox_ no se utiliza en las pruebas automatizadas. Se admite para las pruebas locales.

source: If you know your changes do not need to be tested (this is very rare!), all CIs can be skipped for a given commit by including ``[ci skip]`` or ``[skip ci]`` in the commit message. If you know only a subset of CIs need to be run (e.g., if you are changing some block of plain reStructuredText and want only CircleCI to run to render the result), individual CIs can be skipped on individual commits as well by using the following substrings in commit messages:
es_es: Si sabes que tus cambios no necesitan ser probados (¡esto es muy raro!), todos los CIs pueden ser omitidos para una confirmación dada incluyendo ``[ci skip]`` o ``[skip ci]`` en el mensaje de confirmación. Si sabes que sólo es necesario ejecutar un subconjunto de CIs (por ejemplo, si estás cambiando algún bloque de reStructuredText y quieres que sólo se ejecute CircleCI para obtener el resultado), puedes omitir CIs individuales en confirmaciones individuales también utilizando las siguientes subcadenas en los mensajes de confirmación:

source: GitHub Actions: ``[skip actions]``
es_es: Acciones de GitHub: ``[skip actions]``

source: AppVeyor: ``[skip appveyor]`` (must be in the first line of the commit)
es_es: AppVeyor: ``[skip appveyor]`` (debe estar en la primera línea del commit)

source: Number of commits and squashing
es_es: Número de commits y squashing

source: Squashing is case-by-case. The balance is between burden on the contributor, keeping a relatively clean history, and keeping a history usable for bisecting. The only time we are really strict about it is to eliminate binary files (ex multiple test image re-generations) and to remove upstream merges.
es_es: El squashing se hace caso por caso. El equilibrio es entre la carga para quien contribuye, mantener un historial relativamente limpio, y mantener un historial utilizable para bisecar. La única vez que somos realmente estrictos al respecto es para eliminar archivos binarios (por ejemplo, múltiples re-generaciones de imágenes de prueba) y para eliminar fusiones ascendentes.

source: Do not let perfect be the enemy of the good, particularly for documentation or example PRs. If you find yourself making many small suggestions, either open a PR against the original branch, push changes to the contributor branch, or merge the PR and then open a new PR against upstream.
es_es: No dejes que lo perfecto sea enemigo de lo bueno, particularmente para la documentación o los PRs de ejemplo. Si te encuentras haciendo muchas pequeñas sugerencias, abre un PR contra la rama original, has push de los cambios a la rama de los colaboradores, o fusiona el PR y luego abre un nuevo PR contra el upstream.

source: If you push to a contributor branch leave a comment explaining what you did, ex "I took the liberty of pushing a small clean-up PR to your branch, thanks for your work.". If you are going to make substantial changes to the code or intent of the PR please check with the contributor first.
es_es: Si haces un push a una rama de un colaborador deja un comentario explicando lo que has hecho, por ejemplo "Me he tomado la libertad de hacer un pequeño PR de limpieza a tu rama, gracias por tu trabajo". Si vas a hacer cambios sustanciales en el código o en la intención del PR, por favor, consúltalo primero con el colaborador.

source: Branches and backports
es_es: Ramas y backports

source: Current branches
es_es: Ramas actuales

source: The current active branches are
es_es: Las ramas activas actuales son

source: The current development version. Future minor releases (*v3.N.0*) will be branched from this. Supports Python 3.7+.
es_es: La versión de desarrollo actual. Las futuras versiones menores (*v3.N.0*) se ramificarán a partir de ésta. Soporta Python 3.7+.

source: Maintenance branch for Matplotlib 3.N. Future patch releases will be branched from this. Supports Python 3.6+.
es_es: Rama de mantenimiento para Matplotlib 3.N. Las futuras versiones de parches se ramificarán a partir de ésta. Soporta Python 3.6+.

source: Documentation for the current release. On a patch release, this will be replaced by a properly named branch for the new release.
es_es: Documentación para la versión actual. En una versión de parche, esto será reemplazado por una rama con el nombre adecuado para la nueva versión.

source: Branch selection for pull requests
es_es: Selección de rama para pull requests

source: Generally, all pull requests should target the master branch.
es_es: Generalmente, todos los pull requests deben dirigirse a la rama master.

source: Other branches are fed through :ref:`automatic <automated-backports>` or :ref:`manual <manual-backports>`. Directly targeting other branches is only rarely necessary for special maintenance work.
es_es: Otras ramas se alimentan a través de :ref:`automatic <automated-backports>` o :ref:`manual <manual-backports>`. Dirigirse directamente a otras ramas sólo es necesario en raras ocasiones para trabajos especiales de mantenimiento.

source: Backport strategy
es_es: Estrategia de backport

source: We will always backport to the patch release branch (*v3.N.x*):
es_es: Siempre haremos un backport a la rama de lanzamiento del parche (*v3.N.x*):

source: critical bug fixes (segfault, failure to import, things that the user can not work around)
es_es: arreglos de errores críticos (segfault, fallo de importación, cosas que el usuario no puede trabajar alrededor)

source: fixes for regressions against the last two releases.
es_es: arregla las regresiones con respecto a las dos últimas versiones.

source: Everything else (regressions against older releases, bugs/api inconsistencies the user can work around in their code) are on a case-by-case basis, should be low-risk, and need someone to advocate for and shepherd through the backport.
es_es: Todo lo demás (regresiones contra versiones anteriores, bugs/inconsistencias de la API que el usuario puede solucionar en su código) son caso por caso, deben ser de bajo riesgo, y necesitan a alguien que defienda y guíe a través del backport.

source: The only changes to be backported to the documentation branch (*v3.N.M-doc*) are changes to :file:`doc`, :file:`examples`, or :file:`tutorials`. Any changes to :file:`lib` or :file:`src` including docstring-only changes should not be backported to this branch.
es_es: Los únicos cambios que deben ser respaldados en la rama de documentación (*v3.N.M-doc*) son los cambios en :file:`doc`, :file:`examples`, o :file:`tutorials`. Cualquier cambio en :file:`lib` o :file:`src` que incluya cambios sólo en la documentación no debe ser retroalimentado a esta rama.

source: Automated backports
es_es: Backports automatizados

source: We use meeseeksdev bot to automatically backport merges to the correct maintenance branch base on the milestone. To work properly the milestone must be set before merging. If you have commit rights, the bot can also be manually triggered after a merge by leaving a message ``@meeseeksdev backport to BRANCH`` on the PR. If there are conflicts meeseekdevs will inform you that the backport needs to be done manually.
es_es: Usamos el bot meeseeksdev para hacer backport automático de las fusiones a la rama de mantenimiento correcta en base al hito. Para que funcione correctamente el hito debe ser establecido antes de la fusión. Si tienes derechos de confirmación, el bot también puede ser activado manualmente después de una fusión dejando un mensaje ``@meeseeksdev backport to BRANCH`` en el PR. Si hay conflictos, meeseekdevs le informará de que el backport debe hacerse manualmente.

source: The target branch is configured by putting ``on-merge: backport to TARGETBRANCH`` in the milestone description on it's own line.
es_es: La rama de destino se configura poniendo ``on-merge: backport to TARGETBRANCH`` en la descripción del hito en su propia línea.
