Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/color_changes.po
Languages: es_es

source: Default color changes
es_es: Cambios de color por defecto

source: As discussed at length elsewhere [insert links], ``jet`` is an empirically bad colormap and should not be the default colormap. Due to the position that changing the appearance of the plot breaks backward compatibility, this change has been put off for far longer than it should have been. In addition to changing the default color map we plan to take the chance to change the default color-cycle on plots and to adopt a different colormap for filled plots (``imshow``, ``pcolor``, ``contourf``, etc) and for scatter like plots.
es_es: Como se ha discutido ampliamente en otro lugar [insertar enlaces], ``jet`` es un mapa de color empíricamente malo y no debería ser el mapa de color por defecto. Debido a la posición de que cambiar la apariencia de la trama rompe la compatibilidad hacia versiones anteriores, este cambio se ha pospuesto durante mucho más tiempo de lo que debería haber sido. Además de cambiar el mapa de color por defecto, planeamos aprovechar la oportunidad para cambiar el ciclo de color por defecto en los gráficos y adoptar un mapa de color diferente para los gráficos rellenos (``imshow``, ``pcolor``, ``contourf``, etc) y para los gráficos de dispersión.

source: Default heat map colormap
es_es: Mapa de colores por defecto del mapa de calor

source: The choice of a new colormap is fertile ground to bike-shedding ("No, it should be _this_ color") so we have a proposed set criteria (via Nathaniel Smith) to evaluate proposed colormaps.
es_es: La elección de un nuevo mapa de color es un terreno fértil para la discusión ("No, debería ser _este_ color"), así que tenemos una propuesta de criterios (vía Nathaniel Smith) para evaluar los mapas de color propuestos.

source: it should be a sequential colormap, because diverging colormaps are really misleading unless you know where the "center" of the data is, and for a default colormap we generally won't.
es_es: debería ser un mapa de color secuencial, porque los mapas de color divergentes son realmente engañosos a menos que se sepa dónde está el "centro" de los datos, y para un mapa de color por defecto generalmente no lo sabremos.

source: it should be perceptually uniform, i.e., human subjective judgments of how far apart nearby colors are should correspond as linearly as possible to the difference between the numerical values they represent, at least locally.
es_es: debe ser perceptualmente uniforme, es decir, los juicios subjetivos humanos sobre la distancia de los colores cercanos deben corresponder lo más linealmente posible a la diferencia entre los valores numéricos que representan, al menos localmente.

source: it should have a perceptually uniform luminance ramp, i.e. if you convert to greyscale it should still be uniform. This is useful both in practical terms (greyscale printers are still a thing!) and because luminance is a very strong and natural cue to magnitude.
es_es: debería tener una rampa de luminancia perceptualmente uniforme, es decir, si se convierte a escala de grises debería seguir siendo uniforme. Esto es útil tanto en términos prácticos (¡las impresoras de escala de grises siguen existiendo!) como porque la luminancia es una señal muy fuerte y natural de la magnitud.

source: it should also have some kind of variation in hue, because hue variation is a really helpful additional cue to perception, having two cues is better than one, and there's no reason not to do it.
es_es: también debería tener algún tipo de variación en el tono, porque la variación del tono es una pista adicional realmente útil para la percepción, tener dos pistas es mejor que una, y no hay razón para no hacerlo.

source: the hue variation should be chosen to produce reasonable results even for viewers with the more common types of colorblindness. (Which rules out things like red-to-green.)
es_es: la variación del tono debe ser elegida para generar resultados razonables incluso para los espectadores con los tipos más comunes de daltonismo. (Lo que descarta cosas como el rojo-verde)

source: For bonus points, it would be nice to choose a hue ramp that still works if you throw away the luminance variation, because then we could use the version with varying luminance for 2d plots, and the version with just hue variation for 3d plots. (In 3d plots you really want to reserve the luminance channel for lighting/shading, because your brain is *really* good at extracting 3d shape from luminance variation. If the 3d surface itself has massively varying luminance then this screws up the ability to see shape.)
es_es: Para obtener puntos extra, sería bueno elegir una rampa de tonalidad que siga funcionando si se elimina la variación de luminancia, porque entonces podríamos utilizar la versión con variación de luminancia para los gráficos 2d, y la versión con sólo variación de tonalidad para los gráficos 3d. (En los gráficos 3d es muy conveniente reservar el canal de luminancia para la iluminación/sombreado, porque el cerebro es *realmente* bueno para extraer la forma 3d de la variación de la luminancia. Si la superficie 3d en sí tiene una luminancia que varía masivamente, entonces esto arruina la capacidad de ver la forma)

source: Not infringe any existing IP
es_es: No infringir ninguna IP existente

source: Example script
es_es: Script de ejemplo

source: Proposed colormaps
es_es: Mapas de color propuestos

source: Default scatter colormap
es_es: Mapa de colores de dispersión por defecto

source: For heat-map like applications it can be desirable to cover as much of the luminance scale as possible, however when colormapping markers, having markers too close to white can be a problem. For that reason we propose using a different (but maybe related) colormap to the heat map for marker-based. The design parameters are the same as above, only with a more limited luminance variation.
es_es: Para aplicaciones tipo mapa de calor puede ser deseable cubrir la mayor parte posible de la escala de luminancia, sin embargo cuando se mapean los colores de los marcadores, tenerlos demasiado cerca del blanco puede ser un problema. Por esta razón, proponemos utilizar un mapa de colores diferente (pero quizá relacionado) al mapa de calor para los marcadores. Los parámetros de diseño son los mismos que los anteriores, sólo que con una variación de luminancia más limitada.

source: Color cycle / qualitative colormap
es_es: Ciclo de color / mapa de color cualitativo

source: When plotting lines it is frequently desirable to plot multiple lines or artists which need to be distinguishable, but there is no inherent ordering.
es_es: Al trazar líneas es frecuente que se desee trazar varias líneas o artists que deben ser distinguibles, pero no hay un ordenamiento inherente.

source: Proposed color cycle
es_es: Ciclo de color propuesto
