Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/contributing.po
Languages: es_es

source: Contributing
es_es: Contribuyendo a

source: This project is a community effort, and everyone is welcome to contribute. Everyone within the community is expected to abide by our `code of conduct <https://github.com/matplotlib/matplotlib/blob/master/CODE_OF_CONDUCT.md>`_.
es_es: Este proyecto es un esfuerzo comunitario, y todo el mundo es bienvenido a contribuir. Se espera que todo el mundo dentro de la comunidad cumpla con nuestro `código de conducta <https://github.com/matplotlib/matplotlib/blob/master/CODE_OF_CONDUCT.md>`_.

source: The project is hosted on https://github.com/matplotlib/matplotlib
es_es: El proyecto está alojado en https://github.com/matplotlib/matplotlib

source: Contributor incubator
es_es: Incubadora de colaboradores

source: If you are interested in becoming a regular contributor to Matplotlib, but don't know where to start or feel insecure about it, you can join our non-public communication channel for new contributors. To do so, please go to `gitter <https://gitter.im/matplotlib/matplotlib>`_ and ask to be added to '#incubator'. This is a private gitter room moderated by core Matplotlib developers where you can get guidance and support for your first few PRs. This is a place you can ask questions about anything: how to use git, github, how our PR review process works, technical questions about the code, what makes for good documentation or a blog post, how to get involved involved in community work, or get "pre-review" on your PR.
es_es: Si tienes interés en convertirte en un colaborador/a habitual de Matplotlib, pero no sabes por dónde empezar o te sientes inseguro/a al respecto, puedes unirte a nuestro canal de comunicación no público para nuevos colaboradores. Para ello, dirígete a `gitter <https://gitter.im/matplotlib/matplotlib>`_ y pide que te añadan a ``incubadora''. Esta es una sala privada de gitter moderada por los desarrolladores del núcleo de Matplotlib, donde puedes obtener orientación y apoyo para tus primeros PRs. Este es un lugar donde puedes hacer preguntas sobre cualquier cosa: cómo usar git, github, cómo funciona nuestro proceso de revisión de PRs, preguntas técnicas sobre el código, qué hace una buena documentación o una entrada de blog, cómo involucrarse en el trabajo de la comunidad, o conseguir una "pre-revisión" de tu PR.

source: Issues for new contributors
es_es: Cuestiones para los nuevos contribuyentes

source: While any contributions are welcome, we have marked some issues as particularly suited for new contributors by the label `good first issue <https://github.com/matplotlib/matplotlib/labels/good%20first%20issue>`_ These are well documented issues, that do not require a deep understanding of the internals of Matplotlib. The issues may additionally be tagged with a difficulty. ``Difficulty: Easy`` is suited for people with little Python experience. ``Difficulty: Medium`` and ``Difficulty: Hard`` are not trivial to solve and require more thought and programming experience.
es_es: Aunque todas las contribuciones son bienvenidas, hemos marcado algunas cuestiones como especialmente adecuadas para los nuevos contribuyentes con la etiqueta `buena primera cuestión <https://github.com/matplotlib/matplotlib/labels/good%20first%20issue>`_ Se trata de cuestiones bien documentadas, que no requieren un conocimiento profundo de los aspectos internos de Matplotlib. Los temas pueden ser etiquetados adicionalmente con una dificultad. ``Dificultad: Fácil`` es adecuado para personas con poca experiencia en Python. Dificultad: Medium`` y ``Difficulty: Difícil`` no son triviales de resolver y requieren más reflexión y experiencia en programación.

source: Submitting a bug report
es_es: Envío de un informe de error

source: If you find a bug in the code or documentation, do not hesitate to submit a ticket to the `Issue Tracker <https://github.com/matplotlib/matplotlib/issues>`_. You are also welcome to post feature requests or pull requests.
es_es: Si encuentras un error en el código o en la documentación, no dudes en enviar un ticket al `Issue Tracker <https://github.com/matplotlib/matplotlib/issues>`_. También eres bienvenido/a a publicar solicitudes de características o pull requests.

source: If you are reporting a bug, please do your best to include the following:
es_es: Si estás informando de un error, por favor, haz lo posible por incluir lo siguiente:

source: A short, top-level summary of the bug. In most cases, this should be 1-2 sentences.
es_es: Un breve resumen de nivel superior del fallo. En la mayoría de los casos, esto debería ser 1-2 frases.

source: A short, self-contained code snippet to reproduce the bug, ideally allowing a simple copy and paste to reproduce. Please do your best to reduce the code snippet to the minimum required.
es_es: Un fragmento de código corto y autocontenido para reproducir el fallo, que idealmente permita un simple copiar y pegar para reproducirlo. Por favor, haz lo posible por reducir el fragmento de código al mínimo necesario.

source: The actual outcome of the code snippet.
es_es: El resultado real del fragmento de código.

source: The expected outcome of the code snippet.
es_es: El resultado esperado del fragmento de código.

source: The Matplotlib version, Python version and platform that you are using. You can grab the version with the following commands::
es_es: La versión de Matplotlib, la versión de Python y la plataforma que estás utilizando. Puedes obtener la versión con los siguientes comandos::

source: We have preloaded the issue creation page with a Markdown template that you can use to organize this information.
es_es: Hemos precargado la página de creación de incidencias con una plantilla Markdown que puedes utilizar para organizar esta información.

source: Thank you for your help in keeping bug reports complete, targeted and descriptive.
es_es: Gracias por tu ayuda para que los informes de errores sean completos, específicos y descriptivos.

source: Requesting a new feature
es_es: Solicitar una nueva característica

source: Please post feature requests to the `Issue Tracker <https://github.com/matplotlib/matplotlib/issues>`_.
es_es: Por favor, publica las peticiones de características en el `Rastreador de temas <https://github.com/matplotlib/matplotlib/issues>`_.

source: The Matplotlib developers will give feedback on the feature proposal. Since Matplotlib is an open source project with limited resources, we encourage users to then also :ref:`participate in the implementation <contributing-code>`.
es_es: Los desarrolladores de Matplotlib darán su opinión sobre la propuesta de características. Dado que Matplotlib es un proyecto de código abierto con recursos limitados, animamos a los usuarios a que entonces también :ref:`participen en la implementación <contributing-code>`.

source: Contributing code
es_es: Código de contribución

source: How to contribute
es_es: Cómo contribuir

source: The preferred way to contribute to Matplotlib is to fork the `main repository <https://github.com/matplotlib/matplotlib/>`__ on GitHub, then submit a "pull request" (PR).
es_es: La forma preferida de contribuir a Matplotlib es hacer un fork del `repositorio principal <https://github.com/matplotlib/matplotlib/>`__ en GitHub, y luego enviar un "pull request" (PR).

source: A brief overview is:
es_es: Un breve resumen es:

source: `Create an account <https://github.com/join>`_ on GitHub if you do not already have one.
es_es: `Crea una cuenta <https://github.com/join>` en GitHub si aún no tienes una.

source: Fork the `project repository <https://github.com/matplotlib/matplotlib>`_: click on the 'Fork' button near the top of the page. This creates a copy of the code under your account on the GitHub server.
es_es: Fork del `repositorio del proyecto <https://github.com/matplotlib/matplotlib>`_: haz clic en el botón 'Fork' cerca de la parte superior de la página. Esto crea una copia del código bajo tu cuenta en el servidor de GitHub.

source: Clone this copy to your local disk::
es_es: Clona esta copia en tu disco local::

source: Enter the directory and install the local version of Matplotlib. See :ref:`installing_for_devs` for instructions
es_es: Entra en el directorio e instala la versión local de Matplotlib. Ver :ref:`installing_for_devs` para instrucciones

source: Create a branch to hold your changes::
es_es: Crea una rama para mantener tus cambios::

source: and start making changes. Never work in the ``master`` branch!
es_es: y empezar a hacer cambios. Nunca trabajes en la rama ``master``!

source: Work on this copy, on your computer, using Git to do the version control. When you're done editing e.g., ``lib/matplotlib/collections.py``, do::
es_es: Trabaja en esta copia, en tu ordenador, usando Git para hacer el control de versiones. Cuando hayas terminado de editar, por ejemplo, ``lib/matplotlib/collections.py``, haz::

source: to record your changes in Git, then push them to GitHub with::
es_es: para registrar tus cambios en Git, y luego empujarlos a GitHub con::

source: Finally, go to the web page of your fork of the Matplotlib repo, and click 'Pull request' to send your changes to the maintainers for review.
es_es: Por último, ve a la página web de tu fork del repo de Matplotlib, y haz clic en 'Pull request' para enviar tus cambios a los mantenedores para su revisión.

source: `Introduction to GitHub <https://lab.github.com/githubtraining/introduction-to-github>`_
es_es: `Introducción a GitHub <https://lab.github.com/githubtraining/introduction-to-github>`_

source: :ref:`development-workflow` for best practices for Matplotlib
es_es: :ref:`development-workflow` para las mejores prácticas para Matplotlib

source: Contributing pull requests
es_es: Contribuyendo con pull requests

source: It is recommended to check that your contribution complies with the following rules before submitting a pull request:
es_es: Se recomienda comprobar que tu contribución cumpla con las siguientes reglas antes de enviar un pull request:

source: If your pull request addresses an issue, please use the title to describe the issue and mention the issue number in the pull request description to ensure that a link is created to the original issue.
es_es: Si tu pull request se refiere a un problema, por favor, utiliza el título para describir el problema y menciona el número de problema en la descripción del pull request para asegurar que se cree un enlace al problema original.

source: All public methods should have informative docstrings with sample usage when appropriate. Use the `numpy docstring standard <https://numpydoc.readthedocs.io/en/latest/format.html>`_.
es_es: Todos los métodos públicos deben tener docstrings informativos con ejemplos de uso cuando sea apropiado. Utilice el estándar de documentación de `numpy <https://numpydoc.readthedocs.io/en/latest/format.html>`.

source: Formatting should follow the recommendations of PEP8_, as enforced by flake8_. You can check flake8 compliance from the command line with ::
es_es: El formato debe seguir las recomendaciones de PEP8_, tal y como lo impone flake8_. Puedes comprobar el cumplimiento de flake8 desde la línea de comandos con ::

source: or your editor may provide integration with it. Note that Matplotlib intentionally does not use the black_ auto-formatter (1__), in particular due to its unability to understand the semantics of mathematical expressions (2__, 3__).
es_es: o tu editor puede proporcionar la integración con él. Ten en cuenta que Matplotlib no utiliza intencionadamente el autoformato black_ (1__), en particular debido a su incapacidad para entender la semántica de las expresiones matemáticas (2__, 3__).

source: Each high-level plotting function should have a simple example in the ``Example`` section of the docstring. This should be as simple as possible to demonstrate the method. More complex examples should go in the ``examples`` tree.
es_es: Cada función de trazado de alto nivel debería tener un ejemplo sencillo en la sección ``Ejemplo`` del docstring. Este debe ser lo más simple posible para demostrar el método. Los ejemplos más complejos deben ir en el árbol ``examples``.

source: Changes (both new features and bugfixes) should have good test coverage. See :ref:`testing` for more details.
es_es: Los cambios (tanto las nuevas características como las correcciones de errores) deben tener una buena cobertura de pruebas. Mira :ref:`testing` para más detalles.

source: Import the following modules using the standard scipy conventions::
es_es: Importar los siguientes módulos utilizando las convenciones estándar de scipy::

source: In general, Matplotlib modules should **not** import `.rcParams` using ``from matplotlib import rcParams``, but rather access it as ``mpl.rcParams``. This is because some modules are imported very early, before the `.rcParams` singleton is constructed.
es_es: En general, los módulos de Matplotlib **no** deberían importar `.rcParams` usando ``from matplotlib import rcParams``, sino acceder a él como ``mpl.rcParams``. Esto se debe a que algunos módulos se importan muy pronto, antes de que se construya el singleton `.rcParams`.

source: If your change is a major new feature, add an entry to the ``What's new`` section by adding a new file in ``doc/users/next_whats_new`` (see :file:`doc/users/next_whats_new/README.rst` for more information).
es_es: Si tu cambio es una nueva característica importante, añade una entrada a la sección ``What's new`` añadiendo un nuevo fichero en ``doc/users/next_whats_new`` (ver :file:`doc/users/next_whats_new/README.rst` para más información).

source: If you change the API in a backward-incompatible way, please document it in :file:`doc/api/next_api_changes/behavior`, by adding a new file with the naming convention ``99999-ABC.rst`` where the pull request number is followed by the contributor's initials. (see :file:`doc/api/api_changes.rst` for more information)
es_es: Si cambias la API de forma incompatible con versiones anteriores, documéntalo en :file:`doc/api/next_api_changes/behavior`, añadiendo un nuevo archivo con la convención de nombres ``99999-ABC.rst`` donde el número de pull request va seguido de las iniciales del contribuidor. (ver :file:`doc/api/api_changes.rst` para más información)

source: See below for additional points about :ref:`keyword-argument-processing`, if applicable for your pull request.
es_es: A continuación encontrarás puntos adicionales sobre :ref:`procesamiento de palabras clave-argumentos`, si es aplicable a tu pull request.

source: The current state of the Matplotlib code base is not compliant with all of those guidelines, but we expect that enforcing those constraints on all new contributions will move the overall code base quality in the right direction.
es_es: El estado actual de la base de código de Matplotlib no cumple con todas esas directrices, pero esperamos que la aplicación de esas restricciones en todas las nuevas contribuciones hará que la calidad general de la base de código vaya en la dirección correcta.

source: Contributing documentation
es_es: Contribuyendo a la documentación

source: You as an end-user of Matplotlib can make a valuable contribution because you more clearly see the potential for improvement than a core developer. For example, you can:
es_es: Tú, como usuario final de Matplotlib, puedes hacer una valiosa contribución porque ves más claramente el potencial de mejora que un desarrollador del núcleo. Por ejemplo, puedes:

source: Fix a typo
es_es: Arreglar un error tipográfico

source: Clarify a docstring
es_es: Aclarar un docstring

source: Write or update an :ref:`example plot <gallery>`
es_es: Escribir o actualizar una :ref:`grafo de ejemplo <gallery>`

source: Write or update a comprehensive :ref:`tutorial <tutorials>`
es_es: Escribir o actualizar un completo :ref:`tutorial <tutorials>`

source: The documentation source files live in the same GitHub repository as the code. Contributions are proposed and accepted through the pull request process. For details see :ref:`how-to-contribute`.
es_es: Los archivos fuente de la documentación viven en el mismo repositorio de GitHub que el código. Las contribuciones se proponen y aceptan a través del proceso de pull request. Para más detalles, véase :ref:`how-to-contribute`.

source: If you have trouble getting started, you may instead open an `issue`_ describing the intended improvement.
es_es: Si tienes problemas para empezar, puedes abrir un `issue`_ describiendo la mejora que pretendes.

source: Other ways to contribute
es_es: Otras formas de contribuir

source: It also helps us if you spread the word: reference the project from your blog and articles or link to it from your website! If Matplotlib contributes to a project that leads to a scientific publication, please follow the :doc:`/users/project/citing` guidelines.
es_es: También nos ayuda que corras la voz: ¡haz referencia al proyecto desde tu blog y artículos o enlaza con él desde tu página web! Si Matplotlib contribuye a un proyecto que da lugar a una publicación científica, por favor, sigue las directrices de :doc:`/users/project/citing`.

source: Coding guidelines
es_es: Pautas de codificación

source: API changes
es_es: Cambios en la API

source: API consistency and stability are of great value. Therefore, API changes (e.g. signature changes, behavior changes, removals) will only be conducted if the added benefit is worth the user effort for adapting.
es_es: La consistencia y la estabilidad de la API son de gran valor. Por lo tanto, los cambios de la API (por ejemplo, cambios de firma, cambios de comportamiento, eliminaciones) sólo se llevará a cabo si el beneficio añadido vale la pena el esfuerzo del usuario para adaptarse.

source: API changes in Matplotlib have to be performed following the deprecation process below, except in very rare circumstances as deemed necessary by the development team. This ensures that users are notified before the change will take effect and thus prevents unexpected breaking of code.
es_es: Los cambios de la API en Matplotlib tienen que realizarse siguiendo el proceso de depreciación que se indica a continuación, excepto en circunstancias muy raras que el equipo de desarrollo considere necesarias. Esto asegura que los usuarios sean notificados antes de que el cambio surta efecto y así se evitan rupturas inesperadas de código.

source: Rules
es_es: Reglas

source: Deprecations are targeted at the next point.release (e.g. 3.x)
es_es: Las desapariciones se dirigen al siguiente punto.release (por ejemplo, 3.x)

source: Deprecated API is generally removed two two point-releases after introduction of the deprecation. Longer deprecations can be imposed by core developers on a case-by-case basis to give more time for the transition
es_es: La API desaprobada se elimina generalmente dos versiones puntuales después de la introducción de la desaprobación. Las depreciaciones más largas pueden ser impuestas por los desarrolladores del núcleo sobre una base de caso por caso para dar más tiempo para la transición

source: The old API must remain fully functional during the deprecation period
es_es: La antigua API debe seguir siendo totalmente funcional durante el periodo de depreciación

source: If alternatives to the deprecated API exist, they should be available during the deprecation period
es_es: Si existen alternativas a la API obsoleta, deberían estar disponibles durante el periodo de obturación

source: If in doubt, decisions about API changes are finally made by the API consistency lead developer
es_es: En caso de duda, las decisiones sobre los cambios en la API son tomadas finalmente por el desarrollador principal de la consistencia de la API

source: Introducing
es_es: Presentación de

source: Announce the deprecation in a new file :file:`doc/api/next_api_changes/deprecations/99999-ABC.rst` where ``99999`` is the pull request number and ``ABC`` are the contributor's initials.
es_es: Anuncia la depreciación en un nuevo archivo :file:`doc/api/next_api_changes/deprecations/99999-ABC.rst` donde ``999`` es el número de pull request y ``ABC`` son las iniciales del contribuidor.

source: If possible, issue a `.MatplotlibDeprecationWarning` when the deprecated API is used. There are a number of helper tools for this:
es_es: Si es posible, emite un `.MatplotlibDeprecationWarning` cuando utilices la API obsoleta. Hay una serie de herramientas de ayuda para esto:

source: Use ``_api.warn_deprecated()`` for general deprecation warnings
es_es: Usa ``_api.warn_deprecated()`` para avisos generales de depreciación

source: Use the decorator ``@_api.deprecated`` to deprecate classes, functions, methods, or properties
es_es: Utiliza el decorador ``@_api.deprecated`` para desaprobar clases, funciones, métodos o propiedades

source: To warn on changes of the function signature, use the decorators ``@_api.delete_parameter``, ``@_api.rename_parameter``, and ``@_api.make_keyword_only``
es_es: Para avisar de cambios en la firma de la función, utiliza los decoradores ``@_api.delete_parameter``, ``@_api.rename_parameter``, y ``@_api.make_keyword_only``

source: All these helpers take a first parameter *since*, which should be set to the next point release, e.g. "3.x".
es_es: Todos estos helpers toman un primer parámetro *since*, que debe ser establecido a la siguiente versión de punto, por ejemplo "3.x".

source: Expiring
es_es: Expiración

source: Announce the API changes in a new file :file:`doc/api/next_api_changes/[kind]/99999-ABC.rst` where ``99999`` is the pull request number and ``ABC`` are the contributor's initials, and ``[kind]`` is one of the folders :file:`behavior`, :file:`development`, :file:`removals`. See :file:`doc/api/next_api_changes/README.rst` for more information. For the content, you can usually copy the deprecation notice and adapt it slightly.
es_es: Anuncia los cambios de la API en un nuevo fichero :file:`doc/api/next_api_changes/[kind]/99999-ABC.rst` donde ``999`` es el número de pull request y ``ABC`` son las iniciales del contribuidor, y ``[kind]`` es una de las carpetas :file:`behavior`, :file:`development`, :file:`removals`. Consulta :file:`doc/api/next_api_changes/README.rst` para más información. Para el contenido, normalmente se puede copiar el aviso de depreciación y adaptarlo ligeramente.

source: Change the code functionality and remove any related deprecation warnings.
es_es: Cambia la funcionalidad del código y elimina las advertencias de desaprobación relacionadas.

source: Adding new API
es_es: Añadiendo nueva API

source: Every new function, parameter and attribute that is not explicitly marked as private (i.e., starts with an underscore) becomes part of Matplotlib's public API. As discussed above, changing the existing API is cumbersome. Therefore, take particular care when adding new API:
es_es: Cada nueva función, parámetro y atributo que no esté marcado explícitamente como privado (es decir, que empiece con un guión bajo) pasa a formar parte de la API pública de Matplotlib. Como se ha comentado anteriormente, cambiar la API existente es engorroso. Por lo tanto, ten especial cuidado cuando añadas una nueva API:

source: Mark helper functions and internal attributes as private by prefixing them with an underscore.
es_es: Marca las funciones de ayuda y los atributos internos como privados anteponiéndoles un guión bajo.

source: Carefully think about good names for your functions and variables.
es_es: Piensa cuidadosamente en buenos nombres para tus funciones y variables.

source: Try to adopt patterns and naming conventions from existing parts of the Matplotlib API.
es_es: Intenta adoptar patrones y convenciones de nomenclatura de las partes existentes de la API de Matplotlib.
