Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/contributing.po
Languages: es_es

source: Consider making as many arguments keyword-only as possible. See also `API Evolution the Right Way -- Add Parameters Compatibly`__.
es_es: Considera la posibilidad de hacer el mayor número posible de argumentos con palabras clave. Ver también `API Evolution the Right Way -- Add Parameters Compatibly`__.

source: New modules and files: installation
es_es: Nuevos módulos y archivos: instalación

source: If you have added new files or directories, or reorganized existing ones, make sure the new files are included in the match patterns in in *package_data* in :file:`setupext.py`.
es_es: Si has añadido nuevos ficheros o directorios, o has reorganizado los existentes, asegúrate de que los nuevos ficheros están incluidos en los patrones de coincidencia en *package_data* en :file:`setupext.py`.

source: C/C++ extensions
es_es: Extensiones C/C++

source: Extensions may be written in C or C++.
es_es: Las extensiones pueden estar escritas en C o C++.

source: Code style should conform to PEP7 (understanding that PEP7 doesn't address C++, but most of its admonitions still apply).
es_es: El estilo del código debe ajustarse a PEP7 (entendiendo que PEP7 no se refiere a C++, pero la mayoría de sus advertencias siguen siendo aplicables).

source: Python/C interface code should be kept separate from the core C/C++ code. The interface code should be named :file:`FOO_wrap.cpp` or :file:`FOO_wrapper.cpp`.
es_es: El código de interfaz de Python/C debe mantenerse separado del código C/C++ del núcleo. El código de la interfaz debe llamarse :file:`FOO_wrap.cpp` o :file:`FOO_wrapper.cpp`.

source: Header file documentation (aka docstrings) should be in Numpydoc format. We don't plan on using automated tools for these docstrings, and the Numpydoc format is well understood in the scientific Python community.
es_es: La documentación de los archivos de cabecera (aka docstrings) debe estar en formato Numpydoc. No planeamos usar herramientas automatizadas para estos docstrings, y el formato Numpydoc es bien entendido en la comunidad científica de Python.

source: C/C++ code in the :file:`extern/` directory is vendored, and should be kept close to upstream whenever possible. It can be modified to fix bugs or implement new features only if the required changes cannot be made elsewhere in the codebase. In particular, avoid making style fixes to it.
es_es: El código C/C++ en el directorio :file:`extern/` se vende, y debe mantenerse cerca del upstream siempre que sea posible. Puede ser modificado para arreglar errores o implementar nuevas características sólo si los cambios requeridos no se pueden hacer en otra parte de la base de código. En particular, evita hacer arreglos de estilo en él.

source: Keyword argument processing
es_es: Procesamiento del argumento de la palabra clave

source: Matplotlib makes extensive use of ``**kwargs`` for pass-through customizations from one function to another. A typical example is `~matplotlib.axes.Axes.text`. The definition of `matplotlib.pyplot.text` is a simple pass-through to `matplotlib.axes.Axes.text`::
es_es: Matplotlib hace un uso extensivo de ``**kwargs`` para pasar personalizaciones de una función a otra. Un ejemplo típico es `~matplotlib.axes.Axes.text`. La definición de `matplotlib.pyplot.text` es un simple paso a `matplotlib.axes.Axes.text`::

source: `matplotlib.axes.Axes.text` (simplified for illustration) just passes all ``args`` and ``kwargs`` on to ``matplotlib.text.Text.__init__``::
es_es: `matplotlib.axes.Axes.text` (simplificado para ilustrar) sólo pasa todos los ``args`` y ``kwargs`` a ``matplotlib.text.Text.__init__`::

source: and ``matplotlib.text.Text.__init__`` (again, simplified) just passes them on to the `matplotlib.artist.Artist.update` method::
es_es: y ``matplotlib.text.Text.__init__`` (de nuevo, simplificado) sólo los pasa al método `matplotlib.artist.Artist.update`::

source: ``update`` does the work looking for methods named like ``set_property`` if ``property`` is a keyword argument. i.e., no one looks at the keywords, they just get passed through the API to the artist constructor which looks for suitably named methods and calls them with the value.
es_es: ``update`` hace el trabajo buscando métodos nombrados como ``set_property`` si ``property`` es un argumento de palabra clave. Es decir, nadie mira las palabras clave, simplemente se pasan a través de la API al constructor del artist que busca métodos con nombres adecuados y los llama con el valor.

source: As a general rule, the use of ``**kwargs`` should be reserved for pass-through keyword arguments, as in the example above. If all the keyword args are to be used in the function, and not passed on, use the key/value keyword args in the function definition rather than the ``**kwargs`` idiom.
es_es: Como regla general, el uso de ``**kwargs`` debe reservarse para argumentos de palabras clave de paso, como en el ejemplo anterior. Si todos los argumentos de palabra clave se van a utilizar en la función, y no se van a pasar, utilice los argumentos de palabra clave/valor en la definición de la función en lugar del modismo ``**kwargs``.

source: In some cases, you may want to consume some keys in the local function, and let others pass through. Instead of popping arguments to use off ``**kwargs``, specify them as keyword-only arguments to the local function. This makes it obvious at a glance which arguments will be consumed in the function. For example, in :meth:`~matplotlib.axes.Axes.plot`, ``scalex`` and ``scaley`` are local arguments and the rest are passed on as :meth:`~matplotlib.lines.Line2D` keyword arguments::
es_es: En algunos casos, puede querer consumir algunas claves en la función local, y dejar que otras pasen. En lugar de hacer estallar los argumentos a utilizar fuera de ``**kwargs``, especifíquelos como argumentos de sólo palabras clave a la función local. Esto hace que sea obvio a simple vista qué argumentos serán consumidos en la función. Por ejemplo, en :meth:`~matplotlib.axes.Axes.plot`, ``scalex`` y ``scaley`` son argumentos locales y el resto se pasan como argumentos de palabra clave :meth:`~matplotlib.lines.Line2D`::

source: Using logging for debug messages
es_es: Uso del registro para los mensajes de depuración

source: Matplotlib uses the standard Python `logging` library to write verbose warnings, information, and debug messages. Please use it! In all those places you write `print` calls to do your debugging, try using `logging.debug` instead!
es_es: Matplotlib utiliza la librería estándar de Python `logging` para escribir advertencias, información y mensajes de depuración. ¡Por favor, utilízala! En todos aquellos lugares en los que escribes llamadas `print` para hacer tu depuración, ¡intenta usar `logging.debug` en su lugar!

source: To include `logging` in your module, at the top of the module, you need to ``import logging``. Then calls in your code like::
es_es: Para incluir `logging` en tu módulo, en la parte superior del módulo, necesitas ``importar logging``. A continuación, las llamadas en su código como::

source: will log to a logger named ``matplotlib.yourmodulename``.
es_es: se registrará en un logger llamado ``matplotlib.yourmodulename``.

source: If an end-user of Matplotlib sets up `logging` to display at levels more verbose than ``logging.WARNING`` in their code with the Matplotlib-provided helper::
es_es: Si un usuario final de Matplotlib configura el `logging` para que se muestre a niveles más detallados que ``logging.WARNING`` en su código con el ayudante proporcionado por Matplotlib::

source: or manually with ::
es_es: o manualmente con ::

source: Then they will receive messages like
es_es: Entonces recibirán mensajes como

source: Which logging level to use?
es_es: ¿Qué nivel de registro utilizar?

source: There are five levels at which you can emit messages.
es_es: Hay cinco niveles en los que se pueden emitir mensajes.

source: `logging.critical` and `logging.error` are really only there for errors that will end the use of the library but not kill the interpreter.
es_es: `logging.critical` y `logging.error` están realmente ahí sólo para errores que terminarán el uso de la biblioteca pero no matarán al intérprete.

source: `logging.warning` and `._api.warn_external` are used to warn the user, see below.
es_es: `logging.warning` y `._api.warn_external` se utilizan para avisar al usuario, ver más abajo.

source: `logging.info` is for information that the user may want to know if the program behaves oddly. They are not displayed by default. For instance, if an object isn't drawn because its position is ``NaN``, that can usually be ignored, but a mystified user could call ``logging.basicConfig(level=logging.INFO)`` and get an error message that says why.
es_es: `logging.info` es para información que el usuario puede querer saber si el programa se comporta de forma extraña. No se muestran por defecto. Por ejemplo, si un objeto no se dibuja porque su posición es ``NaN``, normalmente se puede ignorar, pero un usuario desconcertado podría llamar a ``logging.basicConfig(level=logging.INFO)`` y obtener un mensaje de error que diga por qué.

source: `logging.debug` is the least likely to be displayed, and hence can be the most verbose. "Expected" code paths (e.g., reporting normal intermediate steps of layouting or rendering) should only log at this level.
es_es: `logging.debug` es el menos probable que se muestre, y por lo tanto puede ser el más verboso. Las rutas de código "esperadas" (por ejemplo, informando de los pasos intermedios normales de la maquetación o el renderizado) sólo deberían registrar en este nivel.

source: By default, `logging` displays all log messages at levels higher than ``logging.WARNING`` to `sys.stderr`.
es_es: Por defecto, `logging` muestra todos los mensajes de registro de niveles superiores a ``logging.WARNING`` en `sys.stderr`.

source: The `logging tutorial`_ suggests that the difference between `logging.warning` and `._api.warn_external` (which uses `warnings.warn`) is that `._api.warn_external` should be used for things the user must change to stop the warning (typically in the source), whereas `logging.warning` can be more persistent. Moreover, note that `._api.warn_external` will by default only emit a given warning *once* for each line of user code, whereas `logging.warning` will display the message every time it is called.
es_es: El `tutorial de registro`_ sugiere que la diferencia entre `logging.warning` y `._api.warn_external` (que utiliza `warnings.warn`) es que `._api.warn_external` debe utilizarse para cosas que el usuario debe cambiar para detener la advertencia (normalmente en el código fuente), mientras que `logging.warning` puede ser más persistente. Además, tenga en cuenta que `._api.warn_external` sólo emitirá por defecto una advertencia determinada *una vez* por cada línea de código del usuario, mientras que `logging.warning` mostrará el mensaje cada vez que sea llamado.

source: By default, `warnings.warn` displays the line of code that has the ``warn`` call. This usually isn't more informative than the warning message itself. Therefore, Matplotlib uses `._api.warn_external` which uses `warnings.warn`, but goes up the stack and displays the first line of code outside of Matplotlib. For example, for the module::
es_es: Por defecto, `warnings.warn` muestra la línea de código que tiene la llamada ``warn``. Esto normalmente no es más informativo que el propio mensaje de advertencia. Por lo tanto, Matplotlib utiliza `._api.warn_external` que utiliza `warnings.warn`, pero sube por la pila y muestra la primera línea de código fuera de Matplotlib. Por ejemplo, para el módulo::

source: running the script::
es_es: ejecutando el script::

source: will display::
es_es: mostrará::

source: Modifying the module to use `._api.warn_external`::
es_es: Modificando el módulo para usar::

source: and running the same script will display
es_es: y al ejecutar el mismo script se mostrará

source: Writing examples
es_es: Escribir ejemplos

source: We have hundreds of examples in subdirectories of :file:`matplotlib/examples`, and these are automatically generated when the website is built to show up in the :ref:`examples <gallery>` section of the website.
es_es: Tenemos cientos de ejemplos en subdirectorios de :file:`matplotlib/examples`, y estos se generan automáticamente cuando se construye el sitio web para que aparezcan en la sección :ref:`examples <gallery>` del sitio web.

source: Any sample data that the example uses should be kept small and distributed with Matplotlib in the :file:`lib/matplotlib/mpl-data/sample_data/` directory. Then in your example code you can load it into a file handle with::
es_es: Cualquier dato de muestra que utilice el ejemplo debe mantenerse pequeño y distribuirse con Matplotlib en el directorio :file:`lib/matplotlib/mpl-data/sample_data/`. Entonces en tu código de ejemplo puedes cargarlo en un manejador de archivo con::
