Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/development_setup.po
Languages: es_es

source: Setting up Matplotlib for development
es_es: Configuración de Matplotlib para el desarrollo

source: Creating a dedicated environment
es_es: Creación de un entorno dedicado

source: You should set up a dedicated environment to decouple your Matplotlib development from other Python and Matplotlib installations on your system. Here we use python's virtual environment `venv`_, but you may also use others such as conda.
es_es: Debes configurar un entorno dedicado para desacoplar tu desarrollo de Matplotlib de otras instalaciones de Python y Matplotlib en tu sistema. Aquí usamos el entorno virtual de python `venv`_, pero también puedes usar otros como conda.

source: A new environment can be set up with ::
es_es: Se puede configurar un nuevo entorno con ::

source: and activated with one of the following::
es_es: y activado con uno de los siguientes::

source: Whenever you plan to work on Matplotlib, remember to activate the development environment in your shell.
es_es: Cada vez que planees trabajar en Matplotlib, recuerda activar el entorno de desarrollo en tu shell.

source: Retrieving the latest version of the code
es_es: Recuperación de la última versión del código

source: Matplotlib is hosted at https://github.com/matplotlib/matplotlib.git.
es_es: Matplotlib está alojado en https://github.com/matplotlib/matplotlib.git.

source: You can retrieve the latest sources with the command (see :ref:`set-up-fork` for more details)::
es_es: Puedes recuperar las últimas fuentes con el comando (ver :ref:`set-up-fork` para más detalles)::

source: This will place the sources in a directory :file:`matplotlib` below your current working directory.
es_es: Esto colocará las fuentes en un directorio :file:`matplotlib` debajo de tu directorio de trabajo actual.

source: If you have the proper privileges, you can use ``git@`` instead of ``https://``, which works through the ssh protocol and might be easier to use if you are using 2-factor authentication.
es_es: Si tienes los privilegios adecuados, puedes usar ``git@`` en lugar de ``https://``, que funciona a través del protocolo ssh y podría ser más fácil de usar si estás usando la autenticación de 2 factores.

source: Installing Matplotlib in editable mode
es_es: Instalación de Matplotlib en modo editable

source: Install Matplotlib in editable mode from the :file:`matplotlib` directory using the command ::
es_es: Instalar Matplotlib en modo editable desde el directorio :file:`matplotlib` utilizando el comando ::

source: The 'editable/develop mode', builds everything and places links in your Python environment so that Python will be able to import Matplotlib from your development source directory. This allows you to import your modified version of Matplotlib without re-installing after every change. Note that this is only true for ``*.py`` files. If you change the C-extension source (which might also happen if you change branches) you will have to re-run ``python -m pip install -ve .``
es_es: El 'modo editable/desarrollo', construye todo y coloca enlaces en tu entorno Python para que Python sea capaz de importar Matplotlib desde su directorio fuente de desarrollo. Esto te permite importar tu versión modificada de Matplotlib sin tener que reinstalar después de cada cambio. Ten en cuenta que esto sólo es cierto para los archivos ``*.py``. Si cambias la fuente de la extensión C (lo que también puede ocurrir si cambias de rama) tendrás que volver a ejecutar ``python -m pip install -ve .``

source: Installing additional dependencies for development
es_es: Instalación de dependencias adicionales para el desarrollo

source: See :ref:`development-dependencies`.
es_es: Ver :ref:`development-dependencies`.
