Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/documenting_mpl.po
Languages: es_es

source: Writing documentation
es_es: Escribiendo la documentación

source: Getting started
es_es: Empezando

source: General file structure
es_es: Estructura general del archivo

source: All documentation is built from the :file:`doc/`. The :file:`doc/` directory contains configuration files for Sphinx and reStructuredText (ReST_; ``.rst``) files that are rendered to documentation pages.
es_es: Toda la documentación se construye desde el archivo :file:`doc/`. El directorio :file:`doc/` contiene archivos de configuración para Sphinx y archivos reStructuredText (ReST_; ``.rst``) que se convierten en páginas de documentación.

source: Documentation is created in three ways. First, API documentation (:file:`doc/api`) is created by Sphinx_ from the docstrings of the classes in the Matplotlib library. Except for :file:`doc/api/api_changes/`, ``.rst`` files in :file:`doc/api` are created when the documentation is built. See :ref:`writing-docstrings` below.
es_es: La documentación se crea de tres maneras. Primero, la documentación de la API (:file:`doc/api`) es creada por Sphinx_ a partir de los docstrings de las clases de la biblioteca Matplotlib. Excepto para :file:`doc/api/api_changes/`, los archivos ``.rst`` en :file:`doc/api` se crean cuando se construye la documentación. Ver :ref:`writing-docstrings` más abajo.

source: Second, the contents of :file:`doc/plot_types`, :file:`doc/gallery` and :file:`doc/tutorials` are generated by the `Sphinx Gallery`_ from python files in :file:`plot_types/`, :file:`examples/` and :file:`tutorials/`. These sources consist of python scripts that have ReST_ documentation built into their comments. See :ref:`writing-examples-and-tutorials` below.
es_es: En segundo lugar, los contenidos de :file:`doc/plot_types`, :file:`doc/gallery` y :file:`doc/tutorials` son generados por la `Sphinx Gallery`_ a partir de archivos python en :file:`plot_types/`, :file:`examples/` y :file:`tutorials/`. Estas fuentes consisten en scripts de python que tienen la documentación de ReST_ incorporada en sus comentarios. Ver :ref:`escribir-ejemplos-y-tutoriales` más abajo.

source: Third, Matplotlib has narrative docs written in ReST_ in subdirectories of :file:`doc/users/`. If you would like to add new documentation that is suited to an ``.rst`` file rather than a gallery or tutorial example, choose an appropriate subdirectory to put it in, and add the file to the table of contents of :file:`index.rst` of the subdirectory. See :ref:`writing-rest-pages` below.
es_es: En tercer lugar, Matplotlib tiene documentación narrativa escrita en ReST_ en subdirectorios de :file:`doc/users/`. Si deseas añadir nueva documentación que se adapte a un archivo ``.rst`` en lugar de una galería o un ejemplo de tutorial, elige un subdirectorio apropiado para ponerlo, y añade el archivo a la tabla de contenidos de :file:`index.rst` del subdirectorio. Ver :ref:`escritura de páginas de descanso` más abajo.

source: Don't directly edit the ``.rst`` files in :file:`doc/plot_types`, :file:`doc/gallery`, :file:`doc/tutorials`, and :file:`doc/api` (excepting :file:`doc/api/api_changes/`). Sphinx_ regenerates files in these directories when building documentation.
es_es: No edites directamente los ficheros ``.rst`` en :file:`doc/plot_types`, :file:`doc/gallery`, :file:`doc/tutorials`, y :file:`doc/api` (excepto :file:`doc/api/api_changes/`). Sphinx_ regenera los archivos en estos directorios cuando construye la documentación.

source: Setting up the doc build
es_es: Configurando la construcción de la documentación

source: The documentation for Matplotlib is generated from reStructuredText (ReST_) using the Sphinx_ documentation generation tool.
es_es: La documentación de Matplotlib se genera a partir de reStructuredText (ReST_) utilizando la herramienta de generación de documentación Sphinx_.

source: To build the documentation you will need to :ref:`set up Matplotlib for development <installing_for_devs>`. Note in particular the :ref:`additional dependencies <doc-dependencies>` required to build the documentation.
es_es: Para construir la documentación necesitarás :ref:`configurar Matplotlib para desarrollo <installing_for_devs>`. Ten en cuenta en particular las :ref:`dependencias adicionales <doc-dependencias>` necesarias para construir la documentación.

source: Building the docs
es_es: Construyendo la documentación

source: The documentation sources are found in the :file:`doc/` directory in the trunk. The configuration file for Sphinx is :file:`doc/conf.py`. It controls which directories Sphinx parses, how the docs are built, and how the extensions are used. To build the documentation in html format, cd into :file:`doc/` and run:
es_es: Las fuentes de documentación se encuentran en el directorio :file:`doc/` en el tronco. El archivo de configuración para Sphinx es :file:`doc/conf.py`. Controla qué directorios analiza Sphinx, cómo se construyen los documentos y cómo se utilizan las extensiones. Para construir la documentación en formato html, cd en :file:`doc/` y ejecutar:

source: Other useful invocations include
es_es: Otras invocaciones útiles incluyen

source: The ``SPHINXOPTS`` variable is set to ``-W --keep-going`` by default to build the complete docs but exit with exit status 1 if there are warnings. To unset it, use
es_es: La variable ``SPHINXOPTS`` está configurada como ``-W --keep-going`` por defecto para construir los documentos completos pero salir con el estado de salida 1 si hay advertencias. Para desactivarla, utiliza

source: On Windows the arguments must be at the end of the statement:
es_es: En Windows los argumentos deben estar al final de la sentencia:

source: You can use the ``O`` variable to set additional options:
es_es: Puedes utilizar la variable ``O`` para establecer opciones adicionales:

source: ``make O=-j4 html`` runs a parallel build with 4 processes.
es_es: ``make O=-j4 html`` ejecuta una construcción paralela con 4 procesos.

source: ``make O=-Dplot_formats=png:100 html`` saves figures in low resolution.
es_es: ``make O=-Dplot_formats=png:100 html`` guarda las figuras en baja resolución.

source: ``make O=-Dplot_gallery=0 html`` skips the gallery build.
es_es: ``make O=-Dplot_gallery=0 html`` se salta la construcción de la galería.

source: Multiple options can be combined using e.g. ``make O='-j4 -Dplot_gallery=0' html``.
es_es: Se pueden combinar varias opciones utilizando, por ejemplo, ``make O='-j4 -Dplot_gallery=0' html``.

source: On Windows, either use the format shown above or set options as environment variables, e.g.:
es_es: En Windows, utiliza el formato mostrado arriba o establece las opciones como variables de entorno, por ejemplo.:

source: Showing locally built docs
es_es: Mostrando los documentos construidos localmente

source: The built docs are available in the folder :file:`build/html`. A shortcut for opening them in your default browser is:
es_es: Los documentos construidos están disponibles en la carpeta :file:`build/html`. Un acceso directo para abrirlos en su navegador por defecto es:

source: Writing ReST pages
es_es: Escribiendo páginas ReST

source: Most documentation is either in the docstrings of individual classes and methods, in explicit ``.rst`` files, or in examples and tutorials. All of these use the ReST_ syntax and are processed by Sphinx_.
es_es: La mayor parte de la documentación se encuentra en los docstrings de clases y métodos individuales, en archivos explícitos ``.rst``, o en ejemplos y tutoriales. Todos ellos utilizan la sintaxis ReST_ y son procesados por Sphinx_.

source: The `Sphinx reStructuredText Primer <https://www.sphinx-doc.org/en/master/usage/restructuredtext/basics.html>`_ is a good introduction into using ReST. More complete information is available in the `reStructuredText reference documentation <https://docutils.sourceforge.io/rst.html#reference-documentation>`_.
es_es: El `Sphinx reStructuredText Primer <https://www.sphinx-doc.org/en/master/usage/restructuredtext/basics.html>`_ es una buena introducción al uso de ReST. Hay información más completa en la documentación de referencia de `reStructuredText <https://docutils.sourceforge.io/rst.html#reference-documentation>`_.

source: This section contains additional information and conventions how ReST is used in the Matplotlib documentation.
es_es: Esta sección contiene información adicional y convenciones sobre cómo se utiliza ReST en la documentación de Matplotlib.

source: Formatting and style conventions
es_es: Convenciones de formato y estilo

source: It is useful to strive for consistency in the Matplotlib documentation. Here are some formatting and style conventions that are used.
es_es: Es útil esforzarse por la consistencia en la documentación de Matplotlib. Aquí hay algunas convenciones de formato y estilo que se utilizan.

source: Section formatting
es_es: Formato de la sección

source: For everything but top-level chapters, use ``Upper lower`` for section titles, e.g., ``Possible hangups`` rather than ``Possible Hangups``
es_es: Para todo lo que no sean capítulos de nivel superior, utiliza ``Upper lower`` para los títulos de las secciones, por ejemplo, ``Possible hangups`` en lugar de ``Possible Hangups``

source: We aim to follow the recommendations from the `Python documentation <https://devguide.python.org/documenting/#sections>`_ and the `Sphinx reStructuredText documentation <https://www.sphinx-doc.org/en/master/usage/restructuredtext/basics.html#sections>`_ for section markup characters, i.e.:
es_es: Intentamos seguir las recomendaciones de la `documentación de Python <https://devguide.python.org/documenting/#sections>`_ y la `documentación de Sphinx reStructuredText <https://www.sphinx-doc.org/en/master/usage/restructuredtext/basics.html#sections>`_ para los caracteres de marcado de secciones, es decir.:

source: ``#`` with overline, for parts. This is reserved for the main title in ``index.rst``. All other pages should start with "chapter" or lower.
es_es: ``#`` con sobrelínea, para las partes. Esto está reservado para el título principal en ``index.rst``. Todas las demás páginas deben comenzar con "chapter" o más abajo.

source: ``*`` with overline, for chapters
es_es: ``*`` con sobrelínea, para los capítulos

source: ``=``, for sections
es_es: ``=``, para las secciones

source: ``-``, for subsections
es_es: ``-``, para las subsecciones

source: ``^``, for subsubsections
es_es: ``^``, para las subsecciones

source: ``"``, for paragraphs
es_es: ``"``, para los párrafos

source: This may not yet be applied consistently in existing docs.
es_es: Es posible que esto no se aplique aún de forma consistente en los docs existentes.

source: Function arguments
es_es: Argumentos de la función

source: Function arguments and keywords within docstrings should be referred to using the ``*emphasis*`` role. This will keep Matplotlib's documentation consistent with Python's documentation:
es_es: Los argumentos de las funciones y las palabras clave dentro de los docstrings deben ser referidos usando la función ``*emphasis*``. Esto mantendrá la documentación de Matplotlib consistente con la documentación de Python:

source: Do not use the ```default role```:
es_es: No utilices el ``default role``:

source: nor the ````literal```` role:
es_es: ni el rol ````literal````:

source: Referring to other documents and sections
es_es: Referente a otros documentos y secciones

source: Sphinx_ allows internal references_ between documents.
es_es: Sphinx_ permite referencias internas_ entre documentos.

source: Documents can be linked with the ``:doc:`` directive:
es_es: Los documentos se pueden enlazar con la directiva ``:doc:``:

source: will render as:
es_es: se mostrará como:

source: See the :doc:`/users/installing/index`
es_es: Ver el :doc:`/users/installing/index`

source: See the tutorial :doc:`/tutorials/introductory/usage`
es_es: Ver el tutorial :doc:`/tutorials/introductory/usage`

source: See the example :doc:`/gallery/lines_bars_and_markers/simple_plot`
es_es: Ver el ejemplo :doc:`/gallery/lines_bars_and_markers/simple_plot`

source: Sections can also be given reference names. For instance from the :doc:`/users/installing/index` link:
es_es: Las secciones también pueden recibir nombres de referencia. Por ejemplo desde el enlace :doc:`/users/installing/index`:

source: and refer to it using the standard reference syntax:
es_es: y hacer referencia a él utilizando la sintaxis de referencia estándar:

source: will give the following link: :ref:`clean-install`
es_es: dará el siguiente enlace: :ref:`clean-install`

source: To maximize internal consistency in section labeling and references, use hyphen separated, descriptive labels for section references. Keep in mind that contents may be reorganized later, so avoid top level names in references like ``user`` or ``devel`` or ``faq`` unless necessary, because for example the FAQ "what is a backend?" could later become part of the users guide, so the label:
es_es: Para maximizar la coherencia interna en el etiquetado y las referencias de las secciones, utilice etiquetas descriptivas separadas por guiones para las referencias de las secciones. Ten en cuenta que los contenidos pueden ser reorganizados más tarde, así que evita los nombres de primer nivel en las referencias como ``user`` o ``devel`` o ``faq`` a menos que sea necesario, porque por ejemplo la FAQ "¿qué es un backend?" podría convertirse más tarde en parte de la guía de usuarios, por lo que la etiqueta:

source: is better than:
es_es: es mejor que:

source: In addition, since underscores are widely used by Sphinx itself, use hyphens to separate words.
es_es: Además, dado que los guiones bajos son muy utilizados por la propia Sphinx, utilice guiones para separar las palabras.

source: Referring to other code
es_es: Referido a otro código

source: To link to other methods, classes, or modules in Matplotlib you can use back ticks, for example:
es_es: Para enlazar con otros métodos, clases o módulos de Matplotlib se pueden utilizar marcadores de vuelta, por ejemplo:

source: generates a link like this: `matplotlib.collections.LineCollection`.
es_es: genera un enlace como este: `matplotlib.collections.LineCollection`.

source: *Note:* We use the sphinx setting ``default_role = 'obj'`` so that you don't have to use qualifiers like ``:class:``, ``:func:``, ``:meth:`` and the likes.
es_es: *Nota: Usamos la configuración de sphinx ``default_role = 'obj'`` para que no tengas que usar calificadores como ``:class:``, ``:func:``, ``:meth:`` y similares.

source: Often, you don't want to show the full package and module name. As long as the target is unanbigous you can simply leave them out:
es_es: A menudo, no se quiere mostrar el nombre completo del paquete y del módulo. Mientras el objetivo no sea grande, puedes simplemente omitirlos:

source: and the link still works: `.LineCollection`.
es_es: y el enlace sigue funcionando: `.LineCollection`.

source: If there are multiple code elements with the same name (e.g. ``plot()`` is a method in multiple classes), you'll have to extend the definition:
es_es: Si hay varios elementos de código con el mismo nombre (por ejemplo, ``plot()`` es un método en varias clases), tendrás que extender la definición:

source: These will show up as `.pyplot.plot` or `.Axes.plot`. To still show only the last segment you can add a tilde as prefix:
es_es: Estos se mostrarán como `.pyplot.plot` o `.Axes.plot`. Para seguir mostrando sólo el último segmento puedes añadir una tilde como prefijo:

source: will render as `~.pyplot.plot` or `~.Axes.plot`.
es_es: se renderizará como `~.pyplot.plot` o `~.Axes.plot`.

source: Other packages can also be linked via `intersphinx <http://www.sphinx-doc.org/en/master/ext/intersphinx.html>`_:
es_es: También se pueden enlazar otros paquetes a través de `intersphinx <http://www.sphinx-doc.org/en/master/ext/intersphinx.html>`:

source: will return this link: `numpy.mean`. This works for Python, Numpy, Scipy, and Pandas (full list is in :file:`doc/conf.py`). If external linking fails, you can check the full list of referenceable objects with the following commands::
es_es: devolverá este enlace: `numpy.mean`. Esto funciona para Python, Numpy, Scipy y Pandas (la lista completa está en :file:`doc/conf.py`). Si la vinculación externa falla, puedes comprobar la lista completa de objetos referenciables con los siguientes comandos::

source: Including figures and files
es_es: Inclusión de figuras y archivos

source: Image files can directly included in pages with the ``image::`` directive. e.g., :file:`tutorials/intermediate/constrainedlayout_guide.py` displays a couple of static images::
es_es: Los archivos de imagen pueden incluirse directamente en las páginas con la directiva ``image::``. Por ejemplo, :file:`tutorials/intermediate/constrainedlayout_guide.py` muestra un par de imágenes estáticas::

source: Files can be included verbatim. For instance the ``LICENSE`` file is included at :ref:`license-agreement` using ::
es_es: Los archivos pueden incluirse textualmente. Por ejemplo, el archivo ``LICENSE`` se incluye en :ref:`license-agreement` usando ::

source: The examples directory is copied to :file:`doc/gallery` by sphinx-gallery, so plots from the examples directory can be included using
es_es: El directorio de ejemplos es copiado a :file:`doc/gallery` por sphinx-gallery, por lo que los gráficos del directorio de ejemplos pueden ser incluidos usando

source: Note that the python script that generates the plot is referred to, rather than any plot that is created. Sphinx-gallery will provide the correct reference when the documentation is built.
es_es: Ten en cuenta que se hace referencia al script de python que genera la trama, en lugar de cualquier trama que se crea. Sphinx-gallery proporcionará la referencia correcta cuando se construya la documentación.

source: Writing docstrings
es_es: Escribiendo docstrings

source: Most of the API documentation is written in docstrings. These are comment blocks in source code that explain how the code works.
es_es: La mayor parte de la documentación de la API está escrita en docstrings. Son bloques de comentarios en el código fuente que explican cómo funciona el código.

source: Some parts of the documentation do not yet conform to the current documentation style. If in doubt, follow the rules given here and not what you may see in the source code. Pull requests updating docstrings to the current style are very welcome.
es_es: Algunas partes de la documentación aún no se ajustan al estilo de documentación actual. En caso de duda, sigue las reglas dadas aquí y no lo que pueda ver en el código fuente. Los pull requests que actualicen los docstrings al estilo actual son muy bienvenidos.

source: All new or edited docstrings should conform to the `numpydoc docstring guide`_. Much of the ReST_ syntax discussed above (:ref:`writing-rest-pages`) can be used for links and references. These docstrings eventually populate the :file:`doc/api` directory and form the reference documentation for the library.
es_es: Todos los docstrings nuevos o editados deben ajustarse a la `guía de docstrings de numpydoc`_. Gran parte de la sintaxis ReST_ comentada anteriormente (:ref:`escritura de páginas de descanso`) puede utilizarse para los enlaces y las referencias. Estos docstrings acaban poblando el directorio :file:`doc/api` y forman la documentación de referencia de la biblioteca.

source: Example docstring
es_es: Ejemplo de docstring

source: An example docstring looks like:
es_es: Un ejemplo de docstring tiene el siguiente aspecto:

source: See the `~.Axes.hlines` documentation for how this renders.
es_es: Consulta la documentación de `~.Axes.hlines` para saber cómo se renderiza.

source: The Sphinx_ website also contains plenty of documentation_ concerning ReST markup and working with Sphinx in general.
es_es: El sitio web de Sphinx_ también contiene mucha documentación_ relativa al marcado ReST y al trabajo con Sphinx en general.

source: Formatting conventions
es_es: Convenciones de formato

source: The basic docstring conventions are covered in the `numpydoc docstring guide`_ and the Sphinx_ documentation. Some Matplotlib-specific formatting conventions to keep in mind:
es_es: Las convenciones básicas de docstring están cubiertas en la `guía de docstring de numpydoc`_ y en la documentación de Sphinx_. Algunas convenciones de formato específicas de Matplotlib a tener en cuenta:

source: Quote positions
es_es: Posiciones de cotización

source: The quotes for single line docstrings are on the same line (pydocstyle D200)::
es_es: Las comillas para los docstrings de una línea están en la misma línea (pydocstyle D200)::

source: The quotes for multi-line docstrings are on separate lines (pydocstyle D213)::
es_es: Las comillas para docstrings de varias líneas están en líneas separadas (pydocstyle D213)::

source: Do not use the ```default role``` or the ````literal```` role:
es_es: No utilices el rol ``default`` o el rol ````literal````:

source: Quotes for strings
es_es: Comillas para las cadenas

source: Matplotlib does not have a convention whether to use single-quotes or double-quotes. There is a mixture of both in the current code.
es_es: Matplotlib no tiene una convención para usar comillas simples o dobles. Hay una mezcla de ambos en el código actual.

source: Use simple single or double quotes when giving string values, e.g.
es_es: Utilizar comillas simples o dobles al dar valores de cadena, por ejemplo.

source: The use of extra literal quotes around the text is discouraged. While they slightly improve the rendered docs, they are cumbersome to type and difficult to read in plain-text docs.
es_es: Se desaconseja el uso de comillas literales adicionales alrededor del texto. Aunque mejoran ligeramente los documentos renderizados, son engorrosos de escribir y difíciles de leer en los documentos de texto plano.

source: Parameter type descriptions
es_es: Descripciones de los tipos de parámetros

source: The main goal for parameter type descriptions is to be readable and understandable by humans. If the possible types are too complex use a simplification for the type description and explain the type more precisely in the text.
es_es: El objetivo principal de las descripciones de tipos de parámetros es que sean legibles y comprensibles por los humanos. Si los posibles tipos son demasiado complejos utiliza una simplificación para la descripción del tipo y explica el tipo de forma más precisa en el texto.

source: Generally, the `numpydoc docstring guide`_ conventions apply. The following rules expand on them where the numpydoc conventions are not specific.
es_es: En general, se aplican las convenciones de la `guía de documentación de numpydoc`_. Las siguientes reglas las amplían cuando las convenciones de numpydoc no son específicas.

source: Use ``float`` for a type that can be any number.
es_es: Utiliza ``float`` para un tipo que puede ser cualquier número.

source: Use ``(float, float)`` to describe a 2D position. The parentheses should be included to make the tuple-ness more obvious.
es_es: Utiliza ``(float, float)`` para describir una posición 2D. Los paréntesis deben incluirse para que la tupla sea más obvia.
