Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/documenting_mpl.po
Languages: es_es

source: Use ``array-like`` for homogeneous numeric sequences, which could typically be a numpy.array. Dimensionality may be specified using ``2D``, ``3D``, ``n-dimensional``. If you need to have variables denoting the sizes of the dimensions, use capital letters in brackets (``(M, N) array-like``). When referring to them in the text they are easier read and no special formatting is needed. Use ``array`` instead of ``array-like`` for return types if the returned object is indeed a numpy array.
es_es: Utiliza ``array-like`` para secuencias numéricas homogéneas, que podrían ser típicamente un numpy.array. La dimensionalidad puede especificarse usando ``2D``, ``3D``, ``n-dimensional``. Si necesitas tener variables que denoten los tamaños de las dimensiones, utiliza letras mayúsculas entre paréntesis (``(M, N) tipo arreglo``). Al referirte a ellas en el texto son más fáciles de leer y no es necesario un formato especial. Utiliza ``array`` en lugar de ``array-like`` para los tipos de retorno si el objeto devuelto es efectivamente un arreglo de numpy.

source: ``float`` is the implicit default dtype for array-likes. For other dtypes use ``array-like of int``.
es_es: ``float`` es el dtype implícito por defecto para los arreglos. Para otros dtypes usa ``array-like of int``.

source: Some possible uses::
es_es: Algunos usos posibles::

source: Non-numeric homogeneous sequences are described as lists, e.g.::
es_es: Las secuencias homogéneas no numéricas se describen como listas, por ejemplo.::

source: Referencing types
es_es: Tipos de referencia

source: Generally, the rules from referring-to-other-code_ apply. More specifically:
es_es: En general, se aplican las reglas de referring-to-other-code_. Más específicamente:

source: Use full references ```~matplotlib.colors.Normalize``` with an abbreviation tilde in parameter types. While the full name helps the reader of plain text docstrings, the HTML does not need to show the full name as it links to it. Hence, the ``~``-shortening keeps it more readable.
es_es: Utilizar las referencias completas ``~matplotlib.colors.Normalize`` con una tilde de abreviatura en los tipos de parámetros. Mientras que el nombre completo ayuda al lector de docstrings de texto plano, el HTML no necesita mostrar el nombre completo ya que lo enlaza. Por lo tanto, el acortamiento ``~`` lo hace más legible.

source: Use abbreviated links ```.Normalize``` in the text.
es_es: Usar enlaces abreviados ``.Normalize`` en el texto.

source: Default values
es_es: Valores por defecto

source: As opposed to the numpydoc guide, parameters need not be marked as *optional* if they have a simple default:
es_es: A diferencia de la guía de numpydoc, no es necesario marcar los parámetros como *opcionales* si tienen un simple valor por defecto:

source: use ``{name} : {type}, default: {val}`` when possible.
es_es: utilizar ``{nombre} : {tipo}, por defecto: {val}`` cuando sea posible.

source: use ``{name} : {type}, optional`` and describe the default in the text if it cannot be explained sufficiently in the recommended manner.
es_es: utilizar ``{nombre} : {tipo}, opcional`` y describir el valor por defecto en el texto, si no se puede explicar suficientemente en la forma recomendada.

source: The default value should provide semantic information targeted at a human reader. In simple cases, it restates the value in the function signature. If applicable, units should be added.
es_es: El valor por defecto debe proporcionar información semántica dirigida a un lector humano. En casos sencillos, reitera el valor de la firma de la función. Si procede, deben añadirse las unidades.

source: If *None* is only used as a sentinel value for "parameter not specified", do not document it as the default. Depending on the context, give the actual default, or mark the parameter as optional if not specifying has no particular effect.
es_es: Si *None* sólo se utiliza como valor centinela para "parámetro no especificado", no lo documentes como valor por defecto. Dependiendo del contexto, da el valor por defecto real, o marca el parámetro como opcional, si no especificarlo no tiene ningún efecto particular.

source: ``See also`` sections
es_es: ``Ver también`` secciones

source: Sphinx automatically links code elements in the definition blocks of ``See also`` sections. No need to use backticks there::
es_es: Sphinx enlaza automáticamente los elementos de código en los bloques de definición de las secciones ``See also``. No hay necesidad de utilizar backticks allí::

source: Wrapping parameter lists
es_es: Envolver las listas de parámetros

source: Long parameter lists should be wrapped using a ``\`` for continuation and starting on the new line without any indent (no indent because pydoc will parse the docstring and strip the line continuation so that indent would result in a lot of whitespace within the line):
es_es: Las listas de parámetros largas deben ser envueltas usando un ``\`` para la continuación y comenzando en la nueva línea sin ninguna sangría (sin sangría porque pydoc analizará el docstring y quitará la continuación de la línea de modo que la sangría resultaría en un montón de espacios en blanco dentro de la línea):

source: Alternatively, you can describe the valid parameter values in a dedicated section of the docstring.
es_es: Alternativamente, puedes describir los valores válidos de los parámetros en una sección dedicada del docstring.

source: rcParams can be referenced with the custom ``:rc:`` role: :literal:`:rc:\`foo\`` yields ``rcParams["foo"] = 'default'``, which is a link to the :file:`matplotlibrc` file description.
es_es: rcParams puede ser referenciado con el rol personalizado ``:rc:``: :literal:`:rc:`foo`` produce ``rcParams["foo"] = 'default'``, que es un enlace a la descripción del archivo :file:`matplotlibrc`.

source: Setters and getters
es_es: Setters y getters

source: Artist properties are implemented using setter and getter methods (because Matplotlib predates the Python `property` decorator). By convention, these setters and getters are named ``set_PROPERTYNAME`` and ``get_PROPERTYNAME``; the list of properties thusly defined on an artist and their values can be listed by the `~.pyplot.setp` and `~.pyplot.getp` functions.
es_es: Las propiedades de los artistas se implementan mediante métodos setter y getter (porque Matplotlib es anterior al decorador `property` de Python). Por convención, estos setters y getters se denominan ``set_PROPERTYNAME`` y ``get_PROPERTYNAME``; la lista de propiedades así definidas en un artist y sus valores pueden ser listados por las funciones `~.pyplot.setp` y `~.pyplot.getp`.

source: The Parameters block of property setter methods is parsed to document the accepted values, e.g. the docstring of `.Line2D.set_linestyle` starts with
es_es: El bloque Parameters de los métodos de establecimiento de propiedades se analiza para documentar los valores aceptados, por ejemplo, el docstring de `.Line2D.set_linestyle` comienza con

source: which results in the following line in the output of ``plt.setp(line)`` or ``plt.setp(line, "linestyle")``::
es_es: que da como resultado la siguiente línea en la salida de ``plt.setp(line)`` o ``plt.setp(line, "linestyle")``::

source: In some rare cases (mostly, setters which accept both a single tuple and an unpacked tuple), the accepted values cannot be documented in such a fashion; in that case, they can be documented as an ``.. ACCEPTS:`` block, e.g. for `.axes.Axes.set_xlim`:
es_es: En algunos casos raros (sobre todo, los setters que aceptan tanto una tupla simple como una tupla no empaquetada), los valores aceptados no pueden documentarse de esa manera; en ese caso, pueden documentarse como un bloque ``. ACCEPTS:`` bloque, por ejemplo, para `.axes.Axes.set_xlim`:

source: Note that the leading ``..`` makes the ``.. ACCEPTS:`` block a reST comment, hiding it from the rendered docs.
es_es: Observe que el encabezamiento ``..`` hace que el bloque ``.. ACCEPTS:`` sea un comentario reST, ocultándolo de los documentos renderizados.

source: Keyword arguments
es_es: Argumentos de la palabra clave

source: The information in this section is being actively discussed by the development team, so use the docstring interpolation only if necessary. This section has been left in place for now because this interpolation is part of the existing documentation.
es_es: La información de esta sección está siendo discutida activamente por el equipo de desarrollo, así que utilice la interpolación del docstring sólo si es necesario. Esta sección se ha dejado por ahora porque esta interpolación forma parte de la documentación existente.

source: Since Matplotlib uses a lot of pass-through ``kwargs``, e.g., in every function that creates a line (`~.pyplot.plot`, `~.pyplot.semilogx`, `~.pyplot.semilogy`, etc...), it can be difficult for the new user to know which ``kwargs`` are supported. Matplotlib uses a docstring interpolation scheme to support documentation of every function that takes a ``**kwargs``. The requirements are:
es_es: Dado que Matplotlib utiliza muchos ``kwargs`` de paso, por ejemplo, en cada función que crea una línea (`~.pyplot.plot`, `~.pyplot.semilogx`, `~.pyplot.semilogy`, etc...), puede ser difícil para el nuevo usuario saber qué ``kwargs`` están soportados. Matplotlib utiliza un esquema de interpolación docstring para soportar la documentación de cada función que toma un ``**kwargs``. Los requisitos son:

source: single point of configuration so changes to the properties don't require multiple docstring edits.
es_es: punto único de configuración para que los cambios en las propiedades no requieran múltiples ediciones de docstrings.

source: as automated as possible so that as properties change, the docs are updated automatically.
es_es: tan automatizado como sea posible para que, a medida que las propiedades cambien, los documentos se actualicen automáticamente.

source: The ``@docstring.interpd`` decorator implements this. Any function accepting `.Line2D` pass-through ``kwargs``, e.g., `matplotlib.axes.Axes.plot`, can list a summary of the `.Line2D` properties, as follows:
es_es: El decorador ``@docstring.interpd`` implementa esto. Cualquier función que acepte `.Line2D` pass-through ``kwargs``, por ejemplo, `matplotlib.axes.Axes.plot`, puede listar un resumen de las propiedades de `.Line2D``, como sigue:

source: The ``%(Line2D:kwdoc)`` syntax makes ``interpd`` lookup an `.Artist` subclass named ``Line2D``, and call `.artist.kwdoc` on that class. `.artist.kwdoc` introspects the subclass and summarizes its properties as a substring, which gets interpolated into the docstring.
es_es: La sintaxis ``%(Line2D:kwdoc)`` hace que ``interpd`` busque una subclase `.Artist` llamada ``Line2D``, y llame a `.artist.kwdoc` en esa clase. `.artist.kwdoc` hace una introspección de la subclase y resume sus propiedades como una subcadena, que se interpola en el docstring.

source: Note that this scheme does not work for decorating an Artist's ``__init__``, as the subclass and its properties are not defined yet at that point. Instead, ``@docstring.interpd`` can be used to decorate the class itself -- at that point, `.kwdoc` can list the properties and interpolate them into ``__init__.__doc__``.
es_es: Ten en cuenta que este esquema no funciona para decorar el ``__init__`` de un Artista, ya que la subclase y sus propiedades no están definidas todavía en ese momento. En su lugar, se puede utilizar ``@docstring.interpd`` para decorar la propia clase -- en ese momento, `.kwdoc` puede listar las propiedades e interpolarlas en ``__init__.__doc__``.

source: Inheriting docstrings
es_es: Heredando docstrings

source: If a subclass overrides a method but does not change the semantics, we can reuse the parent docstring for the method of the child class. Python does this automatically, if the subclass method does not have a docstring.
es_es: Si una subclase anula un método pero no cambia la semántica, podemos reutilizar el docstring padre para el método de la clase hija. Python lo hace automáticamente, si el método de la subclase no tiene un docstring.

source: Use a plain comment ``# docstring inherited`` to denote the intention to reuse the parent docstring. That way we do not accidentally create a docstring in the future::
es_es: Utilice un comentario simple ``# docstring heredado`` para denotar la intención de reutilizar el docstring padre. Así no crearemos accidentalmente un docstring en el futuro::

source: Adding figures
es_es: Añadiendo cifras

source: As above (see :ref:`rst-figures-and-includes`), figures in the examples gallery can be referenced with a ``.. plot::`` directive pointing to the python script that created the figure. For instance the `~.Axes.legend` docstring references the file :file:`examples/text_labels_and_annotations/legend.py`:
es_es: Como en el caso anterior (ver :ref:`rst-figures-and-includes`), las figuras de la galería de ejemplos pueden ser referenciadas con una directiva ``. plot::`` que apunta al script de python que creó la figura. Por ejemplo, el docstring `~.Axes.legend` hace referencia al archivo :file:`examples/text_labels_and_annotations/legend.py`:

source: Note that ``examples/text_labels_and_annotations/legend.py`` has been mapped to ``gallery/text_labels_and_annotations/legend.py``, a redirection that may be fixed in future re-organization of the docs.
es_es: Nota que ``ejemplos/etiquetas_texto_y_anotaciones/leyenda.py`` ha sido mapeado a ``galería/etiquetas_texto_y_anotaciones/leyenda.py``, una redirección que puede ser arreglada en una futura reorganización de los docs.

source: Plots can also be directly placed inside docstrings. Details are in :doc:`/api/sphinxext_plot_directive_api`. A short example is:
es_es: Los gráficos también pueden colocarse directamente dentro de los docstrings. Los detalles están en :doc:`/api/sphinxext_plot_directive_api`. Un breve ejemplo es:

source: An advantage of this style over referencing an example script is that the code will also appear in interactive docstrings.
es_es: Una ventaja de este estilo sobre la referencia a un script de ejemplo es que el código también aparecerá en los docstrings interactivos.

source: Writing examples and tutorials
es_es: Escribiendo ejemplos y tutoriales

source: Examples and tutorials are python scripts that are run by `Sphinx Gallery`_ to create a gallery of images in the :file:`/doc/gallery` and :file:`/doc/tutorials` directories respectively. To exclude an example from having an plot generated insert "sgskip" somewhere in the filename.
es_es: Los ejemplos y los tutoriales son scripts de python que son ejecutados por `Sphinx Gallery`_ para crear una galería de imágenes en los directorios :file:`/doc/gallery` y :file:`/doc/tutorials` respectivamente. Para excluir un ejemplo de que se genere una trama inserte "sgskip" en algún lugar del nombre del archivo.

source: The format of these files is relatively straightforward. Properly formatted comment blocks are treated as ReST_ text, the code is displayed, and figures are put into the built page.
es_es: El formato de estos archivos es relativamente sencillo. Los bloques de comentarios debidamente formateados se tratan como texto ReST_, el código se muestra, y las figuras se ponen en la página construida.

source: For instance the example :doc:`/gallery/lines_bars_and_markers/simple_plot` example is generated from :file:`/examples/lines_bars_and_markers/simple_plot.py`, which looks like:
es_es: Por ejemplo, en el caso de :doc:`/gallery/lines_bars_and_markers/simple_plot` se genera a partir de :file:`/examples/lines_bars_and_markers/simple_plot.py`, cuyo aspecto es el siguiente:

source: The first comment block is treated as ReST_ text. The other comment blocks render as comments in :doc:`/gallery/lines_bars_and_markers/simple_plot`.
es_es: El primer bloque de comentarios se trata como texto ReST_. Los otros bloques de comentarios se renderizan como comentarios en :doc:`/gallery/lines_bars_and_markers/simple_plot`.

source: Tutorials are made with the exact same mechanism, except they are longer, and typically have more than one comment block (i.e. :doc:`/tutorials/introductory/usage`). The first comment block can be the same as the example above. Subsequent blocks of ReST text are delimited by a line of ``###`` characters:
es_es: Los tutoriales se hacen exactamente con el mismo mecanismo, excepto que son más largos y suelen tener más de un bloque de comentarios (por ejemplo, :doc:`/tutoriales/introducción/uso`). El primer bloque de comentarios puede ser el mismo que el del ejemplo anterior. Los siguientes bloques de texto ReST están delimitados por una línea de caracteres ``###``:

source: In this way text, code, and figures are output in a "notebook" style.
es_es: De este modo, el texto, el código y las figuras se imprimen en un estilo de "cuaderno".

source: References for sphinx-gallery
es_es: Referencias para sphinx-gallery

source: The showcased Matplotlib functions should be listed in an admonition at the bottom as follows
es_es: Las funciones de Matplotlib mostradas deben ser listadas en una advertencia en la parte inferior de la siguiente manera

source: This allows sphinx-gallery to place an entry to the example in the mini-gallery of the mentioned functions. Whether or not a function is mentioned here should be decided depending on if a mini-gallery link prominently helps to illustrate that function; e.g. mention ``matplotlib.pyplot.subplots`` only in examples that are about laying out subplots, not in every example that uses it.
es_es: Esto permite a sphinx-gallery colocar una entrada al ejemplo en la minigalería de las funciones mencionadas. Si una función se menciona aquí debe decidirse dependiendo de si un enlace de la minigalería ayuda de forma prominente a ilustrar esa función; por ejemplo, mencionar ``matplotlib.pyplot.subplots`` sólo en los ejemplos que tratan sobre la disposición de subplots, no en cada ejemplo que la utiliza.

source: Functions that exist in ``pyplot`` as well as in Axes or Figure should mention both references no matter which one is used in the example code. The ``pyplot`` reference should always be the second to mention; see the example above.
es_es: Las funciones que existen tanto en ``pyplot`` como en Axes o Figure, deben mencionar ambas referencias sin importar cuál se utilice en el código de ejemplo. La referencia ``pyplot`` debe ser siempre la segunda en mencionarse; véase el ejemplo anterior.

source: Order of examples in the gallery
es_es: Orden de los ejemplos en la galería

source: The order of the sections of the :ref:`tutorials` and the :ref:`gallery`, as well as the order of the examples within each section are determined in a two step process from within the :file:`/doc/sphinxext/gallery_order.py`:
es_es: El orden de las secciones de la :ref:`tutoriales` y de la :ref:`galería`, así como el orden de los ejemplos dentro de cada sección se determinan en un proceso de dos pasos desde el :archivo:`/doc/sphinxext/gallery_order.py`:

source: *Explicit order*: This file contains a list of folders for the section order and a list of examples for the subsection order. The order of the items shown in the doc pages is the order those items appear in those lists.
es_es: *Orden explícito*: Este archivo contiene una lista de carpetas para el orden de las secciones y una lista de ejemplos para el orden de las subsecciones. El orden de los elementos mostrados en las páginas del documento es el orden en que aparecen esos elementos en esas listas.

source: *Implicit order*: If a folder or example is not in those lists, it will be appended after the explicitly ordered items and all of those additional items will be ordered by pathname (for the sections) or by filename (for the subsections).
es_es: *Orden implícito*: Si una carpeta o ejemplo no está en esas listas, se añadirá después de los elementos ordenados explícitamente y todos esos elementos adicionales se ordenarán por nombre de ruta (para las secciones) o por nombre de archivo (para las subsecciones).

source: As a consequence, if you want to let your example appear in a certain position in the gallery, extend those lists with your example. In case no explicit order is desired or necessary, still make sure to name your example consistently, i.e. use the main function or subject of the example as first word in the filename; e.g. an image example should ideally be named similar to :file:`imshow_mynewexample.py`.
es_es: En consecuencia, si quieres que tu ejemplo aparezca en una determinada posición en la galería, amplía esas listas con su ejemplo. En caso de que no quieras o no sea necesario un orden explícito, asegúrate de nombrar tu ejemplo de forma coherente, es decir, utiliza la función principal o el tema del ejemplo como primera palabra en el nombre del archivo; por ejemplo, un ejemplo de imagen debería nombrarse idealmente de forma similar a :file:`imshow_mynewexample.py`.

source: Miscellaneous
es_es: Varios

source: Moving documentation
es_es: Moviendo la documentación

source: Sometimes it is desirable to move or consolidate documentation. With no action this will lead to links either going dead (404) or pointing to old versions of the documentation. Preferable is to replace the old page with an html refresh that immediately redirects the viewer to the new page. So, for example we move ``/doc/topic/old_info.rst`` to ``/doc/topic/new_info.rst``. We remove ``/doc/topic/old_info.rst`` and in ``/doc/topic/new_info.rst`` we insert a ``redirect-from`` directive that tells sphinx to still make the old file with the html refresh/redirect in it (probably near the top of the file to make it noticeable)
es_es: A veces es conveniente mover o consolidar la documentación. Si no se toman medidas, los enlaces morirán (404) o apuntarán a versiones antiguas de la documentación. Es preferible sustituir la página antigua por un html nuevo que redirija inmediatamente al espectador a la nueva página. Así, por ejemplo, movemos ``/doc/topic/old_info.rst`` a ``/doc/topic/new_info.rst``. Quitamos ``/doc/topic/old_info.rst`` y en ``/doc/topic/new_info.rst`` insertamos una directiva ``redirect-from`` que le dice a sphinx que siga haciendo el archivo antiguo con el html refresh/redirect en él (probablemente cerca de la parte superior del archivo para que se note)

source: In the built docs this will yield an html file ``/build/html/topic/old_info.html`` that has a refresh to ``new_info.html``. If the two files are in different subdirectories:
es_es: En los documentos construidos esto dará lugar a un archivo html ``/build/html/topic/old_info.html`` que tiene una actualización a ``new_info.html``. Si los dos archivos están en diferentes subdirectorios:

source: will yield an html file ``/build/html/old_topic/old_info2.html`` that has a (relative) refresh to ``../topic/new_info.html``.
es_es: producirá un archivo html ``/build/html/old_topic/old_info2.html`` que tiene una actualización (relativa) a ``../topic/new_info.html``.

source: Use the full path for this directive, relative to the doc root at ``https://matplotlib.org/stable/``. So ``/old_topic/old_info2`` would be found by users at ``http://matplotlib.org/stable/old_topic/old_info2``. For clarity, do not use relative links.
es_es: Utiliza la ruta completa para esta directiva, relativa a la raíz del documento en ``https://matplotlib.org/stable/``. Así, ``/antiguo_tema/antiguo_info2`` sería encontrado por los usuarios en ``http://matplotlib.org/stable/old_topic/old_info2``. Para mayor claridad, no utilices enlaces relativos.

source: Adding animations
es_es: Añadiendo animaciones
