Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/documenting_mpl.po
Languages: es_es

source: Animations are scraped automatically by Sphinx-gallery. If this is not desired, there is also a Matplotlib Google/Gmail account with username ``mplgithub`` which was used to setup the github account but can be used for other purposes, like hosting Google docs or Youtube videos. You can embed a Matplotlib animation in the docs by first saving the animation as a movie using :meth:`matplotlib.animation.Animation.save`, and then uploading to `Matplotlib's Youtube channel <https://www.youtube.com/user/matplotlib>`_ and inserting the embedding string youtube provides like:
es_es: Las animaciones son barridas automáticamente por Sphinx-gallery. Si no se desea esto, también hay una cuenta de Google/Gmail de Matplotlib con el nombre de usuario ``mplgithub`` que se utilizó para configurar la cuenta de github, pero que se puede utilizar para otros fines, como el alojamiento de documentos de Google o vídeos de Youtube. Puedes incrustar una animación de Matplotlib en los documentos guardando primero la animación como una película usando :meth:`matplotlib.animation.Animation.save`, y luego subiendo al canal de Youtube de `Matplotlib <https://www.youtube.com/user/matplotlib>`_ e insertando la cadena de incrustación que youtube proporciona como:

source: An example save command to generate a movie looks like this
es_es: Un ejemplo de comando de guardado para generar una película tiene el siguiente aspecto

source: Contact Michael Droettboom for the login password to upload youtube videos of google docs to the mplgithub account.
es_es: Contacta con Michael Droettboom para obtener la contraseña de acceso para subir vídeos de youtube de google docs a la cuenta de mplgithub.

source: Generating inheritance diagrams
es_es: Generación de diagramas de herencia

source: Class inheritance diagrams can be generated with the Sphinx `inheritance-diagram`_ directive.
es_es: Los diagramas de herencia de clases se pueden generar con la directiva `inheritance-diagram`_ de Sphinx.

source: Example:
es_es: Ejemplo:

source: Navbar and style
es_es: Barra de navegación y estilo

source: Matplotlib has a few subprojects that share the same navbar and style, so these are centralized as a sphinx theme at `mpl_sphinx_theme <https://github.com/matplotlib/mpl-sphinx-theme>`_. Changes to the style or topbar should be made there to propagate across all subprojects.
es_es: Matplotlib tiene unos cuantos subproyectos que comparten la misma barra de navegación y el mismo estilo, por lo que estos están centralizados como un tema de sphinx en `mpl_sphinx_theme <https://github.com/matplotlib/mpl-sphinx-theme>`_. Los cambios en el estilo o en la barra superior deben hacerse allí para que se propaguen a todos los subproyectos.
