Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/release_guide.po
Languages: es_es

source: Release guide
es_es: Guía de publicación

source: This document is only relevant for Matplotlib release managers.
es_es: Este documento sólo es relevante para los gestores de la versión de Matplotlib.

source: A guide for developers who are doing a Matplotlib release.
es_es: Una guía para los desarrolladores que están haciendo un lanzamiento de Matplotlib.

source: This assumes that a read-only remote for the canonical repository is ``remote`` and a read/write remote is ``DANGER``
es_es: Esto supone que un remoto de sólo lectura para el repositorio canónico es ``remote`` y un remoto de lectura/escritura es ``DANGER``

source: Testing
es_es: Prueba

source: We use `GitHub Actions <https://github.com/matplotlib/matplotlib/actions>`__ for continuous integration. When preparing for a release, the final tagged commit should be tested locally before it is uploaded::
es_es: Utilizamos `GitHub Actions <https://github.com/matplotlib/matplotlib/actions>`__ para la integración continua. Cuando se prepara un lanzamiento, el commit final etiquetado debe ser probado localmente antes de ser subido::

source: In addition the following test should be run and manually inspected::
es_es: Además, debe ejecutarse la siguiente prueba e inspeccionarse manualmente::

source: In addition the following should be run and manually inspected, but is currently broken::
es_es: Además, se debe ejecutar e inspeccionar manualmente lo siguiente, pero actualmente está roto::

source: GitHub statistics
es_es: Estadísticas de GitHub

source: We automatically extract GitHub issue, PRs, and authors from GitHub via the API. Copy the current :file:`doc/users/github_stats.rst` to :file:`doc/users/prev_whats_new/github_stats_X.Y.Z.rst`, changing the link target at the top of the file, and removing the "Previous GitHub Stats" section at the end.
es_es: Extraemos automáticamente de GitHub lss incidencias, PRs y autores a través de la API. Copia el actual :file:`doc/users/github_stats.rst` a :file:`doc/users/prev_whats_new/github_stats_X.Y.Z.rst`, cambiando el objetivo del enlace en la parte superior del archivo, y eliminando la sección "Previous GitHub Stats" al final.

source: For example, when updating from v3.2.0 to v3.2.1::
es_es: Por ejemplo, al actualizar de v3.2.0 a v3.2.1::

source: Then re-generate the updated stats::
es_es: A continuación, vuelva a generar las estadísticas actualizadas::

source: Review and commit changes. Some issue/PR titles may not be valid reST (the most common issue is ``*`` which is interpreted as unclosed markup).
es_es: Revisa y confirma los cambios. Algunos títulos de incidencias/PR pueden no ser reST válidos (la cuestión más común es ``*`` que se interpreta como marca no cerrada).

source: Make sure you authenticate against the GitHub API. If you do not you will get blocked by GitHub for going over the API rate limits. You can authenticate in one of two ways:
es_es: Asegúrate de autenticarte en la API de GitHub. Si no lo haces, GitHub te bloqueará por superar los límites de velocidad de la API. Puedes autenticarte de dos maneras:

source: using the ``keyring`` package; ``pip install keyring`` and then when running the stats script, you will be prompted for user name and password, that will be stored in your system keyring, or,
es_es: utilizar el paquete ``keyring``; ``pip install keyring`` y luego al ejecutar el script de estadísticas, se le pedirá el nombre de usuario y la contraseña, que se almacenará en su llavero del sistema, o,

source: using a personal access token; generate a new token `on this GitHub page <https://github.com/settings/tokens>`__ with the ``repo:public_repo`` scope and place the token in :file:`~/.ghoauth`.
es_es: utilizando un token de acceso personal; genera un nuevo token `en esta página de GitHub <https://github.com/settings/tokens>`__ con el ámbito ``repo:public_repo`` y coloca el token en :file:`~/.ghoauth`.

source: Update and validate the docs
es_es: Actualizar y validar los documentos

source: Merge ``*-doc`` branch
es_es: Fusionar la rama ``*-doc``

source: Merge the most recent 'doc' branch (e.g., ``v3.2.0-doc``) into the branch you are going to tag on and delete the doc branch on GitHub.
es_es: Fusiona la rama 'doc' más reciente (por ejemplo, ``v3.2.0-doc``) en la rama en la que vas a etiquetar y elimina la rama doc en GitHub.

source: Update supported versions in Security Policy
es_es: Actualizar las versiones admitidas en la política de seguridad

source: When making major or minor releases, update the supported versions in the Security Policy in :file:`SECURITY.md`. Commonly, this may be one or two previous minor releases, but is dependent on release managers.
es_es: Cuando se realicen versiones mayores o menores, actualice las versiones soportadas en la Política de Seguridad en :file:`SECURITY.md`. Normalmente, esto puede ser una o dos versiones menores anteriores, pero depende de los gestores de versiones.

source: Update release notes
es_es: Actualizar las notas de publicación

source: What's new
es_es: Novedades

source: *Only needed for major and minor releases. Bugfix releases should not have new features.*
es_es: *Sólo es necesario para las versiones mayores y menores. Las versiones de corrección de errores no deben tener nuevas características.*

source: Merge the contents of all the files in :file:`doc/users/next_whats_new/` into a single file :file:`doc/users/prev_whats_new/whats_new_X.Y.0.rst` and delete the individual files.
es_es: Fusiona el contenido de todos los archivos en :file:`doc/users/next_whats_new/` en un único archivo :file:`doc/users/prev_whats_new/whats_new_X.Y.0.rst` y elimina los archivos individuales.

source: API changes
es_es: Cambios del API

source: *Primarily needed for major and minor releases. We may sometimes have API changes in bugfix releases.*
es_es: *Se necesita principalmente para las versiones mayores y menores. A veces podemos tener cambios en la API en las versiones de corrección de errores.*

source: Merge the contents of all the files in :file:`doc/api/next_api_changes/` into a single file :file:`doc/api/prev_api_changes/api_changes_X.Y.Z.rst` and delete the individual files.
es_es: Fusiona el contenido de todos los archivos de :file:`doc/api/next_api_changes/` en un único archivo :file:`doc/api/prev_api_changes/api_changes_X.Y.Z.rst` y elimina los archivos individuales.

source: Release notes TOC
es_es: Notas de publicación TOC

source: Update :file:`doc/users/release_notes.rst`:
es_es: Actualizar :file:`doc/users/release_notes.rst`:

source: For major and minor releases add a new section
es_es: Para las versiones mayores y menores añade una nueva sección

source: For bugfix releases add the GitHub stats and (if present) the API changes to the existing X.Y section
es_es: Para las versiones de corrección de errores, añada las estadísticas de GitHub y (si están presentes) los cambios de la API a la sección X.Y existente

source: Verify that docs build
es_es: Verificar que los documentos se construyan

source: Finally, make sure that the docs build cleanly ::
es_es: Por último, asegúrese de que los documentos se construyan limpiamente ::

source: After the docs are built, check that all of the links, internal and external, are still valid. We use ``linkchecker`` for this, which has not been ported to Python3 yet. You will need to create a Python2 environment with ``requests==2.9.0`` and linkchecker ::
es_es: Después de construir los documentos, comprueba que todos los enlaces, internos y externos, siguen siendo válidos. Para ello utilizamos ``linkchecker``, que aún no ha sido portado a Python3. Necesitarás crear un entorno Python2 con ``requests==2.9.0`` y linkchecker ::

source: Address any issues which may arise. The internal links are checked on Circle CI, this should only flag failed external links.
es_es: Abordar cualquier incidencia que pueda surgir. Los enlaces internos se comprueban en Circle CI, esto sólo debería indicar los enlaces externos fallidos.

source: Update supported versions in SECURITY.md
es_es: Actualice las versiones compatibles en SECURITY.md

source: For minor version release update the table in :file:`SECURITY.md` to specify that the 2 most recent minor releases in the current major version series are supported.
es_es: Para las versiones menores actualice la tabla en :file:`SECURITY.md` para especificar que se soportan las 2 versiones menores más recientes de la serie de versiones mayores actual.

source: For a major version release update the table in :file:`SECURITY.md` to specify that the last minor version in the previous major version series is still supported. Dropping support for the last version of a major version series will be handled on an ad-hoc basis.
es_es: Para una versión mayor, actualice la tabla en :file:`SECURITY.md` para especificar que la última versión menor de la serie de versiones mayores anterior sigue siendo soportada. El abandono del soporte de la última versión de una serie de versiones mayores se gestionará de forma ad-hoc.

source: Create release commit and tag
es_es: Crear la confirmación de commit y la etiqueta

source: To create the tag, first create an empty commit with a very terse set of the release notes in the commit message ::
es_es: Para crear la etiqueta, primero hay que crear un commit vacío con un conjunto muy escueto de las notas de la versión en el mensaje del commit ::

source: and then create a signed, annotated tag with the same text in the body message ::
es_es: y luego crear una etiqueta firmada y anotada con el mismo texto en el cuerpo del mensaje ::

source: which will prompt you for your GPG key password and an annotation. For pre releases it is important to follow :pep:`440` so that the build artifacts will sort correctly in PyPI.
es_es: que le pedirá la contraseña de su clave GPG y una anotación. Para las versiones anteriores es importante seguir :pep:`440` para que los artefactos de construcción se ordenen correctamente en PyPI.

source: To prevent issues with any down-stream builders which download the tarball from GitHub it is important to move all branches away from the commit with the tag [#]_::
es_es: Para evitar incidencias con cualquier constructor posterior que descargue el tarball de GitHub es importante mover todas las ramas fuera del commit con la etiqueta [#]_::

source: Finally, push the tag to GitHub::
es_es: Por último, hacemos push en la etiqueta a GitHub::

source: Congratulations, the scariest part is done!
es_es: Felicidades, ¡la parte más aterradora ya está hecha!

source: The tarball that is provided by GitHub is produced using `git archive`_. We use setuptools_scm_ which uses a format string in :file:`lib/matplotlib/_version.py` to have ``git`` insert a list of references to exported commit (see :file:`.gitattributes` for the configuration). This string is then used by ``setuptools_scm`` to produce the correct version, based on the git tag, when users install from the tarball. However, if there is a branch pointed at the tagged commit, then the branch name will also be included in the tarball. When the branch eventually moves, anyone how checked the hash of the tarball before the branch moved will have an incorrect hash.
es_es: El tarball que proporciona GitHub se produce utilizando `git archive`_. Usamos setuptools_scm_ que utiliza una cadena de formato en :file:`lib/matplotlib/_version.py` para que ``git`` inserte una lista de referencias al commit exportado (ver :file:`.gitattributes` para la configuración). Esta cadena es utilizada por ``setuptools_scm`` para producir la versión correcta, basada en la etiqueta git, cuando los usuarios instalan desde el tarball. Sin embargo, si hay una rama que apunta al commit etiquetado, entonces el nombre de la rama también se incluirá en el tarball. Cuando la rama se mueva, cualquiera que haya comprobado el hash del tarball antes de que la rama se moviera tendrá un hash incorrecto.

source: To generate the file that GitHub does use ::
es_es: Para generar el archivo que hace GitHub utiliza ::

source: If this is a final release, also create a 'doc' branch (this is not done for pre-releases)::
es_es: Si se trata de una versión final, crea también una rama "doc" (esto no se hace para las versiones preliminares)::

source: and if this is a major or minor release, also create a bug-fix branch (a micro release will be cut from this branch)::
es_es: y si se trata de una versión mayor o menor, cree también una rama de corrección de errores (una microlanzamiento se cortará de esta rama)::

source: On this branch un-comment the globs from :ref:`release_chkdocs`. And then ::
es_es: En esta rama deshaga el comentario de los globos de :ref:`release_chkdocs`. Y luego ::

source: Release management / DOI
es_es: Gestión de versiones / DOI

source: Via the `GitHub UI <https://github.com/matplotlib/matplotlib/releases>`__, turn the newly pushed tag into a release. If this is a pre-release remember to mark it as such.
es_es: A través de la `GitHub UI <https://github.com/matplotlib/matplotlib/releases>`__, convierta la etiqueta recién empujada en una versión. Si se trata de una versión preliminar, recuerde marcarla como tal.

source: For final releases, also get the DOI from `zenodo <https://zenodo.org/>`__ (which will automatically produce one once the tag is pushed). Add the doi post-fix and version to the dictionary in :file:`tools/cache_zenodo_svg.py` and run the script.
es_es: Para las versiones finales, obtenga también el DOI de `zenodo <https://zenodo.org/>`__ (que producirá automáticamente uno una vez que la etiqueta sea empujada). Añade el post-fix doi y la versión al diccionario en :file:`tools/cache_zenodo_svg.py` y ejecuta el script.

source: This will download the new svg to the :file:`_static` directory in the docs and edit :file:`doc/citing.rst`. Commit the new svg, the change to :file:`tools/cache_zenodo_svg.py`, and the changes to :file:`doc/citing.rst` to the VER-doc branch and push to GitHub. ::
es_es: Esto descargará el nuevo svg al directorio :file:`_static` en los docs y editará :file:`doc/citing.rst`. Confirma el nuevo svg, el cambio en :file:`tools/cache_zenodo_svg.py`, y los cambios en :file:`doc/citing.rst` en la rama VER-doc y empuja a GitHub. ::

source: Building binaries
es_es: Construir binarios

source: We distribute macOS, Windows, and many Linux wheels as well as a source tarball via PyPI. Most builders should trigger automatically once the tag is pushed to GitHub:
es_es: Distribuimos macOS, Windows y muchos wheels de Linux, así como un tarball de origen a través de PyPI. La mayoría de los constructores deberían activarse automáticamente una vez que la etiqueta es empujada a GitHub:

source: Windows, macOS and manylinux wheels are built on GitHub Actions. Builds are triggered by the GitHub Action defined in :file:`.github/workflows/cibuildwheel.yml`, and wheels will be available as artifacts of the build.
es_es: Los wheels de Windows, macOS y manylinux se construyen con Acciones de GitHub. Las construcciones se activan mediante la Acción GitHub definida en :file:`.github/workflows/cibuildwheel.yml`, y los wheels estarán disponibles como artefactos de la construcción.

source: Alternative Windows wheels are built by Christoph Gohlke automatically and will be `available at his site <https://www.lfd.uci.edu/~gohlke/pythonlibs/#matplotlib>`__ once built.
es_es: Los wheels alternativas para Windows son construidas por Christoph Gohlke automáticamente y estarán `disponibles en su sitio <https://www.lfd.uci.edu/~gohlke/pythonlibs/#matplotlib>`__ una vez construidas.

source: The auto-tick bot should open a pull request into the `conda-forge feedstock <https://github.com/conda-forge/matplotlib-feedstock>`__. Review and merge (if you have the power to).
es_es: El bot de auto-tick debería abrir un pull request en el `conda-forge feedstock <https://github.com/conda-forge/matplotlib-feedstock>`__. Revisa y fusiona (si tienes el poder de hacerlo).

source: Because this is automated, it is extremely important to bump all branches away from the tag as discussed in :ref:`release_tag`.
es_es: Debido a que esto está automatizado, es extremadamente importante eliminar todas las ramas de la etiqueta como se discute en :ref:`release_tag`.

source: If this is a final release the following downstream packagers should be contacted:
es_es: Si se trata de una versión final, hay que ponerse en contacto con los siguientes empaquetadores:

source: This can be done ahead of collecting all of the binaries and uploading to pypi.
es_es: Esto puede hacerse antes de recoger todos los binarios y subirlos a pypi.

source: Make distribution and upload to PyPI
es_es: Hacer la distribución y subirla a PyPI

source: Once you have collected all of the wheels (expect this to take about a day), generate the tarball ::
es_es: Una vez que haya reunido todas los wheels (es de esperar que esto lleve aproximadamente un día), genere el archivo tarball ::

source: and copy all of the wheels into :file:`dist` directory. First, check that the dist files are OK ::
es_es: y copiar todas los wheels en el directorio :file:`dist`. Primero, comprueba que los archivos dist están bien ::

source: and then use ``twine`` to upload all of the files to pypi ::
es_es: y luego usar ``twine`` para subir todos los archivos a pypi ::

source: Congratulations, you have now done the second scariest part!
es_es: Felicidades, ¡ahora has hecho la segunda parte más aterradora!

source: Build and deploy documentation
es_es: Construir y desplegar la documentación

source: To build the documentation you must have the tagged version installed, but build the docs from the ``ver-doc`` branch. An easy way to arrange this is::
es_es: Para construir la documentación debe tener la versión etiquetada instalada, pero construir los documentos de la rama ``ver-doc``. Una manera fácil de organizar esto es::

source: which will build both the html and pdf version of the documentation.
es_es: que construirá tanto la versión html como la pdf de la documentación.

source: The built documentation exists in the `matplotlib.github.com <https://github.com/matplotlib/matplotlib.github.com/>`__ repository. Pushing changes to master automatically updates the website.
es_es: La documentación construida existe en el repositorio `matplotlib.github.com <https://github.com/matplotlib/matplotlib.github.com/>`__. Al enviar los cambios al master se actualiza automáticamente el sitio web.

source: The documentation is organized by version. At the root of the tree is always the documentation for the latest stable release. Under that, there are directories containing the documentation for older versions. The documentation for current master is built on Circle CI and pushed to the `devdocs <https://github.com/matplotlib/devdocs/>`__ repository. These are available at `matplotlib.org/devdocs <https://matplotlib.org/devdocs/>`__.
es_es: La documentación está organizada por versiones. En la raíz del árbol está siempre la documentación de la última versión estable. Debajo de ella, hay directorios que contienen la documentación de versiones anteriores. La documentación para la versión maestra actual se construye en Circle CI y se envía al repositorio `devdocs <https://github.com/matplotlib/devdocs/>`__. Está disponible en `matplotlib.org/devdocs <https://matplotlib.org/devdocs/>`__.

source: Assuming you have this repository checked out in the same directory as matplotlib ::
es_es: Asumiendo que tienes este repositorio comprobado en el mismo directorio que matplotlib ::

source: which will copy the built docs over. If this is a final release, link the ``stable`` subdirectory to the newest version::
es_es: que copiará los documentos construidos. Si se trata de una versión final, vincule el subdirectorio ``stable`` a la versión más reciente::

source: You will need to manually edit :file:`versions.html` to show the last 3 tagged versions. You will also need to edit :file:`sitemap.xml` to include the newly released version. Now commit and push everything to GitHub ::
es_es: Tendrá que editar manualmente :file:`versions.html` para mostrar las 3 últimas versiones etiquetadas. También tendrás que editar :file:`sitemap.xml` para incluir la nueva versión. Ahora confirma y empuja todo a GitHub ::

source: Congratulations you have now done the third scariest part!
es_es: Felicidades, ya has hecho la tercera parte más aterradora.

source: If you have access, clear the Cloudflare caches.
es_es: Si tienes acceso, borra las cachés de Cloudflare.

source: It typically takes about 5-10 minutes for GitHub to process the push and update the live web page (remember to clear your browser cache).
es_es: GitHub suele tardar entre 5 y 10 minutos en procesar el push y actualizar la página web en directo (recuerda borrar la caché del navegador).

source: Announcing
es_es: Anuncio

source: The final step is to announce the release to the world. A short version of the release notes along with acknowledgments should be sent to
es_es: El último paso es anunciar el lanzamiento al mundo. Hay que enviar una versión corta de las notas de publicación junto con los agradecimientos a

source: For final releases announcements should also be sent to the numpy/scipy/scikit-image mailing lists.
es_es: Para las versiones finales, los anuncios deben enviarse también a las listas de correo numpy/scipy/scikit-image.

source: In addition, announcements should be made on social networks (twitter via the ``@matplotlib`` account, any other via personal accounts). `NumFOCUS <https://numfocus.org/>`__ should be contacted for inclusion in their newsletter.
es_es: Además, los anuncios deben hacerse en las redes sociales (twitter a través de la cuenta ``@matplotlib``, cualquier otra a través de cuentas personales). Se debe contactar con `NumFOCUS <https://numfocus.org/>`__ para incluirlo en su boletín.

source: Conda packages
es_es: Paquetes Conda

source: The Matplotlib project itself does not release conda packages. In particular, the Matplotlib release manager is not responsible for conda packaging.
es_es: El propio proyecto Matplotlib no libera paquetes de conda. En particular, el gestor de liberación de Matplotlib no es responsable del empaquetado de conda.

source: For information on the packaging of Matplotlib for conda-forge see https://github.com/conda-forge/matplotlib-feedstock.
es_es: Para obtener información sobre el empaquetado de Matplotlib para conda-forge, consulta https://github.com/conda-forge/matplotlib-feedstock.
