Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/style_guide.po
Languages: es_es

source: Documentation style guide
es_es: Guía de estilo de la documentación

source: This guide contains best practices for the language and formatting of Matplotlib documentation.
es_es: Esta guía contiene las mejores prácticas para el lenguaje y el formato de la documentación de Matplotlib.

source: For more information about contributing, see the :ref:`documenting-matplotlib` section.
es_es: Para más información sobre cómo contribuir, consulta la sección :ref:`documenting-matplotlib`.

source: Expository language
es_es: Lenguaje del repositorio

source: For explanatory writing, the following guidelines are for clear and concise language use.
es_es: En el caso de la redacción explicativa, las siguientes directrices se refieren al uso de un lenguaje claro y conciso.

source: Terminology
es_es: Terminologia

source: There are several key terms in Matplotlib that are standards for reliability and consistency in documentation. They are not interchangeable.
es_es: Hay varios términos clave en Matplotlib que son estándares de fiabilidad y consistencia en la documentación. No son intercambiables.

source: Term
es_es: Término

source: Description
es_es: Descripción

source: Correct
es_es: Correcto

source: Incorrect
es_es: Incorrecto

source: Matplotlib working space for programming.
es_es: Espacio de trabajo de Matplotlib para la programación.

source: *For Matplotlib objects*: Figure, "The Figure is the working space for the visual.
es_es: *Para los objetos Matplotlib*: Figura, "La Figura es el espacio de trabajo para el visual.

source: *Referring to class*: Figure_ , "Methods within the Figure_ provide the visuals."
es_es: *Refiriéndose a la clase*: Figure_ , "Los métodos dentro de Figure_ proporcionan los visuales."

source: *General language*: figure, "Michelle Kwan is a famous figure skater."
es_es: *Lenguaje general*: figura, "Michelle Kwan es una famosa patinadora artística."

source: "The figure is the working space for visuals."
es_es: "La figura es el espacio de trabajo de los visuales."

source: "Methods in the figure provide the visuals."
es_es: "Los métodos en la figura proporcionan los visuales."

source: "The Figure_ Four leglock is a wrestling move."
es_es: "La llave de piernas Figure_ Four es un movimiento de lucha libre."

source: Subplots within Figure. Contains plot elements and is responsible for plotting and configuring additional details.
es_es: Subgráficos dentro de la Figura. Contiene elementos de gráfico y es responsable de trazar y configurar detalles adicionales.

source: *For Matplotlib objects*: Axes, "An Axes is a subplot within the Figure."
es_es: *Para los objetos Matplotlib*: Ejes, "Un Eje es un subgráfico dentro de la Figura."

source: *Referring to class*: Axes_ , "Each Axes_ is specific to one Figure."
es_es: *Refiriéndose a la clase*: Axes_ , "Cada Axe_ es específico de una Figura."

source: *General language*: axes, "Both loggers and lumberjacks use axes to chop wood." OR "There are no standard names for the coordinates in the three axes." (Plural of axis)
es_es: *Lenguaje general*: hachas, "Tanto los leñadores como los madereros utilizan hachas para cortar madera". O "No hay nombres estándar para las coordenadas de los tres ejes". (Plural de eje)

source: "The axes methods transform the data."
es_es: "Los métodos de los ejes transforman los datos."

source: "Each Axes_ is specific to a Figure."
es_es: "Cada Axes_ es específico de una figura."

source: "The musicians on stage call their guitars Axes."
es_es: "Los músicos en el escenario llaman a sus guitarras Axes."

source: "The point where the Axes meet is the origin of the coordinate system."
es_es: "El punto de encuentro de los Ejes es el origen del sistema de coordenadas."

source: Broad variety of Matplotlib objects that display visuals.
es_es: Amplia variedad de objetos Matplotlib que muestran imágenes.

source: *For Matplotlib objects*: Artist, "Artists display visuals and are the visible elements when the rendering a Figure."
es_es: *Para objetos Matplotlib*: Artist, "Los artists muestran los visuales y son los elementos visibles cuando el renderizado de una Figura."

source: *Referring to class*: Artist_ , "Each Artist_ has respective methods and functions."
es_es: *Refiriéndose a la clase*: Artist_ , "Cada Artist_ tiene sus respectivos métodos y funciones."

source: *General language*: artist, "The artist in the museum is from France."
es_es: *Lenguaje general*: artista, "El artista del museo es de Francia."

source: "Configure the legend artist with its respective method."
es_es: "Configurar el artist de la leyenda con su respectivo método."

source: "There is an Artist_ for that visual in the graph."
es_es: "Hay un Artist_ para ese visual en el grafo."

source: "Some Artists became famous only by accident."
es_es: "Algunos artistas se hicieron famosos sólo por accidente."

source: Human-readable single dimensional object of reference marks containing ticks, tick labels, spines, and edges.
es_es: Objeto unidimensional legible por el ser humano de marcas de referencia que contiene ticks, etiquetas de tick, spines y aristas.

source: *For Matplotlib objects*: Axis, "The Axis for the bar chart is a separate Artist." (plural, Axis objects)
es_es: *Para los objetos Matplotlib*: Axis, "El Eje para el gráfico de barras es un Artist separado". (plural, objetos Axis)

source: *Referring to class*: Axis_ , "The Axis_ contains respective XAxis and YAxis objects."
es_es: *Refiriéndose a la clase*: Axis_ , "El Axis_ contiene los respectivos objetos XAxis y YAxis."

source: *General language*: axis, "Rotation around a fixed axis is a special case of rotational motion."
es_es: *Lenguaje general*: eje, "La rotación alrededor de un eje fijo es un caso especial de movimiento de rotación."

source: "Plot the graph onto the axis."
es_es: "Graficar en el eje."

source: "Each Axis is usually named after the coordinate which is measured along it."
es_es: "Cada eje suele llevar el nombre de la coordenada que se mide a lo largo de él."

source: "In some computer graphics contexts, the ordinate Axis_ may be oriented downwards."
es_es: "En algunos contextos de gráficos por computadora, el eje de Axis_ puede estar orientado hacia abajo"

source: Explicit, Object Oriented Programming (OOP)
es_es: Programación explícita y orientada a objetos (POO)

source: Explicit approach of programming in Matplotlib.
es_es: Enfoque explícito de la programación en Matplotlib.

source: Explicit
es_es: Explícito

source: explicit
es_es: explícito

source: OOP
es_es: POO

source: object oriented
es_es: orientado a objetos

source: OO-style
es_es: Estilo OO

source: Implicit, ``pyplot``
es_es: Implícito, ``pyplot``

source: Implicit approach of programming in Matplotlib with ``pyplot`` module.
es_es: Enfoque implícito de programación en Matplotlib con el módulo ``pyplot``.

source: Implicit
es_es: Implícito

source: implicit
es_es: implícito

source: MATLAB like
es_es: MATLAB como

source: pyplot interface
es_es: interfaz pyplot

source: Grammar
es_es: Gramática

source: Subject
es_es: Asunto

source: Use second-person imperative sentences for directed instructions specifying an action. Second-person pronouns are for individual-specific contexts and possessive reference.
es_es: Utiliza oraciones imperativas en segunda persona para instrucciones dirigidas que especifican una acción. Los pronombres en segunda persona son para contextos específicos del individuo y para referencias posesivas.

source: Install Matplotlib from the source directory using the Python ``pip`` installer program. Depending on your operating system, you may need additional support.
es_es: Instale Matplotlib desde el directorio fuente utilizando el programa instalador de Python ``pip``. Dependiendo de su sistema operativo, puede necesitar soporte adicional.

source: You can install Matplotlib from the source directory. You can find additional support if you are having trouble with your installation.
es_es: Puede instalar Matplotlib desde el directorio fuente. Puedes encontrar soporte adicional si tienes problemas con tu instalación.

source: Tense
es_es: Tensa

source: Use present simple tense for explanations. Avoid future tense and other modal or auxiliary verbs when possible.
es_es: Utiliza el presente simple para las explicaciones. Evite el tiempo futuro y otros verbos modales o auxiliares cuando sea posible.

source: The fundamental ideas behind Matplotlib for visualization involve taking data and transforming it through functions and methods.
es_es: Las ideas fundamentales detrás de Matplotlib para la visualización implican tomar datos y transformarlos a través de funciones y métodos.

source: Matplotlib will take data and transform it through functions and methods. They can generate many kinds of visuals. These will be the fundamentals for using Matplotlib.
es_es: Matplotlib tomará los datos y los transformará mediante funciones y métodos. Pueden generar muchos tipos de visuales. Estos serán los fundamentos para usar Matplotlib.

source: Voice
es_es: Voz

source: Write in active sentences. Passive voice is best for situations or conditions related to warning prompts.
es_es: Escriba en oraciones activas. La voz pasiva es mejor para las situaciones o condiciones relacionadas con las advertencias prompts.

source: The function ``plot`` generates the graph.
es_es: La función ``plot`` genera el gráfico.

source: The graph is generated by the ``plot`` function.
es_es: El grafo es generado por la función ``plot``.

source: An error message is returned by the function if there are no arguments.
es_es: La función devuelve un mensaje de error si no hay argumentos.

source: You will see an error message from the function if there are no arguments.
es_es: Verás un mensaje de error de la función si no hay argumentos.

source: Sentence structure
es_es: Estructura de la Oración

source: Write with short sentences using Subject-Verb-Object order regularly. Limit coordinating conjunctions in sentences. Avoid pronoun references and subordinating conjunctive phrases.
es_es: Escribir con frases cortas utilizando regularmente el orden sujeto-verbo-objeto. Limitar las conjunciones coordinadas en las frases. Evitar las referencias a pronombres y las frases conjuntivas subordinantes.

source: The ``pyplot`` module in Matplotlib is a collection of functions. These functions create, manage, and manipulate the current Figure and plotting area.
es_es: El módulo ``pyplot`` de Matplotlib es una colección de funciones. Estas funciones crean, gestionan y manipulan la Figura actual y el área de ploteo.

source: The ``pyplot`` module in Matplotlib is a collection of functions which create, manage, and manipulate the current Figure and plotting area.
es_es: El módulo ``pyplot`` en Matplotlib es una colección de funciones que crean, gestionan y manipulan la Figura actual y el área de ploteo.

source: The ``plot`` function plots data to the respective Axes. The Axes corresponds to the respective Figure.
es_es: La función ``plot`` grafica los datos en los ejes respectivos. Los ejes corresponden a la figura respectiva.

source: The ``plot`` function plots data within its respective Axes for its respective Figure.
es_es: La función ``plot`` grafica los datos dentro de sus respectivos Ejes para su respectiva Figura.

source: The implicit approach is a convenient shortcut for generating simple plots.
es_es: El enfoque implícito es un atajo conveniente para generar gráficos simples.

source: Users that wish to have convenient shortcuts for generating plots use the implicit approach.
es_es: Los usuarios que desean disponer de cómodos atajos para generar gráficos utilizan el enfoque implícito.

source: Formatting
es_es: Formato

source: The following guidelines specify how to incorporate code and use appropriate formatting for Matplotlib documentation.
es_es: Las siguientes directrices especifican cómo incorporar el código y utilizar el formato adecuado para la documentación de Matplotlib.

source: Code
es_es: Código

source: Matplotlib is a Python library and follows the same standards for documentation.
es_es: Matplotlib es una biblioteca de Python y sigue los mismos estándares de documentación.

source: Comments
es_es: Comentarios

source: Examples of Python code have comments before or on the same line.
es_es: Los ejemplos de código Python tienen comentarios antes o en la misma línea.

source: Outputs
es_es: Salidas

source: When generating visuals with Matplotlib using ``.py`` files in examples, display the visual with `matplotlib.pyplot.show` to display the visual. Keep the documentation clear of Python output lines.
es_es: Cuando se generen visuales con Matplotlib usando archivos ``.py`` en los ejemplos, muestre el visual con `matplotlib.pyplot.show` para mostrar el visual. Mantenga la documentación libre de líneas de salida de Python.

source: Matplotlib uses reStructuredText Markup for documentation. Sphinx helps to transform these documents into appropriate formats for accessibility and visibility.
es_es: Matplotlib utiliza reStructuredText Markup para la documentación. Sphinx ayuda a transformar estos documentos en formatos apropiados para la accesibilidad y la visibilidad.

source: `Quick Reference Document <https://docutils.sourceforge.io/docs/user/rst/quickref.html>`_
es_es: `Documento de referencia rápida <https://docutils.sourceforge.io/docs/user/rst/quickref.html>`_

source: Lists
es_es: Listas

source: Bulleted lists are for items that do not require sequencing. Numbered lists are exclusively for performing actions in a determined order.
es_es: Las listas con viñetas son para elementos que no requieren una secuencia. Las listas numeradas son exclusivamente para realizar acciones en un orden determinado.

source: The example uses three graphs.
es_es: El ejemplo utiliza tres grafos.

source: Bar
es_es: Barra

source: Line
es_es: Línea

source: Pie
es_es: Circular

source: These four steps help to get started using Matplotlib.
es_es: Estos cuatro pasos ayudan a empezar a utilizar Matplotlib.

source: The following steps are important to get started using Matplotlib.
es_es: Los siguientes pasos son importantes para empezar a utilizar Matplotlib.

source: Import the Matplotlib library.
es_es: Importar la biblioteca Matplotlib.

source: Import the necessary modules.
es_es: Importar los módulos necesarios.

source: Set and assign data to work on.
es_es: Establecer y asignar datos para trabajar.

source: Transform data with methods and functions.
es_es: Transformar datos con métodos y funciones.

source: Tables
es_es: Tablas

source: Use ASCII tables with reStructuredText standards in organizing content. Markdown tables and the csv-table directive are not accepted.
es_es: Utiliza tablas ASCII con los estándares de reStructuredText para organizar el contenido. No se aceptan las tablas Markdown ni la directiva csv-table.

source: OK
es_es: Correcto

source: Not OK
es_es: No es correcto

source: Additional resources
es_es: Recursos adicionales

source: This style guide is not a comprehensive standard. For a more thorough reference of how to contribute to documentation, see the links below. These resources contain common best practices for writing documentation.
es_es: Esta guía de estilo no es una norma exhaustiva. Para obtener una referencia más completa sobre cómo contribuir a la documentación, consulta los siguientes enlaces. Estos recursos contienen las mejores prácticas comunes para escribir la documentación.

source: `Python Developer's Guide <https://devguide.python.org/documenting/#documenting-python>`_
es_es: `Guía del desarrollador de Python <https://devguide.python.org/documenting/#documenting-python>`_

source: `Google Developer Style Guide <https://developers.google.com/style>`_
es_es: `Guía de estilo para desarrolladores de Google <https://developers.google.com/style>`_

source: `IBM Style Guide <https://www.oreilly.com/library/view/the-ibm-style/9780132118989/>`_
es_es: `Guía de estilo de IBM <https://www.oreilly.com/library/view/the-ibm-style/9780132118989/>`_

source: `Red Hat Style Guide <https://stylepedia.net/style/#grammar>`_
es_es: `Guía de estilo de Red Hat <https://stylepedia.net/style/#grammar>`_
