Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/triage.po
Languages: es_es

source: Bug triaging and issue curation
es_es: Triaje de incidencias y curación de problemas

source: The `issue tracker <https://github.com/matplotlib/matplotlib/issues>`_ is important to communication in the project because it serves as the centralized location for making feature requests, reporting bugs, identifying major projects to work on, and discussing priorities. For this reason, it is important to curate the issue list, adding labels to issues and closing issues that are resolved or unresolvable.
es_es: El `issue tracker <https://github.com/matplotlib/matplotlib/issues>`_ es importante para la comunicación en el proyecto porque sirve como lugar centralizado para hacer peticiones de características, informar de errores, identificar proyectos importantes en los que trabajar y discutir prioridades. Por esta razón, es importante curar la lista de incidencias, añadiendo etiquetas a las incidencias y cerrando las incidencias que se resuelven o no se pueden resolver.

source: Triaging issues does not require any particular expertise in the internals of Matplotlib, is extremely valuable to the project, and we welcome anyone to participate in issue triage! However, people who are not part of the Matplotlib organization do not have `permissions to change milestones, add labels, or close issue <https://docs.github.com/en/organizations/managing-access-to-your-organizations-repositories/repository-permission-levels-for-an-organization>`_. If you do not have enough GitHub permissions do something (e.g. add a label, close an issue), please leave a comment tagging ``@matplotlib/triageteam`` with your recommendations!
es_es: El triaje de problemas no requiere ninguna experiencia particular en el interior de Matplotlib, es extremadamente valioso para el proyecto, y damos la bienvenida a cualquiera que participe en el triaje de problemas. Sin embargo, las personas que no forman parte de la organización de Matplotlib no tienen `permisos para cambiar hitos, añadir etiquetas o cerrar problemas <https://docs.github.com/en/organizations/managing-access-to-your-organizations-repositories/repository-permission-levels-for-an-organization>`_. Si no tienes suficientes permisos de GitHub para hacer algo (por ejemplo, añadir una etiqueta, cerrar una incidencia), ¡deja un comentario etiquetando a ``matplotlib/triageteam`` con tus recomendaciones!

source: Working on issues to improve them
es_es: Trabajar en las incidencias (issues) para mejorarlas

source: Improving issues increases their chances of being successfully resolved. Guidelines on submitting good issues can be found :ref:`here <submitting-a-bug-report>`. A third party can give useful feedback or even add comments on the issue. The following actions are typically useful:
es_es: La mejora de las incidencias aumenta las posibilidades de que se resuelvan con éxito. Las directrices para enviar buenas incidencias pueden encontrarse :ref:`aquí <submitting-a-bug-report>`. Un tercero puede dar una opinión útil o incluso añadir comentarios sobre la incidencia. Las siguientes acciones suelen ser útiles:

source: documenting issues that are missing elements to reproduce the problem such as code samples
es_es: documentar las incidencias en las que faltan elementos para reproducir el problema, como muestras de código

source: suggesting better use of code formatting (e.g. triple back ticks in the markdown).
es_es: sugerir un mejor uso del formato del código (por ejemplo, triplicar los ticks en el markdown).

source: suggesting to reformulate the title and description to make them more explicit about the problem to be solved
es_es: sugerir que se reformulen el título y la descripción para que sean más explícitos en cuanto al problema que hay que resolver

source: linking to related issues or discussions while briefly describing how they are related, for instance "See also #xyz for a similar attempt at this" or "See also #xyz where the same thing was reported" provides context and helps the discussion
es_es: enlazar con incidencias o debates relacionados, describiendo brevemente su relación, por ejemplo "Ver también #xyz para un intento similar de esto" o "Ver también #xyz donde se informó de lo mismo" proporciona contexto y ayuda al debate

source: verifying that the issue is reproducible
es_es: verificar que la incidencia sea reproducible

source: classify the issue as a feature request, a long standing bug or a regression
es_es: clasificar la incidencia como una solicitud de función, un error de larga duración o una regresión

source: Fruitful discussions
es_es: Debates fructíferos

source: Online discussions may be harder than it seems at first glance, in particular given that a person new to open-source may have a very different understanding of the process than a seasoned maintainer.
es_es: Las discusiones en línea pueden ser más difíciles de lo que parece a primera vista, sobre todo teniendo en cuenta que una persona nueva en el código abierto puede tener una comprensión del proceso muy diferente a la de un mantenedor experimentado.

source: Overall, it is useful to stay positive and assume good will. `The following article <http://gael-varoquaux.info/programming/technical-discussions-are-hard-a-few-tips.html>`_ explores how to lead online discussions in the context of open source.
es_es: En general, es útil mantenerse positivo y asumir la buena voluntad. `El siguiente artículo <http://gael-varoquaux.info/programming/technical-discussions-are-hard-a-few-tips.html>`_ explora cómo dirigir los debates en línea en el contexto del código abierto.

source: Triage team
es_es: Equipo de prueba

source: If you would like to join the triage team:
es_es: Si quieres unirte al equipo de prueba:

source: Correctly triage 2-3 issues.
es_es: Clasificar correctamente 2-3 incidencias.

source: Ask someone on the `triage team <https://github.com/orgs/matplotlib/teams/triageteam>`_ (publicly or privately) to recommend you to the triage team . If you worked with someone on the issue triaged, they would be a good person to ask.
es_es: Pide a alguien del `equipo de triaje <https://github.com/orgs/matplotlib/teams/triageteam>`_ (de forma pública o privada) que te recomiende al equipo de triaje . Si has trabajado con alguien en el tema triado, sería una buena persona para preguntar.

source: Responsibly exercise your new power!
es_es: ¡Ejerce responsablemente tu nuevo poder!

source: Anyone with commit or triage rights may also nominate a user to be invited to join the triage team.
es_es: Cualquier persona con derechos de commit o triage puede también nominar a un usuario para que sea invitado a unirse al equipo de triage.

source: Triaging operations for members of the core and triage teams
es_es: Operaciones de triaje para los miembros de los equipos centrales y de triaje

source: In addition to the above, members of the core team and the triage team can do the following important tasks:
es_es: Además de lo anterior, los miembros del equipo central y del equipo de triaje pueden realizar las siguientes tareas importantes:

source: Update labels for issues and PRs: see the list of `available github labels <https://github.com/matplotlib/matplotlib/labels>`_.
es_es: Actualizar las etiquetas de las incidencias y PRs: ver la lista de `etiquetas disponibles en github <https://github.com/matplotlib/matplotlib/labels>`_.

source: Triage issues:
es_es: Incidencias de triaje:

source: **reproduce the issue**, if the posted code is a bug label the issue with "status: confirmed bug".
es_es: **reproducir la incidencia**, si el código publicado es un error etiquetar la incidencia con "estado: error confirmado".

source: **identify regressions**, determine if the reported bug used to work as expected in a recent version of Matplotlib and if so determine the last working version. Regressions should be milestoned for the next bug-fix release and may be labeled as "Release critical".
es_es: **Identificar regresiones**, determinar si el error reportado solía funcionar como se esperaba en una versión reciente de Matplotlib y si es así determinar la última versión que funcionaba. Las regresiones deben ser milestoneadas para la próxima versión de corrección de errores y pueden ser etiquetadas como "Release critical".

source: **close usage questions** and politely point the reporter to use `discourse <https://discourse.matplotlib.org>`_ or Stack Overflow instead and label as "community support".
es_es: **cerrar las preguntas de uso** e indicar amablemente al reportero que utilice `discourse <https://discourse.matplotlib.org>`_ o Stack Overflow en su lugar y etiquetar como "apoyo de la comunidad".

source: **close duplicate issues**, after checking that they are indeed duplicate. Ideally, the original submitter moves the discussion to the older, duplicate issue
es_es: **Cerrar las incidencias duplicadas**, después de comprobar que efectivamente son duplicadas. Lo ideal es que el remitente original traslade la discusión a la incidencia más antigua

source: **close issues that cannot be replicated**, after leaving time (at least a week) to add extra information
es_es: **cerrar las incidencias que no se puedan replicar**, después de dejar tiempo (al menos una semana) para añadir información extra

source: Closing issues: a tough call
es_es: Incidencias de cierre: una decisión difícil

source: When uncertain on whether an issue should be closed or not, it is best to strive for consensus with the original poster, and possibly to seek relevant expertise. However, when the issue is a usage question or has been considered as unclear for many years, then it should be closed.
es_es: En caso de duda sobre si una incidencia debe cerrarse o no, lo mejor es tratar de llegar a un consenso con el autor original y, posiblemente, buscar los conocimientos técnicos pertinentes. Sin embargo, cuando la incidencia es una cuestión de uso o se considera poco claro desde hace muchos años, entonces debe cerrarse.

source: A typical workflow for triaging issues
es_es: Un flujo de trabajo típico para el triaje de incidencias

source: The following workflow [1]_ is a good way to approach issue triaging:
es_es: El siguiente flujo de trabajo [1]_ es una buena manera de abordar el triaje de incidencias:

source: Thank the reporter for opening an issue
es_es: Agradece al reportero que haya abierto una incidencia

source: The issue tracker is many people’s first interaction with the Matplotlib project itself, beyond just using the library. As such, we want it to be a welcoming, pleasant experience.
es_es: El gestor de incidencias es la primera interacción de muchas personas con el proyecto Matplotlib, más allá del simple uso de la biblioteca. Como tal, queremos que sea una experiencia acogedora y agradable.

source: Is this a usage question? If so close it with a polite message.
es_es: ¿Es una pregunta de uso? Si es así, ciérrala con un mensaje de cortesía.

source: Is the necessary information provided?
es_es: ¿Se proporciona la información necesaria?

source: Check that the poster has filled in the issue template. If crucial information (the version of Python, the version of Matplotlib used, the OS, and the backend), is missing politely ask the original poster to provide the information.
es_es: Comprueba que el autor ha rellenado la plantilla de la incidencia. Si falta información crucial (la versión de Python, la versión de Matplotlib utilizada, el sistema operativo y el backend), pida amablemente al autor original que proporcione la información.

source: Is the issue minimal and reproducible?
es_es: ¿La incidencia o problema es mínimo y reproducible?

source: For bug reports, we ask that the reporter provide a minimal reproducible example. See `this useful post <https://matthewrocklin.com/blog/work/2018/02/28/minimal-bug-reports>`_ by Matthew Rocklin for a good explanation. If the example is not reproducible, or if it's clearly not minimal, feel free to ask the reporter if they can provide an example or simplify the provided one. Do acknowledge that writing minimal reproducible examples is hard work. If the reporter is struggling, you can try to write one yourself.
es_es: Para los informes de errores, pedimos que el informante proporcione un ejemplo mínimo reproducible. Consulta `este útil post <https://matthewrocklin.com/blog/work/2018/02/28/minimal-bug-reports>`_ de Matthew Rocklin para una buena explicación. Si el ejemplo no es reproducible, o si claramente no es mínimo, no dudes en preguntar al informador si puede proporcionar un ejemplo o simplificar el proporcionado. Reconozca que escribir ejemplos mínimos reproducibles es un trabajo duro. Si el reportero tiene problemas, puedes intentar escribir uno tú mismo.

source: If a reproducible example is provided, but you see a simplification, add your simpler reproducible example.
es_es: Si se proporciona un ejemplo reproducible, pero ves una simplificación, añade tu ejemplo reproducible más sencillo.

source: If you can not reproduce the issue, please report that along with your OS, Python, and Matplotlib versions.
es_es: Si no puedes reproducir la incidencia, por favor, informa de ello junto con las versiones de tu sistema operativo, Python y Matplotlib.

source: If we need more information from either this or the previous step please label the issue with "status: needs clarification".
es_es: Si necesitamos más información de este paso o del anterior, etiquete la incidencia con " estatus: necesita aclaración".

source: Is this a regression?
es_es: ¿Es esto una regresión?

source: While we strive for a bug-free library, regressions are the highest priority. If we have broken user-code that *used to* work, we should fix that in the next patch release!
es_es: Aunque nos esforzamos por conseguir una biblioteca libre de errores, las regresiones son la máxima prioridad. Si tenemos un código de usuario roto que *solía* funcionar, ¡debemos arreglarlo en la próxima versión del parche!

source: Try to determine when the regression happened by running the reproduction code against older versions of Matplotlib. This can be done by released versions of Matplotlib (to get the version it last worked in) or by using `git bisect <https://git-scm.com/docs/git-bisect>`_ to find the first commit where it was broken.
es_es: Intenta determinar cuándo se produjo la regresión ejecutando el código reproducido contra versiones antiguas de Matplotlib. Esto puede hacerse con versiones liberadas de Matplotlib (para obtener la última versión en la que funcionó) o utilizando `git bisect <https://git-scm.com/docs/git-bisect>`_ para encontrar el primer commit en el que se rompió.

source: Is this a duplicate issue?
es_es: ¿Se trata de una incidencia duplicada?

source: We have many open issues. If a new issue seems to be a duplicate, point to the original issue. If it is a clear duplicate, or consensus is that it is redundant, close it. Make sure to still thank the reporter, and encourage them to chime in on the original issue, and perhaps try to fix it.
es_es: Tenemos muchas incidencias abiertas. Si una nueva incidencia parece ser un duplicado, señala la incidencia original. Si es un claro duplicado, o el consenso es que es redundante, ciérralo. Asegúrate de dar las gracias al reportero y anímale a que intervenga en la incidencia original y, tal vez, a que intente solucionarla.

source: If the new issue provides relevant information, such as a better or slightly different example, add it to the original issue as a comment or an edit to the original post.
es_es: Si la nueva incidencia proporciona información relevante, como un ejemplo mejor o ligeramente diferente, añádela a la incidencia original como un comentario o una edición al post original.

source: Label the closed issue with "status: duplicate"
es_es: Etiquetar la incidencia cerrada con "estatus: duplicado"

source: Make sure that the title accurately reflects the issue. If you have the necessary permissions edit it yourself if it's not clear.
es_es: Asegúrate de que el título refleja correctamente la incidencia. Si tienes los permisos necesarios, edítalo tú mismo si no está claro.

source: Add the relevant labels, such as "Documentation" when the issue is about documentation, "Bug" if it is clearly a bug, "New feature" if it is a new feature request, ...
es_es: Añade las etiquetas pertinentes, como "Documentación" cuando la incidencia se refiere a la documentación, "Error" si se trata claramente de un error, "Nueva función" si se trata de una nueva solicitud de función, ...

source: If the issue is clearly defined and the fix seems relatively straightforward, label the issue as “Good first issue” (and possibly a description of the fix or a hint as to where in the code base to look to get started).
es_es: Si la incidencia está claramente definida y la solución parece relativamente sencilla, etiqueta la incidencia como "Buena primera incidencia" (y posiblemente una descripción de la solución o una pista sobre el lugar de la base de código en el que hay que buscar para empezar).

source: An additional useful step can be to tag the corresponding module e.g. the "GUI/Qt" label when relevant.
es_es: Un paso útil adicional puede ser etiquetar el módulo correspondiente, por ejemplo, la etiqueta "IGU/Qt" cuando sea relevante.

source: Adapted from the pandas project `maintainers guide <https://dev.pandas.io/docs/development/maintaining.html>`_ and `the scikit-learn project <https://scikit-learn.org/dev/developers/bug_triaging.html>`_ .
es_es: Adaptado del proyecto pandas `maintainers guide <https://dev.pandas.io/docs/development/maintaining.html>`_ y del proyecto scikit-learn <https://scikit-learn.org/dev/developers/bug_triaging.html>`_ .

source: Working on PRs to help review
es_es: Trabajar en los PR para ayudar a la revisión

source: Reviewing code is also encouraged. Contributors and users are welcome to participate to the review process following our :ref:`review guidelines <pr-guidelines>`.
es_es: También se fomenta la revisión del código. Los colaboradores y usuarios son bienvenidos a participar en el proceso de revisión siguiendo nuestras :ref:`directrices de revisión <pr-guidelines>`.

source: Acknowledgments
es_es: Agradecimientos

source: This page is lightly adapted from `the sckit-learn project <https://scikit-learn.org/dev/developers/bug_triaging.html>`_ .
es_es: Esta página está ligeramente adaptada de `el proyecto sckit-learn <https://scikit-learn.org/dev/developers/bug_triaging.html>`_ .
