Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/users/installing/index.po
Languages: es_es

source: Installation
es_es: Instalación

source: Installing an official release
es_es: Instalación de una versión oficial

source: Matplotlib releases are available as wheel packages for macOS, Windows and Linux on `PyPI <https://pypi.org/project/matplotlib/>`_. Install it using ``pip``:
es_es: Las versiones de Matplotlib están disponibles como paquetes de rueda para macOS, Windows y Linux en `PyPI <https://pypi.org/project/matplotlib/>`_. Instálalo usando ``pip``:

source: If this command results in Matplotlib being compiled from source and there's trouble with the compilation, you can add ``--prefer-binary`` to select the newest version of Matplotlib for which there is a precompiled wheel for your OS and Python.
es_es: Si este comando hace que Matplotlib se compile desde el código fuente y hay problemas con la compilación, puedes añadir ``--prefer-binary`` para seleccionar la versión más reciente de Matplotlib para la que hay una wheel precompilada para tu sistema operativo y Python.

source: The following backends work out of the box: Agg, ps, pdf, svg
es_es: Los siguientes backends funcionan fuera de la caja: Agg, ps, pdf, svg

source: Python is typically shipped with tk bindings which are used by TkAgg.
es_es: Python es típicamente enviado con bindings tk que son usados por TkAgg.

source: For support of other GUI frameworks, LaTeX rendering, saving animations and a larger selection of file formats, you can install :ref:`optional_dependencies`.
es_es: Para soportar otros framework IGU, renderización de LaTeX, guardar animaciones y una mayor selección de formatos de archivo, puede instalar :ref:`optional_dependencies`.

source: Third-party distributions
es_es: Distribuciones de terceros

source: Various third-parties provide Matplotlib for their environments.
es_es: Varios terceros proporcionan Matplotlib para sus entornos.

source: Conda packages
es_es: Paquetes Conda

source: Matplotlib is available both via the *anaconda main channel*
es_es: Matplotlib está disponible en el *canal principal de Anaconda*

source: as well as via the *conda-forge community channel*
es_es: así como a través del *canal de la comunidad de Conda Forge*

source: Python distributions
es_es: Distribuciones de Python

source: Matplotlib is part of major Python distributions:
es_es: Matplotlib forma parte de las principales distribuciones de Python:

source: Linux package manager
es_es: Gestor de paquetes de Linux

source: If you are using the Python version that comes with your Linux distribution, you can install Matplotlib via your package manager, e.g.:
es_es: Si estás utilizando la versión de Python que viene con su distribución de Linux, puedes instalar Matplotlib a través de su gestor de paquetes, por ejemplo:

source: Installing from source
es_es: Instalación desde el código fuente

source: If you are interested in contributing to Matplotlib development, running the latest source code, or just like to build everything yourself, it is not difficult to build Matplotlib from source.
es_es: Si estás interesado en contribuir al desarrollo de Matplotlib, ejecutar el último código fuente, o simplemente te gusta construir todo por ti mismo, no es difícil construir Matplotlib desde el código fuente.

source: First you need to install the :ref:`dependencies`.
es_es: Primero necesitas instalar las :ref:`dependencies`.

source: A C compiler is required. Typically, on Linux, you will need ``gcc``, which should be installed using your distribution's package manager; on macOS, you will need xcode_; on Windows, you will need Visual Studio 2015 or later.
es_es: Se necesita un compilador C. Normalmente, en Linux, necesitarás ``gcc``, que debería instalarse mediante el gestor de paquetes de tu distribución; en macOS, necesitarás xcode_; en Windows, necesitarás Visual Studio 2015 o posterior.

source: The easiest way to get the latest development version to start contributing is to go to the git `repository <https://github.com/matplotlib/matplotlib>`_ and run::
es_es: La forma más fácil de obtener la última versión de desarrollo para empezar a contribuir es ir al `repositorio git <https://github.com/matplotlib/matplotlib>`_ y ejecutar::

source: or::
es_es: o::

source: If you're developing, it's better to do it in editable mode. The reason why is that pytest's test discovery only works for Matplotlib if installation is done this way. Also, editable mode allows your code changes to be instantly propagated to your library code without reinstalling (though you will have to restart your python process / kernel)::
es_es: Si estás desarrollando, es mejor hacerlo en modo editable. La razón es que el descubrimiento de pruebas de pytest sólo funciona para Matplotlib si la instalación se hace de esta manera. Además, el modo editable permite que tus cambios en el código se propaguen instantáneamente a tu código de biblioteca sin necesidad de reinstalar (aunque tendrás que reiniciar tu proceso python / kernel)::

source: If you're not developing, it can be installed from the source directory with a simple (just replace the last step)::
es_es: Si no estás desarrollando, se puede instalar desde el directorio de origen con un simple (sólo reemplazar el último paso)::

source: To run the tests you will need to install some additional dependencies::
es_es: Para ejecutar las pruebas necesitarás instalar algunas dependencias adicionales::

source: Then, if you want to update your Matplotlib at any time, just do::
es_es: Luego, si quieres actualizar tu Matplotlib en cualquier momento, sólo tienes que hacer::

source: When you run ``git pull``, if the output shows that only Python files have been updated, you are all set. If C files have changed, you need to run ``pip install -e .`` again to compile them.
es_es: Cuando ejecutes ``git pull``, si la salida muestra que sólo se han actualizado los archivos de Python, ya estás listo. Si los archivos C han cambiado, necesitas ejecutar ``pip install -e .`` de nuevo para compilarlos.

source: There is more information on :ref:`using git <using-git>` in the developer docs.
es_es: Hay más información sobre :ref:`using git <using-git>` en los documentos para desarrolladores.

source: The following instructions in this section are for very custom installations of Matplotlib. Proceed with caution because these instructions may result in your build producing unexpected behavior and/or causing local testing to fail.
es_es: Las siguientes instrucciones en esta sección son para instalaciones muy personalizadas de Matplotlib. Procede con precaución porque estas instrucciones pueden hacer que tu construcción produzca un comportamiento inesperado y/o que las pruebas locales fallen.

source: If you would like to build from a tarball, grab the latest *tar.gz* release file from `the PyPI files page <https://pypi.org/project/matplotlib/>`_.
es_es: Si quieres construir desde un tarball, toma el último archivo de lanzamiento *tar.gz* de `la página de archivos de PyPI <https://pypi.org/project/matplotlib/>`_.

source: We provide a `mplsetup.cfg`_ file which you can use to customize the build process. For example, which default backend to use, whether some of the optional libraries that Matplotlib ships with are installed, and so on. This file will be particularly useful to those packaging Matplotlib.
es_es: Proporcionamos un archivo `mplsetup.cfg`_ que puede utilizar para personalizar el proceso de construcción. Por ejemplo, qué backend utilizar por defecto, si se instalan algunas de las bibliotecas opcionales que Matplotlib incluye, etc. Este archivo será particularmente útil para aquellos que empaquetan Matplotlib.

source: If you are building your own Matplotlib wheels (or sdists) on Windows, note that any DLLs that you copy into the source tree will be packaged too.
es_es: Si estás construyendo tus propias wheels de Matplotlib (o sdists) en Windows, ten en cuenta que cualquier DLL que copies en el árbol de fuentes se empaquetará también.

source: Installing for development
es_es: Instalación para el desarrollo

source: See :ref:`installing_for_devs`.
es_es: Ver :ref:`installing_for_devs`.

source: Frequently asked questions
es_es: Preguntas frecuentes

source: Report a compilation problem
es_es: Reportar un problema de compilación

source: See :ref:`reporting-problems`.
es_es: Ver :ref:`reporting-problems`.

source: Matplotlib compiled fine, but nothing shows up when I use it
es_es: Matplotlib compiló bien, pero no aparece nada cuando lo uso

source: The first thing to try is a :ref:`clean install <clean-install>` and see if that helps. If not, the best way to test your install is by running a script, rather than working interactively from a python shell or an integrated development environment such as :program:`IDLE` which add additional complexities. Open up a UNIX shell or a DOS command prompt and run, for example::
es_es: Lo primero que hay que probar es un :ref:`clean install <clean-install>` y ver si eso ayuda. Si no es así, la mejor manera de probar tu instalación es ejecutando un script, en lugar de trabajar de forma interactiva desde un terminal python o un entorno de desarrollo integrado como :program:`IDLE` que añaden complejidades adicionales. Abra un terminal UNIX o un prompt de comandos DOS y ejecute, por ejemplo::

source: This will give you additional information about which backends Matplotlib is loading, version information, and more. At this point you might want to make sure you understand Matplotlib's :doc:`configuration </tutorials/introductory/customizing>` process, governed by the :file:`matplotlibrc` configuration file which contains instructions within and the concept of the Matplotlib backend.
es_es: Esto te dará información adicional sobre qué backends está cargando Matplotlib, información sobre la versión, y más. En este punto es posible que desees asegurarte de que entiendes el proceso de :doc:`configuración </tutorials/introductory/customizing>` de Matplotlib, gobernado por el archivo de configuración :file:`matplotlibrc` que contiene instrucciones dentro y el concepto de backend de Matplotlib.

source: If you are still having trouble, see :ref:`reporting-problems`.
es_es: Si todavía tienes problemas, consulta :ref:`reporting-problems`.

source: How to completely remove Matplotlib
es_es: Cómo eliminar completamente Matplotlib

source: Occasionally, problems with Matplotlib can be solved with a clean installation of the package. In order to fully remove an installed Matplotlib:
es_es: En ocasiones, los problemas con Matplotlib pueden resolverse con una instalación limpia del paquete. Para eliminar completamente un Matplotlib instalado:

source: Delete the caches from your :ref:`Matplotlib configuration directory <locating-matplotlib-config-dir>`.
es_es: Elimina los cachés de tu directorio de configuración :ref:`Matplotlib <locating-matplotlib-config-dir>`.

source: Delete any Matplotlib directories or eggs from your :ref:`installation directory <locating-matplotlib-install>`.
es_es: Elimine cualquier directorio o eggs de Matplotlib de su :ref:`directorio de instalación <locating-matplotlib-install>`.

source: OSX Notes
es_es: Notas OSX

source: Which python for OSX?
es_es: ¿Cuál python para OSX?

source: Apple ships OSX with its own Python, in ``/usr/bin/python``, and its own copy of Matplotlib. Unfortunately, the way Apple currently installs its own copies of NumPy, Scipy and Matplotlib means that these packages are difficult to upgrade (see `system python packages`_). For that reason we strongly suggest that you install a fresh version of Python and use that as the basis for installing libraries such as NumPy and Matplotlib. One convenient way to install Matplotlib with other useful Python software is to use the Anaconda_ Python scientific software collection, which includes Python itself and a wide range of libraries; if you need a library that is not available from the collection, you can install it yourself using standard methods such as *pip*. See the Ananconda web page for installation support.
es_es: Apple incluye en OSX su propio Python, en ``/usr/bin/python``, y su propia copia de Matplotlib. Desafortunadamente, la forma en que Apple instala actualmente sus propias copias de NumPy, Scipy y Matplotlib significa que estos paquetes son difíciles de actualizar (ver `paquetes python del sistema`_). Por esta razón, te recomendamos encarecidamente que instales una versión nueva de Python y la utilices como base para instalar bibliotecas como NumPy y Matplotlib. Una forma conveniente de instalar Matplotlib con otro software útil de Python es utilizar la colección de software científico Anaconda_ Python, que incluye el propio Python y una amplia gama de librerías; si necesitas una biblioteca que no está disponible en la colección, puedes instalarla tú mismo utilizando métodos estándar como *pip*. Consulte la página web de Ananconda para obtener ayuda para la instalación.

source: Other options for a fresh Python install are the standard installer from `python.org <https://www.python.org/downloads/mac-osx/>`_, or installing Python using a general OSX package management system such as `homebrew <https://brew.sh/>`_ or `macports <https://www.macports.org>`_. Power users on OSX will likely want one of homebrew or macports on their system to install open source software packages, but it is perfectly possible to use these systems with another source for your Python binary, such as Anaconda or Python.org Python.
es_es: Otras opciones para una instalación fresca de Python son el instalador estándar de `python.org <https://www.python.org/downloads/mac-osx/>`_, o instalar Python usando un sistema general de gestión de paquetes de OSX como `homebrew <https://brew.sh/>`_ o `macports <https://www.macports.org>`_. Los usuarios avanzados de OSX probablemente desearán uno de los sistemas homebrew o macports para instalar paquetes de software de código abierto, pero es perfectamente posible utilizar estos sistemas con otra fuente para su binario de Python, como Anaconda o Python.org Python.

source: Installing OSX binary wheels
es_es: Instalar wheels binarias OSX

source: If you are using Python from https://www.python.org, Homebrew, or Macports, then you can use the standard pip installer to install Matplotlib binaries in the form of wheels.
es_es: Si estás usando Python desde https://www.python. rg, Homebrew o Macports, entonces puede utilizar el instalador estándar pip para instalar Matplotlib binarios en forma de wheels.

source: pip is installed by default with python.org and Homebrew Python, but needs to be manually installed on Macports with ::
es_es: pip está instalado por defecto con python.org y Homebrew Python, pero necesita ser instalado manualmente en Macports con ::

source: Once pip is installed, you can install Matplotlib and all its dependencies with from the Terminal.app command line::
es_es: Una vez que pip está instalado, puedes instalar Matplotlib y todas sus dependencias con la línea de comandos Terminal.app::

source: (``sudo python3.6 ...`` on Macports).
es_es: (``sudo python3.6 ...`` en Macports).

source: You might also want to install IPython or the Jupyter notebook (``python3 -mpip install ipython notebook``).
es_es: También podrías querer instalar IPython o el Cuaderno de Jupyter (``python3 -mpip instalar ipython notebook``).

source: Checking your installation
es_es: Comprobar tu instalación

source: The new version of Matplotlib should now be on your Python "path". Check this at the Terminal.app command line::
es_es: La nueva versión de Matplotlib ahora debería estar en tu "ruta" de Python. Comprueba esto en la línea de comandos de Terminal.app::

source: You should see something like ::
es_es: Deberás ver algo como esto ::

source: where ``3.0.0`` is the Matplotlib version you just installed, and the path following depends on whether you are using Python.org Python, Homebrew or Macports. If you see another version, or you get an error like ::
es_es: donde ``3.0.0`` es la versión de Matplotlib que acabas de instalar, y la ruta que sigue depende de si estás usando Python.org Python, Homebrew o Macports. Si ves otra versión, o recibes un error como ::

source: then check that the Python binary is the one you expected by running ::
es_es: entonces comprueba que el binario de Python es el que esperabas ejecutando ::

source: If you get a result like ``/usr/bin/python...``, then you are getting the Python installed with OSX, which is probably not what you want. Try closing and restarting Terminal.app before running the check again. If that doesn't fix the problem, depending on which Python you wanted to use, consider reinstalling Python.org Python, or check your homebrew or macports setup. Remember that the disk image installer only works for Python.org Python, and will not get picked up by other Pythons. If all these fail, please :ref:`let us know <reporting-problems>`.
es_es: Si obtienes un resultado como ``/usr/bin/python...``, entonces estás obteniendo el Python instalado con OSX, que probablemente no es lo que deseas. Intenta cerrar y reiniciar Terminal.app antes de volver a ejecutar la comprobación. Si eso no soluciona el problema, dependiendo del Python que deseabas utilizar, considera reinstalar Python.org Python, o comprueba tu configuración homebrew o macports. Recuerda que el instalador de imágenes de disco sólo funciona para Python.org Python, y no será recogido por otros Python. Si todo esto falla, por favor :ref:`haznos saber <reporting-problems>`.
