Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/widgets/annotated_cursor.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_widgets_annotated_cursor.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_widgets_annotated_cursor.py>` para descargar el código de ejemplo completo

source: Annotated Cursor
es_es: Cursor anotado

source: Display a data cursor including a text box, which shows the plot point close to the mouse pointer.
es_es: Muestra un cursor de datos que incluye un cuadro de texto, que muestra el punto de gráfico cerca del puntero del ratón.

source: The new cursor inherits from `~matplotlib.widgets.Cursor` and demonstrates the creation of new widgets and their event callbacks.
es_es: El nuevo cursor hereda de `~matplotlib.widgets.Cursor` y demuestra la creación de nuevos widgets y sus callbacks de eventos.

source: See also the :doc:`cross hair cursor </gallery/misc/cursor_demo>`, which implements a cursor tracking the plotted data, but without using inheritance and without displaying the currently tracked coordinates.
es_es: Ver también el :doc:`cross hair cursor </gallery/misc/cursor_demo>`, que implementa un cursor que rastrea los datos graficados, pero sin usar la herencia y sin mostrar las coordenadas actualmente rastreadas.

source: The figure related to this example does not show the cursor, because that figure is automatically created in a build queue, where the first mouse movement, which triggers the cursor creation, is missing.
es_es: La figura relacionada con este ejemplo no muestra el cursor, porque esa figura se crea automáticamente en una cola de construcción, donde falta el primer movimiento del ratón, que desencadena la creación del cursor.

source: Trouble with non-biunique functions
es_es: Problemas con las funciones no biunívocas

source: A call demonstrating problems with the *dataaxis=y* parameter. The text now looks up the matching x value for the current cursor y position instead of vice versa. Hover your cursor to y=4. There are two x values producing this y value: -2 and 2. The function is only unique, but not biunique. Only one value is shown in the text.
es_es: Una invocación que demuestra problemas con el parámetro *dataaxis=y*. El texto ahora busca el valor x correspondiente a la posición y actual del cursor en lugar de viceversa. Pase el cursor a y=4. Hay dos valores x que producen este valor y: -2 y 2. La función es única, pero no biunívoca. Sólo se muestra un valor en el texto.

source: :download:`Download Python source code: annotated_cursor.py <annotated_cursor.py>`
es_es: :download:`Descargar código fuente de Python: annotated_cursor.py <annotated_cursor.py>`

source: :download:`Download Jupyter notebook: annotated_cursor.ipynb <annotated_cursor.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: annotated_cursor.ipynb <annotated_cursor.ipynb>`
