Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/widgets/range_slider.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_widgets_range_slider.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_widgets_range_slider.py>` para descargar el código de ejemplo completo

source: Thresholding an Image with RangeSlider
es_es: Umbralizar una imagen con RangeSlider

source: Using the RangeSlider widget to control the thresholding of an image.
es_es: Utilizar el widget RangeSlider para controlar el umbral de una imagen.

source: The RangeSlider widget can be used similarly to the `.widgets.Slider` widget. The major difference is that RangeSlider's ``val`` attribute is a tuple of floats ``(lower val, upper val)`` rather than a single float.
es_es: El widget RangeSlider puede utilizarse de forma similar al widget `.widgets.Slider`. La principal diferencia es que el atributo ``val`` del RangeSlider es una tupla de floats ``(val inferior, val superior)`` en lugar de un único flotante.

source: See :doc:`/gallery/widgets/slider_demo` for an example of using a ``Slider`` to control a single float.
es_es: Ver :doc:`/gallery/widgets/slider_demo` para un ejemplo de uso de un ``Slider`` para controlar un solo flotante (float).

source: See :doc:`/gallery/widgets/slider_snap_demo` for an example of having the ``Slider`` snap to discrete values.
es_es: Ver :doc:`/gallery/widgets/slider_snap_demo` para un ejemplo de cómo hacer que el ``Slider`` se ajuste a valores discretos.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: range_slider.py <range_slider.py>`
es_es: :download:`Descargar código fuente de Python: range_slider.py <range_slider.py>`

source: :download:`Download Jupyter notebook: range_slider.ipynb <range_slider.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: range_slider.ipynb <range_slider.ipynb>`
