Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/widgets/slider_snap_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_widgets_slider_snap_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_widgets_slider_snap_demo.py>` para descargar el código de ejemplo completo

source: Snapping Sliders to Discrete Values
es_es: Ajustar los carruseles a valores discretos

source: You can snap slider values to discrete values using the ``valstep`` argument.
es_es: Puedes ajustar los valores del carrusel a valores discretos usando el argumento ``valstep``.

source: In this example the Freq slider is constrained to be multiples of pi, and the Amp slider uses an array as the ``valstep`` argument to more densely sample the first part of its range.
es_es: En este ejemplo el carrusel Freq está restringido a ser múltiplos de pi, y el deslizador Amp utiliza un array como argumento ``valstep`` para muestrear más densamente la primera parte de su rango.

source: See :doc:`/gallery/widgets/slider_demo` for an example of using a ``Slider`` to control a single float.
es_es: Ver :doc:`/gallery/widgets/slider_demo` para un ejemplo de uso de un ``Slider`` para controlar un solo flotante (float).

source: See :doc:`/gallery/widgets/range_slider` for an example of using a ``RangeSlider`` to define a range of values.
es_es: Ver :doc:`/gallery/widgets/range_slider` para un ejemplo de uso de un ``RangeSlider`` para definir un rango de valores.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: slider_snap_demo.py <slider_snap_demo.py>`
es_es: :download:`Descargar código fuente de Python: slider_snap_demo.py <slider_snap_demo.py>`

source: :download:`Download Jupyter notebook: slider_snap_demo.ipynb <slider_snap_demo.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: slider_snap_demo.ipynb <slider_snap_demo.ipynb>`
