Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/MEP09.po
Languages: es_es

source: MEP9: Global interaction manager
es_es: MEP9: Gestor global de interacciones

source: Add a global manager for all user interactivity with artists; make any artist resizeable, moveable, highlightable, and selectable as desired by the user.
es_es: Añade un gestor global para toda la interactividad del usuario con los artists; haz que cualquier artista sea redimensionable, movible, destacable y seleccionable a gusto del usuario.

source: Status
es_es: Estado

source: **Discussion**
es_es: **Discusión**

source: Branches and Pull requests
es_es: Ramas y Pull requests

source: Abstract
es_es: Resumen

source: The goal is to be able to interact with matplotlib artists in a very similar way as drawing programs do. When appropriate, the user should be able to move, resize, or select an artist that is already on the canvas. Of course, the script writer is ultimately in control of whether an artist is able to be interacted with, or whether it is static.
es_es: El objetivo es poder interactuar con los artists de matplotlib de forma muy similar a como lo hacen los programas de dibujo. Cuando sea apropiado, el usuario debería ser capaz de mover, redimensionar o seleccionar un artist que ya está en el lienzo. Por supuesto, el script es quien controla en última instancia si se puede interactuar con un artist o si es estático.

source: This code to do this has already been privately implemented and tested, and would need to be migrated from its current "mixin" implementation, to a bona-fide part of matplotlib.
es_es: Este código para hacer esto ya ha sido implementado y probado de forma privada, y necesitaría ser migrado desde su actual implementación "mixin", a una parte bona-fide de matplotlib.

source: The end result would be to have four new keywords available to matplotlib.artist.Artist: _moveable_, _resizeable_, _selectable_, and _highlightable_. Setting any one of these keywords to True would activate interactivity for that artist.
es_es: El resultado final sería tener cuatro nuevas palabras clave disponibles para matplotlib.artist.Artist: _moveable_, _resizeable_, _selectable_ y _highlightable_. Al establecer cualquiera de estas palabras clave como True se activaría la interactividad para ese artist.

source: In effect, this MEP is a logical extension of event handling in matplotlib; matplotlib already supports "low level" interactions like left mouse presses, a key press, or similar. The MEP extends the support to the logical level, where callbacks are performed on the artists when certain interactive gestures from the user are detected.
es_es: En efecto, este MEP es una extensión lógica del manejo de eventos en matplotlib; matplotlib ya soporta interacciones de "bajo nivel" como la pulsación del botón izquierdo del ratón, la pulsación de una tecla o similares. El MEP extiende el soporte al nivel lógico, donde se realizan callbacks en los artists cuando se detectan ciertos gestos interactivos del usuario.

source: Detailed description
es_es: Descripción detallada

source: This new functionality would be used to allow the end-user to better interact with the graph. Many times, a graph is almost what the user wants, but a small repositioning and/or resizing of components is necessary. Rather than force the user to go back to the script to trial-and-error the location, and simple drag and drop would be appropriate.
es_es: Esta nueva funcionalidad serviría para que el usuario final pudiera interactuar mejor con el grafo. Muchas veces, un grafo es casi lo que el usuario quiere, pero es necesario un pequeño reposicionamiento y/o cambio de tamaño de los componentes. En lugar de obligar al usuario a volver al script para probar y equivocarse en la ubicación, un simple arrastrar y soltar sería lo adecuado.

source: Also, this would better support applications that use matplotlib; here, the end-user has no reasonable access or desire to edit the underlying source in order to fine-tune a plot. Here, if matplotlib offered the capability, one could move or resize artists on the canvas to suit their needs. Also, the user should be able to highlight (with a mouse over) an artist, and select it with a double-click, if the application supports that sort of thing. In this MEP, we also want to support the highlighting and selection natively; it is up to application to handle what happens when the artist is selected. A typical handling would be to display a dialog to edit the properties of the artist.
es_es: Además, esto soportaría mejor las aplicaciones que utilizan matplotlib; aquí, el usuario final no tiene un acceso razonable o el deseo de editar la fuente subyacente con el fin de ajustar un gráfico. Aquí, si matplotlib ofreciera la capacidad, uno podría mover o cambiar el tamaño de los artists en el lienzo para adaptarse a sus necesidades. Además, el usuario debería poder resaltar (con el ratón encima) un artist, y seleccionarlo con un doble clic, si la aplicación soporta ese tipo de cosas. En este MEP, también queremos soportar el resaltado y la selección de forma nativa; depende de la aplicación manejar lo que sucede cuando el artist es seleccionado. Un manejo típico sería mostrar un diálogo para editar las propiedades del artist.

source: In the future, as well (this is not part of this MEP), matplotlib could offer backend-specific property dialogs for each artist, which are raised on artist selection. This MEP would be a necessary stepping stone for that sort of capability.
es_es: En el futuro, también (esto no es parte de este MEP), matplotlib podría ofrecer diálogos de propiedades específicas para cada artist, que se plantea en la selección del artist. Este MEP sería un paso necesario para ese tipo de capacidad.

source: There are currently a few interactive capabilities in matplotlib (e.g. legend.draggable()), but they tend to be scattered and are not available for all artists. This MEP seeks to unify the interactive interface and make it work for all artists.
es_es: Actualmente hay algunas capacidades interactivas en matplotlib (por ejemplo, legend.draggable()), pero tienden a estar dispersas y no están disponibles para todos los artistas. Este MEP pretende unificar la interfaz interactiva y hacerla funcionar para todos los artists.

source: The current MEP also includes grab handles for resizing artists, and appropriate boxes drawn when artists are moved or resized.
es_es: El MEP actual también incluye asas de agarre para cambiar el tamaño de los artists, y cajas apropiadas que se dibujan cuando los artists se mueven o cambian de tamaño.

source: Implementation
es_es: Implementación

source: Add appropriate methods to the "tree" of artists so that the interactivity manager has a consistent interface for the interactivity manager to deal with. The proposed methods to add to the artists, if they are to support interactivity, are:
es_es: Añadir métodos apropiados al "árbol" de artists para que el gestor de la interactividad tenga una interfaz coherente con la que tratar. Los métodos propuestos para añadir a los artists, si van a soportar la interactividad, son:

source: get_pixel_position_ll(self): get the pixel position of the lower left corner of the artist's bounding box
es_es: get_pixel_position_ll(self): obtiene la posición del píxel de la esquina inferior izquierda de la caja delimitadora del artista

source: get_pixel_size(self): get the size of the artist's bounding box, in pixels
es_es: get_pixel_size(self): obtiene el tamaño de la caja delimitadora del artist, en píxeles

source: set_pixel_position_and_size(self,x,y,dx,dy): set the new size of the artist, such that it fits within the specified bounding box.
es_es: set_pixel_position_and_size(self,x,y,dx,dy): establece el nuevo tamaño del artist, de forma que se ajuste a la caja delimitadora especificada.

source: add capability to the backends to 1) provide cursors, since these are needed for visual indication of moving/resizing, and 2) provide a function that gets the current mouse position
es_es: añadir capacidad a los backends para 1) proporcionar cursores, ya que estos son necesarios para la indicación visual de movimiento/redimensionamiento, y 2) proporcionar una función que obtenga la posición actual del ratón

source: Implement the manager. This has already been done privately (by dhyams) as a mixin, and has been tested quite a bit. The goal would be to move the functionality of the manager into the artists so that it is in matplotlib properly, and not as a "monkey patch" as I currently have it coded.
es_es: Implementar el gestor. Esto ya se ha hecho de forma privada (por dhyams) como un mixin, y se ha probado bastante. El objetivo sería trasladar la funcionalidad del gestor a los artists para que esté en matplotlib correctamente, y no como un "parche mono" como lo tengo codificado actualmente.

source: Current summary of the mixin
es_es: Resumen actual del mixin

source: (Note that this mixin is for now just private code, but can be added to a branch obviously)
es_es: (Ten en cuenta que este mixin es por ahora sólo código privado, pero puede ser añadido a una rama obviamente)

source: Mixin class to make any generic object that is drawn on a matplotlib canvas moveable and possibly resizeable. The Powerpoint model is followed as closely as possible; not because I'm enamoured with Powerpoint, but because that's what most people understand. An artist can also be selectable, which means that the artist will receive the on_activated() callback when double clicked. Finally, an artist can be highlightable, which means that a highlight is drawn on the artist whenever the mouse passes over. Typically, highlightable artists will also be selectable, but that is left up to the user. So, basically there are four attributes that can be set by the user on a per-artist basis:
es_es: Clase Mixin para hacer que cualquier objeto genérico que se dibuje en un lienzo de matplotlib sea movible y posiblemente redimensionable. Se sigue el modelo de Powerpoint lo más fielmente posible; no porque esté encantado con Powerpoint, sino porque es lo que la mayoría de la gente entiende. Un artist también puede ser seleccionable, lo que significa que el artist recibirá la llamada de retorno on_activated() cuando se haga doble clic. Por último, un artist puede ser resaltante, lo que significa que un resaltante se dibuja en el artist cada vez que el ratón pasa por encima. Normalmente, los artists resaltados también son seleccionables, pero eso se deja a criterio del usuario. Así que, básicamente, hay cuatro atributos que el usuario puede establecer para cada artist:

source: highlightable
es_es: destacable

source: selectable
es_es: seleccionable

source: moveable
es_es: movible

source: resizeable
es_es: redimensionable

source: To be moveable (draggable) or resizeable, the object that is the target of the mixin must support the following protocols:
es_es: Para ser movible (arrastrable) o redimensionable, el objeto que es el objetivo del mixin debe soportar los siguientes protocolos:

source: Note that nonresizeable objects are free to ignore the sx and sy parameters. To be highlightable, the object that is the target of the mixin must also support the following protocol:
es_es: Ten en cuenta que los objetos no redimensionables son libres de ignorar los parámetros sx y sy. Para ser destacable, el objeto que es el objetivo del mixin también debe soportar el siguiente protocolo:

source: Which returns a list of artists that will be used to draw the highlight.
es_es: Que devuelve una lista de artists que se utilizarán para dibujar el resalte.

source: If the object that is the target of the mixin is not an matplotlib artist, the following protocols must also be implemented. Doing so is usually fairly trivial, as there has to be an artist *somewhere* that is being drawn. Typically your object would just route these calls to that artist.
es_es: Si el objeto que es el objetivo del mixin no es un artist de matplotlib, los siguientes protocolos también deben ser implementados. Hacerlo es normalmente bastante trivial, ya que tiene que haber un artist *en algún lugar* que se esté dibujando. Típicamente, su objeto sólo dirigirá estas llamadas a ese artist.

source: The following notifications are called on the artist, and the artist can optionally implement these.
es_es: Las siguientes notificaciones son invocadas en el artist, y el artist puede implementarlas opcionalmente.

source: The following notifications are called on the canvas, if no interactive artist handles the event:
es_es: Las siguientes notificaciones son invocadas en el lienzo, si ningún artist interactivo maneja el evento:

source: The following functions, if present, can be used to modify the behavior of the interactive object:
es_es: Las siguientes funciones, si están presentes, pueden utilizarse para modificar el comportamiento del objeto interactivo:

source: press_filter(self,event) # determines if the object wants to have the press event routed to it
es_es: press_filter(self,event) # determina si el objeto quiere que se le envíe el evento de press

source: handle_unpicked_cursor() # can be used by the object to set a cursor as the cursor passes over the object when it is unpicked.
es_es: handle_unpicked_cursor() # puede ser utilizado por el objeto para establecer un cursor cuando el cursor pasa por encima del objeto al ser deseleccionado.

source: Supports multiple canvases, maintaining a drag lock, motion notifier, and a global "enabled" flag per canvas. Supports fixed aspect ratio resizings by holding the shift key during the resize.
es_es: Soporta múltiples lienzos, manteniendo un bloqueo de arrastre, un notificador de movimiento y una bandera global "habilitada" por lienzo. Admite redimensionamientos de la razón de aspecto fija manteniendo la tecla de mayúsculas durante el redimensionamiento.

source: Known problems:
es_es: Problemas conocidos:

source: Zorder is not obeyed during the selection/drag operations. Because of the blit technique used, I do not believe this can be fixed. The only way I can think of is to search for all artists that have a zorder greater then me, set them all to animated, and then redraw them all on top during each drag refresh. This might be very slow; need to try.
es_es: No se respeta el orden Z durante las operaciones de selección/arrastramiento. Debido a la técnica de blit utilizada, no creo que esto se pueda arreglar. La única forma que se me ocurre es buscar todos los artists que tengan un orden z mayor que el mío, ponerlos a todos como animados, y luego redibujarlos todos encima durante cada refresco de arrastre. Esto puede ser muy lento; hay que probarlo.

source: the mixin only works for wx backends because of two things: 1) the cursors are hardcoded, and 2) there is a call to wx.GetMousePosition() Both of these shortcomings are reasonably fixed by having each backend supply these things.
es_es: el mixin sólo funciona para los backends wx debido a dos cosas: 1) los cursores están codificados, y 2) hay una llamada a wx.GetMousePosition() Ambas deficiencias se arreglan razonablemente haciendo que cada backend suministre estas cosas.

source: Backward compatibility
es_es: Compatibilidad con el pasado

source: No problems with backward compatibility, although once this is in place, it would be appropriate to obsolete some of the existing interactive functions (like legend.draggable())
es_es: No hay problemas de retrocompatibilidad, aunque una vez que esto esté en marcha, sería conveniente obviar algunas de las funciones interactivas existentes (como legend.draggable())

source: Alternatives
es_es: Alternativas

source: None that I know of.
es_es: Que yo sepa, ninguno.
