Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/MEP08.po
Languages: es_es

source: Status
es_es: Estado

source: **Completed**
es_es: **Completado**

source: We are currently enforcing a sub-set of pep8 on new code contributions.
es_es: Actualmente estamos haciendo cumplir un subconjunto de pep8 en nuevas contribuciones de código.

source: Branches and Pull requests
es_es: Ramas y Pull requests

source: None so far.
es_es: Ninguno hasta ahora.

source: Abstract
es_es: Resumen

source: The matplotlib codebase predates PEP8, and therefore is less than consistent style-wise in some areas. Bringing the codebase into compliance with PEP8 would go a long way to improving its legibility.
es_es: El código base de matplotlib es anterior a PEP8, y por lo tanto es menos que consistente en cuanto a estilo en algunas áreas. Adaptar el código base a la PEP8 contribuiría en gran medida a mejorar su legibilidad.

source: Detailed description
es_es: Descripción detallada

source: Some files use four space indentation, some use three. Some use different levels in the same file.
es_es: Algunos archivos utilizan una sangría de cuatro espacios, otros de tres. Algunos utilizan diferentes niveles en el mismo archivo.

source: For the most part, class/function/variable naming follows PEP8, but it wouldn't hurt to fix where necessary.
es_es: En su mayor parte, la nomenclatura de las clases/funciones/variables sigue el PEP8, pero no estaría de más arreglar lo que sea necesario.

source: Implementation
es_es: Implementación

source: The implementation should be fairly mechanical: running the pep8 tool over the code and fixing where appropriate.
es_es: La implementación debería ser bastante mecánica: ejecutar la herramienta pep8 sobre el código y corregirlo cuando sea necesario.

source: This should be merged in after the 2.0 release, since the changes will likely make merging any pending pull requests more difficult.
es_es: Esto debería fusionarse después de la versión 2.0, ya que los cambios probablemente dificultarán la fusión de cualquier pull request pendiente.

source: Additionally, and optionally, PEP8 compliance could be tracked by an automated build system.
es_es: Además, y de manera opcional, el cumplimiento del PEP8 podría ser rastreado por un sistema de construcción automatizado.

source: Backward compatibility
es_es: Compatibilidad con el pasado

source: Public names of classes and functions that require change (there shouldn't be many of these) should first be deprecated and then removed in the next release cycle.
es_es: Los nombres públicos de las clases y funciones que requieran un cambio (no deberían ser muchos) deberían ser primero obsoletos y luego eliminados en el siguiente ciclo de publicación.

source: Alternatives
es_es: Alternativas

source: PEP8 is a popular standard for Python code style, blessed by the Python core developers, making any alternatives less desirable.
es_es: PEP8 es un estándar popular para el estilo de código de Python, de la mano de los desarrolladores del núcleo de Python, lo que hace que cualquier alternativa sea menos deseable.
