Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/MEP13.po
Languages: es_es

source: MEP13: Use properties for Artists
es_es: MEP13: Usa propiedades para Artists

source: Status
es_es: Estado

source: **Discussion**
es_es: **Discusión**

source: Branches and Pull requests
es_es: Ramas y Pull requests

source: Abstract
es_es: Resumen

source: Wrap all of the matplotlib getter and setter methods with python `properties <https://docs.python.org/3/library/functions.html#property>`_, allowing them to be read and written like class attributes.
es_es: Envuelve todos los métodos getter y setter de matplotlib con python `properties <https://docs.python.org/3/library/functions.html#property>`_, permitiendo que sean leídos y escritos como atributos de clase.

source: Detailed description
es_es: Descripción detallada

source: Currently matplotlib uses getter and setter functions (usually prefixed with get\_ and set\_, respectively) for reading and writing data related to classes. However, since 2.6 python supports properties, which allow such setter and getter functions to be accessed as though they were attributes. This proposal would implement all existing setter and getter methods as properties.
es_es: Actualmente matplotlib utiliza funciones getter y setter (normalmente prefijadas con get\_ y set\_, respectivamente) para leer y escribir datos relacionados con las clases. Sin embargo, desde la versión 2.6 python soporta propiedades, que permiten acceder a dichas funciones setter y getter como si fueran atributos. Esta propuesta implementaría todos los métodos setter y getter existentes como propiedades.

source: Implementation
es_es: Implementación

source: All existing getter and setter methods will need to have two aliases, one with the get\_ or set\_ prefix and one without. Getter methods that currently lack prefixes should be recording in a text file.
es_es: Todos los métodos getter y setter existentes deberán tener dos alias, uno con el prefijo get\_ o set\_ y otro sin él. Los métodos getter que actualmente carecen de prefijo deberán registrarse en un archivo de texto.

source: Classes should be reorganized so setter and getter methods are sequential in the code, with getter methods first.
es_es: Las clases deben ser reorganizadas para que los métodos setter y getter sean secuenciales en el código, con los métodos getter primero.

source: Getter and setter methods the provide additional optional optional arguments should have those arguments accessible in another manner, either as additional getter or setter methods or attributes of other classes. If those classes are not accessible, getters for them should be added.
es_es: Los métodos getter y setter que proporcionan argumentos opcionales adicionales deben tener esos argumentos accesibles de otra manera, ya sea como métodos getter o setter adicionales o como atributos de otras clases. Si esas clases no son accesibles, deben añadirse getters para ellas.

source: Property decorators will be added to the setter and getter methods without the prefix. Those with the prefix will be marked as deprecated.
es_es: Los decoradores de propiedades se añadirán a los métodos setter y getter sin el prefijo. Los que tengan el prefijo se marcarán como obsoletos.

source: Docstrings will need to be rewritten so the getter with the prefix has the current docstring and the getter without the prefix has a generic docstring appropriate for an attribute.
es_es: Habrá que reescribir los docstrings para que el getter con el prefijo tenga el docstring actual y el getter sin el prefijo tenga un docstring genérico apropiado para un atributo.

source: Automatic alias generation will need to be modified so it will also create aliases for the properties.
es_es: La generación automática de alias tendrá que ser modificada para que también cree alias para las propiedades.

source: All instances of getter and setter method calls will need to be changed to attribute access.
es_es: Todas las instancias de invocación de métodos getter y setter tendrán que ser cambiadas a acceso de atributos.

source: All setter and getter aliases with prefixes will be removed
es_es: Todos los alias setter y getter con prefijos serán eliminados

source: The following steps can be done simultaneously: 1, 2, and 3; 4 and 5; 6 and 7.
es_es: Los siguientes pasos pueden realizarse simultáneamente: 1, 2 y 3; 4 y 5; 6 y 7.

source: Only the following steps must be done in the same release: 4, 5, and 6. All other changes can be done in separate releases. 8 should be done several major releases after everything else.
es_es: Sólo los siguientes pasos deben realizarse en la misma versión: 4, 5 y 6. Todos los demás cambios pueden realizarse en versiones separadas. El paso 8 debe realizarse en varias versiones principales después de todo lo demás.

source: Backward compatibility
es_es: Compatibilidad con versiones anteriores

source: All existing getter methods that do not have a prefix (such as get\_) will need to be changed from function calls to attribute access. In most cases this will only require removing the parenthesis.
es_es: Todos los métodos getter existentes que no tienen un prefijo (como get\_) tendrán que ser cambiados de llamadas a funciones a acceso a atributos. En la mayoría de los casos sólo será necesario eliminar el paréntesis.

source: setter and getter methods that have additional optional arguments will need to have those arguments implemented in another way, either as a separate property in the same class or as attributes or properties of another class.
es_es: los métodos setter y getter que tienen argumentos opcionales adicionales necesitarán tener esos argumentos implementados de otra manera, ya sea como una propiedad separada en la misma clase o como atributos o propiedades de otra clase.

source: Cases where the setter returns a value will need to be changed to using the setter followed by the getter.
es_es: Los casos en los que el setter devuelve un valor tendrán que ser cambiados para usar el setter seguido del getter.

source: Cases where there are set_ATTR_on() and set_ATTR_off() methods will be changed to ATTR_on properties.
es_es: Los casos en los que haya métodos set_ATTR_on() y set_ATTR_off() se cambiarán por propiedades ATTR_on.

source: Examples
es_es: Ejemplos

source: Current implementation: ::
es_es: Implementación actual: ::

source: New implementation: ::
es_es: Nueva implementación: ::

source: axes.Axes.get_xlim/set_xlim and get_autoscalex_on/set_autoscalex_on
es_es: ejes.Ejes.get_xlim/set_xlim y get_autoscalex_on/set_autoscalex_on

source: Alternatives
es_es: Alternativas

source: Instead of using decorators, it is also possible to use the property function. This would change the procedure so that all getter methods that lack a prefix will need to be renamed or removed. This makes handling docstrings more difficult and harder to read.
es_es: En lugar de utilizar decoradores, también es posible utilizar la función de la propiedad. Esto cambiaría el procedimiento de manera que todos los métodos getter que carecen de prefijo deberán ser renombrados o eliminados. Esto hace que el manejo de las cadenas de documentación sea más difícil y complicado de leer.

source: It is not necessary to deprecate the setter and getter methods, but leaving them in will complicate the code.
es_es: No es necesario eliminar los métodos setter y getter, pero dejarlos complicará el código.

source: This could also serve as an opportunity to rewrite or even remove automatic alias generation.
es_es: Esto también podría servir como una oportunidad para reescribir o incluso eliminar la generación automática de alias.

source: Another alternate proposal:
es_es: Otra propuesta alternativa:

source: Convert ``set_xlim``, ``set_xlabel``, ``set_title``, etc. to ``xlim``, ``xlabel``, ``title``,... to make the transition from ``plt`` functions to ``axes`` methods significantly simpler. These would still be methods, not properties, but it's still a great usability enhancement while retaining the interface.
es_es: Convertir ``set_xlim``, ``set_xlabel``, ``set_title``, etc. en ``xlim``, ``xlabel``, ``title``,... para hacer la transición de las funciones ``plt`` a los métodos ``axes`` significativamente más sencilla. Estos seguirían siendo métodos, no propiedades, pero sigue siendo una gran mejora de usabilidad mientras se mantiene la interfaz.
