Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/MEP12.po
Languages: es_es

source: MEP12: Improve Gallery and Examples
es_es: MEP12: Mejorar la galería y los ejemplos

source: Status
es_es: Estado

source: **Progress**
es_es: **Progreso**

source: Initial changes added in 1.3. Conversion of the gallery is on-going. 29 September 2015 - The last ``pylab_examples`` where ``pylab`` is imported has been converted over to use :mod:`matplotlib.pyplot` and `numpy`.
es_es: Cambios iniciales añadidos en 1.3. La conversión de la galería está en curso. 29 de septiembre de 2015 - El último ``pylab_examples`` donde se importa ``pylab`` ha sido convertido para usar :mod:`matplotlib.pyplot` y `numpy`.

source: Branches and Pull requests
es_es: Ramas y Pull requests

source: PR `#2474 <https://github.com/matplotlib/matplotlib/pull/2474>`_ demonstrates a single example being cleaned up and moved to the appropriate section.
es_es: PR `#2474 <https://github.com/matplotlib/matplotlib/pull/2474>`_ demuestra que se ha limpiado un solo ejemplo y se ha movido a la sección apropiada.

source: Abstract
es_es: Resumen

source: Reorganizing the matplotlib plot gallery would greatly simplify navigation of the gallery. In addition, examples should be cleaned-up and simplified for clarity.
es_es: La reorganización de la galería de gráficos de matplotlib simplificaría enormemente la navegación por la galería. Además, los ejemplos deberían limpiarse y simplificarse para mayor claridad.

source: Detailed description
es_es: Descripción detallada

source: The matplotlib gallery was recently set up to split examples up into sections. As discussed in that PR [1]_, the current example sections (``api``, ``pylab_examples``) aren't terribly useful to users: New sections in the gallery would help users find relevant examples.
es_es: La galería de matplotlib se ha establecido recientemente para dividir los ejemplos en secciones. Como se discutió en ese PR [1]_, las secciones actuales de ejemplos (``api``, ``pylab_examples``) no son muy útiles para los usuarios: Nuevas secciones en la galería ayudarían a los usuarios a encontrar ejemplos relevantes.

source: These sections would also guide a cleanup of the examples: Initially, all the current examples would remain and be listed under their current directories. Over time, these examples could be cleaned up and moved into one of the new sections.
es_es: Estas secciones también guiarían una limpieza de los ejemplos: En un principio, todos los ejemplos actuales se mantendrían y figurarían en sus directorios actuales. Con el tiempo, estos ejemplos podrían limpiarse y trasladarse a una de las nuevas secciones.

source: This process allows users to easily identify examples that need to be cleaned up; i.e. anything in the ``api`` and ``pylab_examples`` directories.
es_es: Este proceso permite a los usuarios identificar fácilmente los ejemplos que necesitan ser limpiados; es decir, cualquier cosa en los directorios ``api`` y ``pylab_examples``.

source: Implementation
es_es: Implementación

source: Create new gallery sections. [Done]
es_es: Crear nuevas secciones de la galería. [Done]

source: Clean up examples and move them to the new gallery sections (over the course of many PRs and with the help of many users/developers). [In progress]
es_es: Limpiar los ejemplos y moverlos a las nuevas secciones de la galería (a lo largo de muchos PRs y con la ayuda de muchos usuarios/desarrolladores). [En curso]

source: Gallery sections
es_es: Secciones de la galería

source: The naming of sections is critical and will guide the clean-up effort. The current sections are:
es_es: La denominación de las secciones es fundamental y guiará el esfuerzo de limpieza. Las secciones actuales son:

source: Lines, bars, and markers (more-or-less 1D data)
es_es: Líneas, barras y marcadores (más o menos datos 1D)

source: Shapes and collections
es_es: Formas y colecciones

source: Statistical plots
es_es: Gráficos estadísticos

source: Images, contours, and fields
es_es: Imágenes, contornos y campos

source: Pie and polar charts: Round things
es_es: Gráficos circulares y polares: Cosas redondas

source: Text, labels, and annotations
es_es: Texto, etiquetas y anotaciones

source: Ticks and spines
es_es: Ticks y spines

source: Subplots, axes, and figures
es_es: Subgráficos, ejes y figuras

source: Specialty plots (e.g., sankey, radar, tornado)
es_es: Gráficos especiales (por ejemplo, sankey, radar, tornado)

source: Showcase (plots with tweaks to make them publication-quality)
es_es: Showcase (gráficos con retoques para hacerlos de calidad de publicación)

source: separate sections for toolboxes (already exists: 'mplot3d', 'axes_grid', 'units', 'widgets')
es_es: secciones separadas para las cajas de herramientas (ya existen: 'mplot3d', 'axes_grid', 'units', 'widgets')

source: These names are certainly up for debate. As these sections grow, we should reevaluate them and split them up as necessary.
es_es: Estos nombres son ciertamente discutibles. A medida que estas secciones crezcan, deberíamos reevaluarlas y dividirlas según sea necesario.

source: Clean up guidelines
es_es: Directrices de limpieza

source: The current examples in the ``api`` and ``pylab_examples`` sections of the gallery would remain in those directories until they are cleaned up. After clean-up, they would be moved to one of the new gallery sections described above. "Clean-up" should involve:
es_es: Los ejemplos actuales en las secciones ``api`` y ``pylab_examples`` de la galería permanecerían en esos directorios hasta que se limpien. Después de la limpieza, se trasladarían a una de las nuevas secciones de la galería descritas anteriormente. La "limpieza" debería implicar:

source: `sphinx-gallery docstrings <https://sphinx-gallery.readthedocs.io/en/latest/>`_: a title and a description of the example formatted as follows, at the top of the example::
es_es: `sphinx-gallery docstrings <https://sphinx-gallery.readthedocs.io/en/latest/>`_: un título y una descripción del ejemplo con el siguiente formato, en la parte superior del ejemplo::

source: PEP8_ clean-ups (running `flake8 <https://pypi.org/project/flake8/>`_, or a similar checker, is highly recommended)
es_es: Limpieza de PEP8_ (se recomienda ejecutar `flake8 <https://pypi.org/project/flake8/>`_, o un verificador similar)

source: Commented-out code should be removed.
es_es: El código comentado debe ser eliminado.

source: Replace uses of `pylab` interface with `.pyplot` (+ `numpy`, etc.). See `c25ef1e <https://github.com/tonysyu/matplotlib/commit/c25ef1e02b3a0ecb279492409dac0de9b3d2c0e2>`_
es_es: Reemplazar los usos de la interfaz `pylab` con `.pyplot` (+ `numpy`, etc.). Ver `c25ef1e <https://github.com/tonysyu/matplotlib/commit/c25ef1e02b3a0ecb279492409dac0de9b3d2c0e2>`_

source: Remove shebang line, e.g.:
es_es: Eliminar la línea de shebang, por ejemplo.:

source: Use consistent imports. In particular:
es_es: Utilizar importaciones coherentes. En particular:

source: import numpy as np
es_es: importar numpy como np

source: import matplotlib.pyplot as plt
es_es: importar matplotlib.pyplot como plt

source: Avoid importing specific functions from these modules (e.g. ``from numpy import sin``)
es_es: Evita importar funciones específicas de estos módulos (por ejemplo, ``from numpy import sin``)

source: Each example should focus on a specific feature (excluding ``showcase`` examples, which will show more "polished" plots). Tweaking unrelated to that feature should be removed. See `f7b2217 <https://github.com/tonysyu/matplotlib/commit/f7b2217a1f92343e8aca0684d19c9915cc2e8674>`_, `e57b5fc <https://github.com/tonysyu/matplotlib/commit/e57b5fc31fbad83ed9c43c77ef15368efdcb9ec1>`_, and `1458aa8 <https://github.com/tonysyu/matplotlib/commit/1458aa87c5eae9dd99e141956a6adf7a0f3c6707>`_
es_es: Cada ejemplo debe centrarse en una característica específica (excluyendo los ejemplos de ``showcase``, que mostrarán gráficos más "pulidos"). Los ajustes que no estén relacionados con esa característica deben ser eliminados. Ver `f7b2217 <https://github.com/tonysyu/matplotlib/commit/f7b2217a1f92343e8aca0684d19c9915cc2e8674>`_, `e57b5fc <https://github.com/tonysyu/matplotlib/commit/e57b5fc31fbad83ed9c43c77ef15368efdcb9ec1>`_, y `1458aa8 <https://github.com/tonysyu/matplotlib/commit/1458aa87c5eae9dd99e141956a6adf7a0f3c6707>`_

source: Use of `pylab` should be demonstrated/discussed on a dedicated help page instead of the gallery examples.
es_es: El uso de `pylab` debería ser demostrado/discutido en una página de ayuda dedicada en lugar de los ejemplos de la galería.

source: **Note:** When moving an existing example, you should search for references to that example. For example, the API documentation for :file:`axes.py` and :file:`pyplot.py` may use these examples to generate plots. Use your favorite search tool (e.g., grep, ack, `grin <https://pypi.org/project/grin/>`_, `pss <https://pypi.org/project/pss/>`_) to search the matplotlib package. See `2dc9a46 <https://github.com/tonysyu/matplotlib/commit/2dc9a4651e5e566afc0866c603aa8d06aaf32b71>`_ and `aa6b410 <https://github.com/tonysyu/matplotlib/commit/aa6b410f9fa085ccf5f4f962a6f26af5beeae7af>`_
es_es: **Nota:** Cuando se mueve un ejemplo existente, se deben buscar referencias a ese ejemplo. Por ejemplo, la documentación de la API para :file:`axes.py` y :file:`pyplot.py` puede utilizar estos ejemplos para generar gráficos. Utiliza tu herramienta de búsqueda favorita (por ejemplo, grep, ack, `grin <https://pypi.org/project/grin/>`_, `pss <https://pypi.org/project/pss/>`_) para buscar en el paquete matplotlib. Ver `2dc9a46 <https://github.com/tonysyu/matplotlib/commit/2dc9a4651e5e566afc0866c603aa8d06aaf32b71>`_ y `aa6b410 <https://github.com/tonysyu/matplotlib/commit/aa6b410f9fa085ccf5f4f962a6f26af5beeae7af>`_

source: Additional suggestions
es_es: Sugerencias adicionales

source: Provide links (both ways) between examples and API docs for the methods/objects used. (issue `#2222 <https://github.com/matplotlib/matplotlib/issues/2222>`_)
es_es: Proporcionar enlaces (en ambos sentidos) entre los ejemplos y los documentos de la API para los métodos/objetos utilizados. (incidencia `#2222 <https://github.com/matplotlib/matplotlib/issues/2222>`_)

source: Use ``plt.subplots`` (note trailing "s") in preference over ``plt.subplot``.
es_es: Utiliza ``plt.subplots`` (ten en cuenta la "s" final) en lugar de ``plt.subplot``.

source: Rename the example to clarify it's purpose. For example, the most basic demo of ``imshow`` might be ``imshow_demo.py``, and one demonstrating different interpolation settings would be ``imshow_demo_interpolation.py`` (*not* ``imshow_demo2.py``).
es_es: Cambia el nombre del ejemplo para aclarar su propósito. Por ejemplo, la demostración más básica de ``imshow`` podría ser ``imshow_demo.py``, y una que demuestre diferentes ajustes de interpolación sería ``imshow_demo_interpolation.py`` (*no* ``imshow_demo2.py``).

source: Split up examples that try to do too much. See `5099675 <https://github.com/tonysyu/matplotlib/commit/509967518ce5ce5ba31edf12486ffaa344e748f2>`_ and `fc2ab07 <https://github.com/tonysyu/matplotlib/commit/fc2ab07cc586abba4c024d8c0d841c4357a3936f>`_
es_es: Dividir los ejemplos que intentan hacer demasiado. Ver `5099675 <https://github.com/tonysyu/matplotlib/commit/509967518ce5ce5ba31edf12486ffaa344e748f2>`_ y `fc2ab07 <https://github.com/tonysyu/matplotlib/commit/fc2ab07cc586abba4c024d8c0d841c4357a3936f>`_

source: Delete examples that don't show anything new.
es_es: Elimina los ejemplos que no muestren nada nuevo.

source: Some examples exercise esoteric features for unit testing. These tweaks should be moved out of the gallery to an example in the ``unit`` directory located in the root directory of the package.
es_es: Algunos ejemplos ejercitan características esotéricas para las pruebas unitarias. Estos ajustes deben ser trasladados fuera de la galería a un ejemplo en el directorio ``unit`` ubicado en el directorio raíz del paquete.

source: Add plot titles to clarify intent of the example. See `bd2b13c <https://github.com/tonysyu/matplotlib/commit/bd2b13c54bf4aa2058781b9a805d68f2feab5ba5>`_
es_es: Añadir los títulos de los gráficos para aclarar la intención del ejemplo. Ver `bd2b13c <https://github.com/tonysyu/matplotlib/commit/bd2b13c54bf4aa2058781b9a805d68f2feab5ba5>`_

source: Backward compatibility
es_es: Compatibilidad con versiones anteriores

source: The website for each Matplotlib version is readily accessible, so users who want to refer to old examples can still do so.
es_es: El sitio web de cada versión de Matplotlib es fácilmente accesible, por lo que los usuarios que quieran consultar ejemplos antiguos pueden seguir haciéndolo.

source: Alternatives
es_es: Alternativas

source: Tags
es_es: Etiquetas

source: Tagging examples will also help users search the example gallery. Although tags would be a big win for users with specific goals, the plot gallery will remain the entry point to these examples, and sections could really help users navigate the gallery. Thus, tags are complementary to this reorganization.
es_es: Etiquetar los ejemplos también ayudará a los usuarios a buscar en la galería de ejemplos. Aunque las etiquetas serían una gran ventaja para los usuarios con objetivos específicos, la galería de gráficos seguirá siendo el punto de entrada a estos ejemplos, y las secciones podrían ayudar mucho a los usuarios a navegar por la galería. Así pues, las etiquetas son complementarias a esta reorganización.
