Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/MEP14.po
Languages: es_es

source: The mathtext code has backend-specific code -- it should instead provide its output as just another text engine. However, it's still desirable to have mathtext layout inserted as part of a larger layout performed by another text engine, so it should be possible to do this. It's an open question whether embedding the text layout of an arbitrary text engine in another should be possible.
es_es: El código de mathtext tiene un código específico de backend -- en su lugar debería proporcionar su salida como otro motor de texto. Sin embargo, sigue siendo deseable que el diseño de mathtext se inserte como parte de un diseño mayor realizado por otro motor de texto, por lo que debería ser posible hacerlo. Es una cuestión abierta si el embedding del layout de texto de un motor de texto arbitrario en otro debería ser posible.

source: The text mode is currently set by a global rcParam ("text.usetex") so it's either all on or all off. We should continue to have a global rcParam to choose the text engine ("text.layout_engine"), but it should under the hood be an overridable property on the `.Text` object, so the same figure can combine the results of multiple text layout engines if necessary.
es_es: El modo de texto se establece actualmente mediante un rcParam global ("text.usetex"), de modo que está todo activado o todo desactivado. Deberíamos seguir teniendo un rcParam global para elegir el motor de texto ("text.layout_engine"), pero debería ser una propiedad anulable en el objeto `.Text`, para que la misma figura pueda combinar los resultados de múltiples motores de diseño de texto si es necesario.

source: Implementation
es_es: Implementación

source: A concept of a "text engine" will be introduced. Each text engine will implement a number of abstract classes. The ``TextFont`` interface will represent text for a given set of font properties. It isn't necessarily limited to a single font file -- if the layout engine supports rich text, it may handle a number of font files in a family. Given a ``TextFont`` instance, the user can get a ``TextLayout`` instance, which represents the layout for a given string of text in a given font. From a ``TextLayout``, an iterator over ``TextSpan``\ s is returned so the engine can output raw editable text using as few spans as possible. If the engine would rather get individual characters, they can be obtained from the ``TextSpan`` instance::
es_es: Se introducirá el concepto de "motor de texto". Cada motor de texto implementará una serie de clases abstractas. La interfaz ``TextFont`` representará el texto para un conjunto dado de propiedades de fuentes. No está necesariamente limitada a un único archivo de fuentes - si el motor de diseño soporta texto enriquecido, puede manejar varios archivos de fuentes en una familia. Dada una instancia de ``TextFont``, el usuario puede obtener una instancia de ``TextLayout``, que representa el layout para una cadena de texto dada en una fuente determinada. A partir de un ``TextLayout``, se devuelve un iterador sobre ``TextSpan`` para que el motor pueda producir texto editable en bruto utilizando el menor número posible de espacios. Si el motor prefiere obtener caracteres individuales, pueden obtenerse de la instancia ``TextSpan``::

source: Graphic backends that want to output subset of fonts would likely build up a file-global dictionary of characters where the keys are (fontname, glyph_id) and the values are the paths so that only one copy of the path for each character will be stored in the file.
es_es: Los backends gráficos que quieran dar salida a un subconjunto de fuentes probablemente construirán un diccionario global de caracteres en el que las claves sean (fontname, glyph_id) y los valores sean las rutas, de modo que sólo se almacene en el archivo una copia de la ruta para cada carácter.

source: Special casing: The "usetex" functionality currently is able to get Postscript directly from TeX to insert directly in a Postscript file, but for other backends, parses a DVI file and generates something more abstract. For a case like this, ``TextLayout`` would implement ``get_spans`` for most backends, but add ``get_ps`` for the Postscript backend, which would look for the presence of this method and use it if available, or fall back to ``get_spans``. This kind of special casing may also be necessary, for example, when the graphics backend and text engine belong to the same ecosystem, e.g. Cairo and Pango, or MacOSX and CoreText.
es_es: Casos especiales: La funcionalidad "usetex" actualmente es capaz de obtener Postscript directamente de TeX para insertarlo directamente en un archivo Postscript, pero para otros backends, analiza un archivo DVI y genera algo más abstracto. Para un caso como este, ``TextLayout`` implementaría ``get_spans`` para la mayoría de los backends, pero añadiría ``get_ps`` para el backend Postscript, que buscaría la presencia de este método y lo usaría si está disponible, o volvería a ``get_spans``. Este tipo de casing especial también puede ser necesario, por ejemplo, cuando el backend gráfico y el motor de texto pertenecen al mismo ecosistema, por ejemplo, Cairo y Pango, o MacOSX y CoreText.

source: There are three main pieces to the implementation:
es_es: Hay tres piezas principales en la aplicación:

source: Rewriting the freetype wrapper, and removing ttconv.
es_es: Reescribiendo la envoltura de freetype y eliminando ttconv.

source: Once (1) is done, as a proof of concept, we can move to the upstream STIX .otf fonts
es_es: Una vez hecho (1), como prueba de concepto, podemos pasar a las fuentes STIX .otf de la fuente superior

source: Add support for web fonts loaded from a remote URL. (Enabled by using freetype for font subsetting).
es_es: Añade soporte para fuentes web cargadas desde una URL remota. (Habilitado mediante el uso de freetype para el subconjunto de fuentes).

source: Refactoring the existing "builtin" and "usetex" code into separate text engines and to follow the API outlined above.
es_es: Refactorizar el código existente de "builtin" y "usetex" para convertirlos en motores de texto separados y seguir la API descrita anteriormente.

source: Implementing support for advanced text layout libraries.
es_es: Implementación de la compatibilidad con las bibliotecas de layout de texto avanzado.

source: (1) and (2) are fairly independent, though having (1) done first will allow (2) to be simpler. (3) is dependent on (1) and (2), but even if it doesn't get done (or is postponed), completing (1) and (2) will make it easier to move forward with improving the "builtin" text engine.
es_es: (1) y (2) son bastante independientes, aunque si (1) se hace primero, (2) será más sencillo. (3) depende de (1) y (2), pero incluso si no se hace (o se pospone), completar (1) y (2) hará más fácil avanzar en la mejora del motor de texto "builtin".

source: Backward compatibility
es_es: Compatibilidad con versiones anteriores

source: The layout of text with respect to its anchor and rotation will change in hopefully small, but improved, ways. The layout of multiline text will be much better, as it will respect horizontal alignment. The layout of bidirectional text or other advanced Unicode features will now work inherently, which may break some things if users are currently using their own workarounds.
es_es: La disposición del texto con respecto a su anclaje y su rotación cambiará de forma pequeña, pero mejorada. La disposición del texto multilínea será mucho mejor, ya que respetará la alineación horizontal. La disposición del texto bidireccional u otras características avanzadas de Unicode funcionarán ahora de forma inherente, lo que puede romper algunas cosas si los usuarios están utilizando actualmente sus propias soluciones.

source: Fonts will be selected differently. Hacks that used to sort of work between the "builtin" and "usetex" text rendering engines may no longer work. Fonts found by the OS that weren't previously found by matplotlib may be selected.
es_es: Las fuentes se seleccionarán de forma diferente. Los trucos que solían funcionar entre los motores de renderizado de texto "builtin" y "usetex" pueden dejar de funcionar. Las fuentes encontradas por el sistema operativo que no fueron encontradas previamente por matplotlib pueden ser seleccionadas.

source: Alternatives
es_es: Alternativas
