Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/MEP11.po
Languages: es_es

source: MEP11: Third-party dependencies
es_es: MEP11: Dependencias de terceros

source: This MEP attempts to improve the way in which third-party dependencies in matplotlib are handled.
es_es: Este MEP intenta mejorar la forma en que se manejan las dependencias de terceros en matplotlib.

source: Status
es_es: Estado

source: **Completed** -- needs to be merged
es_es: **Completado** -- necesita ser fusionado

source: Branches and Pull requests
es_es: Ramas y Pull requests

source: #1157: Use automatic dependency resolution
es_es: #1157: Utilizar la resolución automática de dependencias

source: #1261: Update six to 1.2
es_es: #1261: Actualizar seis a 1.2

source: Abstract
es_es: Resumen

source: One of the goals of matplotlib has been to keep it as easy to install as possible. To that end, some third-party dependencies are included in the source tree and, under certain circumstances, installed alongside matplotlib. This MEP aims to resolve some problems with that approach, bring some consistency, while continuing to make installation convenient.
es_es: Uno de los objetivos de matplotlib ha sido mantenerlo tan fácil de instalar como sea posible. Para ello, algunas dependencias de terceros se incluyen en el árbol de fuentes y, en determinadas circunstancias, se instalan junto a matplotlib. Este MEP tiene como objetivo resolver algunos problemas con ese enfoque, traer un poco de consistencia, mientras que continúa haciendo la instalación conveniente.

source: At the time that was initially done, setuptools_, easy_install_ and PyPI_ were not mature enough to be relied on. However, at present, we should be able to safely leverage the "modern" versions of those tools, distribute_ and pip_.
es_es: En el momento en que se hizo inicialmente, setuptools_, easy_install_ y PyPI_ no estaban lo suficientemente maduros como para confiar en ellos. Sin embargo, en la actualidad, deberíamos poder aprovechar con seguridad las versiones "modernas" de esas herramientas, distribute_ y pip_.

source: While matplotlib has dependencies on both Python libraries and C/C++ libraries, this MEP addresses only the Python libraries so as to not confuse the issue. C libraries represent a larger and mostly orthogonal set of problems.
es_es: Aunque matplotlib tiene dependencias tanto de las bibliotecas Python como de las bibliotecas C/C++, este MEP aborda sólo las bibliotecas Python para no confundir el tema. Las bibliotecas C representan un conjunto de problemas más amplio y mayormente ortogonal.

source: Detailed description
es_es: Descripción detallada

source: matplotlib depends on the following third-party Python libraries:
es_es: matplotlib depende de las siguientes bibliotecas de Python de terceros:

source: dateutil (pure Python)
es_es: dateutil (Python puro)

source: pytz (pure Python)
es_es: pytz (Python puro)

source: six -- required by dateutil (pure Python)
es_es: seis -- requerido por dateutil (Python puro)

source: pyparsing (pure Python)
es_es: pyparsing (Python puro)

source: PIL (optional)
es_es: PIL (opcional)

source: GUI frameworks: pygtk, gobject, tkinter, PySide, PyQt4, wx (all optional, but one is required for an interactive GUI)
es_es: Frameworks de IGU: pygtk, gobject, tkinter, PySide, PyQt4, wx (todos opcionales, pero uno es necesario para una IGU interactiva)

source: Current behavior
es_es: Comportamiento actual

source: When installing from source, a :program:`git` checkout or pip_:
es_es: Cuando se instala desde el código fuente, se requiere un checkout :program:`git` o pip_:

source: :file:`setup.py` attempts to ``import numpy``. If this fails, the installation fails.
es_es: :file:`setup.py` intenta ``importar numpy``. Si esto falla, la instalación falla.

source: For each of dateutil_, pytz_ and six_, :file:`setup.py` attempts to import them (from the top-level namespace). If that fails, matplotlib installs its local copy of the library into the top-level namespace.
es_es: Para cada uno de dateutil_, pytz_ y six_, :file:`setup.py` intenta importarlos (desde el espacio de nombres de nivel superior). Si esto falla, matplotlib instala su copia local de la biblioteca en el espacio de nombres de nivel superior.

source: pyparsing_ is always installed inside of the matplotlib namespace.
es_es: pyparsing_ se instala siempre dentro del espacio de nombres de matplotlib.

source: This behavior is most surprising when used with pip_, because no pip_ dependency resolution is performed, even though it is likely to work for all of these packages.
es_es: Este comportamiento es más sorprendente cuando se utiliza con pip_, porque no se realiza ninguna resolución de dependencia de pip_, aunque es probable que funcione para todos estos paquetes.

source: The fact that pyparsing_ is installed in the matplotlib namespace has reportedly (#1290) confused some users into thinking it is a matplotlib-related module and import it from there rather than the top-level.
es_es: El hecho de que pyparsing_ esté instalado en el espacio de nombres de matplotlib ha confundido, según se informa (#1290), a algunos usuarios para que piensen que se trata de un módulo relacionado con matplotlib y lo importen desde allí en lugar de hacerlo desde el nivel superior.

source: When installing using the Windows installer, dateutil_, pytz_ and six_ are installed at the top-level *always*, potentially overwriting already installed copies of those libraries.
es_es: Cuando se instala con el instalador de Windows, dateutil_, pytz_ y six_ se instalan en el nivel superior *siempre*, sobrescribiendo potencialmente las copias ya instaladas de esas bibliotecas.

source: TODO: Describe behavior with the OS-X installer.
es_es: TODO: Describe el comportamiento con el instalador de OS-X.

source: When installing using a package manager (Debian, RedHat, MacPorts etc.), this behavior actually does the right thing, and there are no special patches in the matplotlib packages to deal with the fact that we handle dateutil_, pytz_ and six_ in this way. However, care should be taken that whatever approach we move to continues to work in that context.
es_es: Cuando se instala usando un gestor de paquetes (Debian, RedHat, MacPorts, etc.), este comportamiento realmente hace lo correcto, y no hay parches especiales en los paquetes de matplotlib para tratar el hecho de que manejemos dateutil_, pytz_ y six_ de esta manera. Sin embargo, hay que tener cuidado de que cualquier enfoque que cambiemos siga funcionando en ese contexto.

source: Maintaining these packages in the matplotlib tree and making sure they are up-to-date is a maintenance burden. Advanced new features that may require a third-party pure Python library have a higher barrier to inclusion because of this burden.
es_es: Mantener estos paquetes en el árbol de matplotlib y asegurarse de que están actualizados es una carga de mantenimiento. Las nuevas características avanzadas que pueden requerir una biblioteca de Python pura de terceros tienen una mayor barrera de inclusión debido a esta carga.

source: Desired behavior
es_es: Comportamiento deseado

source: Third-party dependencies are downloaded and installed from their canonical locations by leveraging pip_, distribute_ and PyPI_.
es_es: Las dependencias de terceros se descargan e instalan desde sus ubicaciones canónicas aprovechando pip_, distribute_ y PyPI_.

source: dateutil_, pytz_, and pyparsing_ should be made into optional dependencies -- though obviously some features would fail if they aren't installed. This will allow the user to decide whether they want to bother installing a particular feature.
es_es: dateutil_, pytz_ y pyparsing_ deberían convertirse en dependencias opcionales, aunque obviamente algunas funciones fallarían si no se instalan. Esto permitirá al usuario decidir si quiere molestarse en instalar una característica en particular.

source: Implementation
es_es: Implementación

source: For installing from source, and assuming the user has all of the C-level compilers and dependencies, this can be accomplished fairly easily using distribute_ and following the instructions `here <https://pypi.org/project/distribute/>`_. The only anticipated change to the matplotlib library code will be to import pyparsing_ from the top-level namespace rather than from within matplotlib. Note that distribute_ will also allow us to remove the direct dependency on six_, since it is, strictly speaking, only a direct dependency of dateutil_.
es_es: Para instalar desde el código fuente, y asumiendo que el usuario tiene todos los compiladores y dependencias a nivel de C, esto se puede lograr con bastante facilidad usando distribute_ y siguiendo las instrucciones `aquí <https://pypi.org/project/distribute/>`_. El único cambio previsto en el código de la biblioteca matplotlib será importar pyparsing_ desde el espacio de nombres de nivel superior en lugar de hacerlo desde matplotlib. Tenga en cuenta que distribute_ también nos permitirá eliminar la dependencia directa de six_, ya que, estrictamente hablando, sólo es una dependencia directa de dateutil_.

source: For binary installations, there are a number of alternatives (here ordered from best/hardest to worst/easiest):
es_es: Para las instalaciones binarias, hay varias alternativas (aquí ordenadas de la mejor/más difícil a la peor/más fácil):

source: The distutils wininst installer allows a post-install script to run. It might be possible to get this script to run pip_ to install the other dependencies. (See `this thread <http://grokbase.com/t/python/distutils-sig/109bdnfhp4/distutils-ann-setuptools-post-install-script-for-bdist-wininst>`_ for someone who has trod that ground before).
es_es: El instalador wininst de distutils permite ejecutar un script post-instalación. Podría ser posible hacer que este script ejecute pip_ para instalar las otras dependencias. (Ver `este hilo <http://grokbase.com/t/python/distutils-sig/109bdnfhp4/distutils-ann-setuptools-post-install-script-for-bdist-wininst>`_ para alguien que ha pisado ese terreno antes).

source: Continue to ship dateutil_, pytz_, six_ and pyparsing_ in our installer, but use the post-install-script to install them *only* if they can not already be found.
es_es: Continúa enviando dateutil_, pytz_, six_ y pyparsing_ en nuestro instalador, pero utiliza el script post-instalación para instalarlos *sólo* si no se encuentran ya.

source: Move all of these packages inside a (new) ``matplotlib.extern`` namespace so it is clear for outside users that these are external packages. Add some conditional imports in the core matplotlib codebase so dateutil_ (at the top-level) is tried first, and failing that ``matplotlib.extern.dateutil`` is used.
es_es: Mover todos estos paquetes dentro de un (nuevo) espacio de nombres ``matplotlib.extern`` para que quede claro para los usuarios externos que se trata de paquetes externos. Añadir algunas importaciones condicionales en el código base de matplotlib para que dateutil_ (en el nivel superior) se intente primero, y en su defecto se utilice ``matplotlib.extern.dateutil``.

source: 2 and 3 are undesirable as they still require maintaining copies of these packages in our tree -- and this is exacerbated by the fact that they are used less -- only in the binary installers. None of these 3 approaches address Numpy, which will still have to be manually installed using an installer.
es_es: 2 y 3 son indeseables ya que todavía requieren mantener copias de estos paquetes en nuestro árbol -- y esto se agrava por el hecho de que se utilizan menos -- sólo en los instaladores binarios. Ninguno de estos 3 enfoques aborda Numpy, que todavía tendrá que ser instalado manualmente usando un instalador.

source: TODO: How does this relate to the Mac OS-X installer?
es_es: TODO: ¿Cómo se relaciona esto con el instalador de Mac OS-X?

source: Backward compatibility
es_es: Compatibilidad con versiones anteriores

source: At present, matplotlib can be installed from source on a machine without the third party dependencies and without an internet connection. After this change, an internet connection (and a working PyPI) will be required to install matplotlib for the first time. (Subsequent matplotlib updates or development work will run without accessing the network).
es_es: Actualmente, matplotlib puede instalarse desde el código fuente en una máquina sin las dependencias de terceros y sin conexión a Internet. Después de este cambio, se requerirá una conexión a Internet (y una PyPI en funcionamiento) para instalar matplotlib por primera vez. (Las actualizaciones posteriores de matplotlib o el trabajo de desarrollo se ejecutarán sin acceder a la red).

source: Alternatives
es_es: Alternativas

source: Distributing binary eggs doesn't feel like a usable solution. That requires getting easy_install_ installed first, and Windows users generally prefer the well known ``.exe`` or ``.msi`` installer that works out of the box.
es_es: Distribuir eggs binarios no parece una solución utilizable. Eso requiere tener easy_install_ instalado primero, y los usuarios de Windows generalmente prefieren el conocido instalador ``.exe`` o ``.msi`` que funciona fuera de la caja.
