Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/MEP19.po
Languages: es_es

source: MEP19: Continuous Integration
es_es: MEP19: Integración continua

source: Status
es_es: Estado

source: **Completed**
es_es: **Completado**

source: Branches and Pull requests
es_es: Ramas y Pull requests

source: Abstract
es_es: Resumen

source: matplotlib could benefit from better and more reliable continuous integration, both for testing and building installers and documentation.
es_es: matplotlib podría beneficiarse de una integración continua mejor y más fiable, tanto para las pruebas como para la construcción de instaladores y documentación.

source: Detailed description
es_es: Descripción detallada

source: Current state-of-the-art
es_es: Estado actual de la técnica

source: **Testing**
es_es: **Prueba**

source: matplotlib currently uses Travis-CI for automated tests. While Travis-CI should be praised for how much it does as a free service, it has a number of shortcomings:
es_es: matplotlib utiliza actualmente Travis-CI para las pruebas automatizadas. Aunque hay que alabar a Travis-CI por lo mucho que hace como servicio gratuito, tiene una serie de deficiencias:

source: It often fails due to network timeouts when installing dependencies.
es_es: A menudo falla debido a los tiempos de espera de la red al instalar las dependencias.

source: It often fails for inexplicable reasons.
es_es: A menudo fracasa por razones inexplicables.

source: build or test products can only be saved from build off of branches on the main repo, not pull requests, so it is often difficult to "post mortem" analyse what went wrong. This is particularly frustrating when the failure can not be subsequently reproduced locally.
es_es: los productos de construcción o de prueba sólo pueden guardarse a partir de las ramas del repositorio principal, no de los pull requests, por lo que a menudo es difícil analizar "post mortem" lo que ha ido mal. Esto es especialmente frustrante cuando el fallo no puede reproducirse posteriormente a nivel local.

source: It is not extremely fast. matplotlib's cpu and memory requirements for testing are much higher than the average Python project.
es_es: No es extremadamente rápido. Los requisitos de cpu y memoria de matplotlib para las pruebas son mucho más altos que los del proyecto promedio de Python.

source: It only tests on Ubuntu Linux, and we have only minimal control over the specifics of the platform. It can be upgraded at any time outside of our control, causing unexpected delays at times that may not be convenient in our release schedule.
es_es: Sólo se prueba en Ubuntu Linux, y sólo tenemos un control mínimo sobre los detalles de la plataforma. Puede actualizarse en cualquier momento fuera de nuestro control, causando retrasos inesperados en momentos que pueden no ser convenientes en nuestro calendario de lanzamientos.

source: On the plus side, Travis-CI's integration with github -- automatically testing all pending pull requests -- is exceptional.
es_es: En el lado positivo, la integración de Travis-CI con github - que prueba automáticamente todos los pull request pendientes - es excepcional.

source: **Builds**
es_es: **Construcción**

source: There is no centralized effort for automated binary builds for matplotlib. However, the following disparate things are being done [If the authors mentioned here could fill in detail, that would be great!]:
es_es: No existe un esfuerzo centralizado para la construcción binaria automatizada de matplotlib. Sin embargo, se están haciendo las siguientes cosas dispares [Si los autores mencionados aquí pueden dar detalles, ¡sería genial!]:

source: @sandrotosi: builds Debian packages
es_es: @sandrotosi: construye paquetes de Debian

source: @takluyver: Has automated Ubuntu builds on Launchpad
es_es: @takluyver: Ha automatizado las construcciones de Ubuntu en Launchpad

source: @cgohlke: Makes Windows builds (don't know how automated that is)
es_es: @cgohlke: Hace compilaciones de Windows (no sé qué tan automatizado está)

source: @r-owen: Makes OS-X builds (don't know how automated that is)
es_es: @r-owen: Hace compilaciones para OS-X (no sé cómo está automatizado)

source: **Documentation**
es_es: **Documentación**

source: Documentation of master is now built by travis and uploaded to https://matplotlib.org/devdocs/index.html
es_es: La documentación del master está ahora construida por travis y subida a https://matplotlib.org/devdocs/index.html

source: @NelleV, I believe, generates the docs automatically and posts them on the web to chart MEP10 progress.
es_es: Creo que @NelleV genera los documentos automáticamente y los cuelga en la web para registrar el progreso de MEP10.

source: Peculiarities of matplotlib
es_es: Peculiedades de matplotlib

source: matplotlib has complex requirements that make testing and building more taxing than many other Python projects.
es_es: matplotlib tiene requisitos complejos que hacen que las pruebas y la construcción sean más exigentes que muchos otros proyectos de Python.

source: The CPU time to run the tests is quite high. It puts us beyond the free accounts of many CI services (e.g. ShiningPanda)
es_es: El tiempo de CPU para ejecutar las pruebas es bastante alto. Nos sitúa por encima de las cuentas gratuitas de muchos servicios de CI (por ejemplo, ShiningPanda)

source: It has a large number of dependencies, and testing the full matrix of all combinations is impractical. We need to be clever about what space we test and guarantee to support.
es_es: Tiene un gran número de dependencias, y probar la matriz completa de todas las combinaciones es poco práctico. Tenemos que ser inteligentes en cuanto al espacio que probamos y garantizar el soporte.

source: Requirements
es_es: Requisitos

source: This section outlines the requirements that we would like to have.
es_es: En esta sección se exponen los requisitos que nos gustaría tener.

source: Testing all pull requests by hooking into the GitHub API, as Travis-CI does
es_es: Comprobación de todas los pull requests conectándose a la API de GitHub, como hace Travis-CI

source: Testing on all major platforms: Linux, Mac OS-X, MS Windows (in that order of priority, based on user survey)
es_es: Pruebas en las principales plataformas: Linux, Mac OS-X, MS Windows (en ese orden de prioridad, según la encuesta de usuarios)

source: Retain the last n days worth of build and test products, to aid in post-mortem debugging.
es_es: Conserve los productos de construcción y prueba de los últimos n días, para ayudar a la depuración post-mortem.

source: Automated nightly binary builds, so that users can test the bleeding edge without installing a complete compilation environment.
es_es: Construcciones binarias nocturnas automatizadas, para que los usuarios puedan probar el arista sin necesidad de instalar un entorno de compilación completo.

source: Automated benchmarking. It would be nice to have a standard benchmark suite (separate from the tests) whose performance could be tracked over time, in different backends and platforms. While this is separate from building and testing, ideally it would run on the same infrastructure.
es_es: Análisis comparativo automatizado. Estaría bien disponer de un conjunto de pruebas estándar (independiente de las pruebas) cuyo rendimiento pudiera seguirse a lo largo del tiempo, en diferentes backends y plataformas. Aunque esto es independiente de la construcción y las pruebas, lo ideal sería que se ejecutara en la misma infraestructura.

source: Automated nightly building and publishing of documentation (or as part of testing, to ensure PRs don't introduce documentation bugs). (This would not replace the static documentation for stable releases as a default).
es_es: Construcción y publicación nocturna automatizada de la documentación (o como parte de las pruebas, para asegurar que los PRs no introduzcan errores en la documentación). (Esto no sustituiría a la documentación estática de las versiones estables por defecto).

source: The test systems should be manageable by multiple developers, so that no single person becomes a bottleneck. (Travis-CI's design does this well -- storing build configuration in the git repository, rather than elsewhere, is a very good design.)
es_es: Los sistemas de prueba deben ser manejados por múltiples desarrolladores, de manera que ninguna persona se convierta en un cuello de botella. (El diseño de Travis-CI hace esto bien - almacenar la configuración de la construcción en el repositorio git, en lugar de en otro lugar, es un muy buen diseño.)

source: Make it easy to test a large but sparse matrix of different versions of matplotlib's dependencies. The matplotlib user survey provides some good data as to where to focus our efforts: https://docs.google.com/spreadsheets/d/1jbK0J4cIkyBNncnS-gP7pINSliNy9lI-N4JHwxlNSXE/edit
es_es: Facilitar la prueba de una matriz grande pero dispersa de diferentes versiones de las dependencias de matplotlib. La encuesta de usuarios de matplotlib proporciona algunos buenos datos sobre dónde centrar nuestros esfuerzos: https://docs.google.com/spreadsheets/d/1jbK0J4cIkyBNncnS-gP7pINSliNy9lI-N4JHwxlNSXE/edit

source: Nice to have: A decentralized design so that those with more obscure platforms can publish build results to a central dashboard.
es_es: Es bueno tenerlo: Un diseño descentralizado para que aquellos con plataformas más oscuras puedan publicar los resultados de la construcción en un tablero central.

source: Implementation
es_es: Implementación

source: This part is yet-to-be-written.
es_es: Esta parte todavía está por escribir.

source: However, ideally, the implementation would be a third-party service, to avoid adding system administration to our already stretched time. As we have some donated funds, this service may be a paid one if it offers significant time-saving advantages over free offerings.
es_es: Sin embargo, lo ideal sería que la implementación fuera un servicio de terceros, para evitar añadir la administración del sistema a nuestro ya escaso tiempo. Como tenemos algunos fondos donados, este servicio puede ser de pago si ofrece ventajas significativas de ahorro de tiempo respecto a las ofertas gratuitas.

source: Backward compatibility
es_es: Compatibilidad con versiones anteriores

source: Backward compatibility is not a major concern for this MEP. We will replace current tools and procedures with something better and throw out the old.
es_es: La compatibilidad con las versiones anteriores no es una preocupación importante para este MEP. Sustituiremos las herramientas y procedimientos actuales por algo mejor y desecharemos lo antiguo.

source: Alternatives
es_es: Alternativas

source: Hangout Notes
es_es: Notas del Hangout

source: CI Infrastructure
es_es: Infraestructura CI

source: We like Travis and it will probably remain part of our arsenal in any event. The reliability issues are being looked into.
es_es: Nos gusta Travis y probablemente seguirá formando parte de nuestro arsenal en cualquier caso. Las incidencias de fiabilidad se están estudiando.

source: Enable Amazon S3 uploads of testing products on Travis. This will help with post-mortem of failures (@mdboom is looking into this now).
es_es: Habilitar las subidas a Amazon S3 de los productos de prueba en Travis. Esto ayudará con el post-mortem de los fracasos (@mdboom está investigando esto ahora).

source: We want Mac coverage. The best bet is probably to push Travis to enable it for our project by paying them for a Pro account (since they don't otherwise allow testing on both Linux and Mac).
es_es: Queremos cobertura para Mac. La mejor opción es probablemente presionar a Travis para que lo habilite para nuestro proyecto pagándoles una cuenta Pro (ya que de otra manera no permiten hacer pruebas tanto en Linux como en Mac).

source: We want Windows coverage. Shining Panda is an option there.
es_es: Queremos la cobertura de Windows. Shining Panda es una opción allí.

source: Investigate finding or building a tool that would collect and synthesize test results from a number of sources and post it to GitHub using the GitHub API. This may be of general use to the Scipy community.
es_es: Investigar la posibilidad de encontrar o construir una herramienta que recoja y sintetice los resultados de las pruebas de una serie de fuentes y los publique en GitHub utilizando la API de GitHub. Esto puede ser de uso general para la comunidad Scipy.

source: For both Windows and Mac, we should document (or better yet, script) the process of setting up the machine for a build, and how to build binaries and installers. This may require getting information from Russel Owen and Christoph Gohlke. This is a necessary step for doing automated builds, but would also be valuable for a number of other reasons.
es_es: Tanto para Windows como para Mac, deberíamos documentar (o mejor aún, hacer un script) el proceso de configuración de la máquina para una compilación, y cómo construir binarios e instaladores. Esto puede requerir obtener información de Russel Owen y Christoph Gohlke. Este es un paso necesario para hacer construcciones automatizadas, pero también sería valioso por una serie de otras razones.

source: The test framework itself
es_es: El propio marco de pruebas

source: We should investigate ways to make it take less time
es_es: Deberíamos investigar formas de hacer que se tarde menos tiempo

source: Eliminating redundant tests, if possible
es_es: Eliminar las pruebas redundantes, si es posible

source: General performance improvements to matplotlib will help
es_es: Las mejoras generales de rendimiento de matplotlib ayudarán

source: We should be covering more things, particularly more backends
es_es: Deberíamos cubrir más cosas, en particular más backends

source: We should have more unit tests, fewer integration tests, if possible
es_es: Deberíamos tener más pruebas unitarias y menos pruebas de integración, si es posible
