Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/MEP21.po
Languages: es_es

source: MEP21: color and cm refactor
es_es: MEP21: refactorización de colores y cm

source: Status
es_es: Estado

source: **Discussion**: This MEP has not commenced yet, but here are some ongoing ideas which may become a part of this MEP:
es_es: **Discusión**: Este MEP aún no ha comenzado, pero aquí hay algunas ideas en curso que pueden formar parte de este MEP:

source: Branches and Pull requests
es_es: Ramas y Pull requests

source: Abstract
es_es: Resumen

source: tidy up the namespace
es_es: ordenar el espacio de nombres

source: Define a "Color" class
es_es: Definir una clase "Color"

source: make it easy to convert from one color type to another ```hex -> RGB```, ```RGB -> hex```, ```HSV -> RGB``` etc.
es_es: facilitan la conversión de un tipo de color a otro ``hex -> RGB``, ``RGB -> hex``, ``HSV -> RGB`` etc.

source: improve the construction of a colormap - the dictionary approach is archaic and overly complex (though incredibly powerful)
es_es: mejorar la construcción de un mapa de colores: el enfoque del diccionario es arcaico y demasiado complejo (aunque increíblemente potente)

source: make it possible to interpolate between two or more color types in different modes, especially useful for construction of colormaps in HSV space for instance
es_es: hacen posible la interpolación entre dos o más tipos de color en diferentes modos, especialmente útil para la construcción de mapas de color en el espacio HSV, por ejemplo

source: rename the module to something more descriptive - mappables?
es_es: cambiar el nombre del módulo a algo más descriptivo - ¿mapables?

source: Overall, there are a lot of improvements that can be made with matplotlib color handling - managing backwards compatibility will be difficult as there are some badly named variables/modules which really shouldn't exist - but a clear path and message for migration should be available, with a large amount of focus on this in the API changes documentation.
es_es: En general, hay un montón de mejoras que se pueden hacer con el manejo del color de matplotlib - la gestión de la compatibilidad con versiones anteriores será difícil ya que hay algunas variables/módulos mal nombrados que realmente no deberían existir - pero un camino claro y un mensaje para la migración debe estar disponible, con una gran cantidad de enfoque en esto en la documentación de los cambios de la API.

source: Detailed description
es_es: Descripción detallada

source: Implementation
es_es: Implementación

source: Backward compatibility
es_es: Compatibilidad con versiones anteriores

source: Alternatives
es_es: Alternativas
