Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/MEP28.po
Languages: es_es

source: But Option Two lets a user write a completely custom stat function (e.g., ``my_box_stats``) with fancy BCA confidence intervals and the whiskers set differently depending on some attribute of the data.
es_es: Pero la Opción Dos permite al usuario escribir una función de estadísticas completamente personalizada (por ejemplo, ``my_box_stats``) con extravagantes intervalos de confianza BCA y los bigotes establecidos de forma diferente dependiendo de algún atributo de los datos.

source: This is available under the current API:
es_es: Esto está disponible en la actual API:

source: And would be more concise with Option Two
es_es: Y sería más conciso con la opción dos

source: Users could also pass their own function to compute the stats:
es_es: Los usuarios también pueden pasar su propia función para calcular las estadísticas:

source: From the examples above, Option Two seems to have only marginal benefit, but in the context of downstream libraries like seaborn, its advantage is more apparent as the following would be possible without any patches to seaborn:
es_es: A partir de los ejemplos anteriores, la opción dos parece tener sólo un beneficio marginal, pero en el contexto de las bibliotecas descendentes como seaborn, su ventaja es más evidente, ya que lo siguiente sería posible sin ningún parche para seaborn:

source: This type of flexibility was the intention behind splitting the overall boxplot API in the current three functions. In practice however, downstream libraries like seaborn support versions of matplotlib dating back well before the split. Thus, adding just a bit more flexibility to the ``Axes.boxplot`` could expose all the functionality to users of the downstream libraries with modern matplotlib installation without intervention from the downstream library maintainers.
es_es: Este tipo de flexibilidad fue la intención detrás de la división de la API gráfico de caja general en las tres funciones actuales. Sin embargo, en la práctica, bibliotecas como seaborn soportan versiones de matplotlib que se remontan a mucho antes de la división. Por lo tanto, añadir un poco más de flexibilidad a ``Axes.boxplot`` podría exponer toda la funcionalidad a los usuarios de las bibliotecas posteriores con una instalación moderna de matplotlib sin la intervención de los mantenedores de las bibliotecas posteriores.

source: Doing less
es_es: Hacer menos

source: Another obvious alternative would be to omit the added pre- and post- computation transform functionality in ``cbook.boxplot_stats`` and ``Axes.boxplot``, and simply remove the redundant statistical and style parameters as described above.
es_es: Otra alternativa obvia sería omitir la funcionalidad añadida de transformación antes y después del cálculo en ``cbook.boxplot_stats`` y ``Axes.boxplot``, y simplemente eliminar los parámetros estadísticos y de estilo redundantes como se ha descrito anteriormente.

source: Doing nothing
es_es: No hacer nada

source: As with many things in life, doing nothing is an option here. This means we simply advocate for users and downstream libraries to take advantage of the split between ``cbook.boxplot_stats`` and ``Axes.bxp`` and let them decide how to provide an interface to that.
es_es: Como con muchas cosas en la vida, no hacer nada es una opción aquí. Esto significa que simplemente abogamos por que los usuarios y las bibliotecas posteriores aprovechen la división entre ``cbook.boxplot_stats`` y ``Axes.bxp`` y dejen que ellos decidan cómo proporcionar una interfaz para ello.
