Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/MEP25.po
Languages: es_es

source: MEP25: Serialization
es_es: MEP25: Serialización

source: Status
es_es: Estado

source: **Rejected**
es_es: **Rechazado**

source: This work is important, but this particular effort has stalled.
es_es: Este trabajo es importante, pero este esfuerzo en particular se ha estancado.

source: Branches and Pull requests
es_es: Ramas y Pull requests

source: development branches:
es_es: ramas de desarrollo:

source: related pull requests:
es_es: relacionados con los pull requests:

source: Abstract
es_es: Resumen

source: This MEP aims at adding a serializable ``Controller`` objects to act as an ``Artist`` managers. Users would then communicate changes to an ``Artist`` via a ``Controller``. In this way, functionality of the ``Controller`` objects may be added incrementally since each ``Artist`` is still responsible for drawing everything. The goal is to create an API that is usable both by graphing libraries requiring high-level descriptions of figures and libraries requiring low-level interpretations.
es_es: Este MEP pretende añadir un objeto ``Controlador`` serializable para que actúe como un gestor de ``Artists``. Los usuarios comunicarían los cambios a un ``Artist`` a través de un ``Controlador``. De esta manera, la funcionalidad de los objetos ``Controller`` puede ser añadida de forma incremental ya que cada ``Artista`` sigue siendo responsable de dibujar todo. El objetivo es crear una API que pueda ser utilizada tanto por las bibliotecas de gráficos que requieren descripciones de alto nivel de las figuras como por las bibliotecas que requieren interpretaciones de bajo nivel.

source: Detailed description
es_es: Descripción detallada

source: Matplotlib is a core plotting engine with an API that many users already understand. It's difficult/impossible for other graphing libraries to (1) get a complete figure description, (2) output raw data from the figure object as the user has provided it, (3) understand the semantics of the figure objects without heuristics, and (4) give matplotlib a complete figure description to visualize. In addition, because an ``Artist`` has no conception of its own semantics within the figure, it's difficult to interact with them in a natural way.
es_es: Matplotlib es un motor de trazado básico con una API que muchos usuarios ya entienden. Es difícil/imposible para otraslibrerías de gráficos (1) obtener una descripción completa de la figura, (2) dar salida a los datos en bruto del objeto figura tal y como el usuario los ha proporcionado, (3) entender la semántica de los objetos figura sin heurística, y (4) dar a matplotlib una descripción completa de la figura para visualizarla. Además, debido a que un ``Artist`` no tiene una concepción de su propia semántica dentro de la figura, es difícil interactuar con ellos de forma natural.

source: In this sense, matplotlib will adopt a standard Model-View-Controller (MVC) framework. The *Model* will be the user defined data, style, and semantics. The *Views* are the ensemble of each individual ``Artist``, which are responsible for producing the final image based on the *model*. The *Controller* will be the ``Controller`` object managing its set of ``Artist`` objects.
es_es: En este sentido, matplotlib adoptará unframework estándar de Modelo-Vista-Controlador (MVC). El *Modelo* serán los datos, el estilo y la semántica definidos por el usuario. Las *Vistas* son el conjunto de cada ``Artist`` individual, que son responsables de producir la imagen final basada en el *modelo*. El *Controlador* será el objeto ``Controller`` que gestiona su conjunto de objetos ``Artists``.

source: The ``Controller`` must be able to export the information that it's carrying about the figure on command, perhaps via a ``to_json`` method or similar. Because it would be extremely extraneous to duplicate all of the information in the model with the controller, only user-specified information (data + style) are explicitly kept. If a user wants more information (defaults) from the view/model, it should be able to query for it.
es_es: El ``Controlador`` debe ser capaz de exportar la información que lleva sobre la figura en el comando, tal vez a través de un método ``to_json`` o similar. Debido a que sería extremadamente extraño duplicar toda la información del modelo con el controlador, sólo se guarda explícitamente la información especificada por el usuario (datos + estilo). Si un usuario quiere más información (por defecto) de la vista/modelo, debería poder consultarla.

source: This might be annoying to do, non-specified kwargs are pulled from the rcParams object which is in turn created from reading a user specified file and can be dynamically changed at run time. I suppose we could keep a dict of default defaults and compare against that. Not clear how this will interact with the style sheet [[MEP26]] - @tacaswell
es_es: Esto podría ser molesto de hacer, los kwargs no especificados se extraen del objeto rcParams que a su vez se crea a partir de la lectura de un archivo especificado por el usuario y puede ser cambiado dinámicamente en tiempo de ejecución. Supongo que podríamos mantener un dictado de valores por defecto y comparar con eso. No está claro cómo va a interactuar esto con la hoja de estilo [[MEP26]] - @tacaswell

source: Additional Notes:
es_es: Notas adicionales:

source: The "raw data" does not necessarily need to be a ``list``, ``ndarray``, etc. Rather, it can more abstractly just have a method to yield data when needed.
es_es: Los "datos brutos" no tienen que ser necesariamente una ``lista``, ``ndarray``, etc. En lugar de ello, puede ser más abstracto tener un método para obtener los datos cuando sea necesario.

source: Because the ``Controller`` will contain extra information that users may not want to keep around, it should *not* be created by default. You should be able to both (a) instantiate a ``Controller`` with a figure and (b) build a figure with a ``Controller``.
es_es: Debido a que el ``Controlador`` contendrá información extra que los usuarios no querrán mantener, no debería ser creado por defecto. Deberías ser capaz de (a) instanciar un ``Controlador`` con una figura y (b) construir una figura con un ``Controlador``.

source: Use Cases:
es_es: Casos de Uso:

source: Export all necessary informat
es_es: Exporta toda la información necesaria

source: Serializing a matplotlib figure, saving it, and being able to rerun later.
es_es: Serializar una figura de matplotlib, guardarla y poder volver a ejecutarla más tarde.

source: Any other source sending an appropriately formatted representation to matplotlib to open
es_es: Cualquier otra fuente que envíe una representación con el formato adecuado a matplotlib para abrir

source: Examples
es_es: Ejemplos

source: Here are some examples of what the controllers should be able to do.
es_es: Estos son algunos ejemplos de lo que deberían poder hacer los controladores.

source: Instantiate a matplotlib figure from a serialized representation (e.g., JSON): ::
es_es: Instanciar una figura de matplotlib a partir de una representación serializada (por ejemplo, JSON): ::

source: Manage artists from the controller (e.g., Line2D): ::
es_es: Gestionar artists desde el controlador (por ejemplo, Line2D): ::

source: Export serializable figure representation: ::
es_es: Exportación de la representación de la figura serializable: ::

source: Implementation
es_es: Implementación

source: Create base ``Controller`` objects that are able to manage ``Artist`` objects (e.g., ``Hist``)
es_es: Crear objetos base ``Controller`` que sean capaces de gestionar objetos ``Artists`` (por ejemplo, ``Hist``)

source: Comments:
es_es: Comentarios:

source: initialization should happen via unpacking ``**``, so we need a copy of call signature parameter for the ``Artist`` we're ultimately trying to control. Unfortunate hard-coded repetition...
es_es: la inicialización debe ocurrir a través de la descomposición de ``**``, por lo que necesitamos una copia del parámetro de la firma de la llamada para el ``Artist`` que en última instancia estamos tratando de controlar. Desafortunada repetición de código duro...

source: should the additional ``**kwargs`` accepted by each ``Artist`` be tracked at the ``Controller``
es_es: ¿los ``kwargs`` adicionales aceptados por cada ``Artist`` deben ser rastreados en el ``Controlador``?

source: how does a ``Controller`` know which artist belongs where? E.g., do we need to pass ``axes`` references?
es_es: ¿Cómo sabe un ``Controlador`` qué artist pertenece a qué lugar? Por ejemplo, ¿hay que pasar referencias a los ``ejes``?

source: Progress:
es_es: Progreso:

source: A simple NB demonstrating some functionality for ``Line2DController`` objects: https://nbviewer.jupyter.org/gist/theengineear/f0aa8d79f64325e767c0
es_es: Un simple NB que demuestra algunas funcionalidades de los objetos ``Line2DController``: https://nbviewer.jupyter.org/gist/theengineear/f0aa8d79f64325e767c0

source: Write in protocols for the ``Controller`` to *update* the model.
es_es: Escribir en protocolos para el ``Controlador`` para *actualizar* el modelo.

source: how should containers be dealt with? E.g., what happens to old patches when we re-bin a histogram?
es_es: ¿Cómo deben tratarse los contenedores? Por ejemplo, ¿qué ocurre con los parches antiguos cuando volvemos a incluir un histograma?

source: in the link from (1), the old line is completely destroyed and redrawn, what if something is referencing it?
es_es: en el enlace de (1), la línea antigua está completamente destruida y redibujada, ¿qué pasa si algo hace referencia a ella?

source: Create method by which a json object can be assembled from the ``Controllers``
es_es: Método de creación mediante el cual se puede ensamblar un objeto json a partir de los ``Controladores``

source: Deal with serializing the unserializable aspects of a figure (e.g., non-affine transforms?)
es_es: Tratar la serialización de los aspectos no serializables de una figura (por ejemplo, las transformaciones no afines...)

source: Be able to instantiate from a serialized representation
es_es: Ser capaz de instanciar desde una representación serializada

source: Reimplement the existing pyplot and Axes method, e.g. ``pyplot.hist`` and ``Axes.hist`` in terms of the new controller class.
es_es: Reimplementar el método pyplot y Axes existente, por ejemplo ``pyplot.hist`` y ``Axes.hist`` en términos de la nueva clase de controlador.

source: > @theengineer: in #2 above, what do you mean by *get updates* from each ``Artist``?
es_es: > @theengineer: en el #2 anterior, ¿qué quieres decir con *obtener actualizaciones* de cada ``Artist``?

source: ^ Yup. The ``Controller`` *shouldn't* need to get updated. This just happens in #3. Delete comments when you see this.
es_es: Sí. El ``Controlador`` *no debería* tener que actualizarse. Esto sólo ocurre en el #3. Borra los comentarios cuando veas esto.

source: Backward compatibility
es_es: Compatibilidad con versiones anteriores

source: pickling will change
es_es: la serialización cambiará

source: non-affine transformations will require a defined pickling method
es_es: las transformaciones no afines requerirán un método de serialización definido

source: Alternatives
es_es: Alternativas

source: PR #3150 suggested adding semantics by parasitically attaching extra containers to axes objects. This is a more complete solution with what should be a more developed/flexible/powerful framework.
es_es: El PR #3150 sugirió añadir semántica adjuntando parásitamente contenedores extra a los objetos de los ejes. Esta es una solución más completa con lo que debería ser un framework más desarrollado/flexible/potente.
