Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/MEP29.po
Languages: es_es

source: MEP29: Text light markup
es_es: MEP29: Marcado de la luz del texto

source: Status
es_es: Estado

source: Discussion
es_es: Discusión

source: Branches and Pull requests
es_es: Ramas y Pull requests

source: None at the moment, proof of concept only.
es_es: Por el momento, sólo una prueba de concepto.

source: Abstract
es_es: Resumen

source: This MEP proposes to add lightweight markup to the text artist.
es_es: Este MEP propone añadir marcas ligeras al artist del texto.

source: Detailed description
es_es: Descripción detallada

source: Using different size/color/family in a text annotation is difficult because the `~.Axes.text` method accepts argument for size/color/family/weight/etc. that are used for the whole text. But, if one wants, for example, to have different colors, one has to look at the gallery where one such example is provided: :doc:`/gallery/text_labels_and_annotations/rainbow_text`
es_es: Utilizar diferentes tamaños/colores/familias en una anotación de texto es difícil porque el método `~.Axes.text` acepta argumentos para el tamaño/color/familia/peso/etc. que se utilizan para todo el texto. Pero, si uno quiere, por ejemplo, tener diferentes colores, hay que mirar la galería donde se proporciona un ejemplo de este tipo: :doc:`/gallery/text_labels_and_annotations/rainbow_text`

source: This example takes a list of strings as well as a list of colors which makes it cumbersome to use. An alternative would be to use a restricted set of pango_-like markup and to interpret this markup.
es_es: Este ejemplo toma una lista de cadenas así como una lista de colores, lo que hace que su uso sea engorroso. Una alternativa sería utilizar un conjunto restringido de marcas tipo pango_ e interpretar estas marcas.

source: Some markup examples::
es_es: Algunos ejemplos de marcado::

source: Implementation
es_es: Implementación

source: A proof of concept is provided in `markup_example.py <https://github.com/rougier/matplotlib/blob/markup/examples/text_labels_and_annotations/markup.py>`_ but it currently only handles the horizontal direction.
es_es: Se proporciona una prueba de concepto en `markup_example.py <https://github.com/rougier/matplotlib/blob/markup/examples/text_labels_and_annotations/markup.py>`_ pero actualmente sólo maneja la dirección horizontal.

source: Improvements
es_es: Mejoras

source: This proof of concept uses regex to parse the text but it may be better to use the html.parser from the standard library.
es_es: Esta prueba de concepto utiliza regex para analizar el texto, pero puede ser mejor utilizar el html.parser de la biblioteca estándar.

source: Computation of text fragment positions could benefit from the OffsetFrom class. See for example item 5 in `Using Complex Coordinates with Annotations <https://matplotlib.org/devdocs/tutorials/text/annotations.html#using-complex-coordinates-with-annotations>`_
es_es: El cálculo de las posiciones de los fragmentos de texto podría beneficiarse de la clase OffsetFrom. Ver, por ejemplo, el punto 5 en `Usar coordenadas complejas con anotaciones <https://matplotlib.org/devdocs/tutorials/text/annotations.html#using-complex-coordinates-with-annotations>`_

source: Problems
es_es: Problemas

source: One serious problem is how to deal with text having both LaTeX and HTML-like tags. For example, consider the following::
es_es: Un problema grave es cómo tratar el texto que tiene etiquetas de tipo LaTeX y HTML. Por ejemplo, considere lo siguiente::

source: Recommendation would be to have mutual exclusion.
es_es: La recomendación sería tener una exclusión mutua.

source: Backward compatibility
es_es: Compatibilidad con versiones anteriores

source: None at the moment since it is only a proof of concept
es_es: Ninguno por el momento, ya que es sólo una prueba de concepto

source: Alternatives
es_es: Alternativas

source: As proposed by @anntzer, this could be also implemented as improvements to mathtext. For example::
es_es: Como propone @anntzer, esto también podría implementarse como mejoras en mathtext. Por ejemplo::
