Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/MEP23.po
Languages: es_es

source: MEP23: Multiple Figures per GUI window
es_es: MEP23: Múltiples Figuras por ventana de IGU

source: Status
es_es: Estado

source: **Discussion**
es_es: **Discusión**

source: Branches and Pull requests
es_es: Ramas y Pull requests

source: **Previous work** - https://github.com/matplotlib/matplotlib/pull/2465 **To-delete**
es_es: **Trabajo anterior** - https://github.com/matplotlib/matplotlib/pull/2465 **To-delete**

source: Abstract
es_es: Resumen

source: Add the possibility to have multiple figures grouped under the same `~.backend_template.FigureManager`
es_es: Añadir la posibilidad de tener múltiples figuras agrupadas bajo el mismo `~.backend_template.FigureManager`

source: Detailed description
es_es: Descripción detallada

source: Under the current structure, every canvas has its own window.
es_es: En la estructura actual, cada lienzo tiene su propia ventana.

source: This is and may continue to be the desired method of operation for most use cases.
es_es: Este es y puede seguir siendo el método de funcionamiento deseado para la mayoría de los casos de uso.

source: Sometimes when there are too many figures open at the same time, it is desirable to be able to group these under the same window [see](https://github.com/matplotlib/matplotlib/issues/2194).
es_es: A veces, cuando hay demasiadas figuras abiertas al mismo tiempo, es deseable poder agruparlas bajo la misma ventana [see] (https://github.com/matplotlib/matplotlib/issues/2194).

source: The proposed solution modifies `.FigureManagerBase` to contain and manage more than one ``Canvas``. The settings parameter :rc:`backend.multifigure` control when the **MultiFigure** behaviour is desired.
es_es: La solución propuesta modifica `.FigureManagerBase` para contener y gestionar más de un ``Canvas``. El parámetro de configuración :rc:`backend.multifigure` controla cuando se desea el comportamiento **MultiFigure**.

source: **Note**
es_es: **Nota**

source: It is important to note, that the proposed solution, assumes that the [MEP22](https://github.com/matplotlib/matplotlib/wiki/Mep22) is already in place. This is simply because the actual implementation of the ``Toolbar`` makes it pretty hard to switch between canvases.
es_es: Es importante señalar, que la solución propuesta, asume que el [MEP22](https://github.com/matplotlib/matplotlib/wiki/Mep22) ya está en su lugar. Esto es simplemente porque la implementación actual de la ``Barra de Herramientas`` hace que sea bastante difícil cambiar entre lienzos.

source: Implementation
es_es: Implementación

source: The first implementation will be done in GTK3 using a Notebook as canvas container.
es_es: La primera implementación se hará en GTK3 utilizando un Notebook como contenedor del lienzo.

source: will add the following new methods
es_es: añadirá los siguientes nuevos métodos

source: ``add_canvas``: To add a canvas to an existing `~.backend_template.FigureManager` object
es_es: ``add_canvas``: Para añadir un lienzo a un objeto existente `~.backend_template.FigureManager`

source: ``remove_canvas``: To remove a canvas from a `~.backend_template.FigureManager` object, if it is the last one, it will be destroyed
es_es: ``remove_canvas``: Para eliminar un lienzo de un objeto `~.backend_template.FigureManager`, si es el último, será destruido

source: ``move_canvas``: To move a canvas from one `~.backend_template.FigureManager` to another.
es_es: ``move_canvas``: Para mover un lienzo de un `~.backend_template.FigureManager` a otro.

source: ``set_canvas_title``: To change the title associated with a specific canvas container
es_es: ``set_canvas_title``: Para cambiar el título asociado a un contenedor de lienzo específico

source: ``get_canvas_title``: To get the title associated with a specific canvas container
es_es: ``get_canvas_title``: Para obtener el título asociado a un contenedor de lienzo específico

source: ``get_active_canvas``: To get the canvas that is in the foreground and is subject to the gui events. There is no ``set_active_canvas`` because the active canvas, is defined when ``show`` is called on a ``Canvas`` object.
es_es: ``get_active_canvas``: Para obtener el lienzo que está en primer plano y está sujeto a los eventos de igu. No hay ``set_active_canvas`` porque el lienzo activo, se define cuando se llama a ``show`` en un objeto ``Canvas``.

source: To control which `~.backend_template.FigureManager` will contain the new figures, an extra optional parameter *figuremanager* will be added, this parameter value will be passed to ``new_figure_manager_given_figure``.
es_es: Para controlar que `~.backend_template.FigureManager` contendrá las nuevas figuras, se añadirá un parámetro opcional extra *figuremanager*, el valor de este parámetro se pasará a ``new_figure_manager_given_figure``.

source: If *figuremanager* parameter is given, this `~.backend_template.FigureManager` object will be used instead of creating a new one.
es_es: Si se da el parámetro *figuremanager*, se utilizará este objeto `~.backend_template.FigureManager` en lugar de crear uno nuevo.

source: If ``rcParams['backend.multifigure']`` is True: The last `~.backend_template.FigureManager` object will be used instead of creating a new one.
es_es: Si ``rcParams['backend.multifigure']`` es True: Se utilizará el último objeto `~.backend_template.FigureManager` en lugar de crear uno nuevo.

source: Modifies the ``NavigationBase`` to keep a list of canvases, directing the actions to the active one.
es_es: Modifica la ``NavigationBase`` para mantener una lista de lienzos, dirigiendo las acciones al activo.

source: Backward compatibility
es_es: Compatibilidad con versiones anteriores

source: For the **MultiFigure** properties to be visible, the user has to activate them directly setting ``rcParams['backend.multifigure'] = True``
es_es: Para que las propiedades **MultiFigure** sean visibles, el usuario tiene que activarlas directamente estableciendo ``rcParams['backend.multifigure'] = True``

source: It should be backwards compatible for backends that adhere to the current `.FigureManagerBase` structure even if they have not implemented the **MultiFigure** magic yet.
es_es: Debería ser compatible con los backends que se adhieren a la estructura actual `.FigureManagerBase` incluso si no han implementado la magia **MultiFigure** todavía.

source: Alternatives
es_es: Alternativas

source: Instead of modifying the `.FigureManagerBase` it could be possible to add a parallel class, that handles the cases where ``rcParams['backend.multifigure'] = True``. This will warranty that there won't be any problems with custom made backends, but also makes bigger the code, and more things to maintain.
es_es: En lugar de modificar el `.FigureManagerBase` podría ser posible añadir una clase paralela, que maneje los casos en los que ``rcParams['backend.multifigure'] = True``. Esto garantizará que no habrá problemas con los backends hechos a medida, pero también hace más grande el código, y más cosas que mantener.
