Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/MEP28.po
Languages: es_es

source: MEP28: Remove Complexity from Axes.boxplot
es_es: MEP28: Eliminar la complejidad de Axes.boxplot

source: Status
es_es: Estado

source: **Discussion**
es_es: **Discusión**

source: Branches and Pull requests
es_es: Ramas y Pull requests

source: The following lists any open PRs or branches related to this MEP:
es_es: A continuación se enumeran los PRs o ramas abiertas relacionadas con este MEP:

source: Deprecate redundant statistical kwargs in ``Axes.boxplot``: https://github.com/phobson/matplotlib/tree/MEP28-initial-deprecations
es_es: Se han suprimido los kwargs estadísticos redundantes en ``Axes.boxplot``: https://github.com/phobson/matplotlib/tree/MEP28-initial-deprecations

source: Deprecate redundant style options in ``Axes.boxplot``: https://github.com/phobson/matplotlib/tree/MEP28-initial-deprecations
es_es: Se eliminan las opciones de estilo redundantes en ``Axes.boxplot``: https://github.com/phobson/matplotlib/tree/MEP28-initial-deprecations

source: Deprecate passings 2D NumPy arrays as input: None
es_es: Desaparece el paso de matrices 2D NumPy como entrada: Ninguno

source: Add pre- & post-processing options to ``cbook.boxplot_stats``: https://github.com/phobson/matplotlib/tree/boxplot-stat-transforms
es_es: Añadir opciones de pre y post-procesamiento a ``cbook.boxplot_stats``: https://github.com/phobson/matplotlib/tree/boxplot-stat-transforms

source: Exposing ``cbook.boxplot_stats`` through ``Axes.boxplot`` kwargs: None
es_es: Exponiendo ``cbook.boxplot_stats`` a través de ``Axes.boxplot`` kwargs: Ninguna

source: Remove redundant statistical kwargs in ``Axes.boxplot``: None
es_es: Eliminar los kwargs estadísticos redundantes en ``Axes.boxplot``: Ninguno

source: Remove redundant style options in ``Axes.boxplot``: None
es_es: Elimina las opciones de estilo redundantes en ``Axes.boxplot``: Ninguno

source: Remaining items that arise through discussion: None
es_es: Otros puntos que surgen en el debate: Ninguno

source: Abstract
es_es: Resumen

source: Over the past few releases, the ``Axes.boxplot`` method has grown in complexity to support fully customizable artist styling and statistical computation. This lead to ``Axes.boxplot`` being split off into multiple parts. The statistics needed to draw a boxplot are computed in ``cbook.boxplot_stats``, while the actual artists are drawn by ``Axes.bxp``. The original method, ``Axes.boxplot`` remains as the most public API that handles passing the user-supplied data to ``cbook.boxplot_stats``, feeding the results to ``Axes.bxp``, and pre-processing style information for each facet of the boxplot plots.
es_es: En las últimas versiones, el método ``Axes.boxplot`` ha crecido en complejidad para soportar un estilo de artist totalmente personalizable y un cálculo estadístico. Esto ha llevado a dividir ``Axes.boxplot`` en varias partes. Las estadísticas necesarias para dibujar un boxplot se calculan en ``cbook.boxplot_stats``, mientras que los artists reales son dibujados por ``Axes.bxp``. El método original, ``Axes.boxplot`` sigue siendo la API más pública que se encarga de pasar los datos suministrados por el usuario a ``cbook.boxplot_stats``, de alimentar los resultados a ``Axes.bxp``, y de preprocesar la información de estilo para cada faceta de los gráficos de caja.

source: This MEP will outline a path forward to rollback the added complexity and simplify the API while maintaining reasonable backwards compatibility.
es_es: Este MEP esbozará un camino a seguir para revertir la complejidad añadida y simplificar la API manteniendo una razonable Compatibilidad con versiones anteriores.

source: Detailed description
es_es: Descripción detallada

source: Currently, the ``Axes.boxplot`` method accepts parameters that allow the users to specify medians and confidence intervals for each box that will be drawn in the plot. These were provided so that avdanced users could provide statistics computed in a different fashion that the simple method provided by matplotlib. However, handling this input requires complex logic to make sure that the forms of the data structure match what needs to be drawn. At the moment, that logic contains 9 separate if/else statements nested up to 5 levels deep with a for loop, and may raise up to 2 errors. These parameters were added prior to the creation of the ``Axes.bxp`` method, which draws boxplots from a list of dictionaries containing the relevant statistics. Matplotlib also provides a function that computes these statistics via ``cbook.boxplot_stats``. Note that advanced users can now either a) write their own function to compute the stats required by ``Axes.bxp``, or b) modify the output returned by ``cbook.boxplots_stats`` to fully customize the position of the artists of the plots. With this flexibility, the parameters to manually specify only the medians and their confidences intervals remain for backwards compatibility.
es_es: Actualmente, el método ``Axes.boxplot`` acepta parámetros que permiten a los usuarios especificar medianas e intervalos de confianza para cada caja que se dibujará en el gráfico. Estos se proporcionaron para que los usuarios de avdanced pudieran proporcionar estadísticas calculadas de una manera diferente al método simple proporcionado por matplotlib. Sin embargo, el manejo de esta entrada requiere una lógica compleja para asegurarse de que las formas de la estructura de datos coinciden con lo que se necesita dibujar. Por el momento, esa lógica contiene 9 declaraciones if/else separadas anidadas hasta 5 niveles de profundidad con un bucle for, y puede generar hasta 2 errores. Estos parámetros se añadieron antes de la creación del método ``Axes.bxp``, que dibuja gráficos de caja a partir de una lista de diccionarios que contienen las estadísticas relevantes. Matplotlib también proporciona una función que calcula estas estadísticas a través de ``cbook.boxplot_stats``. Ten en cuenta que los usuarios avanzados pueden ahora a) escribir su propia función para calcular las estadísticas requeridas por ``Axes.bxp``, o b) modificar la salida devuelta por ``cbook.boxplots_stats`` para personalizar completamente la posición de los artists de los gráficos. Con esta flexibilidad, los parámetros para especificar manualmente sólo las medianas y sus intervalos de confianza permanecen para la compatibilidad con versiones anteriores.

source: Around the same time that the two roles of ``Axes.boxplot`` were split into ``cbook.boxplot_stats`` for computation and ``Axes.bxp`` for drawing, both ``Axes.boxplot`` and ``Axes.bxp`` were written to accept parameters that individually toggle the drawing of all components of the boxplots, and parameters that individually configure the style of those artists. However, to maintain backwards compatibility, the ``sym`` parameter (previously used to specify the symbol of the fliers) was retained. This parameter itself requires fairly complex logic to reconcile the ``sym`` parameters with the newer ``flierprops`` parameter at the default style specified by ``matplotlibrc``.
es_es: Más o menos al mismo tiempo que las dos funciones de ``Axes.boxplot`` se dividieron en ``cbook.boxplot_stats`` para el cálculo y ``Axes.bxp`` para el dibujo, tanto ``Axes.boxplot`` como ``Axes.bxp`` se escribieron para aceptar parámetros que conmutan individualmente el dibujo de todos los componentes de los gráficos de caja, y parámetros que configuran individualmente el estilo de esos artists. Sin embargo, para mantener la compatibilidad con versiones anteriores, se mantuvo el parámetro ``sym`` (que antes se utilizaba para especificar el símbolo de los volantes). Este parámetro en sí mismo requiere una lógica bastante compleja para reconciliar los parámetros ``sym`` con el parámetro más nuevo ``flierprops`` en el estilo por defecto especificado por ``matplotlibrc``.

source: This MEP seeks to dramatically simplify the creation of boxplots for novice and advanced users alike. Importantly, the changes proposed here will also be available to downstream packages like seaborn, as seaborn smartly allows users to pass arbitrary dictionaries of parameters through the seaborn API to the underlying matplotlib functions.
es_es: Este MEP busca simplificar drásticamente la creación degráfico de caja para usuarios principiantes y avanzados por igual. Es importante destacar que los cambios propuestos aquí también estarán disponibles para los paquetes posteriores como seaborn, ya que seaborn permite inteligentemente a los usuarios pasar diccionarios arbitrarios de parámetros a través de la API de seaborn a las funciones subyacentes de matplotlib.

source: This will be achieved in the following way:
es_es: Esto se logrará de la siguiente manera:

source: ``cbook.boxplot_stats`` will be modified to allow pre- and post- computation transformation functions to be passed in (e.g., ``np.log`` and ``np.exp`` for lognormally distributed data)
es_es: ``cbook.boxplot_stats`` se modificará para permitir que se pasen funciones de transformación antes y después del cálculo (por ejemplo, ``np.log`` y ``np.exp`` para datos distribuidos de forma lognormal)

source: ``Axes.boxplot`` will be modified to also accept and naïvely pass them to ``cbook.boxplots_stats`` (Alt: pass the stat function and a dict of its optional parameters).
es_es: ``Axes.boxplot`` será modificado para que también acepte y pase ingenuamente a ``cbook.boxplots_stats`` (Alt: pasar la función stat y un dict de sus parámetros opcionales).

source: Outdated parameters from ``Axes.boxplot`` will be deprecated and later removed.
es_es: Los parámetros obsoletos de ``Axes.boxplot`` serán obsoletos y posteriormente eliminados.

source: Importance
es_es: Importancia

source: Since the limits of the whiskers are computed arithmetically, there is an implicit assumption of normality in box and whisker plots. This primarily affects which data points are classified as outliers.
es_es: Dado que los límites de los bigotes se calculan aritméticamente, existe una suposición implícita de normalidad en los gráficos de caja y bigotes. Esto afecta principalmente a los puntos de datos que se clasifican como valores atípicos.

source: Allowing transformations to the data and the results used to draw boxplots will allow users to opt-out of that assumption if the data are known to not fit a normal distribution.
es_es: Permitir las transformaciones de los datos y los resultados utilizados para dibujar los gráficos de caja permitirá a los usuarios optar por no hacer esa suposición si se sabe que los datos no se ajustan a una distribución normal.

source: Below is an example of how ``Axes.boxplot`` classifies outliers of lognormal data differently depending one these types of transforms.
es_es: A continuación se muestra un ejemplo de cómo ``Axes.boxplot`` clasifica los valores atípicos de los datos lognormales de forma diferente dependiendo de estos tipos de transformaciones.

source: Implementation
es_es: Implementación

source: Passing transform functions to ``cbook.boxplots_stats``
es_es: Pasar funciones de transformación a ``cbook.boxplots_stats``

source: This MEP proposes that two parameters (e.g., ``transform_in`` and ``transform_out`` be added to the cookbook function that computes the statistics for the boxplot function. These will be optional keyword-only arguments and can easily be set to ``lambda x: x`` as a no-op when omitted by the user. The ``transform_in`` function will be applied to the data as the ``boxplot_stats`` function loops through each subset of the data passed to it. After the list of statistics dictionaries are computed the ``transform_out`` function is applied to each value in the dictionaries.
es_es: Este MEP propone que se añadan dos parámetros (por ejemplo, ``transform_in`` y ``transform_out`` a la función del libro de cocina que calcula las estadísticas para la función gráfico de caja. Estos serán argumentos opcionales de palabra clave y pueden ser fácilmente establecidos a ``lambda x: x`` como un no-op cuando es omitido por el usuario. La función ``transform_in`` se aplicará a los datos mientras la función ``boxplot_stats`` recorre cada subconjunto de datos que se le pasa. Después de la lista de diccionarios de estadísticas se calcula la función ``transform_out`` se aplica a cada valor en los diccionarios.

source: These transformations can then be added to the call signature of ``Axes.boxplot`` with little impact to that method's complexity. This is because they can be directly passed to ``cbook.boxplot_stats``. Alternatively, ``Axes.boxplot`` could be modified to accept an optional statistical function kwarg and a dictionary of parameters to be directly passed to it.
es_es: Estas transformaciones pueden añadirse a la firma de la llamada de ``Axes.boxplot`` con poco impacto en la complejidad de ese método. Esto se debe a que se pueden pasar directamente a ``cbook.boxplot_stats``. Como alternativa, ``Axes.boxplot`` podría modificarse para aceptar una función estadística opcional kwarg y un diccionario de parámetros que se le pasen directamente.

source: At this point in the implementation users and external libraries like seaborn would have complete control via the ``Axes.boxplot`` method. More importantly, at the very least, seaborn would require no changes to its API to allow users to take advantage of these new options.
es_es: En este punto de la implementación, los usuarios y las bibliotecas externas como seaborn tendrían un control completo a través del método ``Axes.boxplot``. Y lo que es más importante, al menos seaborn no necesitaría cambios en su API para permitir a los usuarios aprovechar estas nuevas opciones.

source: Simplifications to the ``Axes.boxplot`` API and other functions
es_es: Simplificación de la API ``Axes.boxplot`` y otras funciones

source: Simplifying the boxplot method consists primarily of deprecating and then removing the redundant parameters. Optionally, a next step would include rectifying minor terminological inconsistencies between ``Axes.boxplot`` and ``Axes.bxp``.
es_es: La simplificación del método boxplot consiste principalmente en desaprobar y luego eliminar los parámetros redundantes. Opcionalmente, un siguiente paso incluiría la rectificación de incoherencias terminológicas menores entre ``Axes.boxplot`` y ``Axes.bxp``.

source: The parameters to be deprecated and removed include:
es_es: Los parámetros que se van a obsoleto son los siguientes:

source: ``usermedians`` - processed by 10 SLOC, 3 ``if`` blocks, a ``for`` loop
es_es: ``usermedians`` - procesado por 10 SLOC, 3 bloques ``if``, un bucle ``for``

source: ``conf_intervals`` - handled by 15 SLOC, 6 ``if`` blocks, a ``for`` loop
es_es: ``conf_intervals`` - manejado por 15 SLOC, 6 bloques ``if``, un bucle ``for``

source: ``sym`` - processed by 12 SLOC, 4 ``if`` blocks
es_es: ``sym`` - procesado por 12 SLOC, 4 bloques ``if``

source: Removing the ``sym`` option allows all code in handling the remaining styling parameters to be moved to ``Axes.bxp``. This doesn't remove any complexity, but does reinforce the single responsibility principle among ``Axes.bxp``, ``cbook.boxplot_stats``, and ``Axes.boxplot``.
es_es: La eliminación de la opción ``sym`` permite que todo el código para el manejo de los restantes parámetros de estilo se traslade a ``Axes.bxp``. Esto no elimina ninguna complejidad, pero refuerza el principio de responsabilidad única entre ``Axes.bxp``, ``cbook.boxplot_stats`` y ``Axes.boxplot``.

source: Additionally, the ``notch`` parameter could be renamed ``shownotches`` to be consistent with ``Axes.bxp``. This kind of cleanup could be taken a step further and the ``whis``, ``bootstrap``, ``autorange`` could be rolled into the kwargs passed to the new ``statfxn`` parameter.
es_es: Además, el parámetro ``notch`` podría ser renombrado como ``shownotches`` para ser consistente con ``Axes.bxp``. Este tipo de limpieza podría llevarse a cabo un paso más allá y los parámetros ``whis``, ``bootstrap``, ``autorange`` podrían incluirse en los kwargs pasados al nuevo parámetro ``statfxn``.

source: Backward compatibility
es_es: Compatibilidad con versiones anteriores

source: Implementation of this MEP would eventually result in the backwards incompatible deprecation and then removal of the keyword parameters ``usermedians``, ``conf_intervals``, and ``sym``. Cursory searches on GitHub indicated that ``usermedians``, ``conf_intervals`` are used by few users, who all seem to have a very strong knowledge of matplotlib. A robust deprecation cycle should provide sufficient time for these users to migrate to a new API.
es_es: La implementación de este MEP resultaría eventualmente en la obsolescencia y posterior eliminación de los parámetros de palabra clave ``usermedians``, ``conf_intervals``, y ``sym``. Búsquedas rápidas en GitHub indican que ``usermedians``, ``conf_intervals`` son utilizados por pocos usuarios, que parecen tener un gran conocimiento de matplotlib. Un ciclo de obsolescencia robusta debería proporcionar suficiente tiempo para que estos usuarios migren a una nueva API.

source: Deprecation of ``sym`` however, may have a much broader reach into the matplotlib userbase.
es_es: Sin embargo, la obsolescencia de ``sym`` puede tener un alcance mucho más amplio en la base de usuarios de matplotlib.

source: Schedule
es_es: Planificación

source: An accelerated timeline could look like the following:
es_es: Un cronograma acelerado podría ser el siguiente:

source: v2.0.1 add transforms to ``cbook.boxplots_stats``, expose in ``Axes.boxplot``
es_es: v2.0.1 añade transformaciones a ``cbook.boxplots_stats``, expone en ``Axes.boxplot``

source: v2.1.0 Initial Deprecations , and using 2D NumPy arrays as input
es_es: v2.1.0 Obsolencias iniciales , y uso de arreglos 2D NumPy como entrada

source: Using 2D NumPy arrays as input. The semantics around 2D arrays are generally confusing.
es_es: Uso de arreglos 2D de NumPy como entrada. La semántica en torno a los arreglos 2D es generalmente confusa.

source: ``usermedians``, ``conf_intervals``, ``sym`` parameters
es_es: parámetros ``usermedians``, ``conf_intervals``, ``sym``

source: remove ``usermedians``, ``conf_intervals``, ``sym`` parameters
es_es: eliminar los parámetros ``usermedians``, ``conf_intervals``, ``sym``

source: deprecate ``notch`` in favor of ``shownotches`` to be consistent with other parameters and ``Axes.bxp``
es_es: dejar de lado ``notch`` en favor de ``shownotches`` para ser coherente con otros parámetros y ``Axes.bxp``

source: remove ``notch`` parameter
es_es: eliminar el parámetro ``notch``

source: move all style and artist toggling logic to ``Axes.bxp`` such ``Axes.boxplot`` is little more than a broker between ``Axes.bxp`` and ``cbook.boxplots_stats``
es_es: mover toda la lógica de estilo y de alternancia de artists a ``Axes.bxp`` tal ``Axes.boxplot`` es poco más que un intermediario entre ``Axes.bxp`` y ``cbook.boxplots_stats``

source: Anticipated Impacts to Users
es_es: Efectos previstos para los usuarios

source: As described above deprecating ``usermedians`` and ``conf_intervals`` will likely impact few users. Those who will be impacted are almost certainly advanced users who will be able to adapt to the change.
es_es: Tal y como se ha descrito anteriormente, la obsolencia de "usermedians" y "conf_intervals" probablemente afectará a pocos usuarios. Los que se verán afectados son, casi con toda seguridad, usuarios avanzados que podrán adaptarse al cambio.

source: Deprecating the ``sym`` option may import more users and effort should be taken to collect community feedback on this.
es_es: La eliminación de la opción ``sym`` podría importar a más usuarios y se debería hacer un esfuerzo para recoger la opinión de la comunidad al respecto.

source: Anticipated Impacts to Downstream Libraries
es_es: Impactos anticipados para bajar las bibliotecas

source: The source code (GitHub master as of 2016-10-17) was inspected for seaborn and python-ggplot to see if these changes would impact their use. None of the parameters nominated for removal in this MEP are used by seaborn. The seaborn APIs that use matplotlib's boxplot function allow user's to pass arbitrary ``**kwargs`` through to matplotlib's API. Thus seaborn users with modern matplotlib installations will be able to take full advantage of any new features added as a result of this MEP.
es_es: Se inspeccionó el código fuente (GitHub master a partir de 2016-10-17) de seaborn y python-ggplot para ver si estos cambios afectarían a su uso. Ninguno de los parámetros nominados para ser eliminados en este MEP son utilizados por seaborn. Las APIs de seaborn que utilizan la función gráfico de caja de matplotlib permiten al usuario pasar ``**kwargs`` arbitrarios a través de la API de matplotlib. Por lo tanto, los usuarios de seaborn con instalaciones modernas de matplotlib podrán aprovechar al máximo las nuevas características añadidas como resultado de este MEP.

source: Python-ggplot has implemented its own function to draw boxplots. Therefore, no impact can come to it as a result of implementing this MEP.
es_es: Python-ggplot ha implementado su propia función para dibujar gráficos de caja. Por lo tanto, la implementación de este MEP no puede tener ningún impacto.

source: Alternatives
es_es: Alternativas

source: Variations on the theme
es_es: Variaciones sobre el tema

source: This MEP can be divided into a few loosely coupled components:
es_es: Este MEP puede dividirse en algunos componentes poco acoplados:

source: Allowing pre- and post-computation transformation function in ``cbook.boxplot_stats``
es_es: Permitir la función de transformación antes y después del cálculo en ``cbook.boxplot_stats``

source: Exposing that transformation in the ``Axes.boxplot`` API
es_es: Exponer esa transformación en la API ``Axes.boxplot``

source: Removing redundant statistical options in ``Axes.boxplot``
es_es: Eliminación de opciones estadísticas redundantes en ``Axes.boxplot``

source: Shifting all styling parameter processing from ``Axes.boxplot`` to ``Axes.bxp``.
es_es: Cambio de todo el procesamiento de parámetros de estilo de ``Axes.boxplot`` a ``Axes.bxp``.

source: With this approach, #2 depends and #1, and #4 depends on #3.
es_es: Con este enfoque, #2 depende y #1, y #4 depende de #3.

source: There are two possible approaches to #2. The first and most direct would be to mirror the new ``transform_in`` and ``transform_out`` parameters of ``cbook.boxplot_stats`` in ``Axes.boxplot`` and pass them directly.
es_es: Hay dos enfoques posibles para el número #2. La primera y más directa sería reflejar los nuevos parámetros ``transform_in`` y ``transform_out`` de ``cbook.boxplot_stats`` en ``Axes.boxplot`` y pasarlos directamente.

source: The second approach would be to add ``statfxn`` and ``statfxn_args`` parameters to ``Axes.boxplot``. Under this implementation, the default value of ``statfxn`` would be ``cbook.boxplot_stats``, but users could pass their own function. Then ``transform_in`` and ``transform_out`` would then be passed as elements of the ``statfxn_args`` parameter.
es_es: El segundo enfoque sería añadir los parámetros ``statfxn`` y ``statfxn_args`` a ``Axes.boxplot``. Bajo esta implementación, el valor por defecto de ``statfxn`` sería ``cbook.boxplot_stats``, pero los usuarios podrían pasar su propia función. Entonces, ``transform_in`` y ``transform_out`` se pasarían como elementos del parámetro ``statfxn_args``.

source: Both cases would allow users to do the following:
es_es: Ambos casos permitirían a los usuarios hacer lo siguiente:
