Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/MEP/template.po
Languages: es_es

source: MEP Template
es_es: Plantilla de MEP

source: This MEP template is a guideline of the sections that a MEP should contain. Extra sections may be added if appropriate, and unnecessary sections may be noted as such.
es_es: Esta plantilla de MEP es una guía de las secciones que debe contener un MEP. Pueden añadirse secciones adicionales si se considera oportuno, y las secciones innecesarias pueden señalarse como tales.

source: Status
es_es: Estado

source: MEPs go through a number of phases in their lifetime:
es_es: Los MEP pasan por varias fases a lo largo de su vida:

source: **Discussion**: The MEP is being actively discussed on the mailing list and it is being improved by its author. The mailing list discussion of the MEP should include the MEP number (MEPxxx) in the subject line so they can be easily related to the MEP.
es_es: **Discusión**: El MEP está siendo discutido activamente en la lista de correo y está siendo mejorado por su autor. Las discusiones de la lista de correo sobre el MEP deben incluir el número del MEP (MEPxxx) en el asunto para que puedan relacionarse fácilmente con el MEP.

source: **Progress**: Consensus was reached and implementation work has begun.
es_es: **Progreso**: Se ha llegado a un consenso y se ha iniciado el trabajo de implementación.

source: **Completed**: The implementation has been merged into master.
es_es: **Completado**: La implementación ha sido fusionada en el master.

source: **Superseded**: This MEP has been abandoned in favor of another approach.
es_es: **Suprimido**: Este MEP ha sido abandonado en favor de otro enfoque.

source: **Rejected**: There are currently no plans to implement the proposal.
es_es: **Rechazada**: Actualmente no hay planes para aplicar la propuesta.

source: Branches and Pull requests
es_es: Ramas y Pull requests

source: All development branches containing work on this MEP should be linked to from here.
es_es: Todas las ramas de desarrollo que contengan trabajo en este MEP deben ser enlazadas desde aquí.

source: All pull requests submitted relating to this MEP should be linked to from here. (A MEP does not need to be implemented in a single pull request if it makes sense to implement it in discrete phases).
es_es: Todos los pull requests enviados relacionados con este MEP deben ser enlazados desde aquí. (No es necesario que un MEP se implemente en un único pull request si tiene sentido implementarlo en fases discretas).

source: Abstract
es_es: Resumen

source: The abstract should be a short description of what the MEP will achieve.
es_es: El resumen debe ser una breve descripción de lo que conseguirá el MEP.

source: Detailed description
es_es: Descripción detallada

source: This section describes the need for the MEP. It should describe the existing problem that it is trying to solve and why this MEP makes the situation better. It should include examples of how the new functionality would be used and perhaps some use cases.
es_es: Esta sección describe la necesidad del MEP. Debe describir el problema existente que intenta resolver y por qué este MEP mejora la situación. Debe incluir ejemplos de cómo se utilizaría la nueva funcionalidad y quizás algunos casos de uso.

source: Implementation
es_es: Implementación

source: This section lists the major steps required to implement the MEP. Where possible, it should be noted where one step is dependent on another, and which steps may be optionally omitted. Where it makes sense, each step should include a link related pull requests as the implementation progresses.
es_es: En esta sección se enumeran los principales pasos necesarios para implementar el MEP. En la medida de lo posible, debe señalarse dónde un paso depende de otro, y qué pasos pueden omitirse opcionalmente. Cuando tenga sentido, cada paso debe incluir un enlace relacionado con los pull requests a medida que avanza la implementación.

source: Backward compatibility
es_es: Compatibilidad con versiones anteriores

source: This section describes the ways in which the MEP breaks backward incompatibility.
es_es: Esta sección describe las formas en que el MEP rompe la incompatibilidad hacia atrás.

source: Alternatives
es_es: Alternativas

source: If there were any alternative solutions to solving the same problem, they should be discussed here, along with a justification for the chosen approach.
es_es: Si existieran soluciones alternativas para resolver el mismo problema, deberían discutirse aquí, junto con una justificación del enfoque elegido.
