Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/style_sheets/plot_solarizedlight2.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_style_sheets_plot_solarizedlight2.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_style_sheets_plot_solarizedlight2.py>` para descargar el código de ejemplo completo

source: Solarized Light stylesheet
es_es: Hoja de estilo de la luz solarizada

source: This shows an example of "Solarized_Light" styling, which tries to replicate the styles of:
es_es: Esto muestra un ejemplo de estilo "Solarized_Light", que intenta replicar los estilos de:

source: and work of:
es_es: y el trabajo de:

source: using all 8 accents of the color palette - starting with blue
es_es: utilizando los 8 acentos de la paleta de colores - empezando por el azul

source: Still TODO:
es_es: Aún así, es necesario:

source: Create alpha values for bar and stacked charts. .33 or .5
es_es: Crear valores alfa para los gráficos de barras y apilados. .33 o .5

source: Apply Layout Rules
es_es: Aplicar las reglas de diseño

source: :download:`Download Python source code: plot_solarizedlight2.py <plot_solarizedlight2.py>`
es_es: :download:`Descargar el código fuente de Python: plot_solarizedlight2.py <plot_solarizedlight2.py>`

source: :download:`Download Jupyter notebook: plot_solarizedlight2.ipynb <plot_solarizedlight2.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: plot_solarizedlight2.ipynb <plot_solarizedlight2.ipynb>`
