Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/toolkits/axisartist.po
Languages: es_es

source: Again, the *transData* of the axes is still a rectilinear coordinate (image coordinate). You may manually do conversion between two coordinates, or you may use Parasite Axes for convenience.::
es_es: De nuevo, el *transData* de los ejes sigue siendo una coordenada rectilínea (coordenada de la imagen). Usted puede hacer manualmente la conversión entre dos coordenadas, o puede utilizar Parasite Axes por conveniencia.::

source: A floating axis is an axis one of whose data coordinate is fixed, i.e, its location is not fixed in Axes coordinate but changes as axes data limits changes. A floating axis can be created using *new_floating_axis* method. However, it is your responsibility that the resulting AxisArtist is properly added to the axes. A recommended way is to add it as an item of Axes's axis attribute.::
es_es: Un eje flotante es un eje cuya coordenada de datos es fija, es decir, su ubicación no es fija en la coordenada de los ejes, sino que cambia según los límites de los datos de los ejes. Se puede crear un eje flotante utilizando el método *new_floating_axis*. Sin embargo, es su responsabilidad que el AxisArtist resultante se añada correctamente a los ejes. Una forma recomendada es añadirlo como un elemento del atributo eje de los ejes.::

source: See the first example of this page.
es_es: Ver el primer ejemplo de esta página.

source: Current Limitations and TODO's
es_es: Limitaciones actuales y tareas pendientes

source: The code need more refinement. Here is a incomplete list of issues and TODO's
es_es: El código necesita más refinamiento. Esta es una lista incompleta de problemas y tareas pendientes

source: No easy way to support a user customized tick location (for curvilinear grid). A new Locator class needs to be created.
es_es: No hay una manera fácil de soportar una ubicación de tick personalizada por el usuario (para la malla curvilínea). Es necesario crear una nueva clase de localizador.

source: FloatingAxis may have coordinate limits, e.g., a floating axis of x = 0, but y only spans from 0 to 1.
es_es: FloatingAxis puede tener límites de coordenadas, por ejemplo, un eje flotante de x = 0, pero y sólo abarca de 0 a 1.

source: The location of axislabel of FloatingAxis needs to be optionally given as a coordinate value. ex, a floating axis of x=0 with label at y=1
es_es: La ubicación de la etiqueta del eje de FloatingAxis necesita ser dada opcionalmente como un valor de coordenadas. ej., un eje flotante de x=0 con etiqueta en y=1
