Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/toolkits/axisartist.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_toolkits_axisartist.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_tutorials_toolkits_axisartist.py>` para descargar el código de ejemplo completo

source: Overview of axisartist toolkit
es_es: Visión general del conjunto de herramientas de axisartist

source: The axisartist toolkit tutorial.
es_es: El tutorial del kit de herramientas de axisartist.

source: *axisartist* uses a custom Axes class (derived from the Matplotlib's original Axes class). As a side effect, some commands (mostly tick-related) do not work.
es_es: *axisartist* utiliza una clase Axes personalizada (derivada de la clase Axes original de Matplotlib). Como efecto secundario, algunos comandos (sobre todo los relacionados con las ticks) no funcionan.

source: The *axisartist* contains a custom Axes class that is meant to support curvilinear grids (e.g., the world coordinate system in astronomy). Unlike Matplotlib's original Axes class which uses Axes.xaxis and Axes.yaxis to draw ticks, ticklines, etc., axisartist uses a special artist (AxisArtist) that can handle ticks, ticklines, etc. for curved coordinate systems.
es_es: El *axisartist* contiene una clase Axes personalizada que está pensada para soportar mallas curvilíneas (por ejemplo, el sistema de coordenadas mundial en astronomía). A diferencia de la clase Axes original de Matplotlib que utiliza Axes.xaxis y Axes.yaxis para dibujar ticks, ticklines, etc., axisartist utiliza un artist especial (AxisArtist) que puede manejar ticks, ticklines, etc. para sistemas de coordenadas curvas.

source: Since it uses special artists, some Matplotlib commands that work on Axes.xaxis and Axes.yaxis may not work.
es_es: Como utiliza artists especiales, algunos comandos de Matplotlib que funcionan con Axes.xaxis y Axes.yaxis pueden no funcionar.

source: The *axisartist* module provides a custom (and very experimental) Axes class, where each axis (left, right, top, and bottom) have a separate associated artist which is responsible for drawing the axis-line, ticks, ticklabels, and labels. You can also create your own axis, which can pass through a fixed position in the axes coordinate, or a fixed position in the data coordinate (i.e., the axis floats around when viewlimit changes).
es_es: El módulo *axisartist* proporciona una clase de ejes personalizada (y muy experimental), en la que cada eje (izquierdo, derecho, superior e inferior) tiene un artist asociado separado que es responsable de dibujar la línea del eje, los ticks, las etiquetas de verificación y las etiquetas. También puede crear su propio eje, que puede pasar por una posición fija en la coordenada de los ejes, o una posición fija en la coordenada de los datos (es decir, el eje de punto flotante cuando cambia el límite de la vista).

source: The axes class, by default, has its xaxis and yaxis invisible, and has 4 additional artists which are responsible for drawing the 4 axis spines in "left", "right", "bottom", and "top". They are accessed as ax.axis["left"], ax.axis["right"], and so on, i.e., ax.axis is a dictionary that contains artists (note that ax.axis is still a callable method and it behaves as an original Axes.axis method in Matplotlib).
es_es: La clase axes, por defecto, tiene sus ejes x y y invisibles, y tiene 4 artistas adicionales que se encargan de dibujar las 4 espinas de los ejes en "left", "right", "bottom", y "top". Se accede a ellos como ax.axis["left"], ax.axis["right"], y así sucesivamente, es decir, ax.axis es un diccionario que contiene artists ( nota que ax.axis sigue siendo un método invocable y se comporta como un método Axes.axis original en Matplotlib).

source: To create an axes, ::
es_es: Para crear un eje, ::

source: or to create a subplot ::
es_es: o para crear un subgráfico ::

source: For example, you can hide the right and top spines using::
es_es: Por ejemplo, puede ocultar los extremos derecho y superior de la columna mediante::

source: It is also possible to add a horizontal axis. For example, you may have an horizontal axis at y=0 (in data coordinate). ::
es_es: También es posible añadir un eje horizontal. Por ejemplo, puede tener un eje horizontal en y=0 (en coordenadas de datos). ::

source: Or a fixed axis with some offset ::
es_es: O un eje fijo con algún desplazamiento ::

source: axisartist with ParasiteAxes
es_es: axisartist con ParasiteAxes

source: Most commands in the axes_grid1 toolkit can take an axes_class keyword argument, and the commands create an axes of the given class. For example, to create a host subplot with axisartist.Axes, ::
es_es: La mayoría de los comandos del conjunto de herramientas axes_grid1 pueden tomar un argumento de palabra clave axes_class, y los comandos crean un eje de la clase dada. Por ejemplo, para crear un subgráfico de acogida con axisartist.Axes, ::

source: Here is an example that uses ParasiteAxes.
es_es: Este es un ejemplo que utiliza ParasiteAxes.

source: Curvilinear Grid
es_es: Malla curvilínea

source: The motivation behind the AxisArtist module is to support a curvilinear grid and ticks.
es_es: La motivación detrás del módulo AxisArtist es soportar una malla curvilínea y ticks.

source: Floating Axes
es_es: Ejes de punto flotante

source: AxisArtist also supports a Floating Axes whose outer axes are defined as floating axis.
es_es: AxisArtist también admite Ejes de puntos Flotantes cuyos ejes exteriores se definen como ejes flotantes.

source: axisartist namespace
es_es: espacio de nombres axisartist

source: The *axisartist* namespace includes a derived Axes implementation. The biggest difference is that the artists responsible to draw axis line, ticks, ticklabel and axis labels are separated out from the Matplotlib's Axis class, which are much more than artists in the original Matplotlib. This change was strongly motivated to support curvilinear grid. Here are a few things that mpl_toolkits.axisartist.Axes is different from original Axes from Matplotlib.
es_es: El espacio de nombres *axisartist* incluye una implementación derivada de Axes. La mayor diferencia es que los artists responsables de dibujar la línea del eje, los ticks, los ticklabel y las etiquetas del eje están separados de la clase Axis de Matplotlib, que son mucho más que los artists en el Matplotlib original. Este cambio fue fuertemente motivado para soportar la malla curvilínea. Aquí hay algunas cosas que mpl_toolkits.axisartist.Axes es diferente de Axes original de Matplotlib.

source: Axis elements (axis line(spine), ticks, ticklabel and axis labels) are drawn by a AxisArtist instance. Unlike Axis, left, right, top and bottom axis are drawn by separate artists. And each of them may have different tick location and different tick labels.
es_es: Los elementos del eje (línea(s) del eje, ticks, ticklabel y etiquetas del eje) son dibujados por una instancia de AxisArtist. A diferencia de los ejes, los ejes izquierdo, derecho, superior e inferior son dibujados por artists separados. Y cada uno de ellos puede tener diferente ubicación de ticks y diferentes etiquetas de la marca del eje.

source: gridlines are drawn by a Gridlines instance. The change was motivated that in curvilinear coordinate, a gridline may not cross axis-lines (i.e., no associated ticks). In the original Axes class, gridlines are tied to ticks.
es_es: las líneas de malla son dibujadas por una instancia de Gridlines. El cambio fue motivado por el hecho de que en coordenadas curvilíneas, una línea de cuadrícula no puede cruzar líneas de eje (es decir, no hay ticks asociados). En la clase original Axes, las líneas de rejilla están ligadas a los ticks.

source: ticklines can be rotated if necessary (i.e, along the gridlines)
es_es: las líneas de puntos se pueden girar si es necesario (es decir, a lo largo de las líneas de la malla)

source: In summary, all these changes was to support
es_es: En resumen, todos estos cambios fueron para apoyar

source: a curvilinear grid.
es_es: una malla curvilínea.

source: a floating axis
es_es: ejes de punto flotante

source: *mpl_toolkits.axisartist.Axes* class defines a *axis* attribute, which is a dictionary of AxisArtist instances. By default, the dictionary has 4 AxisArtist instances, responsible for drawing of left, right, bottom and top axis.
es_es: La clase *mpl_toolkits.axisartist.Axes* define un atributo *axis*, que es un diccionario de instancias AxisArtist. Por defecto, el diccionario tiene 4 instancias AxisArtist, responsables de dibujar los ejes izquierdo, derecho, inferior y superior.

source: xaxis and yaxis attributes are still available, however they are set to not visible. As separate artists are used for rendering axis, some axis-related method in Matplotlib may have no effect. In addition to AxisArtist instances, the mpl_toolkits.axisartist.Axes will have *gridlines* attribute (Gridlines), which obviously draws grid lines.
es_es: los atributos xaxis y yaxis siguen estando disponibles, sin embargo están configurados como no visibles. Como se utilizan artists separados para renderizar los ejes, algunos métodos relacionados con los ejes en Matplotlib pueden no tener efecto. Además de las instancias AxisArtist, el mpl_toolkits.axisartist.Axes tendrá el atributo *gridlines* (Líneas de malla), que obviamente dibuja líneas de malla.

source: In both AxisArtist and Gridlines, the calculation of tick and grid location is delegated to an instance of GridHelper class. mpl_toolkits.axisartist.Axes class uses GridHelperRectlinear as a grid helper. The GridHelperRectlinear class is a wrapper around the *xaxis* and *yaxis* of Matplotlib's original Axes, and it was meant to work as the way how Matplotlib's original axes works. For example, tick location changes using set_ticks method and etc. should work as expected. But change in artist properties (e.g., color) will not work in general, although some effort has been made so that some often-change attributes (color, etc.) are respected.
es_es: Tanto en AxisArtist como en Gridlines, el cálculo de la ubicación del tick y de la cuadrícula se delega en una instancia de la clase GridHelper. La clase mpl_toolkits.axisartist.Axes utiliza GridHelperRectlinear como ayudante de la malla. La clase GridHelperRectlinear es una envoltura alrededor del *xaxis* y el *yaxis* de los ejes originales de Matplotlib, y fue pensada para trabajar como la forma en que los ejes originales de Matplotlib funcionan. Por ejemplo, los cambios en la ubicación de los ticks utilizando el método set_ticks, etc., deberían funcionar como se espera. Pero el cambio en las propiedades del artist (por ejemplo, el color) no funcionará en general, aunque se ha hecho un esfuerzo para que algunos atributos que cambian a menudo (color, etc.) sean respetados.

source: AxisArtist can be considered as a container artist with following attributes which will draw ticks, labels, etc.
es_es: AxisArtist puede ser considerado como un artist contenedor con los siguientes atributos que dibujarán ticks, etiquetas, etc.

source: line
es_es: línea

source: label
es_es: etiqueta

source: Derived from Line2D class. Responsible for drawing a spinal(?) line.
es_es: Derivado de la clase Line2D. Responsable de dibujar una línea de espinal(?).

source: Derived from Line2D class. Note that ticks are markers.
es_es: Derivado de la clase Line2D. Tenga en cuenta que los ticks son marcadores.

source: Derived from Text. Note that it is not a list of Text artist, but a single artist (similar to a collection).
es_es: Derivado de Text. Tenga en cuenta que no es una lista de artistas de Texto, sino un solo artist (similar a una colección).

source: Derived from Text.
es_es: Derivado del texto.

source: Default AxisArtists
es_es: AxisArtists por defecto

source: By default, following for axis artists are defined.::
es_es: Por defecto, se define lo siguiente para los artists del eje.::

source: The ticklabels and axislabel of the top and the right axis are set to not visible.
es_es: Las etiquetas de verificación y las etiquetas de eje del eje superior y del eje derecho están configuradas como no visibles.

source: For example, if you want to change the color attributes of major_ticklabels of the bottom x-axis ::
es_es: Por ejemplo, si quieres cambiar los atributos de color de major_ticklabels del eje x inferior ::

source: Similarly, to make ticklabels invisible ::
es_es: Del mismo modo, para hacer invisibles las etiquetas ::

source: AxisArtist provides a helper method to control the visibility of ticks, ticklabels, and label. To make ticklabel invisible, ::
es_es: AxisArtist proporciona un método de ayuda para controlar la visibilidad de los ticks, ticklabel y label. Para hacer invisibles las etiquetas de puntos, ::

source: To make all of ticks, ticklabels, and (axis) label invisible ::
es_es: Para hacer invisibles todos los ticks, ticklabels y etiquetas (de los ejes) ::

source: To turn all off but ticks on ::
es_es: Para desactivar todo, excepto los ticks ::

source: To turn all on but (axis) label off ::
es_es: Para activar todo menos la etiqueta (del eje) ::

source: ax.axis's __getitem__ method can take multiple axis names. For example, to turn ticklabels of "top" and "right" axis on, ::
es_es: el método __getitem__ de ax.axis puede tomar múltiples nombres de ejes. Por ejemplo, para activar las etiquetas de los ejes "superior" y "derecho", ::

source: Note that ``ax.axis["top", "right"]`` returns a simple proxy object that translate above code to something like below. ::
es_es: Observa que ``ax.axis["top", "right"]`` devuelve un simple objeto proxy que traduce el código anterior a algo como lo siguiente. ::

source: So, any return values in the for loop are ignored. And you should not use it anything more than a simple method.
es_es: Por lo tanto, cualquier valor de retorno en el bucle for es ignorado. Y no debes utilizarlo más que como un simple método.

source: Like the list indexing ":" means all items, i.e., ::
es_es: Al igual que la indexación de listas, ":" significa todos los elementos, es decir, ::

source: changes tick color in all axis.
es_es: cambia el color de los ticks en todos los ejes.

source: Changing tick locations and label.
es_es: Cambiar la ubicación del tick y la etiqueta.

source: Same as the original Matplotlib's axes::
es_es: Igual que los ejes originales de Matplotlib::

source: Changing axis properties like color, etc.
es_es: Cambiar las propiedades de los ejes, como el color, etc.

source: Change the properties of appropriate artists. For example, to change the color of the ticklabels::
es_es: Cambia las propiedades de los artists apropiados. Por ejemplo, para cambiar el color de las etiquetas de verificación::

source: To change the attributes of multiple axis::
es_es: Para cambiar los atributos de varios ejes::

source: or to change the attributes of all axis::
es_es: o para cambiar los atributos de todos los ejes::

source: To change the tick size (length), you need to use axis.major_ticks.set_ticksize method. To change the direction of the ticks (ticks are in opposite direction of ticklabels by default), use axis.major_ticks.set_tick_out method.
es_es: Para cambiar el tamaño de los ticks (longitud), es necesario utilizar el método axis.major_ticks.set_ticksize. Para cambiar la dirección de los ticks (los ticks están en dirección opuesta a las etiquetas de los ticks por defecto), utilice el método axis.major_ticks.set_tick_out.

source: To change the pad between ticks and ticklabels, use axis.major_ticklabels.set_pad method.
es_es: Para cambiar el pad entre ticks y ticklabels, utilice el método axis.major_ticklabels.set_pad.

source: To change the pad between ticklabels and axis label, axis.label.set_pad method.
es_es: Para cambiar el pad entre las etiquetas de los puntos y la etiqueta del eje, método axis.label.set_pad.

source: Rotation and Alignment of TickLabels
es_es: Rotación y alineación de TickLabels

source: This is also quite different from standard Matplotlib and can be confusing. When you want to rotate the ticklabels, first consider using "set_axis_direction" method. ::
es_es: Esto también es bastante diferente de Matplotlib estándar y puede ser confuso. Cuando quiera rotar las etiquetas de puntos, primero considera usar el método "set_axis_direction" ::

source: The parameter for set_axis_direction is one of ["left", "right", "bottom", "top"].
es_es: El parámetro para set_axis_direction es uno de ["left", "right", "bottom", "top"].

source: You must understand some underlying concept of directions.
es_es: Debes entender algún concepto subyacente de las direcciones.

source: There is a reference direction which is defined as the direction of the axis line with increasing coordinate. For example, the reference direction of the left x-axis is from bottom to top.
es_es: Existe una dirección de referencia que se define como la dirección de la línea del eje con coordenada creciente. Por ejemplo, la dirección de referencia del eje x izquierdo es de abajo a arriba.

source: The direction, text angle, and alignments of the ticks, ticklabels and axis-label is determined with respect to the reference direction
es_es: La dirección, el ángulo del texto y las alineaciones de los ticks, las etiquetas de los ticks y las etiquetas de los ejes se determinan con respecto a la dirección de referencia

source: *label_direction* and *ticklabel_direction* are either the right-hand side (+) of the reference direction or the left-hand side (-).
es_es: *label_direction* y *ticklabel_direction* son el lado derecho (+) de la dirección de referencia o el lado izquierdo (-).

source: ticks are by default drawn toward the opposite direction of the ticklabels.
es_es: los ticks se dibujan por defecto hacia la dirección opuesta a las etiquetas de los ticks.

source: text rotation of ticklabels and label is determined in reference to the *ticklabel_direction* or *label_direction*, respectively. The rotation of ticklabels and label is anchored.
es_es: la rotación del texto de las etiquetas de la marca del eje y la etiqueta se determina en referencia a la *ticklabel_direction* o a la **label_direction*, respectivamente. La rotación de las etiquetas de la marca del eje y la etiqueta está anclada.

source: On the other hand, there is a concept of "axis_direction". This is a default setting of above properties for each, "bottom", "left", "top", and "right" axis.
es_es: Por otro lado, existe el concepto de "axis_direction". Se trata de una configuración por defecto de las propiedades anteriores para cada uno de los ejes "bottom", "left", "top", y "right".

source: And, 'set_axis_direction("top")' means to adjust the text rotation etc, for settings suitable for "top" axis. The concept of axis direction can be more clear with curved axis.
es_es: Y, 'set_axis_direction("top")' significa ajustar la rotación del texto, etc, para los ajustes adecuados para el eje " top". El concepto de dirección del eje puede ser más claro con los ejes curvos.

source: The axis_direction can be adjusted in the AxisArtist level, or in the level of its child artists, i.e., ticks, ticklabels, and axis-label. ::
es_es: La axis_direction se puede ajustar en el nivel de AxisArtist, o en el nivel de sus artistas hijos, es decir, ticks, ticklabels y axis-label. ::

source: changes axis_direction of all the associated artist with the "left" axis, while ::
es_es: cambia axis_direction de todos los artists asociados con el eje "left", mientras que ::

source: changes the axis_direction of only the major_ticklabels. Note that set_axis_direction in the AxisArtist level changes the ticklabel_direction and label_direction, while changing the axis_direction of ticks, ticklabels, and axis-label does not affect them.
es_es: cambia la axis_direction sólo de las major_ticklabels. Ten en cuenta que set_axis_direction en el nivel AxisArtist cambia la dirección de ticklabel y label_direction, mientras que cambiar la dirección del eje de ticks, ticklabels y axis-label no les afecta.

source: If you want to make ticks outward and ticklabels inside the axes, use invert_ticklabel_direction method. ::
es_es: Si quieres hacer ticks hacia fuera y ticklabels dentro de los ejes, utiliza el método invert_ticklabel_direction ::

source: A related method is "set_tick_out". It makes ticks outward (as a matter of fact, it makes ticks toward the opposite direction of the default direction). ::
es_es: Un método relacionado es "set_tick_out". Hace ticks hacia fuera (de hecho, hace ticks hacia la dirección opuesta a la dirección por defecto). ::

source: So, in summary,
es_es: Así que, en resumen,

source: AxisArtist's methods
es_es: Métodos del AxisArtist

source: set_ticklabel_direction: "+" or "-"
es_es: set_ticklabel_direction: "+" o "-"

source: set_axislabel_direction: "+" or "-"
es_es: set_axislabel_direction: "+" o "-"

source: Ticks' methods (major_ticks and minor_ticks)
es_es: Métodos de Ticks (major_ticks y minor_ticks)

source: set_ticksize: size in points
es_es: set_ticksize: tamaño en puntos

source: TickLabels' methods (major_ticklabels and minor_ticklabels)
es_es: Métodos de TickLabels (major_ticklabels y minor_ticklabels)

source: set_rotation: angle with respect to the reference direction
es_es: set_rotation: ángulo con respecto a la dirección de referencia

source: set_ha and set_va: see below
es_es: set_ha y set_va: ver más abajo

source: AxisLabels' methods (label)
es_es: Métodos de AxisLabels (label)

source: set_ha and set_va
es_es: set_ha y set_va

source: Adjusting ticklabels alignment
es_es: Ajuste de la alineación de las etiquetas

source: Alignment of TickLabels are treated specially. See below
es_es: La alineación de los TickLabels se trata de forma especial. Ver más abajo

source: Adjusting pad
es_es: Ajuste del pad

source: To change the pad between ticks and ticklabels ::
es_es: Para cambiar el pad entre ticks y ticklabels ::

source: Or ticklabels and axis-label ::
es_es: O ticklabels y axis-label ::

source: To actually define a curvilinear coordinate, you have to use your own grid helper. A generalised version of grid helper class is supplied and this class should suffice in most of cases. A user may provide two functions which defines a transformation (and its inverse pair) from the curved coordinate to (rectilinear) image coordinate. Note that while ticks and grids are drawn for curved coordinate, the data transform of the axes itself (ax.transData) is still rectilinear (image) coordinate. ::
es_es: Para definir realmente una coordenada curvilínea, tiene que utilizar su propio ayudante de malla. Se suministra una versión generalizada de la clase grid helper, que debería ser suficiente en la mayoría de los casos. Un usuario puede proporcionar dos funciones que definen una transformación (y su par inverso) de la coordenada curva a la coordenada (rectilínea) de la imagen. Tenga en cuenta que mientras las marcas y las cuadrículas se dibujan para la coordenada curva, la transformación de datos de los ejes en sí (ax.transData) sigue siendo la coordenada rectilínea (imagen). ::

source: You may use Matplotlib's Transform instance instead (but a inverse transformation must be defined). Often, coordinate range in a curved coordinate system may have a limited range, or may have cycles. In those cases, a more customized version of grid helper is required. ::
es_es: Puede utilizar la instancia Transform de Matplotlib en su lugar (pero debe definirse una transformación inversa). A menudo, el rango de coordenadas en un sistema de coordenadas curvas puede tener un rango limitado, o puede tener ciclos. En esos casos, se requiere una versión más personalizada del ayudante de malla. ::
