Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/introductory/lifecycle.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_introductory_lifecycle.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_tutorials_introductory_lifecycle.py>` para descargar el código de ejemplo completo

source: The Lifecycle of a Plot
es_es: El ciclo de vida de un gráfico

source: This tutorial aims to show the beginning, middle, and end of a single visualization using Matplotlib. We'll begin with some raw data and end by saving a figure of a customized visualization. Along the way we try to highlight some neat features and best-practices using Matplotlib.
es_es: Este tutorial tiene como objetivo mostrar el principio, el medio y el final de una única visualización utilizando Matplotlib. Comenzaremos con algunos datos en bruto y terminaremos guardando una figura de una visualización personalizada. A lo largo del camino tratamos de resaltar algunas características y mejores prácticas usando Matplotlib.

source: This tutorial is based on `this excellent blog post <https://pbpython.com/effective-matplotlib.html>`_ by Chris Moffitt. It was transformed into this tutorial by Chris Holdgraf.
es_es: Este tutorial está basado en `este excelente artículo del blog <https://pbpython.com/effective-matplotlib.html>`_ de Chris Moffitt. Fue transformado en este tutorial por Chris Holdgraf.

source: A note on the Object-Oriented API vs. Pyplot
es_es: Una nota sobre la API orientada a objetos frente a Pyplot

source: Matplotlib has two interfaces. The first is an object-oriented (OO) interface. In this case, we utilize an instance of :class:`axes.Axes` in order to render visualizations on an instance of :class:`figure.Figure`.
es_es: Matplotlib tiene dos interfaces. La primera es una interfaz orientada a objetos (OO). En este caso, utilizamos una instancia de :class:`axes.Axes` para representar las visualizaciones en una instancia de :class:`figure.Figure`.

source: The second is based on MATLAB and uses a state-based interface. This is encapsulated in the :mod:`.pyplot` module. See the :doc:`pyplot tutorials </tutorials/introductory/pyplot>` for a more in-depth look at the pyplot interface.
es_es: El segundo está basado en MATLAB y utiliza una interfaz basada en estados. Esto está encapsulado en el módulo :mod:`.pyplot`. Consulte el :doc:`pyplot tutorials </tutorials/introductory/pyplot>` para conocer más a fondo la interfaz de pyplot.

source: Most of the terms are straightforward but the main thing to remember is that:
es_es: La mayoría de los términos son sencillos, pero lo principal es recordar que:

source: The Figure is the final image that may contain 1 or more Axes.
es_es: La Figura es la imagen final que puede contener 1 o más Ejes.

source: The Axes represent an individual plot (don't confuse this with the word "axis", which refers to the x/y axis of a plot).
es_es: Los ejes representan una parcela individual (no hay que confundirlo con la palabra "axis", que se refiere al eje x/y de un gráfico).

source: We call methods that do the plotting directly from the Axes, which gives us much more flexibility and power in customizing our plot.
es_es: Llamamos a los métodos que hacen el graficado directamente desde los Ejes, lo que nos da mucha más flexibilidad y poder en la personalización de nuestro gráfico.

source: In general, try to use the object-oriented interface over the pyplot interface.
es_es: En general, trate de utilizar la interfaz orientada a objetos sobre la interfaz de pyplot.

source: Our data
es_es: Nuestros datos

source: We'll use the data from the post from which this tutorial was derived. It contains sales information for a number of companies.
es_es: Utilizaremos los datos del post del que se deriva este tutorial. Contiene información sobre las ventas de una serie de empresas.

source: Getting started
es_es: Cómo empezar

source: This data is naturally visualized as a barplot, with one bar per group. To do this with the object-oriented approach, we first generate an instance of :class:`figure.Figure` and :class:`axes.Axes`. The Figure is like a canvas, and the Axes is a part of that canvas on which we will make a particular visualization.
es_es: Estos datos se visualizan naturalmente como un gráfico de barras, con una barra por grupo. Para hacer esto con el enfoque orientado a objetos, primero generamos una instancia de :class:`figure.Figure` y :class:`axes.Axes`. La Figura es como un lienzo, y los Ejes son una parte de ese lienzo sobre el que haremos una visualización concreta.

source: Figures can have multiple axes on them. For information on how to do this, see the :doc:`Tight Layout tutorial </tutorials/intermediate/tight_layout_guide>`.
es_es: Las figuras pueden tener varios ejes en ellas. Para obtener información sobre cómo hacerlo, consulta el :doc:`Tutorial de diseño ajustado </tutorials/intermediate/tight_layout_guide>`.

source: Now that we have an Axes instance, we can plot on top of it.
es_es: Ahora que tenemos una instancia de Axes, podemos graficar sobre ella.

source: Out:
es_es: Salida:

source: Controlling the style
es_es: Controlar el estilo

source: There are many styles available in Matplotlib in order to let you tailor your visualization to your needs. To see a list of styles, we can use :mod:`.style`.
es_es: Hay muchos estilos disponibles en Matplotlib para que puedas adaptar tu visualización a tus necesidades. Para ver una lista de estilos, podemos utilizar :mod:`.style`.

source: You can activate a style with the following:
es_es: Puedes activar un estilo con lo siguiente:

source: Now let's remake the above plot to see how it looks:
es_es: Ahora vamos a rehacer el gráfico anterior para ver cómo queda:

source: The style controls many things, such as color, linewidths, backgrounds, etc.
es_es: El estilo controla muchas cosas, como el color, los anchos de línea, los fondos, etc.

source: Customizing the plot
es_es: Personalización del gráfico

source: Now we've got a plot with the general look that we want, so let's fine-tune it so that it's ready for print. First let's rotate the labels on the x-axis so that they show up more clearly. We can gain access to these labels with the :meth:`axes.Axes.get_xticklabels` method:
es_es: Ahora tenemos un gráfico con el aspecto general que queremos, así que vamos a ajustarlo para que esté listo para imprimir. Primero vamos a rotar las etiquetas del eje x para que se vean más claramente. Podemos acceder a estas etiquetas con el método :meth:`axes.Axes.get_xticklabels`:

source: If we'd like to set the property of many items at once, it's useful to use the :func:`pyplot.setp` function. This will take a list (or many lists) of Matplotlib objects, and attempt to set some style element of each one.
es_es: Si queremos establecer la propiedad de muchos elementos a la vez, es útil utilizar la función :func:`pyplot.setp`. Ésta tomará una lista (o muchas listas) de objetos Matplotlib, e intentará establecer algún elemento de estilo de cada uno.

source: It looks like this cut off some of the labels on the bottom. We can tell Matplotlib to automatically make room for elements in the figures that we create. To do this we set the ``autolayout`` value of our rcParams. For more information on controlling the style, layout, and other features of plots with rcParams, see :doc:`/tutorials/introductory/customizing`.
es_es: Parece que esto cortó algunas de las etiquetas en la parte inferior. Podemos decirle a Matplotlib que haga automáticamente espacio para los elementos en las figuras que creamos. Para ello establecemos el valor ``autolayout`` de nuestro rcParams. Para más información sobre cómo controlar el estilo, el diseño y otras características de los gráficos con rcParams, ver :doc:`/tutorials/introductory/customizing`.

source: Next, we add labels to the plot. To do this with the OO interface, we can use the :meth:`.Artist.set` method to set properties of this Axes object.
es_es: A continuación, añadimos etiquetas al gráfico. Para hacer esto con la interfaz OO, podemos utilizar el método :meth:`.Artist.set` para establecer las propiedades de este objeto Axes.

source: We can also adjust the size of this plot using the :func:`pyplot.subplots` function. We can do this with the *figsize* keyword argument.
es_es: También podemos ajustar el tamaño de este gráfico utilizando la función :func:`pyplot.subplots`. Podemos hacerlo con el argumento de la palabra clave *figsize*.

source: While indexing in NumPy follows the form (row, column), the *figsize* keyword argument follows the form (width, height). This follows conventions in visualization, which unfortunately are different from those of linear algebra.
es_es: Mientras que la indexación en NumPy sigue la forma (fila, columna), el argumento de la palabra clave *figsize* sigue la forma (ancho, alto). Esto sigue las convenciones de la visualización, que desafortunadamente son diferentes de las del álgebra lineal.

source: For labels, we can specify custom formatting guidelines in the form of functions. Below we define a function that takes an integer as input, and returns a string as an output. When used with `.Axis.set_major_formatter` or `.Axis.set_minor_formatter`, they will automatically create and use a :class:`ticker.FuncFormatter` class.
es_es: Para las etiquetas, podemos especificar pautas de formato personalizadas en forma de funciones. A continuación definimos una función que toma un entero como entrada, y devuelve una cadena como salida. Cuando se utiliza con `.Axis.set_major_formatter` o `.Axis.set_minor_formatter`, crearán y utilizarán automáticamente una clase :class:`ticker.FuncFormatter`.

source: For this function, the ``x`` argument is the original tick label and ``pos`` is the tick position. We will only use ``x`` here but both arguments are needed.
es_es: Para esta función, el argumento ``x`` es la etiqueta original del tick y ``pos`` es la posición del tick. Aquí sólo usaremos ``x`` pero ambos argumentos son necesarios.

source: We can then apply this function to the labels on our plot. To do this, we use the ``xaxis`` attribute of our axes. This lets you perform actions on a specific axis on our plot.
es_es: A continuación, podemos aplicar esta función a las etiquetas de nuestro gráfico. Para ello, utilizamos el atributo ``xaxis`` de nuestros ejes. Esto permite realizar acciones en un eje específico de nuestro gráfico.

source: Combining multiple visualizations
es_es: Combinar varias visualizaciones

source: It is possible to draw multiple plot elements on the same instance of :class:`axes.Axes`. To do this we simply need to call another one of the plot methods on that axes object.
es_es: Es posible dibujar múltiples elementos de gráfico en la misma instancia de :class:`axes.Axes`. Para ello, simplemente tenemos que llamar a otro de los métodos de trazado en ese objeto ejes.

source: Saving our plot
es_es: Guardar nuestro gráfico

source: Now that we're happy with the outcome of our plot, we want to save it to disk. There are many file formats we can save to in Matplotlib. To see a list of available options, use:
es_es: Ahora que estamos contentos con el resultado de nuestro gráfico, queremos guardarlo en el disco. Hay muchos formatos de archivo que podemos guardar en Matplotlib. Para ver una lista de opciones disponibles, utiliza:

source: We can then use the :meth:`figure.Figure.savefig` in order to save the figure to disk. Note that there are several useful flags we show below:
es_es: A continuación, podemos utilizar el método :meth:`figure.Figure.savefig` para guardar la figura en el disco. Ten en cuenta que hay varios indicadores útiles que mostramos a continuación:

source: ``transparent=True`` makes the background of the saved figure transparent if the format supports it.
es_es: ``transparent=True`` hace que el fondo de la figura guardada sea transparente si el formato lo soporta.

source: ``dpi=80`` controls the resolution (dots per square inch) of the output.
es_es: ``dpi=80`` controla la resolución (puntos por pulgada cuadrada) de la salida.

source: ``bbox_inches="tight"`` fits the bounds of the figure to our plot.
es_es: ``bbox_inches="tight"`` ajusta los límites de la figura a nuestro gráfico.

source: **Total running time of the script:** ( 0 minutes 3.851 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 3.851 segundos)
