Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/introductory/usage.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_introductory_usage.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_tutorials_introductory_usage.py>` para descargar el código de ejemplo completo

source: Basic Usage
es_es: Uso básico

source: This tutorial covers some basic usage patterns and best practices to help you get started with Matplotlib.
es_es: Este tutorial cubre algunos patrones básicos de uso y las mejores prácticas para ayudarte a empezar con Matplotlib.

source: A simple example
es_es: Un ejemplo simple

source: Matplotlib graphs your data on `~.figure.Figure`\s (e.g., windows, Jupyter widgets, etc.), each of which can contain one or more `~.axes.Axes`, an area where points can be specified in terms of x-y coordinates (or theta-r in a polar plot, x-y-z in a 3D plot, etc). The simplest way of creating a Figure with an Axes is using `.pyplot.subplots`. We can then use `.Axes.plot` to draw some data on the Axes:
es_es: Matplotlib grafica sus datos en `~.figure.Figure` (por ejemplo, ventanas, widgets de Jupyter, etc.), cada uno de los cuales puede contener uno o más `~.axes.Axes`, un área donde los puntos pueden ser especificados en términos de coordenadas x-y (o theta-r en un gráfico polar, x-y-z en un gráfico 3D, etc). La forma más sencilla de crear una Figura con Ejes es utilizando `.pyplot.subplots`. Luego podemos utilizar `.Axes.plot` para dibujar algunos datos en los Ejes:

source: Out:
es_es: Salida:

source: Parts of a Figure
es_es: Partes de una Figura

source: Here are the components of a Matplotlib Figure.
es_es: Aquí están los componentes de una figura de Matplotlib.

source: The **whole** figure. The Figure keeps track of all the child :class:`~matplotlib.axes.Axes`, a group of 'special' Artists (titles, figure legends, colorbars, etc), and even nested subfigures.
es_es: La **figura completa**. La Figura mantiene un registro de todos los hijos :class:`~matplotlib.axes.Axes`, un grupo de Artists 'especiales' (títulos, leyendas de figuras, barras de color, etc), e incluso subfiguras anidadas.

source: The easiest way to create a new Figure is with pyplot::
es_es: La forma más sencilla de crear una nueva Figura es con pyplot::

source: It is often convenient to create the Axes together with the Figure, but you can also manually add Axes later on. Note that many :doc:`Matplotlib backends </users/explain/backends>` support zooming and panning on figure windows.
es_es: A menudo es conveniente crear los Ejes junto con la Figura, pero también se pueden añadir manualmente los Ejes más tarde. Ten en cuenta que muchos backends de :doc:`Matplotlib </users/explain/backends>` soportan el zoom y la panorámica en las ventanas de las figuras.

source: An Axes is an Artist attached to a Figure that contains a region for plotting data, and usually includes two (or three in the case of 3D) :class:`~matplotlib.axis.Axis` objects (be aware of the difference between **Axes** and **Axis**) that provide ticks and tick labels to provide scales for the data in the Axes. Each :class:`~.axes.Axes` also has a title (set via :meth:`~matplotlib.axes.Axes.set_title`), an x-label (set via :meth:`~matplotlib.axes.Axes.set_xlabel`), and a y-label set via :meth:`~matplotlib.axes.Axes.set_ylabel`).
es_es: Un Eje es un Artist adjunto a una Figura que contiene una región para trazar datos, y normalmente incluye dos (o tres en el caso de 3D) objetos :class:`~matplotlib.axis.Axis` (ten en cuenta la diferencia entre **Axes** y **Axis**) que proporcionan ticks y etiquetas de marca para proporcionar escalas para los datos en los Ejes. Cada :class:`~.axes.Axes` también tiene un título (establecido mediante :meth:`~matplotlib.axes.Axes.set_title`), una etiqueta x (establecida mediante :meth:`~matplotlib.axes.Axes.set_xlabel`), y una etiqueta y establecida mediante :meth:`~matplotlib.axes.Axes.set_ylabel`).

source: The :class:`~.axes.Axes` class and its member functions are the primary entry point to working with the OOP interface, and have most of the plotting methods defined on them (e.g. ``ax.plot()``, shown above, uses the `~.Axes.plot` method)
es_es: La clase :class:`~.axes.Axes` y sus funciones miembro son el principal punto de entrada para trabajar con la interfaz OOP, y tienen la mayoría de los métodos de trazado definidos en ellos (por ejemplo, ``ax.plot()``, mostrado arriba, utiliza el método `~.Axes.plot`)

source: These objects set the scale and limits and generate ticks (the marks on the Axis) and ticklabels (strings labeling the ticks). The location of the ticks is determined by a `~matplotlib.ticker.Locator` object and the ticklabel strings are formatted by a `~matplotlib.ticker.Formatter`. The combination of the correct `.Locator` and `.Formatter` gives very fine control over the tick locations and labels.
es_es: Estos objetos establecen la escala y los límites y generan ticks (las marcas en el Eje) y ticklabel (cadenas que etiquetan los ticks). La ubicación de los ticks se determina mediante un objeto `~matplotlib.ticker.Locator` y las cadenas de ticklabel son formateadas por un `~matplotlib.ticker.Formatter`. La combinación de los objetos `.Locator` y `.Formatter` correctos proporciona un control muy fino sobre las ubicaciones y etiquetas de los ticks.

source: Basically, everything visible on the Figure is an Artist (even `.Figure`, `Axes <.axes.Axes>`, and `~.axis.Axis` objects). This includes `.Text` objects, `.Line2D` objects, :mod:`.collections` objects, `.Patch` objects, etc. When the Figure is rendered, all of the Artists are drawn to the **canvas**. Most Artists are tied to an Axes; such an Artist cannot be shared by multiple Axes, or moved from one to another.
es_es: Básicamente, todo lo visible en la Figura es un Artist (incluso los objetos `.Figure`, `Axes <.axes.Axes>`, y `~.axis.Axis`). Esto incluye objetos `.Text`, objetos `.Line2D`, objetos :mod:`.collections`, objetos `.Patch`, etc. Cuando se renderiza la Figura, todos los Artists se dibujan en el **lienzo**. La mayoría de los Artists están ligados a un Eje; un Artist no puede ser compartido por varios Ejes, ni moverse de uno a otro.

source: Types of inputs to plotting functions
es_es: Tipos de entradas a las funciones de gráfico

source: Plotting functions expect `numpy.array` or `numpy.ma.masked_array` as input, or objects that can be passed to `numpy.asarray`. Classes that are similar to arrays ('array-like') such as `pandas` data objects and `numpy.matrix` may not work as intended. Common convention is to convert these to `numpy.array` objects prior to plotting. For example, to convert a `numpy.matrix` ::
es_es: Las funciones de grafico esperan `numpy.array` o `numpy.ma.masked_array` como entrada, u objetos que puedan pasarse a `numpy.asarray`. Las clases que son similares a los arreglos ('array-like') como los objetos de datos `pandas` y `numpy.matrix` pueden no funcionar como se pretende. La convención común es convertirlos en objetos `numpy.array` antes de graficarlos. Por ejemplo, para convertir un `numpy.matrix` ::

source: Most methods will also parse an addressable object like a *dict*, a `numpy.recarray`, or a `pandas.DataFrame`. Matplotlib allows you provide the ``data`` keyword argument and generate plots passing the strings corresponding to the *x* and *y* variables.
es_es: La mayoría de los métodos también analizarán un objeto direccionable como un *dict*, un `numpy.recarray`, o un `pandas.DataFrame`. Matplotlib permite proporcionar el argumento de la palabra clave ``data`` y generar gráficos pasando las cadenas correspondientes a las variables *x* e *y*.

source: Coding styles
es_es: Estilos de código

source: The object-oriented and the pyplot interfaces
es_es: Las interfaces orientada a objetos y pyplot

source: As noted above, there are essentially two ways to use Matplotlib:
es_es: Como se ha señalado anteriormente, hay esencialmente dos maneras de utilizar Matplotlib:

source: Explicitly create Figures and Axes, and call methods on them (the "object-oriented (OO) style").
es_es: Crear explícitamente Figuras y Ejes, e invocar métodos sobre ellos (el "estilo orientado a objetos (OO)").

source: Rely on pyplot to automatically create and manage the Figures and Axes, and use pyplot functions for plotting.
es_es: Confía en pyplot para crear y gestionar automáticamente las figuras y los ejes, y utiliza las funciones de pyplot para graficar.

source: So one can use the OO-style
es_es: Así que uno puede usar el estilo OO

source: or the pyplot-style:
es_es: o el estilo pyplot:

source: (In addition, there is a third approach, for the case when embedding Matplotlib in a GUI application, which completely drops pyplot, even for figure creation. See the corresponding section in the gallery for more info: :ref:`user_interfaces`.)
es_es: (Además, hay un tercer enfoque, para el caso de incrustar Matplotlib en una aplicación IGU, que deja de lado completamente a pyplot, incluso para la creación de figuras. Ver la sección correspondiente en la galería para más información: :ref:`user_interfaces`.)

source: Matplotlib's documentation and examples use both the OO and the pyplot styles. In general, we suggest using the OO style, particularly for complicated plots, and functions and scripts that are intended to be reused as part of a larger project. However, the pyplot style can be very convenient for quick interactive work.
es_es: La documentación y los ejemplos de Matplotlib utilizan los estilos OO y pyplot. En general, sugerimos que se utilice el estilo OO, sobre todo para los gráficos complicados, y las funciones y scripts que están destinados a ser reutilizados como parte de un proyecto más grande. Sin embargo, el estilo pyplot puede ser muy conveniente para el trabajo interactivo rápido.

source: You may find older examples that use the ``pylab`` interface, via ``from pylab import *``. This approach is strongly deprecated.
es_es: Puedes encontrar ejemplos antiguos que utilizan la interfaz ``pylab``, a través de ``from pylab import *``. Este enfoque está fuertemente obsoleto.

source: Making a helper functions
es_es: Realización de funciones de ayuda

source: If you need to make the same plots over and over again with different data sets, or want to easily wrap Matplotlib methods, use the recommended signature function below.
es_es: Si necesitas hacer los mismos gráficos una y otra vez con diferentes conjuntos de datos, o quieres envolver fácilmente los métodos de Matplotlib, utiliza la función de firma recomendada a continuación.

source: which you would then use twice to populate two subplots:
es_es: que luego se utilizaría dos veces para rellenar dos subgráficos:

source: Note that if you want to install these as a python package, or any other customizations you could use one of the many templates on the web; Matplotlib has one at `mpl-cookiecutter <https://github.com/matplotlib/matplotlib-extension-cookiecutter>`_
es_es: Ten en cuenta que si quieres instalar esto como un paquete de python, o cualquier otra personalización podrías usar una de las muchas plantillas que hay en la web; Matplotlib tiene una en `mpl-cookiecutter <https://github.com/matplotlib/matplotlib-extension-cookiecutter>`_

source: Styling Artists
es_es: Estilo de Artists

source: Most plotting methods have styling options for the Artists, accessible either when a plotting method is called, or from a "setter" on the Artist. In the plot below we manually set the *color*, *linewidth*, and *linestyle* of the Artists created by `~.Axes.plot`, and we set the linestyle of the second line after the fact with `~.Line2D.set_linestyle`.
es_es: La mayoría de los métodos de gráfico tienen opciones de estilo para los Artists, accesibles cuando se llama a un método de graficar, o desde un "setter" en el Artist. En el gráfico que se muestra a continuación, establecemos manualmente el *color*, el *ancho de línea* y el *estilo de línea* de los Artistas creados por `~.Axes.plot`, y establecemos el estilo de línea de la segunda línea después del hecho con `~.Line2D.set_linestyle`.

source: Colors
es_es: Colores

source: Matplotlib has a very flexible array of colors that are accepted for most Artists; see the :doc:`colors tutorial </tutorials/colors/colors>` for a list of specifications. Some Artists will take multiple colors. i.e. for a `~.Axes.scatter` plot, the edge of the markers can be different colors from the interior:
es_es: Matplotlib tiene un arreglo muy flexible de colores que se aceptan para la mayoría de los Artists; ver el :doc:`tutorial de colores </tutorials/colors/colors>` para una lista de especificaciones. Algunos Artists tomarán múltiples colores. Por ejemplo, para un gráfico `~.Axes.scatter`, el borde de los marcadores puede ser de diferentes colores que el interior:

source: Linewidths, linestyles, and markersizes
es_es: Anchos de línea, estilos de línea y tamaños de marcadores

source: Line widths are typically in typographic points (1 pt = 1/72 inch) and available for Artists that have stroked lines. Similarly, stroked lines can have a linestyle. See the :doc:`linestyles example </gallery/lines_bars_and_markers/linestyles>`.
es_es: Los anchos de línea suelen estar en puntos tipográficos (1 pt = 1/72 pulgadas) y están disponibles para los Artists que tienen líneas trazadas. Del mismo modo, las líneas trazadas pueden tener un estilo de línea. Consulta el :doc:`ejemplo de estilos de línea </gallery/lines_bars_and_markers/linestyles>`.

source: Marker size depends on the method being used. `~.Axes.plot` specifies markersize in points, and is generally the "diameter" or width of the marker. `~.Axes.scatter` specifies markersize as approximately proportional to the visual area of the marker. There is an array of markerstyles available as string codes (see :mod:`~.matplotlib.markers`), or users can define their own `~.MarkerStyle` (see :doc:`/gallery/lines_bars_and_markers/marker_reference`):
es_es: El tamaño del marcador depende del método que se utilice. `~.Axes.plot` especifica el tamaño del marcador en puntos, y es generalmente el "diámetro" o la anchura del marcador. `~.Axes.scatter` especifica el tamaño del marcador como aproximadamente proporcional al área visual del marcador. Hay una serie de estilos de marcador disponibles como códigos de cadena (ver :mod:`~.matplotlib.markers`), o los usuarios pueden definir su propio `~.MarkerStyle` (ver :doc:`/gallery/lines_bars_and_markers/marker_reference`):

source: Labelling plots
es_es: Etiquetado de gráficos

source: Axes labels and text
es_es: Etiquetas y texto de los ejes

source: `~.Axes.set_xlabel`, `~.Axes.set_ylabel`, and `~.Axes.set_title` are used to add text in the indicated locations (see :doc:`/tutorials/text/text_intro` for more discussion). Text can also be directly added to plots using `~.Axes.text`:
es_es: Las funciones `~.Axes.set_xlabel`, `~.Axes.set_ylabel` y `~.Axes.set_title` se utilizan para añadir texto en los lugares indicados ( ver :doc:`/tutorials/text/text_intro` para más información). El texto también puede añadirse directamente a los gráficos utilizando `~.Axes.text`:

source: All of the `~.Axes.text` functions return a `matplotlib.text.Text` instance. Just as with lines above, you can customize the properties by passing keyword arguments into the text functions::
es_es: Todas las funciones `~.Axes.text` devuelven una instancia `matplotlib.text.Text`. Al igual que con las líneas anteriores, puede personalizar las propiedades pasando argumentos de palabras clave a las funciones de texto::

source: These properties are covered in more detail in :doc:`/tutorials/text/text_props`.
es_es: Estas propiedades se tratan con más detalle en :doc:`/tutorials/text/text_props`.

source: Using mathematical expressions in text
es_es: Usar expresiones matemáticas en el texto

source: Matplotlib accepts TeX equation expressions in any text expression. For example to write the expression :math:`\sigma_i=15` in the title, you can write a TeX expression surrounded by dollar signs::
es_es: Matplotlib acepta expresiones de ecuaciones TeX en cualquier expresión de texto. Por ejemplo, para escribir la expresión :math:`\sigma_i=15` en el título, puede escribir una expresión TeX rodeada de signos de dólar::

source: where the ``r`` preceding the title string signifies that the string is a *raw* string and not to treat backslashes as python escapes. Matplotlib has a built-in TeX expression parser and layout engine, and ships its own math fonts – for details see :doc:`/tutorials/text/mathtext`. You can also use LaTeX directly to format your text and incorporate the output directly into your display figures or saved postscript – see :doc:`/tutorials/text/usetex`.
es_es: donde la ``r`` que precede a la cadena del título significa que la cadena es una cadena *raw* y que no debe tratar las barras invertidas como escapes de python. Matplotlib tiene un analizador de expresiones TeX y un motor de diseño incorporados, y envía sus propias fuentes matemáticas - para más detalles ver :doc:`/tutorials/text/mathtext`. También puedes utilizar LaTeX directamente para formatear su texto e incorporar la salida directamente en sus figuras de visualización o postscript guardado - ver :doc:`/tutorials/text/usetex`.

source: Annotations
es_es: Anotaciones

source: We can also annotate points on a plot, often by connecting an arrow pointing to *xy*, to a piece of text at *xytext*:
es_es: También podemos anotar puntos en un gráfico, a menudo conectando una flecha que apunta a *xy*, con un trozo de texto en *xytext*:

source: In this basic example, both *xy* and *xytext* are in data coordinates. There are a variety of other coordinate systems one can choose -- see :ref:`annotations-tutorial` and :ref:`plotting-guide-annotation` for details. More examples also can be found in :doc:`/gallery/text_labels_and_annotations/annotation_demo`.
es_es: En este ejemplo básico, tanto *xy* como *xytext* están en coordenadas de datos. Hay una variedad de otros sistemas de coordenadas que se pueden elegir -- ver :ref:`annotations-tutorial` y :ref:`plotting-guide-annotation` para más detalles. También se pueden encontrar más ejemplos en :doc:`/gallery/text_labels_and_annotations/annotation_demo`.

source: Legends
es_es: Leyendas

source: Often we want to identify lines or markers with a `.Axes.legend`:
es_es: A menudo queremos identificar líneas o marcadores con un `.Axes.legend`:

source: Legends in Matplotlib are quite flexible in layout, placement, and what Artists they can represent. They are discussed in detail in :doc:`/tutorials/intermediate/legend_guide`.
es_es: Las leyendas en Matplotlib son bastante flexibles en cuanto a su diseño, colocación y los Artists que pueden representar. Se discuten en detalle en :doc:`/tutorials/intermediate/legend_guide`.

source: Axis scales and ticks
es_es: Escalas y ticks de los ejes

source: Each Axes has two (or three) `~.axis.Axis` objects representing the x- and y-axis. These control the *scale* of the Axis, the tick *locators* and the tick *formatters*. Additional Axes can be attached to display further Axis objects.
es_es: Cada Eje tiene dos (o tres) objetos `~.axis.Axis` que representan los ejes x e y. Éstos controlan la *escala* del Eje, los *localizadores* de ticks y los *formateadores* de ticks. Se pueden adjuntar ejes adicionales para mostrar más objetos Axis.

source: Scales
es_es: Escalas

source: In addition to the linear scale, Matplotlib supplies non-linear scales, such as a log-scale. Since log-scales are used so much there are also direct methods like `~.Axes.loglog`, `~.Axes.semilogx`, and `~.Axes.semilogy`. There are a number of scales (see :doc:`/gallery/scales/scales` for other examples). Here we set the scale manually:
es_es: Además de la escala lineal, Matplotlib proporciona escalas no lineales, como una escala logarítmica. Dado que las escalas logarítmicas se utilizan mucho, también hay métodos directos como `~.Axes.loglog`, `~.Axes.semilogx` y `~.Axes.semilogy`. Hay varias escalas (ver :doc:`/gallery/scales/scales` para otros ejemplos). Aquí establecemos la escala manualmente:

source: The scale sets the mapping from data values to spacing along the Axis. This happens in both directions, and gets combined into a *transform*, which is the way that Matplotlib maps from data coordinates to Axes, Figure, or screen coordinates. See :doc:`/tutorials/advanced/transforms_tutorial`.
es_es: La escala establece el mapeo de los valores de los datos al espacio a lo largo del Eje. Esto ocurre en ambas direcciones, y se combina en una *transformación*, que es la forma en que Matplotlib mapea desde las coordenadas de los datos a los Ejes, la Figura o las coordenadas de la pantalla. Ver :doc:`/tutorials/advanced/transforms_tutorial`.

source: Tick locators and formatters
es_es: Localizadores y formateadores de tick

source: Each Axis has a tick *locator* and *formatter* that choose where along the Axis objects to put tick marks. A simple interface to this is `~.Axes.set_xticks`:
es_es: Cada Eje tiene un *localizador* de tick y un *formateador* que eligen en qué lugar de los objetos del Eje se colocan las marcas de ticks. Una interfaz sencilla para esto es `~.Axes.set_xticks`:

source: Different scales can have different locators and formatters; for instance the log-scale above uses `~.LogLocator` and `~.LogFormatter`. See :doc:`/gallery/ticks/tick-locators` and :doc:`/gallery/ticks/tick-formatters` for other formatters and locators and information for writing your own.
es_es: Diferentes escalas pueden tener diferentes localizadores y formateadores; por ejemplo, la escala de registro anterior utiliza `~.LogLocator` y `~.LogFormatter`. Ver :doc:`/gallery/ticks/tick-locators` y :doc:`/gallery/ticks/tick-formatters` para otros formateadores y localizadores e información para escribir los suyos propios.

source: Plotting dates and strings
es_es: Graficar fechas y cadenas

source: Matplotlib can handle plotting arrays of dates and arrays of strings, as well as floating point numbers. These get special locators and formatters as appropriate. For dates:
es_es: Matplotlib puede manejar arreglos de fechas y arreglos de cadenas, así como números de punto flotante. Estos obtienen localizadores y formateadores especiales, según corresponda. Para las fechas:

source: For more information see the date examples (e.g. :doc:`/gallery/text_labels_and_annotations/date`)
es_es: Para más información, consulta los ejemplos de fechas (por ejemplo, :doc:`/gallery/text_labels_and_annotations/date`)

source: For strings, we get categorical plotting (see: :doc:`/gallery/lines_bars_and_markers/categorical_variables`).
es_es: En el caso de las cadenas, obtenemos un gráfico categórico (ver: :doc:`/gallery/lines_bars_and_markers/categorical_variables`).

source: One caveat about categorical plotting is that some methods of parsing text files return a list of strings, even if the strings all represent numbers or dates. If you pass 1000 strings, Matplotlib will think you meant 1000 categories and will add 1000 ticks to your plot!
es_es: Una advertencia sobre el graficado categórico es que algunos métodos de análisis de archivos de texto devuelven una lista de cadenas, incluso si todas las cadenas representan números o fechas. Si pasas 1000 cadenas, Matplotlib pensará que quiere decir 1000 categorías y añadirá 1000 marcas a su gráfico.

source: Additional Axis objects
es_es: Objetos adicionales del eje
