Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/introductory/usage.po
Languages: es_es

source: Plotting data of different magnitude in one chart may require an additional y-axis. Such an Axis can be created by using `~.Axes.twinx` to add a new Axes with an invisible x-axis and a y-axis positioned at the right (analogously for `~.Axes.twiny`). See :doc:`/gallery/subplots_axes_and_figures/two_scales` for another example.
es_es: El graficado de datos de diferente magnitud en un gráfico puede requerir un eje y adicional. Dicho eje puede crearse utilizando `~.Axes.twinx` para añadir un nuevo eje con un eje x invisible y un eje y posicionado a la derecha (análogamente para `~.Axes.twiny`). Ver :doc:`/gallery/subplots_axes_and_figures/two_scales` para otro ejemplo.

source: Similarly, you can add a `~.Axes.secondary_xaxis` or `~.Axes.secondary_yaxis` having a different scale than the main Axis to represent the data in different scales or units. See :doc:`/gallery/subplots_axes_and_figures/secondary_axis` for further examples.
es_es: Del mismo modo, puede añadir un `~.Axes.secondary_xaxis` o `~.Axes.secondary_yaxis` con una escala diferente a la del eje principal para representar los datos en diferentes escalas o unidades. Consulta :doc:`/gallery/subplots_axes_and_figures/secondary_axis` para ver más ejemplos.

source: Color mapped data
es_es: Datos mapeados en color

source: Often we want to have a third dimension in a plot represented by a colors in a colormap. Matplotlib has a number of plot types that do this:
es_es: A menudo queremos tener una tercera dimensión en un gráfico representada por colores en un mapa de colores. Matplotlib tiene una serie de tipos de gráficos que hacen esto:

source: Colormaps
es_es: Mapas de colores

source: These are all examples of Artists that derive from `~.ScalarMappable` objects. They all can set a linear mapping between *vmin* and *vmax* into the colormap specified by *cmap*. Matplotlib has many colormaps to choose from (:doc:`/tutorials/colors/colormaps`) you can make your own (:doc:`/tutorials/colors/colormap-manipulation`) or download as `third-party packages <https://matplotlib.org/mpl-third-party/#colormaps-and-styles>`_.
es_es: Todos estos son ejemplos de Artists que derivan de objetos `~.ScalarMappable`. Todos ellos pueden establecer un mapeo lineal entre *vmin* y *vmax* en el mapa de colores especificado por *cmap*. Matplotlib tiene muchos mapas de colores entre los que elegir (:doc:`/tutorials/colors/colormaps`), puedes hacer los tuyos propios (:doc:`/tutorials/colors/colormap-manipulation`) o descargarlos como `paquetes de terceros <https://matplotlib.org/mpl-third-party/#colormaps-and-styles>`_.

source: Normalizations
es_es: Normalizaciones

source: Sometimes we want a non-linear mapping of the data to the colormap, as in the ``LogNorm`` example above. We do this by supplying the ScalarMappable with the *norm* argument instead of *vmin* and *vmax*. More normalizations are shown at :doc:`/tutorials/colors/colormapnorms`.
es_es: A veces queremos un mapeo no lineal de los datos al mapa de colores, como en el ejemplo ``LogNorm`` de arriba. Esto se hace suministrando el ScalarMappable con el argumento *norm* en lugar de *vmin* y *vmax*. Se muestran más normalizaciones en :doc:`/tutorials/colors/colormnorms`.

source: Colorbars
es_es: Barras de colores

source: Adding a `~.Figure.colorbar` gives a key to relate the color back to the underlying data. Colorbars are figure-level Artists, and are attached to a ScalarMappable (where they get their information about the norm and colormap) and usually steal space from a parent Axes. Placement of colorbars can be complex: see :doc:`/gallery/subplots_axes_and_figures/colorbar_placement` for details. You can also change the appearance of colorbars with the *extend* keyword to add arrows to the ends, and *shrink* and *aspect* to control the size. Finally, the colorbar will have default locators and formatters appropriate to the norm. These can be changed as for other Axis objects.
es_es: Añadir un `~.Figure.colorbar` da una clave para relacionar el color con los datos subyacentes. Las barras de color son Artists a nivel de figura, y se adjuntan a un ScalarMappable (de donde obtienen su información sobre la norma y el mapa de color) y normalmente roban espacio de un Eje padre. La colocación de las barras de color puede ser compleja: ver :doc:`/gallery/subplots_axes_and_figures/colorbar_placement` para más detalles. También puedes cambiar la apariencia de las barras de color con la palabra clave *extend* para añadir flechas a los extremos, y *shrink* y *aspect* para controlar el tamaño. Por último, la barra de colores tendrá localizadores y formateadores por defecto adecuados a la norma. Estos pueden ser cambiados como para otros objetos Eje.

source: Working with multiple Figures and Axes
es_es: Trabajar con múltiples figuras y ejes

source: You can open multiple Figures with multiple calls to ``fig = plt.figure()`` or ``fig2, ax = plt.subplots()``. By keeping the object references you can add Artists to either Figure.
es_es: Puedes abrir múltiples Figuras con múltiples invocaciones a ``fig = plt.figure()`` o ``fig2, ax = plt.subplots()``. Manteniendo las referencias a los objetos puedes añadir Artists a cualquiera de las Figuras.

source: Multiple Axes can be added a number of ways, but the most basic is ``plt.subplots()`` as used above. One can achieve more complex layouts, with Axes objects spanning columns or rows, using `~.pyplot.subplot_mosaic`.
es_es: Se pueden añadir múltiples ejes de varias maneras, pero la más básica es ``plt.subplots()`` como se ha utilizado anteriormente. Se pueden conseguir diseños más complejos, con objetos Axes que abarquen columnas o filas, utilizando `~.pyplot.subplot_mosaic`.

source: Matplotlib has quite sophisticated tools for arranging Axes: See :doc:`/tutorials/intermediate/arranging_axes` and :doc:`/tutorials/provisional/mosaic`.
es_es: Matplotlib tiene herramientas bastante sofisticadas para organizar los ejes: Ver :doc:`/tutorials/intermediate/arranging_axes` y :doc:`/tutorials/provisional/mosaic`.

source: More reading
es_es: Más lectura

source: For more plot types see :doc:`Plot types </plot_types/index>` and the :doc:`API reference </api/index>`, in particlar the :doc:`Axes API </api/axes_api>`.
es_es: Para ver más tipos de gráficos, consulta :doc:`Tipos de gráficos </plot_types/index>` y el :doc:`Referencia a la API </api/index>`, en particular el :doc:`Axes API </api/axes_api>`.

source: **Total running time of the script:** ( 0 minutes 7.055 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 7.055 segundos)
