Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/text/annotations.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_text_annotations.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_tutorials_text_annotations.py>` para descargar el código de ejemplo completo

source: Annotations
es_es: Anotaciones

source: Annotating text with Matplotlib.
es_es: Anotando texto con Matplotlib.

source: Table of Contents
es_es: Tabla de contenidos

source: Basic annotation
es_es: Anotación básica

source: The uses of the basic :func:`~matplotlib.pyplot.text` will place text at an arbitrary position on the Axes. A common use case of text is to annotate some feature of the plot, and the :func:`~matplotlib.axes.Axes.annotate` method provides helper functionality to make annotations easy. In an annotation, there are two points to consider: the location being annotated represented by the argument *xy* and the location of the text *xytext*. Both of these arguments are ``(x, y)`` tuples.
es_es: Los usos de la :func:`~matplotlib.pyplot.text` básica colocarán el texto en una posición arbitraria en los Ejes. Un caso de uso común del texto es anotar alguna característica del gráfico, y el método :func:`~matplotlib.axes.Axes.annotate` proporciona una funcionalidad de ayuda para facilitar las anotaciones. En una anotación, hay dos puntos a tener en cuenta: la ubicación que se anota representada por el argumento *xy* y la ubicación del texto *xytext*. Ambos argumentos son tuplas ``(x, y)``.

source: In this example, both the *xy* (arrow tip) and *xytext* locations (text location) are in data coordinates. There are a variety of other coordinate systems one can choose -- you can specify the coordinate system of *xy* and *xytext* with one of the following strings for *xycoords* and *textcoords* (default is 'data')
es_es: En este ejemplo, tanto las ubicaciones *xy* (punta de flecha) como *xytext* (ubicación del texto) están en coordenadas de datos. Hay una variedad de otros sistemas de coordenadas que uno puede elegir -- puede especificar el sistema de coordenadas de *xy* y *xytext* con una de las siguientes cadenas para *coordenadasxy* y *coordenadastexto* (por defecto es 'data')

source: argument
es_es: argumento

source: coordinate system
es_es: sistema de coordenadas

source: 'figure points'
es_es: 'figura de píxeles'

source: points from the lower left corner of the figure
es_es: píxeles de la esquina inferior izquierda de la figura

source: pixels from the lower left corner of the figure
es_es: píxeles de la esquina inferior izquierda de la figura

source: 'figure fraction'
es_es: 'fracción de figura'

source: (0, 0) is lower left of figure and (1, 1) is upper right
es_es: (0, 0) es la parte inferior izquierda de la figura y (1, 1) es la parte superior derecha

source: 'axes points'
es_es: 'puntos de los ejes'

source: points from lower left corner of axes
es_es: puntos de la esquina inferior izquierda de los ejes

source: pixels from lower left corner of axes
es_es: píxeles de la esquina inferior izquierda de los ejes

source: (0, 0) is lower left of axes and (1, 1) is upper right
es_es: (0, 0) es la parte inferior izquierda de los ejes y (1, 1) es la parte superior derecha

source: use the axes data coordinate system
es_es: utiliza el sistema de coordenadas de los datos de los ejes

source: For example to place the text coordinates in fractional axes coordinates, one could do::
es_es: Por ejemplo para colocar las coordenadas del texto en coordenadas de ejes fraccionarios, se podría hacer::

source: For physical coordinate systems (points or pixels) the origin is the bottom-left of the figure or axes.
es_es: Para sistemas de coordenadas físicas (puntos o píxeles) el origen es la parte inferior izquierda de la figura o los ejes.

source: Optionally, you can enable drawing of an arrow from the text to the annotated point by giving a dictionary of arrow properties in the optional keyword argument *arrowprops*.
es_es: Opcionalmente, puede habilitar el dibujo de una flecha desde el texto hasta el punto anotado dando un diccionario de propiedades de la flecha en el argumento opcional de palabra clave *arrowprops*.

source: *arrowprops* key
es_es: clave *arrowprops*

source: description
es_es: descripción

source: width
es_es: ancho

source: the width of the arrow in points
es_es: el ancho de la flecha en puntos

source: the fraction of the arrow length occupied by the head
es_es: la fracción de la longitud de la flecha ocupada por la punta

source: the width of the base of the arrow head in points
es_es: el ancho de la base de la punta de la flecha en puntos

source: move the tip and base some percent away from the annotated point and text
es_es: mover la punta y la base un poco lejos del punto y el texto anotado

source: any key for :class:`matplotlib.patches.Polygon`, e.g., ``facecolor``
es_es: cualquier clave para :class:`matplotlib.patches.Polygon`, por ejemplo, ``facecolor``

source: In the example below, the *xy* point is in native coordinates (*xycoords* defaults to 'data'). For a polar axes, this is in (theta, radius) space. The text in this example is placed in the fractional figure coordinate system. :class:`matplotlib.text.Text` keyword arguments like *horizontalalignment*, *verticalalignment* and *fontsize* are passed from `~matplotlib.axes.Axes.annotate` to the ``Text`` instance.
es_es: En el siguiente ejemplo, el punto *xy* está en coordenadas nativas (*xycoords* por defecto es 'data'). Para un eje polar, esto es en el espacio (theta, radio). El texto en este ejemplo se coloca en el sistema de coordenadas de la figura fraccionaria. :class:`matplotlib.text.Text` argumentos de palabras clave como *alineación horizontal*, *alineación vertical* y *tamaño de letra* se pasan desde `~matplotlib.axes.Axes.annotate` a la instancia ``Text``.

source: For more on all the wild and wonderful things you can do with annotations, including fancy arrows, see :ref:`plotting-guide-annotation` and :doc:`/gallery/text_labels_and_annotations/annotation_demo`.
es_es: Para más información sobre todas las cosas salvajes y maravillosas que puedes hacer con las anotaciones, incluyendo flechas de fantasía, consulta :ref:`plotting-guide-annotation` y :doc:`/gallery/text_labels_and_annotations/annotation_demo`.

source: Do not proceed unless you have already read :ref:`annotations-tutorial`, :func:`~matplotlib.pyplot.text` and :func:`~matplotlib.pyplot.annotate`!
es_es: ¡No continúe a menos que ya haya leído :ref:`annotations-tutorial`, :func:`~matplotlib.pyplot.text` y :func:`~matplotlib.pyplot.annotate`!

source: Advanced Annotations
es_es: Anotaciones avanzadas

source: Annotating with Text with Box
es_es: Anotación con texto con caja

source: Let's start with a simple example.
es_es: Empecemos con un ejemplo sencillo.

source: `~.Axes.text` takes a *bbox* keyword argument, which draws a box around the text::
es_es: `~.Axes.text` toma un argumento de palabra clave *bbox*, que dibuja una caja alrededor del texto::

source: The patch object associated with the text can be accessed by::
es_es: Se puede acceder al objeto parche asociado al texto mediante::

source: The return value is a `.FancyBboxPatch`; patch properties (facecolor, edgewidth, etc.) can be accessed and modified as usual. `.FancyBboxPatch.set_boxstyle` sets the box shape::
es_es: El valor de retorno es un `.FancyBboxPatch`; las propiedades del parche (color de la cara, ancho del borde, etc.) pueden ser accedidas y modificadas como siempre. El parche `.FancyBboxPatch.set_boxstyle` establece la forma de la caja::

source: The arguments are the name of the box style with its attributes as keyword arguments. Currently, following box styles are implemented.
es_es: Los argumentos son el nombre del estilo de caja con sus atributos como argumentos de palabra clave. Actualmente, se implementan los siguientes estilos de caja.

source: Class
es_es: Clase

source: Name
es_es: Nombre

source: Circle
es_es: Círculo

source: Square
es_es: Cuadrado

source: Note that the attribute arguments can be specified within the style name with separating comma (this form can be used as "boxstyle" value of bbox argument when initializing the text instance) ::
es_es: Ten en cuenta que los argumentos de los atributos se pueden especificar dentro del nombre del estilo con una coma de separación (esta forma se puede utilizar como valor "boxstyle" del argumento bbox al inicializar la instancia de texto) ::

source: Annotating with Arrow
es_es: Anotar con Arrow

source: `~.Axes.annotate` draws an arrow connecting two points in an axes::
es_es: `~.Axes.annotate` dibuja una flecha que conecta dos puntos en un eje::

source: This annotates a point at *xy* in the given coordinate (*xycoords*) with the text at *xytext* given in *textcoords*. Often, the annotated point is specified in the *data* coordinate and the annotating text in *offset points*. See `~.Axes.annotate` for available coordinate systems.
es_es: Esto anota un punto en *xy* en las coordenadas dadas (*coordenadasxy*) con el texto en *xytext* dado en *coordenadastext*. A menudo, el punto anotado se especifica en la coordenada *data* y el texto anotado en *offset points*. Ver `~.Axes.annotate` para los sistemas de coordenadas disponibles.

source: An arrow connecting *xy* to *xytext* can be optionally drawn by specifying the *arrowprops* argument. To draw only an arrow, use empty string as the first argument. ::
es_es: Se puede dibujar opcionalmente una flecha que conecte *xy* con *xytext* especificando el argumento *arrowprops*. Para dibujar sólo una flecha, utilice una cadena vacía como primer argumento. ::

source: The arrow is drawn as follows:
es_es: La flecha se dibuja de la siguiente manera:

source: A path connecting the two points is created, as specified by the *connectionstyle* parameter.
es_es: Se crea un camino que conecta los dos puntos, según lo especificado por el parámetro *connectionstyle*.

source: The path is clipped to avoid patches *patchA* and *patchB*, if these are set.
es_es: La ruta se recorta para evitar los parches *patchA* y *patchB*, si estos están establecidos.

source: The path is further shrunk by *shrinkA* and *shrinkB* (in pixels).
es_es: La ruta se reduce aún más con *shrinkA* y *shrinkB* (en píxeles).

source: The path is transmuted to an arrow patch, as specified by the *arrowstyle* parameter.
es_es: La ruta se transmuta en un parche de flecha, según lo especificado por el parámetro *arrowstyle*.

source: The creation of the connecting path between two points is controlled by ``connectionstyle`` key and the following styles are available.
es_es: La creación de la ruta de conexión entre dos puntos se controla con la clave ``connectionstyle`` y están disponibles los siguientes estilos.

source: Note that "3" in ``angle3`` and ``arc3`` is meant to indicate that the resulting path is a quadratic spline segment (three control points). As will be discussed below, some arrow style options can only be used when the connecting path is a quadratic spline.
es_es: Observa que "3" en ``ángulo3`` y ``arco3`` pretende indicar que la trayectoria resultante es un segmento de spline cuadrático (tres puntos de control). Como se verá más adelante, algunas opciones de estilo de flecha sólo pueden utilizarse cuando la trayectoria de conexión es una spline cuadrática.

source: The behavior of each connection style is (limitedly) demonstrated in the example below. (Warning: The behavior of the ``bar`` style is currently not well defined, it may be changed in the future).
es_es: El comportamiento de cada estilo de conexión se demuestra (limitadamente) en el ejemplo siguiente. (Advertencia: El comportamiento del estilo ``bar`` no está actualmente bien definido, puede ser cambiado en el futuro).

source: The connecting path (after clipping and shrinking) is then mutated to an arrow patch, according to the given ``arrowstyle``.
es_es: El camino de conexión (después de recortar y encoger) se transforma en un parche de flecha, de acuerdo con el ``arrowstyle`` dado.

source: Some arrowstyles only work with connection styles that generate a quadratic-spline segment. They are ``fancy``, ``simple``, and ``wedge``. For these arrow styles, you must use the "angle3" or "arc3" connection style.
es_es: Algunos estilos de flecha sólo funcionan con estilos de conexión que generan un segmento de curva cuadrática. Son ``fancy``, ``simple`` y ``wedge``. Para estos estilos de flecha, debes utilizar el estilo de conexión "angle3" o "arc3".

source: If the annotation string is given, the patchA is set to the bbox patch of the text by default.
es_es: Si se da la cadena de anotación, el parcheA se establece por defecto en el parche bbox del texto.

source: As with `~.Axes.text`, a box around the text can be drawn using the *bbox* argument.
es_es: Al igual que con `~.Axes.text`, se puede dibujar una caja alrededor del texto utilizando el argumento *bbox*.

source: By default, the starting point is set to the center of the text extent. This can be adjusted with ``relpos`` key value. The values are normalized to the extent of the text. For example, (0, 0) means lower-left corner and (1, 1) means top-right.
es_es: Por defecto, el punto de inicio se establece en el centro de la extensión del texto. Esto se puede ajustar con el valor de la clave ``relpos``. Los valores se normalizan a la extensión del texto. Por ejemplo, (0, 0) significa esquina inferior izquierda y (1, 1) significa superior derecha.

source: Placing Artist at the anchored location of the Axes
es_es: Colocación de Artist en la ubicación anclada de los Ejes

source: There are classes of artists that can be placed at an anchored location in the Axes. A common example is the legend. This type of artist can be created by using the `.OffsetBox` class. A few predefined classes are available in :mod:`matplotlib.offsetbox` and in :mod:`mpl_toolkits.axes_grid1.anchored_artists`.
es_es: Hay clases de artistas que pueden colocarse en un lugar anclado en los Ejes. Un ejemplo común es la leyenda. Este tipo de artista se puede crear utilizando la clase `.OffsetBox`. Algunas clases predefinidas están disponibles en :mod:`matplotlib.offsetbox` y en :mod:`mpl_toolkits.axes_grid1.anchored_artists`.

source: Out:
es_es: Salida:

source: The *loc* keyword has same meaning as in the legend command.
es_es: La palabra clave *loc* tiene el mismo significado que en el comando leyenda.

source: A simple application is when the size of the artist (or collection of artists) is known in pixel size during the time of creation. For example, If you want to draw a circle with fixed size of 20 pixel x 20 pixel (radius = 10 pixel), you can utilize ``AnchoredDrawingArea``. The instance is created with a size of the drawing area (in pixels), and arbitrary artists can added to the drawing area. Note that the extents of the artists that are added to the drawing area are not related to the placement of the drawing area itself. Only the initial size matters.
es_es: Una aplicación sencilla es cuando el tamaño del artist (o colección de artists) se conoce en tamaño de píxel durante el momento de la creación. Por ejemplo, si se quiere dibujar un círculo con un tamaño fijo de 20 píxeles x 20 píxeles (radio = 10 píxeles), se puede utilizar ``AnchoredDrawingArea``. La instancia se crea con un tamaño del área de dibujo (en píxeles), y se pueden añadir artists arbitrarios al área de dibujo. Ten en cuenta que las extensiones de los artists que se añaden al área de dibujo no están relacionadas con la colocación del área de dibujo en sí. Sólo importa el tamaño inicial.

source: The artists that are added to the drawing area should not have a transform set (it will be overridden) and the dimensions of those artists are interpreted as a pixel coordinate, i.e., the radius of the circles in above example are 10 pixels and 5 pixels, respectively.
es_es: Los artists que se añaden al área de dibujo no deben tener una transformación establecida (se anulará) y las dimensiones de esos artists se interpretan como una coordenada de píxel, es decir, el radio de los círculos en el ejemplo anterior son 10 píxeles y 5 píxeles, respectivamente.

source: Sometimes, you want your artists to scale with the data coordinate (or coordinates other than canvas pixels). You can use ``AnchoredAuxTransformBox`` class. This is similar to ``AnchoredDrawingArea`` except that the extent of the artist is determined during the drawing time respecting the specified transform.
es_es: A veces, quieres que tus artists se escalen con la coordenada de los datos (o coordenadas distintas a los píxeles del lienzo). Puedes utilizar la clase ``AnchoredAuxTransformBox``. Es similar a ``AnchoredDrawingArea`` excepto que la extensión del artist se determina durante el tiempo de dibujo respetando la transformación especificada.

source: The ellipse in the example below will have width and height corresponding to 0.1 and 0.4 in data coordinates and will be automatically scaled when the view limits of the axes change.
es_es: La elipse del ejemplo siguiente tendrá la anchura y la altura correspondientes a 0,1 y 0,4 en coordenadas de datos y se escalará automáticamente cuando cambien los límites de vista de los ejes.

source: As in the legend, the bbox_to_anchor argument can be set. Using the HPacker and VPacker, you can have an arrangement(?) of artist as in the legend (as a matter of fact, this is how the legend is created).
es_es: Al igual que en la leyenda, se puede establecer el argumento bbox_to_anchor. Usando el HPacker y el VPacker, se puede tener un ajuste(?) de artist como en la leyenda (de hecho, así es como se crea la leyenda).

source: Note that unlike the legend, the ``bbox_transform`` is set to IdentityTransform by default.
es_es: Ten en cuenta que, a diferencia de la leyenda, la ``bbox_transform`` se establece por defecto en IdentityTransform.

source: Using Complex Coordinates with Annotations
es_es: Uso de Coordenadas Complejas con Anotaciones

source: The Annotation in matplotlib supports several types of coordinates as described in :ref:`annotations-tutorial`. For an advanced user who wants more control, it supports a few other options.
es_es: La anotación en Matplotlib soporta varios tipos de coordenadas como se describe en :ref:`annotations-tutorial`. Para un usuario avanzado que quiera más control, soporta algunas otras opciones.

source: A `.Transform` instance. For example, ::
es_es: Una instancia de `.Transform`. Por ejemplo, ::

source: is identical to ::
es_es: es idéntico a ::

source: This allows annotating a point in another axes::
es_es: Esto permite anotar un punto en otro eje::

source: An `.Artist` instance. The *xy* value (or *xytext*) is interpreted as a fractional coordinate of the bbox (return value of *get_window_extent*) of the artist::
es_es: Una instancia de `.Artist`. El valor *xy* (o *xytext*) se interpreta como una coordenada fraccionaria de la bbox (valor de retorno de *get_window_extent*) del artista::

source: Note that you must ensure that the extent of the coordinate artist (*an1* in above example) is determined before *an2* gets drawn. Usually, this means that *an2* needs to be drawn after *an1*.
es_es: Ten en cuenta que debes asegurarte de que la extensión del artista de coordenadas (*an1* en el ejemplo anterior) se determine antes de que se dibuje *an2*. Normalmente, esto significa que *an2* debe dibujarse después de *an1*.

source: A callable object that takes the renderer instance as single argument, and returns either a `.Transform` or a `.BboxBase`. The return value is then handled as in (1), for transforms, or in (2), for bboxes. For example, ::
es_es: Un objeto invocable que toma la instancia del renderizador como único argumento, y devuelve un `.Transform` o un `.BboxBase`. El valor devuelto se maneja como en (1), para transformadores, o en (2), para bboxes. Por ejemplo, ::

source: is identical to::
es_es: es idéntico a::

source: A pair of coordinate specifications -- the first for the x-coordinate, and the second is for the y-coordinate; e.g. ::
es_es: Un par de especificaciones de coordenadas -- la primera para la coordenada x, y la segunda es para la coordenada y; p. ej. ::

source: Here, 0.5 is in data coordinates, and 1 is in normalized axes coordinates. Each of the coordinate specifications can also be an artist or a transform. For example,
es_es: Aquí, 0.5 está en coordenadas de datos, y 1 está en coordenadas de ejes normalizados. Cada una de las especificaciones de coordenadas también puede ser un artist o una transformación. Por ejemplo,

source: Sometimes, you want your annotation with some "offset points", not from the annotated point but from some other point. `.text.OffsetFrom` is a helper for such cases.
es_es: A veces, quieres que tu anotación tenga algunos "puntos de desplazamiento", no desde el punto anotado sino desde algún otro punto. `.text.OffsetFrom` es una ayuda para estos casos.

source: You may take a look at this example :doc:`/gallery/text_labels_and_annotations/annotation_demo`.
es_es: Puedes echar un vistazo a este ejemplo :doc:`/gallery/text_labels_and_annotations/annotation_demo`.

source: Using ConnectionPatch
es_es: Uso de ConnectionPatch

source: ConnectionPatch is like an annotation without text. While `~.Axes.annotate` is sufficient in most situations, ConnectionPatch is useful when you want to connect points in different axes. ::
es_es: ConnectionPatch es como una anotación sin texto. Mientras que `~.Axes.annotate` es suficiente en la mayoría de las situaciones, ConnectionPatch es útil cuando se quiere conectar puntos en diferentes ejes. ::

source: The above code connects point *xy* in the data coordinates of ``ax1`` to point *xy* in the data coordinates of ``ax2``. Here is a simple example.
es_es: El código anterior conecta el punto *xy* en las coordenadas de datos de ``ax1`` con el punto *xy* en las coordenadas de datos de ``ax2``. He aquí un ejemplo sencillo.

source: Here, we added the ConnectionPatch to the *figure* (with `~.Figure.add_artist`) rather than to either axes: this ensures that it is drawn on top of both axes, and is also necessary if using :doc:`constrained_layout </tutorials/intermediate/constrainedlayout_guide>` for positioning the axes.
es_es: Aquí, añadimos el ConnectionPatch a la *figura* (con `~.Figure.add_artist`), en lugar de a cualquiera de los ejes: esto asegura que se dibuje encima de ambos ejes, y también es necesario si se utiliza :doc:`constrained_layout </tutorials/intermediate/constrainedlayout_guide>` para posicionar los ejes.

source: Advanced Topics
es_es: Temas avanzados

source: Zoom effect between Axes
es_es: Efecto de zoom entre ejes

source: ``mpl_toolkits.axes_grid1.inset_locator`` defines some patch classes useful for interconnecting two axes. Understanding the code requires some knowledge of Matplotlib's transform system.
es_es: ``mpl_toolkits.axes_grid1.inset_locator`` define algunas clases de parche útiles para interconectar dos ejes. La comprensión del código requiere algunos conocimientos del sistema de transformación de Matplotlib.

source: Define Custom BoxStyle
es_es: Definir BoxStyle personalizado

source: You can use a custom box style. The value for the ``boxstyle`` can be a callable object in the following forms.::
es_es: Puedes utilizar un estilo de caja personalizado. El valor para el ``boxstyle`` puede ser un objeto llamable de las siguientes formas.::

source: Here is a complete example.
es_es: Aquí tienes un ejemplo completo.

source: Similarly, you can define a custom ConnectionStyle and a custom ArrowStyle. See the source code of ``lib/matplotlib/patches.py`` and check how each style class is defined.
es_es: Del mismo modo, puedes definir un ConnectionStyle personalizado y un ArrowStyle personalizado. Consulta el código fuente de ``lib/matplotlib/patches.py`` y comprueba cómo se define cada clase de estilo.
