Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/text/annotations.po
Languages: es_es

source: :download:`Download Python source code: annotations.py <annotations.py>`
es_es: :download:`Descargar código fuente de Python: annotations.py <annotations.py>`

source: :download:`Download Jupyter notebook: annotations.ipynb <annotations.ipynb>`
es_es: :download:`Descargar Jupyter notebook: annotations.ipynb <annotations.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código Matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
