Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/text/pgf.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_text_pgf.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_tutorials_text_pgf.py>` para descargar el código de ejemplo completo

source: Typesetting with XeLaTeX/LuaLaTeX
es_es: Composición tipográfica con XeLaTeX/LuaLaTeX

source: How to typeset text with the ``pgf`` backend in Matplotlib.
es_es: Cómo componer texto con el backend ``pgf`` en Matplotlib.

source: Using the ``pgf`` backend, Matplotlib can export figures as pgf drawing commands that can be processed with pdflatex, xelatex or lualatex. XeLaTeX and LuaLaTeX have full Unicode support and can use any font that is installed in the operating system, making use of advanced typographic features of OpenType, AAT and Graphite. Pgf pictures created by ``plt.savefig('figure.pgf')`` can be embedded as raw commands in LaTeX documents. Figures can also be directly compiled and saved to PDF with ``plt.savefig('figure.pdf')`` by switching the backend ::
es_es: Usando el backend ``pgf``, Matplotlib puedes exportar figuras como comandos de dibujo pgf que pueden ser procesados con pdflatex, xelatex o lualatex. XeLaTeX y LuaLaTeX tienen soporte completo para Unicode y pueden utilizar cualquier fuente que esté instalada en el sistema operativo, haciendo uso de las características tipográficas avanzadas de OpenType, AAT y Graphite. Las figuras Pgf creadas por ``plt.savefig('figure.pgf')`` pueden incrustarse como comandos en bruto en los documentos LaTeX. Las figuras también se pueden compilar y guardar directamente en PDF con ``plt.savefig('figure.pdf')`` cambiando el backend ::

source: or by explicitly requesting the use of the ``pgf`` backend ::
es_es: o solicitando explícitamente el uso del backend ``pgf`` ::

source: or by registering it for handling pdf output ::
es_es: o registrándolo para manejar la salida en pdf ::

source: The last method allows you to keep using regular interactive backends and to save xelatex, lualatex or pdflatex compiled PDF files from the graphical user interface.
es_es: El último método permite seguir utilizando los backends interactivos habituales y guardar archivos PDF compilados con xelatex, lualatex o pdflatex desde la interfaz gráfica de usuario.

source: Matplotlib's pgf support requires a recent LaTeX_ installation that includes the TikZ/PGF packages (such as TeXLive_), preferably with XeLaTeX or LuaLaTeX installed. If either pdftocairo or ghostscript is present on your system, figures can optionally be saved to PNG images as well. The executables for all applications must be located on your :envvar:`PATH`.
es_es: El soporte pgf de Matplotlib requiere una instalación reciente de LaTeX_ que incluya los paquetes TikZ/PGF (como TeXLive_), preferiblemente con XeLaTeX o LuaLaTeX instalados. Si pdftocairo o ghostscript están presentes en su sistema, las figuras también pueden guardarse opcionalmente en imágenes PNG. Los ejecutables de todas las aplicaciones deben estar ubicados en su :envvar:`PATH`.

source: `.rcParams` that control the behavior of the pgf backend:
es_es: `.rcParams` que controlan el comportamiento del backend de pgf:

source: Parameter
es_es: Parámetro

source: Documentation
es_es: Documentación

source: Lines to be included in the LaTeX preamble
es_es: Líneas a incluir en el preámbulo de LaTeX

source: Setup fonts from rc params using the fontspec package
es_es: Configurar las fuentes a partir de los parámetros de rc utilizando el paquete fontspec

source: Either "xelatex" (default), "lualatex" or "pdflatex"
es_es: O bien "xelatex" (por defecto), "lualatex" o "pdflatex"

source: TeX defines a set of special characters, such as::
es_es: TeX define un conjunto de caracteres especiales, como::

source: Generally, these characters must be escaped correctly. For convenience, some characters (_, ^, %) are automatically escaped outside of math environments.
es_es: En general, estos caracteres deben escaparse correctamente. Por comodidad, algunos caracteres (_, ^, %) se escapan automáticamente fuera de los entornos matemáticos.

source: Multi-Page PDF Files
es_es: Archivos PDF de varias páginas

source: The pgf backend also supports multipage pdf files using `~.backend_pgf.PdfPages`
es_es: El backend pgf también soporta archivos pdf multipágina usando `~.backend_pgf.PdfPages`

source: Font specification
es_es: Especificación de la fuente

source: The fonts used for obtaining the size of text elements or when compiling figures to PDF are usually defined in the `.rcParams`. You can also use the LaTeX default Computer Modern fonts by clearing the lists for :rc:`font.serif`, :rc:`font.sans-serif` or :rc:`font.monospace`. Please note that the glyph coverage of these fonts is very limited. If you want to keep the Computer Modern font face but require extended Unicode support, consider installing the `Computer Modern Unicode`__ fonts *CMU Serif*, *CMU Sans Serif*, etc.
es_es: Los tipos de letra utilizados para obtener el tamaño de los elementos de texto o al compilar figuras a PDF se definen normalmente en el `.rcParams`. También puede utilizar las fuentes Computer Modern por defecto de LaTeX borrando las listas de :rc:`font.serif`, :rc:`font.sans-serif` o :rc:`font.monospace`. Tenga en cuenta que la cobertura de glifos de estas fuentes es muy limitada. Si quiere mantener la cara de la fuente Computer Modern pero necesita un soporte ampliado de Unicode, considere instalar las fuentes `Computer Modern Unicode`__ *CMU Serif*, *CMU Sans Serif*, etc.

source: When saving to ``.pgf``, the font configuration Matplotlib used for the layout of the figure is included in the header of the text file.
es_es: Al guardar en ``.pgf``, la configuración de la fuente que Matplotlib ha utilizado para el diseño de la figura se incluye en la cabecera del archivo de texto.

source: Custom preamble
es_es: Preámbulo personalizado

source: Full customization is possible by adding your own commands to the preamble. Use :rc:`pgf.preamble` if you want to configure the math fonts, using ``unicode-math`` for example, or for loading additional packages. Also, if you want to do the font configuration yourself instead of using the fonts specified in the rc parameters, make sure to disable :rc:`pgf.rcfonts`.
es_es: La personalización completa es posible añadiendo sus propios comandos al preámbulo. Utilice :rc:`pgf.preamble` si desea configurar las fuentes matemáticas, utilizando ``unicode-math`` por ejemplo, o para cargar paquetes adicionales. Además, si quiere hacer la configuración de las fuentes usted mismo en lugar de usar las fuentes especificadas en los parámetros rc, asegúrese de desactivar :rc:`pgf.rcfonts`.

source: Choosing the TeX system
es_es: Elección del sistema TeX

source: The TeX system to be used by Matplotlib is chosen by :rc:`pgf.texsystem`. Possible values are ``'xelatex'`` (default), ``'lualatex'`` and ``'pdflatex'``. Please note that when selecting pdflatex, the fonts and Unicode handling must be configured in the preamble.
es_es: El sistema TeX a utilizar por Matplotlib se elige mediante :rc:`pgf.texsystem`. Los valores posibles son ``'xelatex`` (por defecto), ``'lualatex`` y ``'pdflatex``. Tenga en cuenta que al seleccionar pdflatex, las fuentes y el manejo de Unicode deben ser configurados en el preámbulo.

source: Troubleshooting
es_es: Solución de problemas

source: Please note that the TeX packages found in some Linux distributions and MiKTeX installations are dramatically outdated. Make sure to update your package catalog and upgrade or install a recent TeX distribution.
es_es: Tenga en cuenta que los paquetes de TeX que se encuentran en algunas distribuciones de Linux y en las instalaciones de MiKTeX están drásticamente desactualizados. Asegúrese de actualizar su catálogo de paquetes y de actualizar o instalar una distribución de TeX reciente.

source: On Windows, the :envvar:`PATH` environment variable may need to be modified to include the directories containing the latex, dvipng and ghostscript executables. See :ref:`environment-variables` and :ref:`setting-windows-environment-variables` for details.
es_es: En Windows, puede ser necesario modificar la variable de entorno :envvar:`PATH` para incluir los directorios que contienen los ejecutables de latex, dvipng y ghostscript. Consulte :ref:`variables de entorno` y :ref:`setting-windows-variables de entorno` para más detalles.

source: Sometimes the font rendering in figures that are saved to png images is very bad. This happens when the pdftocairo tool is not available and ghostscript is used for the pdf to png conversion.
es_es: A veces el renderizado de las fuentes en las figuras que se guardan en imágenes png es muy malo. Esto ocurre cuando la herramienta pdftocairo no está disponible y se utiliza ghostscript para la conversión de pdf a png.

source: Make sure what you are trying to do is possible in a LaTeX document, that your LaTeX syntax is valid and that you are using raw strings if necessary to avoid unintended escape sequences.
es_es: Asegúrate de que lo que está intentando hacer es posible en un documento LaTeX, que su sintaxis LaTeX es válida y que está utilizando cadenas de texto sin procesar si es necesario para evitar secuencias de escape no deseadas.

source: :rc:`pgf.preamble` provides lots of flexibility, and lots of ways to cause problems. When experiencing problems, try to minimalize or disable the custom preamble.
es_es: :rc:`pgf.preamble` proporciona mucha flexibilidad, y muchas maneras de causar problemas. Si tienes problemas, intenta minimizar o desactivar el preámbulo personalizado.

source: Configuring an ``unicode-math`` environment can be a bit tricky. The TeXLive distribution for example provides a set of math fonts which are usually not installed system-wide. XeTeX, unlike LuaLatex, cannot find these fonts by their name, which is why you might have to specify ``\setmathfont{xits-math.otf}`` instead of ``\setmathfont{XITS Math}`` or alternatively make the fonts available to your OS. See this `tex.stackexchange.com question`__ for more details.
es_es: Configurar un entorno ``unicode-math`` puede ser un poco complicado. La distribución TeXLive, por ejemplo, proporciona un conjunto de fuentes matemáticas que normalmente no se instalan en todo el sistema. XeTeX, a diferencia de LuaLatex, no puede encontrar estas fuentes por su nombre, por lo que es posible que tenga que especificar ``setmathfont{xits-math.otf}` en lugar de ``setmathfont{XITS Math}` o, alternativamente, hacer que las fuentes estén disponibles para su sistema operativo. Vea esta `pregunta de tex.stackexchange.com`__ para más detalles.

source: If the font configuration used by Matplotlib differs from the font setting in yout LaTeX document, the alignment of text elements in imported figures may be off. Check the header of your ``.pgf`` file if you are unsure about the fonts Matplotlib used for the layout.
es_es: Si la configuración de la fuente utilizada por Matplotlib difiere de la configuración de la fuente en su documento LaTeX, la alineación de los elementos de texto en las figuras importadas puede estar fuera de lugar. Comprueba la cabecera de su archivo ``.pgf`` si no está seguro de los tipos de letra que Matplotlib ha utilizado para el diseño.

source: Vector images and hence ``.pgf`` files can become bloated if there are a lot of objects in the graph. This can be the case for image processing or very big scatter graphs. In an extreme case this can cause TeX to run out of memory: "TeX capacity exceeded, sorry" You can configure latex to increase the amount of memory available to generate the ``.pdf`` image as discussed on `tex.stackexchange.com <https://tex.stackexchange.com/q/7953/>`_. Another way would be to "rasterize" parts of the graph causing problems using either the ``rasterized=True`` keyword, or ``.set_rasterized(True)`` as per :doc:`this example </gallery/misc/rasterization_demo>`.
es_es: Las imágenes vectoriales y, por tanto, los archivos ``.pgf`` pueden hincharse si hay muchos objetos en el gráfico. Este puede ser el caso del procesamiento de imágenes o de gráficos de dispersión muy grandes. En un caso extremo, esto puede hacer que TeX se quede sin memoria: "Capacidad de TeX excedida, lo siento" Se puede configurar latex para aumentar la cantidad de memoria disponible para generar la imagen ``.pdf`` como se discute en `tex.stackexchange.com <https://tex.stackexchange.com/q/7953/>`_. Otra forma sería "rasterizar" las partes del gráfico que causan problemas utilizando la palabra clave ``rasterized=True``, o ``.set_rasterized(True)`` según :doc:`este ejemplo </gallery/misc/rasterization_demo>`.

source: Various math fonts are compiled and rendered only if corresponding font packages are loaded. Specifically, when using ``\mathbf{}`` on Greek letters, the default computer modern font may not contain them, in which case the letter is not rendered. In such scenarios, the ``lmodern`` package should be loaded.
es_es: Varias fuentes matemáticas se compilan y renderizan sólo si se cargan los paquetes de fuentes correspondientes. En concreto, cuando se utiliza ``mathbf{}` en las letras griegas, es posible que la fuente moderna del ordenador por defecto no las contenga, en cuyo caso la letra no se renderiza. En estos casos, se debe cargar el paquete ``lmodern``.

source: If you still need help, please see :ref:`reporting-problems`
es_es: Si todavía necesitas ayuda, consulte :ref:`reporting-problems`

source: :download:`Download Python source code: pgf.py <pgf.py>`
es_es: :download:`Descargar código fuente de Python: pgf.py <pgf.py>`

source: :download:`Download Jupyter notebook: pgf.ipynb <pgf.ipynb>`
es_es: :download:`Descargar Jupyter notebook: pgf.ipynb <pgf.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
