Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/text/usetex.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_text_usetex.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_tutorials_text_usetex.py>` para descargar el código de ejemplo completo

source: Text rendering with LaTeX
es_es: Renderización de texto con LaTeX

source: Matplotlib can use LaTeX to render text. This is activated by setting ``text.usetex : True`` in your rcParams, or by setting the ``usetex`` property to True on individual `.Text` objects. Text handling through LaTeX is slower than Matplotlib's very capable :doc:`mathtext </tutorials/text/mathtext>`, but is more flexible, since different LaTeX packages (font packages, math packages, etc.) can be used. The results can be striking, especially when you take care to use the same fonts in your figures as in the main document.
es_es: Matplotlib puede utilizar LaTeX para renderizar texto. Esto se activa estableciendo ``text.usetex : True`` en sus rcParams, o estableciendo la propiedad ``usetex`` a True en objetos individuales `.Text`. El manejo de texto a través de LaTeX es más lento que el muy capaz :doc:`mathtext </tutorials/text/mathtext>` de Matplotlib, pero es más flexible, ya que se pueden utilizar diferentes paquetes de LaTeX (paquetes de fuentes, paquetes matemáticos, etc.). Los resultados pueden ser sorprendentes, sobre todo si se tiene la precaución de utilizar en las figuras los mismos tipos de letra que en el documento principal.

source: Matplotlib's LaTeX support requires a working LaTeX_ installation. For the \*Agg backends, dvipng_ is additionally required; for the PS backend, PSfrag_, dvips_ and Ghostscript_ are additionally required. For the PDF and SVG backends, if LuaTeX is present, it will be used to speed up some post-processing steps, but note that it is not used to parse the TeX string itself (only LaTeX is supported). The executables for these external dependencies must all be located on your :envvar:`PATH`.
es_es: El soporte de LaTeX de Matplotlib requiere una instalación de LaTeX_ que funcione. Para los backends \*Agg, se requiere adicionalmente dvipng_; para el backend PS, se requieren adicionalmente PSfrag_, dvips_ y Ghostscript_. Para los backends PDF y SVG, si LuaTeX está presente, se utilizará para acelerar algunos pasos de post-procesamiento, pero tenga en cuenta que no se utiliza para analizar la cadena TeX en sí misma (sólo se soporta LaTeX). Los ejecutables de estas dependencias externas deben estar ubicados en su :envvar:`PATH`.

source: There are a couple of options to mention, which can be changed using :doc:`rc settings </tutorials/introductory/customizing>`. Here is an example matplotlibrc file::
es_es: Hay un par de opciones a mencionar, que pueden ser cambiadas usando :doc:`rc settings </tutorials/introductory/customizing>`. Aquí hay un ejemplo de archivo matplotlibrc::

source: The first valid font in each family is the one that will be loaded. If the fonts are not specified, the Computer Modern fonts are used by default. All of the other fonts are Adobe fonts. Times and Palatino each have their own accompanying math fonts, while the other Adobe serif fonts make use of the Computer Modern math fonts. See the PSNFSS_ documentation for more details.
es_es: La primera fuente válida de cada familia es la que se cargará. Si no se especifican las fuentes, se utilizan por defecto las fuentes Computer Modern. Todas las demás fuentes son de Adobe. Times y Palatino tienen sus propias fuentes matemáticas, mientras que las otras fuentes de Adobe utilizan las fuentes matemáticas de Computer Modern. Consulta la documentación de PSNFSS_ para más detalles.

source: To use LaTeX and select Helvetica as the default font, without editing matplotlibrc use::
es_es: Para utilizar LaTeX y seleccionar Helvetica como fuente por defecto, sin editar matplotlibrc utilizar::

source: Currently, the supported fonts are:
es_es: Actualmente, las fuentes soportadas son:

source: family
es_es: familia

source: fonts
es_es: fuentes

source: Here is the standard example, :doc:`/gallery/text_labels_and_annotations/tex_demo`:
es_es: Aquí está el ejemplo estándar, :doc:`/gallery/text_labels_and_annotations/tex_demo`:

source: Note that display math mode (``$$ e=mc^2 $$``) is not supported, but adding the command ``\displaystyle``, as in the above demo, will produce the same results.
es_es: Tenga en cuenta que el modo matemático de visualización (``$$ e=mc^2 $$``) no está soportado, pero añadiendo el comando ``displaystyle``, como en la demostración anterior, generará los mismos resultados.

source: Non-ASCII characters (e.g. the degree sign in the y-label above) are supported to the extent that they are supported by inputenc_.
es_es: Los caracteres no ASCII (por ejemplo, el signo de grado en la etiqueta y de arriba) se admiten en la medida en que los admita inputenc_.

source: Certain characters require special escaping in TeX, such as::
es_es: Algunos caracteres requieren un escape especial en TeX, como::

source: Therefore, these characters will behave differently depending on :rc:`text.usetex`.
es_es: Por lo tanto, estos caracteres se comportarán de forma diferente según :rc:`text.usetex`.

source: PostScript options
es_es: Opciones de PostScript

source: In order to produce encapsulated PostScript (EPS) files that can be embedded in a new LaTeX document, the default behavior of Matplotlib is to distill the output, which removes some PostScript operators used by LaTeX that are illegal in an EPS file. This step produces results which may be unacceptable to some users, because the text is coarsely rasterized and converted to bitmaps, which are not scalable like standard PostScript, and the text is not searchable. One workaround is to set :rc:`ps.distiller.res` to a higher value (perhaps 6000) in your rc settings, which will produce larger files but may look better and scale reasonably. A better workaround, which requires Poppler_ or Xpdf_, can be activated by changing :rc:`ps.usedistiller` to ``xpdf``. This alternative produces PostScript without rasterizing text, so it scales properly, can be edited in Adobe Illustrator, and searched text in pdf documents.
es_es: Para generar archivos PostScript encapsulados (EPS) que puedan ser incrustados en un nuevo documento LaTeX, el comportamiento por defecto de Matplotlib es destilar la salida, lo que elimina algunos operadores PostScript utilizados por LaTeX que son ilegales en un archivo EPS. Este paso genera resultados que pueden ser inaceptables para algunos usuarios, porque el texto se rasteriza groseramente y se convierte en mapas de bits, que no son escalables como el PostScript estándar, y el texto no se puede buscar. Una solución es establecer :rc:`ps.distiller.res` a un valor más alto (tal vez 6000) en la configuración de rc, lo que generará archivos más grandes pero puede verse mejor y escalar razonablemente. Una mejor solución, que requiere Poppler_ o Xpdf_, se puede activar cambiando :rc:`ps.usedistiller` a ``xpdf``. Esta alternativa genera PostScript sin rasterizar el texto, por lo que se escala correctamente, se puede editar en Adobe Illustrator y buscar texto en documentos pdf.

source: Possible hangups
es_es: Posibles cuelgues

source: On Windows, the :envvar:`PATH` environment variable may need to be modified to include the directories containing the latex, dvipng and ghostscript executables. See :ref:`environment-variables` and :ref:`setting-windows-environment-variables` for details.
es_es: En Windows, puede ser necesario modificar la variable de entorno :envvar:`PATH` para incluir los directorios que contienen los ejecutables de latex, dvipng y ghostscript. Consulta :ref:`variables de entorno` y :ref:`setting-windows-variables de entorno` para más detalles.

source: Using MiKTeX with Computer Modern fonts, if you get odd \*Agg and PNG results, go to MiKTeX/Options and update your format files
es_es: Usando MiKTeX con fuentes Computer Modern, si obtienes resultados extraños \*Agg y PNG, ve a MiKTeX/Opciones y actualiza tus archivos de formato

source: On Ubuntu and Gentoo, the base texlive install does not ship with the type1cm package. You may need to install some of the extra packages to get all the goodies that come bundled with other LaTeX distributions.
es_es: En Ubuntu y Gentoo, la instalación básica de texlive no viene con el paquete type1cm. Es posible que tenga que instalar algunos de los paquetes adicionales para obtener todas las ventajas que vienen incluidas en otras distribuciones de LaTeX.

source: Some progress has been made so Matplotlib uses the dvi files directly for text layout. This allows LaTeX to be used for text layout with the pdf and svg backends, as well as the \*Agg and PS backends. In the future, a LaTeX installation may be the only external dependency.
es_es: Se han hecho algunos progresos para que Matplotlib utilice los archivos dvi directamente para la distribución del texto. Esto permite utilizar LaTeX para el diseño de texto con los backends pdf y svg, así como con los backends \*Agg y PS. En el futuro, la instalación de LaTeX puede ser la única dependencia externa.

source: Troubleshooting
es_es: Solución de problemas

source: Try deleting your :file:`.matplotlib/tex.cache` directory. If you don't know where to find :file:`.matplotlib`, see :ref:`locating-matplotlib-config-dir`.
es_es: Intenta borrar tu directorio :file:`.matplotlib/tex.cache`. Si no sabes dónde encontrar :file:`.matplotlib`, consulta :ref:`locating-matplotlib-config-dir`.

source: Make sure LaTeX, dvipng and ghostscript are each working and on your :envvar:`PATH`.
es_es: Asegúrate de que LaTeX, dvipng y ghostscript están funcionando y en tu :envvar:`PATH`.

source: Make sure what you are trying to do is possible in a LaTeX document, that your LaTeX syntax is valid and that you are using raw strings if necessary to avoid unintended escape sequences.
es_es: Asegúrate de que lo que estás tratando de hacer es posible en un documento LaTeX, que su sintaxis LaTeX es válida y que estás utilizando cadenas crudas si es necesario para evitar secuencias de salida no deseadas.

source: :rc:`text.latex.preamble` is not officially supported. This option provides lots of flexibility, and lots of ways to cause problems. Please disable this option before reporting problems to the mailing list.
es_es: :rc:`text.latex.preamble` no está soportado oficialmente. Esta opción proporciona mucha flexibilidad, y muchas maneras de causar problemas. Por favor, desactive esta opción antes de informar de los problemas a la lista de correo.

source: If you still need help, please see :ref:`reporting-problems`.
es_es: Si todavía necesita ayuda, consulte :ref:`reporting-problems`.

source: :download:`Download Python source code: usetex.py <usetex.py>`
es_es: :download:`Descargar código fuente de Python: usetex.py <usetex.py>`

source: :download:`Download Jupyter notebook: usetex.ipynb <usetex.ipynb>`
es_es: :download:`Descargar Jupyter notebook: usetex.ipynb <usetex.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery
