Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/ticks/auto_ticks.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_ticks_auto_ticks.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_ticks_auto_ticks.py>` para descargar el código de ejemplo completo #: ../../gallery/ticks/auto_ticks.rst:13 Archivo: auto_ticks.po

source: Automatically setting tick positions
es_es: Establecimiento automático de las posiciones de los marcadores

source: Setting the behavior of tick auto-placement.
es_es: Configurar el comportamiento de la autocolocación de los marcadores.

source: By default, Matplotlib will choose the number of ticks and tick positions so that there is a reasonable number of ticks on the axis and they are located at "round" numbers.
es_es: Por defecto, Matplotlib elegirá el número de ticks y las posiciones de los mismos para que haya un número razonable de ticks en el eje y que estén situados en números "redondos".

source: As a result, there may be no ticks on the edges of the plot.
es_es: Como resultado, es posible que no haya marcadores en los bordes del gráfico.

source: If you want to keep ticks at round numbers, and also have ticks at the edges you can switch :rc:`axes.autolimit_mode` to 'round_numbers'. This expands the axis limits to the next round number.
es_es: Si quieres mantener los marcadores en números redondos, y también tener marcadores en los bordes puedes cambiar :rc:`axes.autolimit_mode` a 'round_numbers'. Esto expande los límites del eje al siguiente número redondo.

source: The round numbers autolimit_mode is still respected if you set an additional margin around the data using `.Axes.set_xmargin` / `.Axes.set_ymargin`:
es_es: El modo autolimit_mode de números redondos se sigue respetando si se establece un margen adicional alrededor de los datos utilizando `.Axes.set_xmargin` / `.Axes.set_ymargin`:

source: :download:`Download Python source code: auto_ticks.py <auto_ticks.py>`
es_es: :download:`Descargar el código fuente de Python: auto_ticks.py <auto_ticks.py>`

source: :download:`Download Jupyter notebook: auto_ticks.ipynb <auto_ticks.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: auto_ticks.ipynb <auto_ticks.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
