Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/ticks/colorbar_tick_labelling_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_ticks_colorbar_tick_labelling_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_ticks_colorbar_tick_labelling_demo.py>` para descargar el código de ejemplo completo

source: Colorbar Tick Labelling
es_es: Etiquetado de los marcadores de la barra de colores

source: Produce custom labelling for a colorbar.
es_es: Generar un etiquetado personalizado para una barra de colores.

source: Contributed by Scott Sinclair
es_es: Contribución de Scott Sinclair

source: Make plot with vertical (default) colorbar
es_es: Hacer un gráfico con barra de color vertical (por defecto)

source: Out:
es_es: Salida:

source: Make plot with horizontal colorbar
es_es: Hacer un gráfico con barra de colores horizontal

source: **Total running time of the script:** ( 0 minutes 1.200 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.200 segundos)

source: :download:`Download Python source code: colorbar_tick_labelling_demo.py <colorbar_tick_labelling_demo.py>`
es_es: :download:`Descarga el código fuente de Python: colorbar_tick_labelling_demo.py <colorbar_tick_labelling_demo.py>`

source: :download:`Download Jupyter notebook: colorbar_tick_labelling_demo.ipynb <colorbar_tick_labelling_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: colorbar_tick_labelling_demo.ipynb <colorbar_tick_labelling_demo.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
