Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/ticks/date_concise_formatter.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_ticks_date_concise_formatter.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_ticks_date_concise_formatter.py>` para descargar el código de ejemplo completo

source: Formatting date ticks using ConciseDateFormatter
es_es: Formateo de los marcadores de fecha usando ConciseDateFormatter

source: Finding good tick values and formatting the ticks for an axis that has date data is often a challenge. `~.dates.ConciseDateFormatter` is meant to improve the strings chosen for the ticklabels, and to minimize the strings used in those tick labels as much as possible.
es_es: Encontrar buenos valores de marcador y formatear los marcadores para un eje que tiene datos de fecha es a menudo un desafío. `~.dates.ConciseDateFormatter` está pensado para mejorar las cadenas elegidas para las etiquetas de ticks, y para minimizar las cadenas utilizadas en esas etiquetas de ticks tanto como sea posible.

source: This formatter is a candidate to become the default date tick formatter in future versions of Matplotlib. Please report any issues or suggestions for improvement to the github repository or mailing list.
es_es: Este formateador es candidato a convertirse en el formateador de marcadores de fecha por defecto en futuras versiones de Matplotlib. Por favor, informe de cualquier problema o sugerencia de mejora en el repositorio de github o en la lista de correo.

source: First, the default formatter.
es_es: Primero, el formateador por defecto.

source: The default date formatter is quite verbose, so we have the option of using `~.dates.ConciseDateFormatter`, as shown below. Note that for this example the labels do not need to be rotated as they do for the default formatter because the labels are as small as possible.
es_es: El formateador de fechas por defecto es bastante verboso, por lo que tenemos la opción de utilizar `~.dates.ConciseDateFormatter`, como se muestra a continuación. Ten en cuenta que para este ejemplo no es necesario girar las etiquetas como en el caso del formateador por defecto porque las etiquetas son lo más pequeñas posible.

source: If all calls to axes that have dates are to be made using this converter, it is probably most convenient to use the units registry where you do imports:
es_es: Si todas las llamadas a los ejes que tienen fechas se van a hacer utilizando este conversor, probablemente lo más conveniente sea utilizar el registro de unidades donde se hacen las importaciones:

source: Localization of date formats
es_es: Localización de los formatos de fecha

source: Dates formats can be localized if the default formats are not desirable by manipulating one of three lists of strings.
es_es: Los formatos de las fechas pueden ser localizados si los formatos por defecto no son deseables, manipulando una de las tres listas de cadenas.

source: The ``formatter.formats`` list of formats is for the normal tick labels, There are six levels: years, months, days, hours, minutes, seconds. The ``formatter.offset_formats`` is how the "offset" string on the right of the axis is formatted. This is usually much more verbose than the tick labels. Finally, the ``formatter.zero_formats`` are the formats of the ticks that are "zeros". These are tick values that are either the first of the year, month, or day of month, or the zeroth hour, minute, or second. These are usually the same as the format of the ticks a level above. For example if the axis limits mean the ticks are mostly days, then we label 1 Mar 2005 simply with a "Mar". If the axis limits are mostly hours, we label Feb 4 00:00 as simply "Feb-4".
es_es: La lista de formatos ``formatter.formats`` se utiliza para las etiquetas normales de los marcadores, Hay seis niveles: años, meses, días, horas, minutos, segundos. El ``formatter.offset_formats`` es cómo se formatea la cadena "offset" a la derecha del eje. Normalmente es mucho más detallado que las etiquetas de los marcadores. Por último, los ``formatter.zero_formats`` son los formatos de los marcadores que son "ceros". Son valores de los marcadores que son el primero del año, del mes o del día del mes, o la hora, el minuto o el segundo cero. Normalmente tienen el mismo formato que los marcadores de un nivel superior. Por ejemplo, si los límites del eje significan que los marcadores son principalmente días, entonces etiquetamos el 1 de marzo de 2005 simplemente con un "Mar". Si los límites del eje son en su mayoría horas, etiquetamos el 4 de febrero a las 00:00 horas simplemente con "Feb-4".

source: Note that these format lists can also be passed to `.ConciseDateFormatter` as optional keyword arguments.
es_es: Ten en cuenta que estas listas de formatos también pueden pasarse a `.ConciseDateFormatter` como argumentos opcionales de palabra clave.

source: Here we modify the labels to be "day month year", instead of the ISO "year month day":
es_es: Aquí modificamos las etiquetas para que sean "día mes año", en lugar de la ISO "año mes día":

source: Registering a converter with localization
es_es: Registro de un convertidor con localización

source: `.ConciseDateFormatter` doesn't have rcParams entries, but localization can be accomplished by passing keyword arguments to `.ConciseDateConverter` and registering the datatypes you will use with the units registry:
es_es: `.ConciseDateFormatter` no tiene entradas rcParams, pero la localización se puede lograr pasando argumentos de palabras clave a `.ConciseDateConverter` y registrando los tipos de datos que se usarán con el registro de unidades:

source: **Total running time of the script:** ( 0 minutes 3.697 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 3.697 segundos)

source: :download:`Download Python source code: date_concise_formatter.py <date_concise_formatter.py>`
es_es: :download:`Descargar el código fuente de Python: date_concise_formatter.py <date_concise_formatter.py>`

source: :download:`Download Jupyter notebook: date_concise_formatter.ipynb <date_concise_formatter.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: date_concise_formatter.ipynb <date_concise_formatter.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
