Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/ticks/major_minor_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_ticks_major_minor_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_ticks_major_minor_demo.py>` para descargar el código de ejemplo completo

source: Major and minor ticks
es_es: Marcadores mayores y menores

source: Demonstrate how to use major and minor tickers.
es_es: Demostrar cómo utilizar los tickers mayores y menores.

source: The two relevant classes are `.Locator`\s and `.Formatter`\s. Locators determine where the ticks are, and formatters control the formatting of tick labels.
es_es: Las dos clases relevantes son `.Locator`s y `.Formatter`s. Los localizadores determinan dónde están los marcadores, y los formateadores controlan el formato de las etiquetas de los marcadores.

source: Minor ticks are off by default (using `.NullLocator` and `.NullFormatter`). Minor ticks can be turned on without labels by setting the minor locator. Minor tick labels can be turned on by setting the minor formatter.
es_es: Los marcadores menores están desactivados por defecto (usando `.NullLocator` y `.NullFormatter`). Los marcadores menores pueden activarse sin etiquetas estableciendo el localizador menor. Las etiquetas de los marcadores menores pueden activarse configurando el formateador menor.

source: `.MultipleLocator` places ticks on multiples of some base. `.StrMethodFormatter` uses a format string (e.g., ``'{x:d}'`` or ``'{x:1.2f}'`` or ``'{x:1.1f} cm'``) to format the tick labels (the variable in the format string must be ``'x'``). For a `.StrMethodFormatter`, the string can be passed directly to `.Axis.set_major_formatter` or `.Axis.set_minor_formatter`. An appropriate `.StrMethodFormatter` will be created and used automatically.
es_es: `.MultipleLocator` coloca los marcadores en múltiplos de alguna base. `.StrMethodFormatter` utiliza una cadena de formato (por ejemplo, ``'{x:d}'`` o ``'{x:1.2f}'`` o ``'{x:1.1f} cm'``) para formatear las etiquetas de los marcadores (la variable de la cadena de formato debe ser ``'x'``). Para un `.StrMethodFormatter`, la cadena se puede pasar directamente a `.Axis.set_major_formatter` o `.Axis.set_minor_formatter`. Se creará y utilizará automáticamente un `.StrMethodFormatter` apropiado.

source: `.pyplot.grid` changes the grid settings of the major ticks of the y and y axis together. If you want to control the grid of the minor ticks for a given axis, use for example ::
es_es: `.pyplot.grid` cambia la configuración de la cuadrícula de los marcadores mayores del eje y y juntos. Si quieres controlar la cuadrícula de los marcadores menores de un eje determinado, utiliza por ejemplo ::

source: Note that a given locator or formatter instance can only be used on a single axis (because the locator stores references to the axis data and view limits).
es_es: Ten en cuenta que una instancia de localizador o formateador dada sólo puede utilizarse en un único eje (porque el localizador almacena referencias a los datos del eje y a los límites de la vista).

source: Automatic tick selection for major and minor ticks.
es_es: Selección automática de marcadores para ticks mayores y menores.

source: Use interactive pan and zoom to see how the tick intervals change. There will be either 4 or 5 minor tick intervals per major interval, depending on the major interval.
es_es: Utiliza el paneo y el zoom interactivos para ver cómo cambian los intervalos de los marcadores. Habrá 4 o 5 intervalos de marcadores menores por cada intervalo mayor, dependiendo del intervalo mayor.

source: One can supply an argument to `.AutoMinorLocator` to specify a fixed number of minor intervals per major interval, e.g. ``AutoMinorLocator(2)`` would lead to a single minor tick between major ticks.
es_es: Se puede suministrar un argumento a `.AutoMinorLocator` para especificar un número fijo de intervalos menores por intervalo mayor, por ejemplo, ``AutoMinorLocator(2)`` llevaría a un único marcador menor entre los marcadores mayores.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: major_minor_demo.py <major_minor_demo.py>`
es_es: :download:`Descarga el código fuente de Python: mayor_menor_demo.py <mayor_menor_demo.py>`

source: :download:`Download Jupyter notebook: major_minor_demo.ipynb <major_minor_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: major_minor_demo.ipynb <major_minor_demo.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
