Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/ticks/scalarformatter.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_ticks_scalarformatter.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_ticks_scalarformatter.py>` para descargar el código de ejemplo completo

source: The default tick formatter
es_es: El formateador de marcadores por defecto

source: The example shows use of the default `.ScalarFormatter` with different settings.
es_es: El ejemplo muestra el uso del `.ScalarFormatter` por defecto con diferentes configuraciones.

source: Example 1 : Default
es_es: Ejemplo 1 : Por defecto

source: Example 2 : With no Numerical Offset
es_es: Ejemplo 2 : Sin desplazamiento numérico

source: Example 3 : With Mathtext
es_es: Ejemplo 3 : Con Mathtext

source: Example 1
es_es: Ejemplo 1

source: Example 2
es_es: Ejemplo 2

source: Example 3
es_es: Ejemplo 3

source: **Total running time of the script:** ( 0 minutes 1.769 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.769 segundos)

source: :download:`Download Python source code: scalarformatter.py <scalarformatter.py>`
es_es: :download:`Descarga el código fuente de Python: scalarformatter.py <scalarformatter.py>`

source: :download:`Download Jupyter notebook: scalarformatter.ipynb <scalarformatter.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: scalarformatter.ipynb <scalarformatter.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
