Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/ticks/tick_labels_from_values.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_ticks_tick_labels_from_values.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_ticks_tick_labels_from_values.py>` para descargar el código de ejemplo completo

source: Setting tick labels from a list of values
es_es: Establecer las etiquetas de los marcadores a partir de una lista de valores

source: Using `.Axes.set_xticks` causes the tick labels to be set on the currently chosen ticks. However, you may want to allow matplotlib to dynamically choose the number of ticks and their spacing.
es_es: El uso de `.Axes.set_xticks` hace que las etiquetas de los marcadores se establezcan en los marcadores elegidos actualmente. Sin embargo, es posible que desee permitir que matplotlib elija dinámicamente el número de marcadores y su espaciado.

source: In this case it may be better to determine the tick label from the value at the tick. The following example shows how to do this.
es_es: En este caso puede ser mejor determinar la etiqueta del marcador a partir del valor en el marcador. El siguiente ejemplo muestra cómo hacerlo.

source: NB: The `.ticker.MaxNLocator` is used here to ensure that the tick values take integer values.
es_es: NB: El `.ticker.MaxNLocator` se utiliza aquí para asegurar que los valores de los marcadores toman valores enteros.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: tick_labels_from_values.py <tick_labels_from_values.py>`
es_es: :download:`Descarga el código fuente de Python: tick_labels_from_values.py <tick_labels_from_values.py>`

source: :download:`Download Jupyter notebook: tick_labels_from_values.ipynb <tick_labels_from_values.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: tick_labels_from_values.ipynb <tick_labels_from_values.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
