Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/ticks/ticks_too_many.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_ticks_ticks_too_many.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_ticks_ticks_too_many.py>` para descargar el código de ejemplo completo

source: Fixing too many ticks
es_es: Arreglando muchos marcadores

source: One common cause for unexpected tick behavior is passing a list of strings instead of numbers or datetime objects. This can easily happen without notice when reading in a comma-delimited text file. Matplotlib treats lists of strings as *categorical* variables (:doc:`/gallery/lines_bars_and_markers/categorical_variables`), and by default puts one tick per category, and plots them in the order in which they are supplied. If this is not desired, the solution is to convert the strings to a numeric type as in the following examples.
es_es: Una causa común del comportamiento inesperado de los marcadores es pasar una lista de cadenas en lugar de números u objetos de fecha. Esto puede ocurrir fácilmente sin previo aviso al leer un archivo de texto delimitado por comas. Matplotlib trata las listas de cadenas como variables *categóricas* (:doc:`/gallery/lines_bars_and_markers/categorical_variables`), y por defecto pone un marcador por categoría, y los traza en el orden en que se suministran. Si no quieres esto, la solución es convertir las cadenas a un tipo numérico como en los siguientes ejemplos.

source: Example 1: Strings can lead to an unexpected order of number ticks
es_es: Ejemplo 1: Las cadenas pueden llevar a un orden inesperado de los marcadores numéricos

source: Out:
es_es: Salida:

source: Example 2: Strings can lead to very many ticks
es_es: Ejemplo 2: Las cadenas pueden dar lugar a muchos marcadores

source: If *x* has 100 elements, all strings, then we would have 100 (unreadable) ticks, and again the solution is to convert the strings to floats:
es_es: Si *x* tiene 100 elementos, todos ellos cadenas, entonces tendríamos 100 marcadores (ilegibles), y de nuevo la solución es convertir las cadenas en flotantes:

source: Example 3: Strings can lead to an unexpected order of datetime ticks
es_es: Ejemplo 3: Las cadenas pueden llevar a un orden inesperado de los marcadores de fecha

source: A common case is when dates are read from a CSV file, they need to be converted from strings to datetime objects to get the proper date locators and formatters.
es_es: Un caso común es cuando las fechas se leen desde un archivo CSV, necesitan ser convertidas de cadenas a objetos datetime para obtener los localizadores de fecha y formateadores adecuados.

source: **Total running time of the script:** ( 0 minutes 2.247 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2.247 segundos)

source: :download:`Download Python source code: ticks_too_many.py <ticks_too_many.py>`
es_es: :download:`Descarga el código fuente de Python: ticks_too_many.py <ticks_too_many.py>`

source: :download:`Download Jupyter notebook: ticks_too_many.ipynb <ticks_too_many.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: ticks_too_many.ipynb <ticks_too_many.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
