Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.isinteractive.po
Languages: es_es

source: Return whether plots are updated after every plotting command.
es_es: Devuelve si los gráficos se actualizan después de cada comando de trazado.

source: The interactive mode is mainly useful if you build plots from the command line and want to see the effect of each command while you are building the figure.
es_es: El modo interactivo es principalmente útil si se construyen parcelas desde la línea de comandos y se quiere ver el efecto de cada comando mientras se está construyendo la figura.

source: In interactive mode:
es_es: En modo interactivo:

source: newly created figures will be shown immediately;
es_es: las cifras recién creadas se mostrarán inmediatamente;

source: figures will automatically redraw on change;
es_es: las cifras se redibujarán automáticamente al cambiar;

source: `.pyplot.show` will not block by default.
es_es: `.pyplot.show` no bloqueará por defecto.

source: In non-interactive mode:
es_es: En modo no interactivo:

source: newly created figures and changes to figures will not be reflected until explicitly asked to be;
es_es: Las cifras recién creadas y los cambios en las cifras no se reflejarán hasta que se les pida explícitamente;

source: `.pyplot.show` will block by default.
es_es: `.pyplot.show` bloqueará por defecto.

source: Enable interactive mode.
es_es: Activar modo interactivo.

source: Disable interactive mode.
es_es: Desactivar modo interactivo.

source: :obj:`show`
es_es: :obj:`mostrar`

source: Show all figures (and maybe block).
es_es: Mostrar todas las figuras (y tal vez el bloque).

source: :obj:`pause`
es_es: :obj:`pausar`

source: Show all figures, and block for a time.
es_es: Mostrar todas las cifras y el bloque por un tiempo.
