Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.rgrids.po
Languages: es_es

source: Get or set the radial gridlines on the current polar plot.
es_es: Obtener o establecer las líneas de cuadrícula radial en la parcela polar actual.

source: Call signatures::
es_es: Firma de llamadas::

source: When called with no arguments, `.rgrids` simply returns the tuple (*lines*, *labels*). When called with arguments, the labels will appear at the specified radial distances and angle.
es_es: Cuando se llama sin argumentos, `.rgrids` simplemente devuelve la tupla (*líneas*, *etiquetas*). Cuando se llama con argumentos, las etiquetas aparecerán en las distancias y ángulos radiales especificados.

source: Parameters
es_es: Parámetros

source: tuple with floats
es_es: tupla con flotantes (floats)

source: The radii for the radial gridlines
es_es: Los radios de las mallas radiales

source: tuple with strings or None
es_es: tupla con cadenas o None

source: The labels to use at each radial gridline. The `matplotlib.ticker.ScalarFormatter` will be used if None.
es_es: Las etiquetas que se utilizarán en cada línea de la cuadrícula radial. Se utilizará `matplotlib.ticker.ScalarFormatter` si no hay None.

source: The angular position of the radius labels in degrees.
es_es: La posición angular de las etiquetas de radio en grados.

source: str or None
es_es: str o None

source: Format string used in `matplotlib.ticker.FormatStrFormatter`. For example '%f'.
es_es: Cadena de formato usada en `matplotlib.ticker.FormatStrFormatter`. Por ejemplo '%f'.

source: Returns
es_es: Devuelve

source: **lines** : list of `.lines.Line2D`
es_es: **lines** : lista de `.lines.Line2D`

source: list of
es_es: lista de

source: The radial gridlines.
es_es: Las líneas de cuadrícula radiales.

source: **labels** : list of `.text.Text`
es_es: **labels** : lista de `.text.Text`

source: The tick labels.
es_es: Las etiquetas de la marca del eje.

source: Other Parameters
es_es: Otros Parámetros

source: *kwargs* are optional `.Text` properties for the labels.
es_es: *kwargs* son propiedades opcionales `.Text` para las etiquetas.

source: :obj:`.projections.polar.PolarAxes.set_rgrids`
es_es: :obj:`.projectections.polar.PolarAxes.set_rgrids`

source: Examples
es_es: Ejemplos
