Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.xlabel.po
Languages: es_es

source: Set the label for the x-axis.
es_es: Establece la etiqueta para el eje x.

source: Parameters
es_es: Parámetros

source: The label text.
es_es: Texto de la etiqueta.

source: **labelpad** : float, default: :rc:`axes.labelpad`
es_es: **labelpad** : float, por defecto: :rc:`axes.labelpad`

source: float, default:
es_es: flotante, por defecto:

source: Spacing in points from the Axes bounding box including ticks and tick labels. If None, the previous value is left as is.
es_es: Espaciado en puntos de la casilla delimitadora de ejes incluyendo ticks y etiquetas de tick. Si no, el valor anterior se deja como está.

source: **loc** : {'left', 'center', 'right'}, default: :rc:`xaxis.labellocation`
es_es: **loc** : {'left', 'center', 'right'}, por defecto: :rc:`xaxis.labellocation`

source: {'left', 'center', 'right'}, default:
es_es: {'left', 'center', 'right'}por defecto:

source: The label position. This is a high-level alternative for passing parameters *x* and *horizontalalignment*.
es_es: La posición de la etiqueta. Esta es una alternativa de alto nivel para pasar parámetros *x* y *horizontalalignment*.

source: Other Parameters
es_es: Otros Parámetros

source: **\*\*kwargs** : `.Text` properties
es_es: **\*\*kwargs** : propiedades `.Text`

source: Text properties
es_es: Propiedades del texto

source: `.Text` properties control the appearance of the label.
es_es: Las propiedades `.Text` controlan la apariencia de la etiqueta.

source: :obj:`text`
es_es: :obj:`texto`

source: Documents the properties supported by `.Text`.
es_es: Documenta las propiedades soportadas por `.Text`.

source: Examples using ``matplotlib.pyplot.xlabel``
es_es: Ejemplos usando ``matplotlib.pyplot.xlabel``

source: Basic Usage
es_es: Uso básico

source: Pyplot tutorial
es_es: Tutorial Pyplot
