Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.animation.MovieWriter.po
Languages: es_es

source: matplotlib.animation.MovieWriter
es_es: matplotlib.animation.Escritor

source: Base class for writing movies.
es_es: Clase base para escribir películas.

source: This is a base class for MovieWriter subclasses that write a movie frame data to a pipe. You cannot instantiate this class directly. See examples for how to use its subclasses.
es_es: Esta es una clase base para las subclases Mo)[video] Writer que escriben los datos de un marco de película en una tubería. No puede instanciar esta clase directamente. Vea ejemplos de cómo usar sus subclases.

source: Attributes
es_es: Atributos

source: The format used in writing frame data, defaults to 'rgba'.
es_es: El formato utilizado en la escritura de los datos del marco, por defecto a 'rgba'.

source: Figure
es_es: Figura

source: The figure to capture data from. This must be provided by the sub-classes.
es_es: La cifra de la que capturar datos. Esto debe ser proporcionado por las subclases.

source: Parameters
es_es: Parámetros

source: int, default: 5
es_es: int, por defecto: 5

source: Movie frame rate (per second).
es_es: Ratio de fotogramas de película (por segundo).

source: **codec** : str or None, default: :rc:`animation.codec`
es_es: **codec** : str o None, por defecto: :rc:`animation.codec`

source: str or None, default:
es_es: str o None, por defecto:

source: The codec to use.
es_es: El código a utilizar.

source: **bitrate** : int, default: :rc:`animation.bitrate`
es_es: **bitrate** : int, por defecto: :rc:`animation.bitrate`

source: int, default:
es_es: int, por defecto:

source: The bitrate of the movie, in kilobits per second. Higher values means higher quality movies, but increase the file size. A value of -1 lets the underlying movie encoder select the bitrate.
es_es: La tasa de bits de la película, en kilobits por segundo. Valores más altos significa películas de mayor calidad, pero aumentan el tamaño del archivo. Un valor de -1 permite al codificador de películas subyacente seleccionar la tasa de bits.

source: list of str or None, optional
es_es: lista de str o ninguno, opcional

source: Extra command-line arguments passed to the underlying movie encoder. The default, None, means to use :rc:`animation.[name-of-encoder]_args` for the builtin writers.
es_es: Argumentos extra de línea de comandos pasados al codificador de película subyacente. El valor predeterminado, Ninguno, significa usar :rc:`animation.[name-of-encoder]_args` para los escritores incorporados.

source: **metadata**
es_es: **metadatos**

source: dict[str, str], default: {}
es_es: dict[str, str], predeterminado: {}

source: A dictionary of keys and values for metadata to include in the output file. Some keys that may be of use include: title, artist, genre, subject, copyright, srcform, comment.
es_es: Un diccionario de claves y valores para los metadatos a incluir en el archivo de salida. Algunas claves que pueden ser de uso incluyen: título, artista, género, tema, copyright, srcform, comentario.

source: Methods
es_es: Métodos

source: Return the binary path to the commandline tool used by a specific subclass.
es_es: Devuelve la ruta binaria a la herramienta de línea de comandos usada por una subclase específica.

source: Finish any processing for writing the movie.
es_es: Terminar cualquier proceso para escribir la película.

source: Grab the image information from the figure and save as a movie frame.
es_es: Tome la información de la imagen de la figura y guarde como un marco de película.

source: Return whether a MovieWriter subclass is actually available.
es_es: Devuelve si una subclase Mo)[video] Writer está disponible realmente.

source: Context manager to facilitate writing the movie file.
es_es: Gestor de contexto para facilitar la escritura del archivo de película.

source: Setup for writing the movie file.
es_es: Configuración para escribir el archivo de película.

source: A tuple ``(width, height)`` in pixels of a movie frame.
es_es: Una tupla ``(anchura, altura)`` en píxeles de un marco de película.

source: :py:obj:`supported_formats <matplotlib.animation.MovieWriter.supported_formats>`\
es_es: :py:obj:`supported_format <matplotlib.animation.MovieWriter.supported_formats>`\

source: Return the binary path to the commandline tool used by a specific subclass. This is a class method so that the tool can be looked for before making a particular MovieWriter subclass available.
es_es: Devuelve la ruta binaria a la herramienta de línea de comandos usada por una subclase específica. Este es un método de clase para que la herramienta pueda ser buscada antes de poner a disposición una subclase MoWriter en particular.

source: All keyword arguments in *savefig_kwargs* are passed on to the `~.Figure.savefig` call that saves the figure.
es_es: Todos los argumentos de palabra clave en *savefig_kwargs* se pasan a la llamada `~.Figure.savefig` que guarda la figura.

source: The figure object that contains the information for frames.
es_es: El objeto figura que contiene la información de los marcos.

source: The filename of the resulting movie file.
es_es: El nombre de archivo del archivo de película resultante.

source: **dpi** : float, default: ``fig.dpi``
es_es: **dpi** : float, por defecto: ``fig.dpi``

source: float, default:
es_es: flotante, por defecto:

source: The DPI (or resolution) for the file. This controls the size in pixels of the resulting movie file.
es_es: El DPI (o resolución) para el archivo. Esto controla el tamaño en píxeles del archivo de película resultante.
