Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.SubplotBase.po
Languages: es_es

source: Base class for subplots, which are :class:`Axes` instances with additional methods to facilitate generating and manipulating a set of :class:`Axes` within a figure.
es_es: Clase base para subplots, que son instancias :class:`Axes` con métodos adicionales para facilitar la generación y manipulación de un conjunto de :class:`Axes` dentro de una figura.

source: Parameters
es_es: Parámetros

source: **fig** : `matplotlib.figure.Figure`
es_es: **figura** : `matplotlib.figure.Figure`

source: **\*args** : tuple (*nrows*, *ncols*, *index*) or int
es_es: **\*args** : tupla (*nrows*, *ncols*, *índice*) o int

source: tuple (
es_es: tupla (

source: The array of subplots in the figure has dimensions ``(nrows, ncols)``, and *index* is the index of the subplot being created. *index* starts at 1 in the upper left corner and increases to the right.
es_es: El array de subparcelas en la figura tiene dimensiones ``(nrows, ncols)``, y *index* es el índice de la subparcela que se está creando. *índice* comienza en 1 en la esquina superior izquierda y aumenta a la derecha.

source: If *nrows*, *ncols*, and *index* are all single digit numbers, then *args* can be passed as a single 3-digit number (e.g. 234 for (2, 3, 4)).
es_es: Si *nrows*, *ncols*, y *índice* son todos números de un solo dígito, entonces *args* puede ser pasado como un único número de 3 dígitos (e. . 234 for (2, 3, 4)).

source: Keyword arguments are passed to the Axes (sub)class constructor.
es_es: Los argumentos de palabra clave se pasan al constructor de clase Axes (sub)clase.

source: [*Deprecated*] Change subplot geometry, e.g., from (1, 1, 1) to (2, 2, 3).
es_es: [*Obsoleto*] Cambiar geometrificación de subparcelas, por ejemplo, de (1, 1, 1) a (2, 2, 3).

source: [*Deprecated*] Get the subplot geometry, e.g., (2, 2, 3).
es_es: [*Desaprobado*] Obtenga la geometización de subparcela, por ejemplo, (2, 2, 3).

source: Return the `.GridSpec` instance associated with the subplot.
es_es: Devuelve la instancia `.GridSpec` asociada con el subplot.

source: Return the `.SubplotSpec` instance associated with the subplot.
es_es: Devuelve la instancia `.SubplotSpec` asociada con el subplot.

source: Only show "outer" labels and tick labels.
es_es: Mostrar sólo etiquetas "Exteriores" y etiquetas de etiquetas.

source: x-labels are only kept for subplots on the last row (or first row, if labels are on the top side); y-labels only for subplots on the first column (or last column, if labels are on the right side).
es_es: Las etiquetas x sólo se guardan para las subparcelas en la última fila (o la primera fila, si las etiquetas están en el lado superior); y-labels sólo para subparcelas en la primera columna (o en la última columna, si las etiquetas están en el lado derecho).

source: Set the `.SubplotSpec`. instance associated with the subplot.
es_es: Establece el `.SubplotSpec`. instancia asociada con el subplot.

source: [*Deprecated*] Update the subplot position from ``self.figure.subplotpars``.
es_es: [*Desaprobado*] Actualizar la posición de subplot desde ``self.figure.subplotpars``.
