Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.fill.po
Languages: es_es

source: Plot filled polygons.
es_es: Trazar polígonos llenos.

source: Parameters
es_es: Parámetros

source: sequence of x, y, [color]
es_es: secuencia de x, y, [color]

source: Each polygon is defined by the lists of *x* and *y* positions of its nodes, optionally followed by a *color* specifier. See :mod:`matplotlib.colors` for supported color specifiers. The standard color cycle is used for polygons without a color specifier.
es_es: Cada polígono se define por las listas de posiciones *x* y *y* de sus nodos, opcionalmente seguidas por un especificador de *color*. Vea :mod:`matplotlib.colors` para especificadores de color compatibles. El ciclo de color estándar se utiliza para polígonos sin un especificador de color.

source: You can plot multiple polygons by providing multiple *x*, *y*, *[color]* groups.
es_es: Puedes graficar múltiples polígonos proporcionando múltiples grupos *x*, *y*, *[color]*.

source: For example, each of the following is legal::
es_es: Por ejemplo, cada una de las siguientes opciones es legal::

source: An object with labelled data. If given, provide the label names to plot in *x* and *y*, e.g.::
es_es: Un objeto con datos etiquetados. Si es dado, proporcione los nombres de las etiquetas a trazar en *x* y *y*, por ejemplo:

source: Returns
es_es: Devuelve

source: list of `~matplotlib.patches.Polygon`
es_es: lista de `~matplotlib.patches.Polygon`

source: Other Parameters
es_es: Otros Parámetros

source: **\*\*kwargs** : `~matplotlib.patches.Polygon` properties
es_es: **\*\*kwargs** : propiedades `~matplotlib.patches.Polygon`

source: Polygon properties
es_es: Propiedades del polígono

source: Use :meth:`fill_between` if you would like to fill the region between two curves.
es_es: Usa :meth:`fill_between` si deseas llenar la región entre dos curvas.

source: Examples using ``matplotlib.axes.Axes.fill``
es_es: Ejemplos usando ``matplotlib.axes.Axes.fill``

source: Radar chart (aka spider or star chart)
es_es: Diagrama de radar (también conocido como diagrama de araña o diagrama de estrellas)
