Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.quiverkey.po
Languages: es_es

source: Add a key to a quiver plot.
es_es: Agrega una clave a una parcela de quiver.

source: The positioning of the key depends on *X*, *Y*, *coordinates*, and *labelpos*. If *labelpos* is 'N' or 'S', *X*, *Y* give the position of the middle of the key arrow. If *labelpos* is 'E', *X*, *Y* positions the head, and if *labelpos* is 'W', *X*, *Y* positions the tail; in either of these two cases, *X*, *Y* is somewhere in the middle of the arrow+label key object.
es_es: La posición de la clave depende de *X*, *Y*, *coordenadas*, y *etiquetas*. Si *etiquetas* es 'N' o 'S', *X*, *Y* da la posición del centro de la flecha de tecla. Si *etiquetas* es 'E', *X*, *Y* posiciona la cabeza, y si *etiquetas* es 'W', *X*, *Y* posiciona la cola; en cualquiera de estos dos casos, *X*, *Y* está en algún lugar en el centro del objeto clave de flecha+etiqueta.

source: Parameters
es_es: Parámetros

source: A `.Quiver` object as returned by a call to `~.Axes.quiver()`.
es_es: Un objeto `.Quiver` devuelto por una llamada a `~.Axes.quiver()`.

source: The location of the key.
es_es: La ubicación de la clave.

source: The length of the key.
es_es: La longitud de la clave.

source: **label**
es_es: **etiqueta**

source: The key label (e.g., length and units of the key).
es_es: La etiqueta de la clave (por ejemplo, longitud y unidades de la clave).

source: The angle of the key arrow, in degrees anti-clockwise from the x-axis.
es_es: El ángulo de la flecha de teclado, en grados en sentido antihorario desde el eje x.

source: **coordinates**
es_es: **coordenadas**

source: {'axes', 'figure', 'data', 'inches'}, default: 'axes'
es_es: {'ejes', 'figura', 'data', 'pulgadas'}, por defecto: 'ejes'

source: Coordinate system and units for *X*, *Y*: 'axes' and 'figure' are normalized coordinate systems with (0, 0) in the lower left and (1, 1) in the upper right; 'data' are the axes data coordinates (used for the locations of the vectors in the quiver plot itself); 'inches' is position in the figure in inches, with (0, 0) at the lower left corner.
es_es: Sistema de coordenadas y unidades para *X*, *Y*: 'ejes' y 'figura' son sistemas de coordenadas normalizados con (0, 0) en la parte inferior izquierda y (1, 1) en la parte superior derecha; 'data' son las coordenadas de datos de los ejes (utilizadas para las ubicaciones de los vectores en la propia trama del quiver); 'pulgadas' es la posición en la figura en pulgadas, con (0, 0) en la esquina inferior izquierda.

source: Overrides face and edge colors from *Q*.
es_es: Sobreescribe los colores de cara y bordes de *Q*.

source: **labelpos**
es_es: **etiquetas**

source: Position the label above, below, to the right, to the left of the arrow, respectively.
es_es: Coloque la etiqueta arriba, abajo, a la derecha, a la izquierda de la flecha, respectivamente.

source: **labelsep**
es_es: **etiqueta**

source: float, default: 0.1
es_es: float, por defecto: 0.1

source: Distance in inches between the arrow and the label.
es_es: Distancia en pulgadas entre la flecha y la etiqueta.

source: **labelcolor** : color, default: :rc:`text.color`
es_es: **labelcolor** : color, por defecto: :rc:`text.color`

source: color, default:
es_es: color, por defecto:

source: Label color.
es_es: Color de etiqueta.

source: A dictionary with keyword arguments accepted by the `~matplotlib.font_manager.FontProperties` initializer: *family*, *style*, *variant*, *size*, *weight*.
es_es: Un diccionario con argumentos de palabras clave aceptados por el inicializador `~matplotlib.font_manager.FontProperties`: *familia*, *estilo*, *variante*, *tamaño*, *peso*.

source: Any additional keyword arguments are used to override vector properties taken from *Q*.
es_es: Cualquier argumento adicional de palabra clave se utiliza para sobreescribir las propiedades vectoriales tomadas de *Q*.

source: Examples using ``matplotlib.axes.Axes.quiverkey``
es_es: Ejemplos usando ``matplotlib.axes.Axes.quiverkey``

source: Advanced quiver and quiverkey functions
es_es: Funciones avanzadas de quiver y quiverkey

source: Quiver Simple Demo
es_es: Demostración de Quiver Simple
