Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.indicate_inset_zoom.po
Languages: es_es

source: Add an inset indicator rectangle to the Axes based on the axis limits for an *inset_ax* and draw connectors between *inset_ax* and the rectangle.
es_es: Agrega un rectángulo de indicador de entrada a los ejes basado en los límites del eje para un *inset_ax* y dibuja los conectores entre *inset_ax* y el rectángulo.

source: Parameters
es_es: Parámetros

source: Axes
es_es: Ejes

source: Inset Axes to draw connecting lines to. Two lines are drawn connecting the indicator box to the inset Axes on corners chosen so as to not overlap with the indicator box.
es_es: Entrar ejes para dibujar líneas de conexión. Se dibujan dos líneas que conectan la caja del indicador a los ejes de entrada en las esquinas elegidas para no solaparse con la caja del indicador.

source: Other keyword arguments are passed on to `.Axes.indicate_inset`
es_es: Otros argumentos de palabra clave son pasados a `.Axes.indicate_inset`

source: Returns
es_es: Devuelve

source: **rectangle_patch** : `.patches.Rectangle`
es_es: **rectángulo_patch** : `.patches.Rectangle`

source: patches.Rectangle
es_es: parches.Rectángulo

source: Rectangle artist.
es_es: Artista rectangular.

source: **connector_lines** : 4-tuple of `.patches.ConnectionPatch`
es_es: **connector_lines** : 4-tupla de `.patches.ConnectionPatch`

source: 4-tuple of
es_es: 4 tuplas de

source: Each of four connector lines coming from the rectangle drawn on this axis, in the order lower left, upper left, lower right, upper right. Two are set with visibility to *False*, but the user can set the visibility to *True* if the automatic choice is not deemed correct.
es_es: Cada una de las cuatro líneas de conector que provienen del rectángulo dibujado en este eje, en el orden inferior izquierdo, superior izquierda, inferior derecha, superior derecha. Dos se establecen con visibilidad a *False*, pero el usuario puede establecer la visibilidad a *Verdadero* si la opción automática no se considera correcta.

source: This method is experimental as of 3.0, and the API may change.
es_es: Este método es experimental a partir de 3.0, y la API puede cambiar.

source: Examples using ``matplotlib.axes.Axes.indicate_inset_zoom``
es_es: Ejemplos usando ``matplotlib.axes.Axes.indicate_inset_zoom``

source: Zoom region inset axes
es_es: Ejes de inserción de la región de zoom
