Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.colors.TwoSlopeNorm.po
Languages: es_es

source: Normalize data with a set center.
es_es: Normalizar los datos con un centro determinado.

source: Useful when mapping data with an unequal rates of change around a conceptual center, e.g., data that range from -2 to 4, with 0 as the midpoint.
es_es: Útil al mapear datos con tasas desiguales de cambio alrededor de un centro conceptual. ., datos que van de -2 a 4, con 0 como punto medio.

source: Parameters
es_es: Parámetros

source: **vcenter**
es_es: **central**

source: The data value that defines ``0.5`` in the normalization.
es_es: El valor de datos que define ``0.5`` en la normalización.

source: float, optional
es_es: float, opcional

source: The data value that defines ``0.0`` in the normalization. Defaults to the min value of the dataset.
es_es: El valor de datos que define ``0.0`` en la normalización. Por defecto es el valor mínimo del conjunto de datos.

source: The data value that defines ``1.0`` in the normalization. Defaults to the max value of the dataset.
es_es: El valor de datos que define ``1.0`` en la normalización. Por defecto es el valor máximo del conjunto de datos.

source: Examples
es_es: Ejemplos

source: This maps data value -4000 to 0., 0 to 0.5, and +10000 to 1.0; data between is linearly interpolated::
es_es: Este mapea datos de -4000 a 0., 0 a 0.5, y +10000 a 1.0; los datos entre están interpolados linealmente::

source: Map value to the interval [0, 1]. The clip argument is unused.
es_es: Mapea el valor del intervalo [0, 1]. El argumento del clip no está utilizado.

source: Get vmin and vmax, and then clip at vcenter
es_es: Obtener vmin y vmax, y luego clip en vcenter

source: Examples using ``matplotlib.colors.TwoSlopeNorm``
es_es: Ejemplos usando ``matplotlib.colors.TwoSlopeNorm``

source: Colormap Normalization
es_es: Normalización del mapa de colores
