Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.close.po
Languages: es_es

source: matplotlib.pyplot.close
es_es: matplotlib.pyplot

source: Close a figure window.
es_es: Cerrar una ventana de figura.

source: Parameters
es_es: Parámetros

source: **fig** : None or int or str or `.Figure`
es_es: **figura** : Ninguno o int o str o `.Figure`

source: None or int or str or
es_es: Ninguno o int o str o

source: The figure to close. There are a number of ways to specify this:
es_es: La cifra a cerrar. Hay varias maneras de especificar esto:

source: *None*: the current figure
es_es: *Ninguno*: la figura actual

source: `.Figure`: the given `.Figure` instance
es_es: `.Figure`: la instancia `.Figure` dada

source: ``int``: a figure number
es_es: ``int``: un número de figura

source: ``str``: a figure name
es_es: ``str``: un nombre de figura

source: 'all': all figures
es_es: 'todos': todas las cifras

source: Examples using ``matplotlib.pyplot.close``
es_es: Ejemplos usando ``matplotlib.pyplot.close``

source: Multiprocess
es_es: Multiproceso
