Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.set_position.po
Languages: es_es

source: matplotlib.axes.Axes.set\_position
es_es: matplotlib.axes.Ejes.set\_posición

source: Set the Axes position.
es_es: Establecer la posición de los ejes.

source: Axes have two position attributes. The 'original' position is the position allocated for the Axes. The 'active' position is the position the Axes is actually drawn at. These positions are usually the same unless a fixed aspect is set to the Axes. See `.Axes.set_aspect` for details.
es_es: Los ejes tienen dos atributos de posición. La posición 'original' es la posición asignada para los ejes. La posición 'activa' es la posición en la que los ejes se dibujan. Estas posiciones son usualmente las mismas a menos que se establezca un aspecto fijo en los ejes. Consulte `.Axes.set_aspect` para más detalles.

source: Parameters
es_es: Parámetros

source: **pos** : [left, bottom, width, height] or `~matplotlib.transforms.Bbox`
es_es: **pos** : [izquierdo, abajo, anchura, altura] o `~matplotlib.transforms.Bbox`

source: [left, bottom, width, height] or
es_es: [izquierda, inferior, anchura, altura] o

source: The new position of the in `.Figure` coordinates.
es_es: La nueva posición de las coordenadas `.Figure`.

source: **which**
es_es: **qué**

source: {'both', 'active', 'original'}, default: 'both'
es_es: {'both', 'active', 'original'}, por defecto: 'ambos'

source: Determines which position variables to change.
es_es: Determina qué variables de posición cambiar.

source: Examples using ``matplotlib.axes.Axes.set_position``
es_es: Ejemplos usando ``matplotlib.axes.Axes.set_position``

source: Contour Demo
es_es: Demostración de contornos
