Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.set_prop_cycle.po
Languages: es_es

source: matplotlib.axes.Axes.set\_prop\_cycle
es_es: matplotlib.axes.Ejes.set\_prop\_cycle

source: Set the property cycle of the Axes.
es_es: Establece el ciclo de propiedades de los ejes.

source: The property cycle controls the style properties such as color, marker and linestyle of future plot commands. The style properties of data already added to the Axes are not modified.
es_es: El ciclo de la propiedad controla las propiedades de estilo como el color, el marcador y el estilo de línea de futuros comandos de la parcela. Las propiedades de estilo de los datos ya añadidos a los ejes no se modifican.

source: Call signatures::
es_es: Firma de llamadas::

source: Form 1 sets given `~cycler.Cycler` object.
es_es: El formulario 1 establece un objeto `~cycler.Cycler`.

source: Form 2 creates a `~cycler.Cycler` which cycles over one or more properties simultaneously and set it as the property cycle of the Axes. If multiple properties are given, their value lists must have the same length. This is just a shortcut for explicitly creating a cycler and passing it to the function, i.e. it's short for ``set_prop_cycle(cycler(label=values label2=values2, ...))``.
es_es: La forma 2 crea un `~cycler.Cycler` que cicla sobre una o más propiedades simultáneamente y establecerla como el ciclo de propiedades de los ejes. Si se dan múltiples propiedades, sus listas de valores deben tener la misma longitud. Esto es sólo un acceso directo para crear explícitamente un cicler y pasarlo a la función, es decir, es un abreviatura de ``set_prop_cycle(cycler(label=values label2=values2, ...))``.

source: Form 3 creates a `~cycler.Cycler` for a single property and set it as the property cycle of the Axes. This form exists for compatibility with the original `cycler.cycler` interface. Its use is discouraged in favor of the kwarg form, i.e. ``set_prop_cycle(label=values)``.
es_es: El formulario 3 crea un `~cycler.Cycler` para una única propiedad y establecerla como el ciclo de propiedades de los ejes. Este formulario existe por compatibilidad con el `cycler original. interfaz ycler`. Su uso está desaconsejado a favor de la forma kwarg, es decir, ``set_prop_cycle(label=values)``.

source: Parameters
es_es: Parámetros

source: Cycler
es_es: Ciclador

source: Set the given Cycler. *None* resets to the cycle defined by the current style.
es_es: Establece el Cycler dado. *nunca* se reinicia al ciclo definido por el estilo actual.

source: **label**
es_es: **etiqueta**

source: The property key. Must be a valid `.Artist` property. For example, 'color' or 'linestyle'. Aliases are allowed, such as 'c' for 'color' and 'lw' for 'linewidth'.
es_es: La clave de la propiedad. Debe ser una propiedad `.Artist` válida. Por ejemplo, 'color' o 'linestyle'. Se permiten alias, como 'c' para 'color' y 'lw' para 'ancho de línea'.

source: **values**
es_es: **valores**

source: Finite-length iterable of the property values. These values are validated and will raise a ValueError if invalid.
es_es: Longitud finita iterable de los valores de la propiedad. Estos valores son validados y generarán un ValueError si no es válido.

source: Convenience function for creating validated cyclers for properties.
es_es: Función de comodidad para crear cicleres validados para las propiedades.

source: The original function for creating unvalidated cyclers.
es_es: La función original para crear cicleres no validados.

source: Examples
es_es: Ejemplos

source: Setting the property cycle for a single property:
es_es: Estableciendo el ciclo de la propiedad para una sola propiedad:

source: Setting the property cycle for simultaneously cycling over multiple properties (e.g. red circle, green plus, blue cross):
es_es: Estableciendo el ciclo de propiedad para ciclos simultáneos sobre múltiples propiedades (por ejemplo, círculo rojo, verde plus, cruz azul):

source: Examples using ``matplotlib.axes.Axes.set_prop_cycle``
es_es: Ejemplos usando ``matplotlib.axes.Axes.set_prop_cycle``

source: Bachelor's degrees by gender
es_es: Títulos de grado por género

source: Styling with cycler
es_es: Estilización con cycler
