Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.patches.Patch.po
Languages: es_es

source: matplotlib.patches.Patch
es_es: matplotlib.patches.Parche

source: A patch is a 2D artist with a face color and an edge color.
es_es: Un parche es un artista 2D de color cara y borde.

source: If any of *edgecolor*, *facecolor*, *linewidth*, or *antialiased* are *None*, they default to their rc params setting.
es_es: Si alguno de los *edgecolor*, *facecolor*, *lineancho*, o *antialiased* son *o*, ellos por defecto en su configuración de params rc.

source: The following kwarg properties are supported
es_es: Las siguientes propiedades kwarg están soportadas

source: Property
es_es: Propiedad

source: Description
es_es: Descripción

source: a filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array
es_es: una función de filtro, que toma un arreglo de puntos flotantes (m, n, 3) y un valor de dpi, y devuelve un arreglo (m, n, 3)

source: unknown
es_es: desconocido

source: :meth:`antialiased <matplotlib.patches.Patch.set_antialiased>` or aa
es_es: :meth:`antialias <matplotlib.patches.Patch.set_antialiased>` o aa

source: `.CapStyle` or {'butt', 'projecting', 'round'}
es_es: `.CapStyle` o {'butt', 'projecting', 'round'}

source: Patch or (Path, Transform) or None
es_es: Patch o (Path, Transform) o None

source: :meth:`edgecolor <matplotlib.patches.Patch.set_edgecolor>` or ec
es_es: :meth:`edgecolor <matplotlib.patches.Patch.set_edgecolor>` o ec

source: color or None
es_es: color o ninguno

source: :meth:`facecolor <matplotlib.patches.Patch.set_facecolor>` or fc
es_es: :meth:`facecolor <matplotlib.patches.Patch.set_facecolor>` o fc

source: :meth:`fill <matplotlib.patches.Patch.set_fill>`
es_es: :meth:`rellenar <matplotlib.patches.Patch.set_fill>`

source: :meth:`hatch <matplotlib.patches.Patch.set_hatch>`
es_es: :meth:`colgante <matplotlib.patches.Patch.set_hatch>`

source: `.JoinStyle` or {'miter', 'round', 'bevel'}
es_es: `.JoinStyle` o {'miter', 'round', 'bevel'}

source: :meth:`linestyle <matplotlib.patches.Patch.set_linestyle>` or ls
es_es: :meth:`linestyle <matplotlib.patches.Patch.set_linestyle>` o ls

source: float or None
es_es: float o None

source: None or bool or float or callable
es_es: None o bool o float o callable

source: float
es_es: de punto flotante (float)

source: Test whether the mouse event occurred in the patch.
es_es: Evalúa si el evento del ratón ocurrió en el parche.

source: Returns
es_es: Devuelve

source: (bool, empty dict)
es_es: (bool, dictado vacío)

source: Return whether the given point is inside the patch.
es_es: Devuelve si el punto dado está dentro del parche.

source: Parameters
es_es: Parámetros

source: The point (x, y) to check, in target coordinates of ``self.get_transform()``. These are display coordinates for patches that are added to a figure or axes.
es_es: El punto (x, y) a comprobar, en las coordenadas de destino de ``self.get_transform()``. Estas son coordenadas de visualización para parches que se añaden a una figura o ejes.

source: float, optional
es_es: float, opcional

source: Add an additional margin on the patch in target coordinates of ``self.get_transform()``. See `.Path.contains_point` for further details.
es_es: Agregue un margen adicional en el parche en las coordenadas de destino de ``self.get_transform()``. Vea `.Path.contains_point` para más detalles.

source: The proper use of this method depends on the transform of the patch. Isolated patches do not have a transform. In this case, the patch creation coordinates and the point coordinates match. The following example checks that the center of a circle is within the circle
es_es: El uso adecuado de este método depende de la transformación del parche, los parches aislados no tienen una transforma. En este caso, la creación de parches coordenadas y las coordenadas de puntos coinciden. El siguiente ejemplo comprueba que el centro de un círculo está dentro del círculo

source: The convention of checking against the transformed patch stems from the fact that this method is predominantly used to check if display coordinates (e.g. from mouse events) are within the patch. If you want to do the above check with data coordinates, you have to properly transform them first:
es_es: La convención de comprobar contra el parche transformado proviene del hecho de que este método se utiliza de forma predominante para comprobar si se muestran las coordenadas (e. . de los eventos del ratón) están dentro del parche. Si quieres hacer la comprobación anterior con las coordenadas de datos, primero tienes que transformarlas correctamente:

source: Return whether the given points are inside the patch.
es_es: Devuelve si los puntos dados están dentro del parche.

source: **points**
es_es: **puntos**

source: The points to check, in target coordinates of ``self.get_transform()``. These are display coordinates for patches that are added to a figure or axes. Columns contain x and y values.
es_es: Los puntos a comprobar, en las coordenadas de destino de ``self.get_transform()``. Estas son coordenadas de visualización de parches que se añaden a una figura o ejes. Las columnas contienen valores x y y.

source: length-N bool array
es_es: length-N arreglo bool

source: The proper use of this method depends on the transform of the patch. See the notes on `.Patch.contains_point`.
es_es: El uso adecuado de este método depende de la transformación del parche. Vea las notas en `.Patch.contains_point`.

source: Draw the Artist (and its children) using the given renderer.
es_es: Dibuja el Artist (y sus hijos) usando el renderizador dado.

source: This has no effect if the artist is not visible (`.Artist.get_visible` returns False).
es_es: Esto no tiene efecto si el artist no es visible (`.Artist.get_visible` devuelve False).

source: **renderer** : `.RendererBase` subclass.
es_es: **renderer** : `.RendererBase` subclase.

source: RendererBase subclass.
es_es: Subclase RendererBase.

source: This method is overridden in the Artist subclasses.
es_es: Este método se sobrescribe en las subclases de Artist.

source: Return whether the patch is filled.
es_es: Devuelve si el parche está lleno.

source: Alias for `get_antialiased`.
es_es: Alias para `get_antialiased`.

source: Return whether antialiasing is used for drawing.
es_es: Devuelve si se utiliza el antialiasing para dibujar.

source: Return the capstyle.
es_es: Devuelve el capstyle.

source: Return the `~.transforms.Transform` mapping data coordinates to physical coordinates.
es_es: Devuelve las coordenadas de datos de mapeo `~.transforms.Transform` a las coordenadas físicas.

source: Alias for `get_edgecolor`.
es_es: Alias para `get_edgecolor`.

source: Return the edge color.
es_es: Devuelve el color del borde.

source: Return the `Patch`'s axis-aligned extents as a `~.transforms.Bbox`.
es_es: Devuelve el eje alineado del `Parche como un `~.transforms.Bbox`.

source: Return the face color.
es_es: Devuelve el color de la cara.

source: Alias for `get_facecolor`.
es_es: Alias para `get_facecolor`.

source: Return the hatching pattern.
es_es: Devuelve el patrón de eclosión.

source: Return the joinstyle.
es_es: Devuelve el joinstyle.

source: Return the linestyle.
es_es: Devuelve el estilo de línea.

source: Return the line width in points.
es_es: Devuelve el ancho de la línea en puntos.

source: Alias for `get_linestyle`.
es_es: Alias para `get_linestyle`.

source: Alias for `get_linewidth`.
es_es: Alias para `get_linewidth`.

source: Return the `~.transforms.Transform` instance mapping patch coordinates to data coordinates.
es_es: Devuelve las coordenadas del parche `~.transforms.Transform` de la instancia del parche a las coordenadas de datos.

source: For example, one may define a patch of a circle which represents a radius of 5 by providing coordinates for a unit circle, and a transform which scales the coordinates (the patch coordinate) by 5.
es_es: Por ejemplo, se puede definir un parche de un círculo que representa un radio de 5 proporcionando coordenadas para un círculo unitario, y una transformación que escala las coordenadas (la coordenada del parche) por 5.

source: Return the path of this patch.
es_es: Devuelve la ruta de este parche.

source: Return the `~.transforms.Transform` applied to the `Patch`.
es_es: Devuelve el `~.transforms.Transform` aplicado al `Parch`.

source: Return a copy of the vertices used in this patch.
es_es: Devuelve una copia de los vértices usados en este parche.

source: If the patch contains Bezier curves, the curves will be interpolated by line segments. To access the curves as curves, use `get_path`.
es_es: Si el parche contiene curvas Bézier, las curvas serán interpoladas por segmentos de línea. Para acceder a las curvas como curvas, use `get_path`.

source: Get the artist's bounding box in display space.
es_es: Obtenga la caja delimitadora del artist en el espacio de visualización.

source: The bounding box' width and height are nonnegative.
es_es: La anchura y la altura de la caja delimitadora son no negativas.

source: Subclasses should override for inclusion in the bounding box "tight" calculation. Default is to return an empty bounding box at 0, 0.
es_es: Las subclases deben anularlo para incluirlo en el cálculo de la caja delimitadora "ajustada". Por defecto devuelve una caja delimitadora vacía en 0, 0.

source: Be careful when using this function, the results will not update if the artist window extent of the artist changes. The extent can change due to any changes in the transform stack, such as changing the axes limits, the figure size, or the canvas used (as is done when saving a figure). This can lead to unexpected behavior where interactive figures will look fine on the screen, but will save incorrectly.
es_es: Ten cuidado cuando uses esta función, los resultados no se actualizarán si la extensión de la ventana del artist cambia. La extensión puede cambiar debido a cualquier cambio en la pila de transformaciones, como cambiar los límites de los ejes, el tamaño de la figura o el lienzo utilizado (como se hace al guardar una figura). Esto puede llevar a un comportamiento inesperado donde las figuras interactivas se verán bien en la pantalla, pero se guardarán incorrectamente.

source: Set multiple properties at once.
es_es: Establece varias propiedades a la vez.

source: Supported properties are
es_es: Las propiedades admitidas son

source: :meth:`antialiased <matplotlib.patches.Patch.set_antialiased>`
es_es: :meth:`antialias <matplotlib.patches.Patch.set_antialiased>`

source: Alias for `set_antialiased`.
es_es: Alias para `set_antialiased`.

source: Set the alpha value used for blending - not supported on all backends.
es_es: Establece el valor alfa usado para mezclar - no soportado en todos los backends.

source: **alpha**
es_es: **alfa**

source: scalar or None
es_es: escalar o None

source: *alpha* must be within the 0-1 range, inclusive.
es_es: *alpha* debe estar dentro del rango 0-1, inclusive.

source: Set whether to use antialiased rendering.
es_es: Establece si quieres usar el procesado antialias.

source: Set the `.CapStyle`.
es_es: Establece el `.CapStyle`.

source: **s** : `.CapStyle` or {'butt', 'projecting', 'round'}
es_es: **s** : `.CapStyle` o {'butt', 'projecting', 'round'}

source: CapStyle or {'butt', 'projecting', 'round'}
es_es: CapEstilo o {'butt', 'projecting', 'round'}

source: Set both the edgecolor and the facecolor.
es_es: Establece tanto el color del borde como el color del rostro.

source: For setting the edge or face color individually.
es_es: Para ajustar el borde o el color de la cara individualmente.

source: Alias for `set_edgecolor`.
es_es: Alias para `set_edgecolor`.

source: Set the patch edge color.
es_es: Establecer el color del borde del parche.

source: Set the patch face color.
es_es: Establecer el color de la cara del parche.

source: Alias for `set_facecolor`.
es_es: Alias para `set_facecolor`.

source: Set whether to fill the patch.
es_es: Establece si quieres rellenar el parche.

source: Set the hatching pattern.
es_es: Establece el patrón de eclosión.

source: *hatch* can be one of::
es_es: *hatch* puede ser uno de::

source: Letters can be combined, in which case all the specified hatchings are done. If same letter repeats, it increases the density of hatching of that pattern.
es_es: Las letras se pueden combinar, en cuyo caso todas las eclosiones especificadas se hacen. Si se repite la misma letra, aumenta la densidad de eclosión de ese patrón.

source: Hatching is supported in the PostScript, PDF, SVG and Agg backends only.
es_es: El incubamiento sólo se admite en los backends de PostScript, PDF, SVG y Agg.

source: Set the `.JoinStyle`.
es_es: Establece el `.JoinStyle`.

source: **s** : `.JoinStyle` or {'miter', 'round', 'bevel'}
es_es: **s** : `.JoinStyle` o {'miter', 'round', 'bevel'}

source: JoinStyle or {'miter', 'round', 'bevel'}
es_es: Estilo de registro o {'miter', 'round', 'bevel'}

source: Set the patch linestyle.
es_es: Establecer el estilo de línea del parche.

source: linestyle
es_es: estilo de línea

source: description
es_es: descripción

source: ``'-'`` or ``'solid'``
es_es: ``'-'`` o ``'sólid'``

source: solid line
es_es: línea sólida

source: ``'--'`` or ``'dashed'``
es_es: ``'--'`` o ``'guionado'``

source: dashed line
es_es: línea de guiones

source: ``'-.'`` or ``'dashdot'``
es_es: ``'-.'`` o ``'dashdot'``

source: dash-dotted line
es_es: línea punteada en guión

source: ``':'`` or ``'dotted'``
es_es: ``':'`` o ``'dotted'``

source: dotted line
es_es: línea de puntos

source: ``'none'``, ``'None'``, ``' '``, or ``''``
es_es: ``'ninguno '``, ``'Ninguno'``, ``' '``, o ``''``

source: draw nothing
es_es: no dibujar

source: Alternatively a dash tuple of the following form can be provided::
es_es: Alternativamente se puede proporcionar una tupla de guión de la siguiente forma::

source: where ``onoffseq`` is an even length tuple of on and off ink in points.
es_es: donde ``onoffseq`` es una tupla de longitud uniforme de la tinta de encendido y apagado en puntos.

source: The line style.
es_es: Estilo de línea.

source: Set the patch linewidth in points.
es_es: Establecer el ancho de línea del parche en puntos.

source: Alias for `set_linestyle`.
es_es: Alias para `set_linestyle`.

source: Alias for `set_linewidth`.
es_es: Alias para `set_linewidth`.

source: Copy properties from *other* to *self*.
es_es: Copiar propiedades de *otro* a *self*.

source: Examples using ``matplotlib.patches.Patch``
es_es: Ejemplos usando ``matplotlib.patches.Patch``

source: Axes box aspect
es_es: Aspecto de la caja de los ejes

source: Bar of pie
es_es: Barra de torta

source: Scale invariant angle label
es_es: Etiqueta de ángulo invariante de la escala

source: Drawing fancy boxes
es_es: Dibujar cajas elegantes

source: Style sheets reference
es_es: Referencia de las hojas de estilo

source: Anatomy of a figure
es_es: Anatomía de una figura

source: Looking Glass
es_es: Espejo

source: Path Editor
es_es: Editor de rutas

source: Pick Event Demo
es_es: Demostración de selección de eventos

source: Poly Editor
es_es: Editor Poly

source: Trifinder Event Demo
es_es: Demostración de eventos de Trifinder

source: Matplotlib logo
es_es: Logotipo de Matplotlib

source: Radar chart (aka spider or star chart)
es_es: Diagrama de radar (también conocido como diagrama de araña o diagrama de estrellas)

source: Artist tutorial
es_es: Tutorial de artistas

source: Transformations Tutorial
es_es: Tutorial de transformaciones

source: Specifying Colors
es_es: Especificación de colores

source: Text properties and layout
es_es: Propiedades y diseño del texto

source: Annotations
es_es: Anotaciones
