Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.boxplot.po
Languages: es_es

source: Draw a box and whisker plot.
es_es: Dibuja una caja y una parcela de whisker.

source: The box extends from the first quartile (Q1) to the third quartile (Q3) of the data, with a line at the median. The whiskers extend from the box by 1.5x the inter-quartile range (IQR). Flier points are those past the end of the whiskers. See https://en.wikipedia.org/wiki/Box_plot for reference.
es_es: La caja se extiende desde el primer cuartil (Q1) hasta el tercer cuartil (Q3) de los datos, con una línea en la mediana. Los whiskers se extienden de la caja por 1. x el rango inter-cuartile (IQR). Los puntos voladores son los que están más allá del final de los whiskers. Vea https://es.wikipedia.org/wiki/Box_plot para referencia.

source: Parameters
es_es: Parámetros

source: Array or a sequence of vectors.
es_es: Arreglo o una secuencia de vecores.

source: The input data. If a 2D array, a boxplot is drawn for each column in *x*. If a sequence of 1D arrays, a boxplot is drawn for each array in *x*.
es_es: Los datos de entrada. Si una matriz 2D es dibujada para cada columna en *x*. Si una secuencia de matrices 1D, se dibuja una casilla para cada matriz en *x*.

source: bool, default: False
es_es: bool, por defecto: False

source: Whether to draw a notched boxplot (`True`), or a rectangular boxplot (`False`). The notches represent the confidence interval (CI) around the median. The documentation for *bootstrap* describes how the locations of the notches are computed by default, but their locations may also be overridden by setting the *conf_intervals* parameter.
es_es: Ya sea para dibujar un dibujo de boxplot (`True`), o un boxplot rectangular (`False`). Las muñecas representan el intervalo de confianza (CI) alrededor de la mediana. La documentación de *bootstrap* describe cómo las ubicaciones de las muñecas se calculan por defecto, pero sus ubicaciones también pueden ser sobreescritas estableciendo el parámetro *conf_intervals*.

source: In cases where the values of the CI are less than the lower quartile or greater than the upper quartile, the notches will extend beyond the box, giving it a distinctive "flipped" appearance. This is expected behavior and consistent with other statistical visualization packages.
es_es: En los casos en los que los valores del CI son menores que el cuartil inferior o mayor que el cuadrilátero superior, las muelles se extenderán más allá de la caja, dándole una apariencia distintiva "volteada". Esto es un comportamiento esperado y consistente con otros paquetes de visualización estadística.

source: str, optional
es_es: str, opcional

source: The default symbol for flier points. An empty string ('') hides the fliers. If `None`, then the fliers default to 'b+'. More control is provided by the *flierprops* parameter.
es_es: El símbolo por defecto para los puntos de volante. Una cadena vacía ('') oculta los fliers. Si `nunca`, entonces los volantes por defecto 'b+'. Se proporciona más control por el parámetro *flierprops*.

source: bool, default: True
es_es: bool, por defecto: True

source: If `True`, draws vertical boxes. If `False`, draw horizontal boxes.
es_es: Si es `Verdadero`, dibuja cajas verticales. Si `False`, dibuja cajas horizontales.

source: **whis**
es_es: **susurro**

source: float or (float, float), default: 1.5
es_es: flotante o (flotante), por defecto: 1.5

source: The position of the whiskers.
es_es: La posición de los whiskers.

source: If a float, the lower whisker is at the lowest datum above ``Q1 - whis*(Q3-Q1)``, and the upper whisker at the highest datum below ``Q3 + whis*(Q3-Q1)``, where Q1 and Q3 are the first and third quartiles. The default value of ``whis = 1.5`` corresponds to Tukey's original definition of boxplots.
es_es: Si un flotante, el batidor más bajo es el datum más bajo sobre ``Q1 - whis*(Q3-Q1)``, y la parte superior del whisker en el datum más alto por debajo de ``Q3 + whis*(Q3-Q1)``, donde los Q1 y los Q3 son los primeros y los tercero cuartiles. El valor predeterminado de ``whis = 1.5`` corresponde a la definición original de Tukey de las casillas.

source: If a pair of floats, they indicate the percentiles at which to draw the whiskers (e.g., (5, 95)). In particular, setting this to (0, 100) results in whiskers covering the whole range of the data.
es_es: Si un par de carrozas, indican los percentiles en los que dibujar las batidoras (por ejemplo, (5, 95)). En particular, la fijación de esto a (0, 100) da lugar a que los whiskers cubran toda la gama de datos.

source: In the edge case where ``Q1 == Q3``, *whis* is automatically set to (0, 100) (cover the whole range of the data) if *autorange* is True.
es_es: En el caso donde ``Q1 == Q3``, *whis* se establece automáticamente en (0, 100) (cubre todo el rango de los datos) si *autorange* es verdadero.

source: Beyond the whiskers, data are considered outliers and are plotted as individual points.
es_es: Más allá de los whiskers, los datos se consideran atípicos y se trazan como puntos individuales.

source: int, optional
es_es: int, opcional

source: Specifies whether to bootstrap the confidence intervals around the median for notched boxplots. If *bootstrap* is None, no bootstrapping is performed, and notches are calculated using a Gaussian-based asymptotic approximation (see McGill, R., Tukey, J.W., and Larsen, W.A., 1978, and Kendall and Stuart, 1967). Otherwise, bootstrap specifies the number of times to bootstrap the median to determine its 95% confidence intervals. Values between 1000 and 10000 are recommended.
es_es: Especifica si arrancar o no los intervalos de confianza alrededor de la mediana para las pinceladas de boxplot. Si *bootstrap* no es Ninguna, no se realiza ningún arranque y las muelles se calculan usando una aproximación asíntica basada en Gaussiano (ver McGill, R. Tukey, J.W., y Larsen, W.A., 1978, y Kendall y Stuart, 1967). De lo contrario, el bootstrap especifica el número de veces que se inicia la mediana para determinar sus intervalos de confianza del 95%. Se recomiendan valores entre 1000 y 10000.

source: **usermedians**
es_es: **medios de usuario**

source: 1D array-like, optional
es_es: Opcional para matriz 1D

source: A 1D array-like of length ``len(x)``. Each entry that is not `None` forces the value of the median for the corresponding dataset. For entries that are `None`, the medians are computed by Matplotlib as normal.
es_es: Un array 1D similar a la longitud ``len(x)``. Cada entrada que no es `Ninguna` fuerza el valor del promedio del conjunto de datos correspondiente. Para las entradas que son `Ninguno`, los medianos son calculados por Matplotlib como de costumbre.

source: **conf_intervals**
es_es: **conf_intervalos**

source: array-like, optional
es_es: tipo arreglo, opcional

source: A 2D array-like of shape ``(len(x), 2)``. Each entry that is not None forces the location of the corresponding notch (which is only drawn if *notch* is `True`). For entries that are `None`, the notches are computed by the method specified by the other parameters (e.g., *bootstrap*).
es_es: Un array-like 2D de la forma ``(len(x), 2)``. Cada entrada que no es Ninguno fuerza la ubicación de la muñeca correspondiente (que sólo se dibuja si *notch* es `True`). Para las entradas que son `Ninguno`, las muelles son calculadas por el método especificado por los otros parámetros (por ejemplo, *bootstrap*).

source: **positions**
es_es: **posiciones**

source: The positions of the boxes. The ticks and limits are automatically set to match the positions. Defaults to ``range(1, N+1)`` where N is the number of boxes to be drawn.
es_es: Las posiciones de las casillas. Los ticks y los límites se ajustan automáticamente para que coincidan con las posiciones. Por defecto es ``range(1, N+1)`` donde N es el número de cajas a dibujar.

source: float or array-like
es_es: flotante o matriz

source: The widths of the boxes. The default is 0.5, or ``0.15*(distance between extreme positions)``, if that is smaller.
es_es: Los anchos de las cajas. El valor predeterminado es 0.5, o ``0.15*(distancia entre posiciones extremas)``, si es más pequeño.

source: **patch_artist**
es_es: **parche_artista**

source: If `False` produces boxes with the Line2D artist. Otherwise, boxes are drawn with Patch artists.
es_es: Si `False` produce cajas con el artista de Line2D. De lo contrario, las cajas se dibujan con artistas de Patch.

source: sequence, optional
es_es: secuencia, opcional

source: Labels for each dataset (one per dataset).
es_es: Etiquetas para cada conjunto de datos (uno por conjunto de datos).

source: If True, the tick locations and labels will be adjusted to match the boxplot positions.
es_es: Si es verdadero, la ubicación de la marca y las etiquetas se ajustarán para que coincidan con las posiciones de la casilla.

source: When `True` and the data are distributed such that the 25th and 75th percentiles are equal, *whis* is set to (0, 100) such that the whisker ends are at the minimum and maximum of the data.
es_es: Cuando `True` y los datos se distribuyen de tal forma que los percentiles 25 y 75 son iguales, *whis* se establece en (0, 100) tal que los extremos del whisker son al mínimo y máximo de los datos.

source: **meanline**
es_es: **linea**

source: If `True` (and *showmeans* is `True`), will try to render the mean as a line spanning the full width of the box according to *meanprops* (see below). Not recommended if *shownotches* is also True. Otherwise, means will be shown as points.
es_es: Si `True` (y *showmeans* es `True`), tratará de renderizar la media como una línea que abarca el ancho completo de la caja de acuerdo a *significados* (ver abajo). No se recomienda si las *notas* también son verdaderas. De lo contrario, se mostrará como puntos.

source: **zorder** : float, default: ``Line2D.zorder = 2``
es_es: **zorder** : float, por defecto: ``Line2D.zorder = 2``

source: float, default:
es_es: flotante, por defecto:

source: The zorder of the boxplot.
es_es: El zorder de la parcela de caja.

source: Returns
es_es: Devuelve

source: A dictionary mapping each component of the boxplot to a list of the `.Line2D` instances created. That dictionary has the following keys (assuming vertical boxplots):
es_es: Un diccionario que mapea cada componente de la boxplot a una lista de las instancias de `.Line2D` creadas. Ese diccionario tiene las siguientes teclas (asumiendo cuadros verticales):

source: ``boxes``: the main body of the boxplot showing the quartiles and the median's confidence intervals if enabled.
es_es: ``cajas``: el cuerpo principal de la bola mostrando los cuartiles y los intervalos de confianza del mediano si está habilitado.

source: ``medians``: horizontal lines at the median of each box.
es_es: ``medianos``: líneas horizontales en la mediana de cada caja.

source: ``whiskers``: the vertical lines extending to the most extreme, non-outlier data points.
es_es: ``whiskers``: las líneas verticales que se extienden a los puntos de datos más extremos y no atípicos.

source: ``caps``: the horizontal lines at the ends of the whiskers.
es_es: ``caps``: las líneas horizontales en los extremos de los whiskers.

source: ``fliers``: points representing data that extend beyond the whiskers (fliers).
es_es: ``fliers``: puntos que representan datos que se extienden más allá de los whiskers (fliers).

source: ``means``: points or lines representing the means.
es_es: ``significa``: puntos o líneas que representan los medios.

source: Other Parameters
es_es: Otros Parámetros

source: Show the caps on the ends of whiskers.
es_es: Muestra las gorras en los extremos de los whiskers.

source: Show the central box.
es_es: Mostrar la caja central.

source: Show the outliers beyond the caps.
es_es: Mostrar los atípicos más allá de los tapones.

source: **showmeans**
es_es: **significados mostrados**

source: Show the arithmetic means.
es_es: Mostrar los medios aritméticos.

source: dict, default: None
es_es: dictamen, predeterminado: ninguno

source: The style of the caps.
es_es: El estilo de las mayúsculas.

source: The style of the box.
es_es: El estilo de la caja.

source: **whiskerprops**
es_es: **Bigotes**

source: The style of the whiskers.
es_es: El estilo de los whiskers.

source: **flierprops**
es_es: **flierpros**

source: The style of the fliers.
es_es: El estilo de los fliers.

source: The style of the median.
es_es: El estilo de la mediana.

source: The style of the mean.
es_es: El estilo de la media.

source: If given, all parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception).
es_es: Si se dan, todos los parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción).

source: Draw an estimate of the probability density function.
es_es: Dibujar una estimación de la función de densidad de probabilidad.

source: Examples using ``matplotlib.axes.Axes.boxplot``
es_es: Ejemplos usando ``matplotlib.axes.Axes.boxplot``
