Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.animation.Animation.po
Languages: es_es

source: matplotlib.animation.Animation
es_es: matplotlib.animation.Animación

source: A base class for Animations.
es_es: Una clase base para las animaciones.

source: This class is not usable as is, and should be subclassed to provide needed behavior.
es_es: Esta clase no es utilizable tal como es, y debe ser subclasificada para proporcionar el comportamiento necesario.

source: You must store the created Animation in a variable that lives as long as the animation should run. Otherwise, the Animation object will be garbage-collected and the animation stops.
es_es: Debes almacenar la Animación creada en una variable que vive siempre y cuando la animación deba ejecutarse. De lo contrario, el objeto de Animación será recolectado de basura y la animación se detiene.

source: Parameters
es_es: Parámetros

source: Figure
es_es: Figura

source: The figure object used to get needed events, such as draw or resize.
es_es: El objeto figura utilizado para obtener eventos necesarios, como dibujar o redimensionar.

source: **event_source**
es_es: **evento_origen**

source: object, optional
es_es: objeto, opcional

source: A class that can run a callback when desired events are generated, as well as be stopped and started.
es_es: Una clase que puede ejecutar un callback cuando se generan eventos deseados, así como ser detenida e iniciada.

source: Examples include timers (see `TimedAnimation`) and file system notifications.
es_es: Los ejemplos incluyen temporizadores (ver `TimedAnimation`) y notificaciones del sistema de archivos.

source: bool, default: False
es_es: bool, por defecto: False

source: Whether blitting is used to optimize drawing.
es_es: Si el chorro se utiliza para optimizar el dibujo.

source: Methods
es_es: Métodos

source: Return a new sequence of frame information.
es_es: Devuelve una nueva secuencia de información de fotogramas.

source: Return a new sequence of saved/cached frame information.
es_es: Devolver una nueva secuencia de información del fotograma guardado/caché.

source: Pause the animation.
es_es: Pausar la animación.

source: Resume the animation.
es_es: Reanudar la animación.

source: Save the animation as a movie file by drawing every frame.
es_es: Guarda la animación como un archivo de película dibujando cada fotograma.

source: Convert the animation to an HTML5 ``<video>`` tag.
es_es: Convierte la animación a una etiqueta HTML5 ``<video>`.

source: Generate HTML representation of the animation.
es_es: Generar representación HTML de la animación.

source: **filename**
es_es: **nombre de archivo**

source: The output filename, e.g., :file:`mymovie.mp4`.
es_es: El nombre del archivo de salida, p. ej., :file:`mi-mp4`.

source: **writer** : `MovieWriter` or str, default: :rc:`animation.writer`
es_es: **writer** : `MoWriter` o str, por defecto: :rc:`animation.writer`

source: MovieWriter or str, default: rcParams["animation.writer"] (default: 'ffmpeg')
es_es: Escritor o str, por defecto: rcParams["animation.writer"] (por defecto: 'ffmpeg')

source: A `MovieWriter` instance to use or a key that identifies a class to use, such as 'ffmpeg'.
es_es: Una instancia de `Mo)[video] Writer` a usar o una clave que identifique una clase a usar, como 'ffmpeg'.

source: int, optional
es_es: int, opcional

source: Movie frame rate (per second). If not set, the frame rate from the animation's frame interval.
es_es: Ratio de fotogramas de película (por segundo). Si no se establece, la velocidad de fotogramas del intervalo de fotogramas de la animación.

source: **dpi** : float, default: :rc:`savefig.dpi`
es_es: **dpi** : float, por defecto: :rc:`savefig.dpi`

source: float, default:
es_es: flotante, por defecto:

source: Controls the dots per inch for the movie frames. Together with the figure's size in inches, this controls the size of the movie.
es_es: Controla los puntos por pulgada para los marcos de película. Junto con el tamaño de la figura en pulgadas, controla el tamaño de la película.

source: **codec** : str, default: :rc:`animation.codec`.
es_es: **codec** : str, por defecto: :rc:`animation.codec`.

source: str, default:
es_es: str, por defecto:

source: The video codec to use. Not all codecs are supported by a given `MovieWriter`.
es_es: El códec de vídeo a utilizar. No todos los códecs son soportados por un determinado `Mo)[video] Writer`.

source: **bitrate** : int, default: :rc:`animation.bitrate`
es_es: **bitrate** : int, por defecto: :rc:`animation.bitrate`

source: int, default:
es_es: int, por defecto:

source: The bitrate of the movie, in kilobits per second. Higher values means higher quality movies, but increase the file size. A value of -1 lets the underlying movie encoder select the bitrate.
es_es: La tasa de bits de la película, en kilobits por segundo. Valores más altos significa películas de mayor calidad, pero aumentan el tamaño del archivo. Un valor de -1 permite al codificador de películas subyacente seleccionar la tasa de bits.

source: list of str or None, optional
es_es: lista de str o ninguno, opcional

source: Extra command-line arguments passed to the underlying movie encoder. The default, None, means to use :rc:`animation.[name-of-encoder]_args` for the builtin writers.
es_es: Argumentos extra de línea de comandos pasados al codificador de película subyacente. El valor predeterminado, Ninguno, significa usar :rc:`animation.[name-of-encoder]_args` para los escritores incorporados.

source: **metadata**
es_es: **metadatos**

source: dict[str, str], default: {}
es_es: dict[str, str], predeterminado: {}

source: Dictionary of keys and values for metadata to include in the output file. Some keys that may be of use include: title, artist, genre, subject, copyright, srcform, comment.
es_es: Diccionario de claves y valores para que los metadatos se incluyan en el archivo de salida. Algunas claves que pueden ser de uso incluyen: título, artista, género, tema, copyright, srcform, comentario.

source: list, default: []
es_es: lista, por defecto: []

source: Additional `Animation` objects that should be included in the saved movie file. These need to be from the same `matplotlib.figure.Figure` instance. Also, animation frames will just be simply combined, so there should be a 1:1 correspondence between the frames from the different animations.
es_es: Objetos adicionales de `Animation` que deben ser incluidos en el archivo de película guardado. Estos necesitan ser de la misma instancia de `matplotlib.figure.Figure`. Además, los fotogramas de animación serán simplemente combinados, por lo que debe haber una correspondencia 1:1 entre los fotogramas de las diferentes animaciones.

source: Keyword arguments passed to each `~.Figure.savefig` call used to save the individual frames.
es_es: Argumentos de palabra clave pasados a cada llamada `~.Figure.savefig` usada para guardar los fotogramas individuales.

source: **progress_callback**
es_es: **progreso_callback**

source: function, optional
es_es: función, opcional

source: A callback function that will be called for every frame to notify the saving progress. It must have the signature ::
es_es: Una función de callback que será llamada para cada fotograma para notificar el progreso guardado. Debe tener la firma ::

source: where *current_frame* is the current frame number and *total_frames* is the total number of frames to be saved. *total_frames* is set to None, if the total number of frames can not be determined. Return values may exist but are ignored.
es_es: donde *current_frame* es el número de fotograma actual y *total_frames* es el número total de fotogramas a guardar. *total_frames* está establecido en Ninguno, si el número total de fotogramas no se puede determinar. Los valores de retorno pueden existir pero son ignorados.

source: Example code to write the progress to stdout::
es_es: Código de ejemplo para escribir el progreso a stdout::

source: *fps*, *codec*, *bitrate*, *extra_args* and *metadata* are used to construct a `.MovieWriter` instance and can only be passed if *writer* is a string. If they are passed as non-*None* and *writer* is a `.MovieWriter`, a `RuntimeError` will be raised.
es_es: *fps*, *codec*, *bitrate*, *extra_args* y *metadata* son usados para construir una instancia de `.Mo)[video] Writer` y sólo pueden ser pasados si *writer* es una cadena. Si son pasados como no-* * y *escritor* es un `.Mo)[video] Writer`, un `RuntimeError` será levantado.

source: This saves the animation as an h264 video, encoded in base64 directly into the HTML5 video tag. This respects :rc:`animation.writer` and :rc:`animation.bitrate`. This also makes use of the ``interval`` to control the speed, and uses the ``repeat`` parameter to decide whether to loop.
es_es: Esto guarda la animación como un vídeo h264, codificado en base64 directamente en la etiqueta de vídeo HTML5. Esto respeta :rc:`animation.writer` y :rc:`animación. itrate`. Esto también hace uso del ``interval`` para controlar la velocidad, y utiliza el parámetro ``repetir`` para decidir si hacer bucle.

source: float, optional
es_es: float, opcional

source: Limit, in MB, of the returned animation. No animation is created if the limit is exceeded. Defaults to :rc:`animation.embed_limit` = 20.0.
es_es: Límite, en MB, de la animación devuelta. No se crea ninguna animación si el límite es excedido. Por defecto es :rc:`animation.embed_limit` = 20.0.

source: Returns
es_es: Devuelve

source: An HTML5 video tag with the animation embedded as base64 encoded h264 video. If the *embed_limit* is exceeded, this returns the string "Video too large to embed."
es_es: Una etiqueta de vídeo HTML5 con la animación incrustada como vídeo h264 codificado en base64. Si el *embed_limit* es excedido, esto devuelve la cadena "Video demasiado grande para incrustar."

source: Movie frame rate (per second). If not set, the frame rate from the animation's frame interval.
es_es: Ratio de fotogramas de película (por segundo). Si no se establece, la velocidad de fotogramas del intervalo de fotogramas de la animación.

source: **default_mode**
es_es: **modo predeterminado**

source: str, optional
es_es: str, opcional

source: What to do when the animation ends. Must be one of ``{'loop', 'once', 'reflect'}``. Defaults to ``'loop'`` if ``self.repeat`` is True, otherwise ``'once'``.
es_es: Qué hacer cuando la animación termina. Debe ser uno de ``{'loop', 'once', 'reflect'}``. Por defecto es ``'loop'`` si ``self.repetir`` es verdadero, de lo contrario ``'una vez'``.
