Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.pie.po
Languages: es_es

source: Plot a pie chart.
es_es: Trazar un gráfico de pastel.

source: Make a pie chart of array *x*. The fractional area of each wedge is given by ``x/sum(x)``. If ``sum(x) < 1``, then the values of *x* give the fractional area directly and the array will not be normalized. The resulting pie will have an empty wedge of size ``1 - sum(x)``.
es_es: Crea un gráfico de matriz *x*. El área fraccional de cada cuña está dada por ``x/sum(x)``. Si ``sum(x) < 1``, entonces los valores de *x* dan el área fraccional directamente y el array no será normalizado. La tarta resultante tendrá una cuña vacía de tamaño ``1 - sum(x)``.

source: The wedges are plotted counterclockwise, by default starting from the x-axis.
es_es: Las cuñas están trazadas en sentido contrario a las agujas del reloj, por defecto a partir del eje x.

source: Parameters
es_es: Parámetros

source: The wedge sizes.
es_es: Los tamaños de cuña.

source: **explode**
es_es: **explotar**

source: array-like, default: None
es_es: como array-like, default: ninguno

source: If not *None*, is a ``len(x)`` array which specifies the fraction of the radius with which to offset each wedge.
es_es: Si no *nunca*, es una matriz ``len(x)`` que especifica la fracción del radio con la que compensar cada cuña.

source: list, default: None
es_es: lista, por defecto: ninguno

source: A sequence of strings providing the labels for each wedge
es_es: Una secuencia de cadenas que proporcionan las etiquetas para cada cuña

source: **colors**
es_es: **colores**

source: A sequence of colors through which the pie chart will cycle. If *None*, will use the colors in the currently active cycle.
es_es: Una secuencia de colores a través de la cual el gráfico de tarta se ciclará. Si *nunca*, usará los colores en el ciclo activo actual.

source: **autopct**
es_es: **Ct**

source: None or str or callable, default: None
es_es: Ninguno o str o llamable, por defecto: Ninguno

source: If not *None*, is a string or function used to label the wedges with their numeric value. The label will be placed inside the wedge. If it is a format string, the label will be ``fmt % pct``. If it is a function, it will be called.
es_es: Si no *nunca*, es una cadena o función usada para etiquetar las cuñas con su valor numérico. La etiqueta se colocará dentro de la cuña. Si es una cadena de formato, la etiqueta será ``fmt % pct``. Si es una función, será llamada.

source: float, default: 0.6
es_es: float, por defecto: 0.6

source: The ratio between the center of each pie slice and the start of the text generated by *autopct*. Ignored if *autopct* is *None*.
es_es: La relación entre el centro de cada rebanada de pastel y el inicio del texto generado por *ct*.

source: **shadow**
es_es: **sombra**

source: bool, default: False
es_es: bool, por defecto: False

source: Draw a shadow beneath the pie.
es_es: Dibuja una sombra debajo del pastel.

source: bool, default: True
es_es: bool, por defecto: True

source: When *True*, always make a full pie by normalizing x so that ``sum(x) == 1``. *False* makes a partial pie if ``sum(x) <= 1`` and raises a `ValueError` for ``sum(x) > 1``.
es_es: Cuando *True*, siempre hacer un pastel completo normalizando x para que ``sum(x) == 1``. *False* hace un pastel parcial si ``sum(x) <= 1`` y levanta un `ValueError` para ``sum(x) > 1``.

source: float or None, default: 1.1
es_es: flotante o ninguno, por defecto: 1.1

source: The radial distance at which the pie labels are drawn. If set to ``None``, label are not drawn, but are stored for use in ``legend()``
es_es: La distancia radial a la que se dibujan las etiquetas del pastel. Si se establece en ``Ninguno``, la etiqueta no se dibuja, pero se almacenan para su uso en ``legend()``

source: float, default: 0 degrees
es_es: flotante, por defecto: 0 grados

source: The angle by which the start of the pie is rotated, counterclockwise from the x-axis.
es_es: El ángulo por el cual se gira el inicio de la tarta, en sentido contrario a las agujas del eje x.

source: The radius of the pie.
es_es: El radio del pastel.

source: **counterclock**
es_es: **contrareloj**

source: Specify fractions direction, clockwise or counterclockwise.
es_es: Especifique la dirección de las fracciones, en el sentido de las agujas del reloj o en sentido contrario a las agujas del reloj.

source: **wedgeprops**
es_es: **Bedgeprops**

source: dict, default: None
es_es: dictamen, predeterminado: ninguno

source: Dict of arguments passed to the wedge objects making the pie. For example, you can pass in ``wedgeprops = {'linewidth': 3}`` to set the width of the wedge border lines equal to 3. For more details, look at the doc/arguments of the wedge object. By default ``clip_on=False``.
es_es: Dicto de argumentos pasados a los objetos cuña que hacen la tarta. Por ejemplo, puede pasar en ``wedgeprops = {'linewidth': 3}`` para establecer el ancho de las líneas de borde de cuña igual a 3. Para más detalles, mire el documento/argumentos del objeto cuñado. Por defecto ``clip_on=False``.

source: Dict of arguments to pass to the text objects.
es_es: Dicto de argumentos para pasar a los objetos de texto.

source: The coordinates of the center of the chart.
es_es: Las coordenadas del centro del gráfico.

source: Plot Axes frame with the chart if true.
es_es: Trazar el marco de ejes con el gráfico si es verdadero.

source: **rotatelabels**
es_es: **rotaciones**

source: Rotate each label to the angle of the corresponding slice if true.
es_es: Girar cada etiqueta al ángulo de la rebanada correspondiente si es verdadera.

source: If given, the following parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception):
es_es: Si se dan, los siguientes parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción):

source: *x*, *explode*, *labels*, *colors*
es_es: *x*, *explotar*, *etiquetas*, *colores*

source: Returns
es_es: Devuelve

source: **patches**
es_es: **parches**

source: list
es_es: lista

source: A sequence of `matplotlib.patches.Wedge` instances
es_es: Una secuencia de instancias `matplotlib.patches.► ge`

source: **texts**
es_es: **textos**

source: A list of the label `.Text` instances.
es_es: Una lista de las instancias de la etiqueta `.Text`.

source: **autotexts**
es_es: **autotextos**

source: A list of `.Text` instances for the numeric labels. This will only be returned if the parameter *autopct* is not *None*.
es_es: Una lista de instancias de `.Text` para las etiquetas numéricas. Esto solo se devolverá si el parámetro *► ct* no es *Ninguno*.

source: The pie chart will probably look best if the figure and Axes are square, or the Axes aspect is equal. This method sets the aspect ratio of the axis to "equal". The Axes aspect ratio can be controlled with `.Axes.set_aspect`.
es_es: El gráfico del pastel probablemente se verá mejor si la figura y los ejes son cuadrados, o el aspecto de los ejes es igual. Este método establece la relación de aspecto del eje a "igual". La relación de aspecto de los ejes puede controlarse con `.Axes.set_aspect`.

source: Examples using ``matplotlib.axes.Axes.pie``
es_es: Ejemplos usando ``matplotlib.axes.Axes.pie``

source: Bar of pie
es_es: Barra de torta
