Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.pause.po
Languages: es_es

source: Run the GUI event loop for *interval* seconds.
es_es: Ejecute el bucle de eventos de la IGU durante *intervalo* de segundos.

source: If there is an active figure, it will be updated and displayed before the pause, and the GUI event loop (if any) will run during the pause.
es_es: Si hay una figura activa, se actualizará y se mostrará antes de la pausa, y el ciclo de eventos GUI (si existe) se ejecutará durante la pausa.

source: This can be used for crude animation. For more complex animation use :mod:`matplotlib.animation`.
es_es: Esto puede ser usado para la animación cruda. Para una animación más compleja, utilice :mod:`matplotlib.animation`.

source: If there is no active figure, sleep for *interval* seconds instead.
es_es: Si no hay una figura activa, duerme durante segundos *interval*.

source: Proper animations
es_es: Animaciones adecuadas

source: :obj:`show`
es_es: :obj:`mostrar`

source: Show all figures and optional block until all figures are closed.
es_es: Mostrar todas las figuras y bloques opcionales hasta que todas las figuras estén cerradas.

source: Examples using ``matplotlib.pyplot.pause``
es_es: Ejemplos usando ``matplotlib.pyplot.pause``

source: Rotating a 3D plot
es_es: Rotación de un gráfico 3D

source: Rotating 3D wireframe plot
es_es: Rotación de la trama de alambre 3D
