Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.gridspec.GridSpec.po
Languages: es_es

source: A grid layout to place subplots within a figure.
es_es: Un diseño de cuadrícula para colocar subparcelas dentro de una figura.

source: The location of the grid cells is determined in a similar way to `~.figure.SubplotParams` using *left*, *right*, *top*, *bottom*, *wspace* and *hspace*.
es_es: La ubicación de las células de la cuadrícula se determina de manera similar a `~.figure.SubplotParams` usando *izquierda*, *derecha*, *arriba*, *abajo*, *wspace* y *hspace*.

source: Parameters
es_es: Parámetros

source: **nrows, ncols**
es_es: **nfilas, ncoles**

source: The number of rows and columns of the grid.
es_es: El número de filas y columnas de la cuadrícula.

source: **figure** : `~.figure.Figure`, optional
es_es: **figura** : `~.figure.Figure`, opcional

source: Figure, optional
es_es: figura, opcional

source: Only used for constrained layout to create a proper layoutgrid.
es_es: Sólo se utiliza para el diseño restringido para crear una tabla de diseño apropiada.

source: **left, right, top, bottom**
es_es: **izquierda, derecha, arriba, abajo**

source: float, optional
es_es: float, opcional

source: Extent of the subplots as a fraction of figure width or height. Left cannot be larger than right, and bottom cannot be larger than top. If not given, the values will be inferred from a figure or rcParams at draw time. See also `GridSpec.get_subplot_params`.
es_es: Extensión de las subparcelas como una fracción del ancho o la altura de la figura. La izquierda no puede ser más grande que la derecha, y la parte inferior no puede ser mayor que la superior. Si no se proporciona, los valores serán inferiores de una figura o rcParams en tiempo de dibujo. Vea también `GridSpec.get_subplot_params`.

source: The amount of width reserved for space between subplots, expressed as a fraction of the average axis width. If not given, the values will be inferred from a figure or rcParams when necessary. See also `GridSpec.get_subplot_params`.
es_es: La cantidad de anchura reservada para el espacio entre subparcelas, expresada como una fracción de la anchura media del eje. Si no se proporciona, los valores serán inferiores de una figura o rcParams cuando sea necesario. Vea también `GridSpec.get_subplot_params`.

source: The amount of height reserved for space between subplots, expressed as a fraction of the average axis height. If not given, the values will be inferred from a figure or rcParams when necessary. See also `GridSpec.get_subplot_params`.
es_es: La cantidad de altura reservada para el espacio entre subparcelas, expresada como una fracción de la altura media del eje. Si no se proporciona, los valores serán inferiores de una figura o rcParams cuando sea necesario. Vea también `GridSpec.get_subplot_params`.

source: **width_ratios** : array-like of length *ncols*, optional
es_es: **width_ratios** : array-like de longitud *ncols*, opcional

source: array-like of length
es_es: longitud del array

source: Defines the relative widths of the columns. Each column gets a relative width of ``width_ratios[i] / sum(width_ratios)``. If not given, all columns will have the same width.
es_es: Define el ancho relativo de las columnas. Cada columna obtiene un ancho relativo de ``width_ratios[i] / suma(width_ratios)``. Si no se dan, todas las columnas tendrán el mismo anchura.

source: **height_ratios** : array-like of length *nrows*, optional
es_es: **altura_ratios** : tipo matriz de longitud *nrows*, opcional

source: Defines the relative heights of the rows. Each row gets a relative height of ``height_ratios[i] / sum(height_ratios)``. If not given, all rows will have the same height.
es_es: Define las alturas relativas de las filas. Cada fila tiene una altura relativa de ``height_ratios[i] / suma(height_ratios)``. Si no se da, todos los registros tendrán la misma altura.

source: Return the `.SubplotParams` for the GridSpec.
es_es: Devuelve el `.SubplotParams` para el GridSpec.

source: In order of precedence the values are taken from
es_es: En orden de precedencia los valores son tomados de

source: non-*None* attributes of the GridSpec
es_es: atributos no *nunca* de la GridSpec

source: the provided *figure*
es_es: la *figura* proporcionada

source: Return a list of the names of the subplot parameters explicitly set in the GridSpec.
es_es: Devuelve una lista de los nombres de los parámetros de subplot explícitamente establecidos en el GridSpec.

source: This is a subset of the attributes of `.SubplotParams`.
es_es: Este es un subconjunto de los atributos de `.SubplotParams`.

source: Adjust subplot parameters to give specified padding.
es_es: Ajuste los parámetros de subplot para dar el relleno especificado.

source: Padding between the figure edge and the edges of subplots, as a fraction of the font-size.
es_es: Rellenar entre el borde de la figura y los bordes de las subgráficas, como una fracción del tamaño de la fuente.

source: Padding (height/width) between edges of adjacent subplots. Defaults to *pad*.
es_es: Rellenar (altura/ancho) entre bordes de subparcelas adyacentes. Por defecto es *pad*.

source: tuple of 4 floats, default: (0, 0, 1, 1), i.e. the whole figure
es_es: tuple de 4 flotantes, por defecto: (0, 0, 1, 1), es decir, toda la figura

source: (left, bottom, right, top) rectangle in normalized figure coordinates that the whole subplots area (including labels) will fit into.
es_es: (izquierda, abajo, derecha, arriba) rectángulo en coordenadas normalizadas en las que caben todo el área de subparcelas (incluyendo etiquetas).

source: Update the subplot parameters of the grid.
es_es: Actualizar los parámetros de subplot de la cuadrícula.

source: Parameters that are not explicitly given are not changed. Setting a parameter to *None* resets it to :rc:`figure.subplot.*`.
es_es: Los parámetros que no son explícitamente dados no cambian. Establecer un parámetro a *Ninguno* lo restablece a :rc:`figure.subplot.*`.

source: float or None, optional
es_es: flotante o ninguno, opcional

source: Extent of the subplots as a fraction of figure width or height.
es_es: Extención de las subparcelas como una fracción de anchura o altura de la figura.

source: Spacing between the subplots as a fraction of the average subplot width / height.
es_es: Espaciado entre las subparcelas como una fracción de la anchura / altura promedio de la subparcela.

source: Examples using ``matplotlib.gridspec.GridSpec``
es_es: Ejemplos usando ``matplotlib.gridspec.GridSpec``

source: Scatter plot with histograms
es_es: Gráfico de dispersión con histogramas

source: Resizing axes with tight layout
es_es: Cambiar el tamaño de los ejes con el diseño ajustado

source: Nested Gridspecs
es_es: Gridspecs anidados

source: Constrained Layout Guide
es_es: Guía de diseño restringido

source: Tight Layout guide
es_es: Guía de diseño ajustado

source: Arranging multiple Axes in a Figure
es_es: Organizar varios ejes en una figura
