Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.colors.CenteredNorm.po
Languages: es_es

source: matplotlib.colors.CenteredNorm
es_es: matrizlib.colors.Norma central

source: Normalize symmetrical data around a center (0 by default).
es_es: Normaliza los datos simétricos alrededor de un centro (0 por defecto).

source: Unlike `TwoSlopeNorm`, `CenteredNorm` applies an equal rate of change around the center.
es_es: A diferencia de `TwoSlopeNorm`, `CenteredNorm` aplica una tasa de cambio igual alrededor del centro.

source: Useful when mapping symmetrical data around a conceptual center e.g., data that range from -2 to 4, with 0 as the midpoint, and with equal rates of change around that midpoint.
es_es: Útil al mapear datos simétricos alrededor de un centro conceptual p.ej. datos que van de -2 a 4, con 0 como punto medio, y con las mismas tasas de cambio alrededor de ese punto medio.

source: Parameters
es_es: Parámetros

source: **vcenter**
es_es: **central**

source: The data value that defines ``0.5`` in the normalization.
es_es: El valor de datos que define ``0.5`` en la normalización.

source: float, optional
es_es: float, opcional

source: The range of data values that defines a range of ``0.5`` in the normalization, so that *vcenter* - *halfrange* is ``0.0`` and *vcenter* + *halfrange* is ``1.0`` in the normalization. Defaults to the largest absolute difference to *vcenter* for the values in the dataset.
es_es: El rango de valores de datos que define un rango de ``0.5`` en la normalización, de modo que *vcenter* - *halfrange* es ``0. `` y *vcenter* + *halfrange* es ``1.0`` en la normalización. Por defecto es la diferencia absoluta más grande en *vcenter* para los valores en el conjunto de datos.

source: Examples
es_es: Ejemplos

source: This maps data values -2 to 0.25, 0 to 0.5, and 4 to 1.0 (assuming equal rates of change above and below 0.0):
es_es: Este mapea los valores de datos -2 a 0.25, 0 a 0.5, y 4 a 1.0 (asumiendo las mismas tasas de cambio por encima y por debajo de 0.0):

source: Normalize *value* data in the ``[vmin, vmax]`` interval into the ``[0.0, 1.0]`` interval and return it.
es_es: Normaliza los datos de *valor* en el intervalo ``[vmin, vmax]`` en el intervalo ``[0.0, 1.0]`` y devuelve.

source: **value**
es_es: **valor**

source: Data to normalize.
es_es: Datos a normalizar.

source: If ``None``, defaults to ``self.clip`` (which defaults to ``False``).
es_es: Si ``ninguno``, el valor predeterminado es ``self.clip`` (que por defecto es ``False``).

source: If not already initialized, ``self.vmin`` and ``self.vmax`` are initialized using ``self.autoscale_None(value)``.
es_es: Si no se ha inicializado, ``self.vmin`` y ``self.vmax`` son inicializados usando ``self.autoscale_ichard (value)``.

source: Set *halfrange* to ``max(abs(A-vcenter))``, then set *vmin* and *vmax*.
es_es: Establece *halfrange* a ``max(A-vcenter)``, luego establece *vmin* y *vmax*.

source: Set *vmin* and *vmax*.
es_es: Establecer *vmin* y *vmax*.

source: Examples using ``matplotlib.colors.CenteredNorm``
es_es: Ejemplos usando ``matplotlib.colors.CenteredNorm``

source: Colormap Normalization
es_es: Normalización del mapa de colores
