Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.violinplot.po
Languages: es_es

source: Make a violin plot.
es_es: Hacer una parcela de violín.

source: Make a violin plot for each column of *dataset* or each vector in sequence *dataset*. Each filled area extends to represent the entire data range, with optional lines at the mean, the median, the minimum, the maximum, and user-specified quantiles.
es_es: Hacer un gráfico de violín para cada columna de *dataset* o cada vector en secuencia *dataset*. Cada área llena se extiende para representar todo el rango de datos, con líneas opcionales en la media, la mediana, el mínimo, el máximo y las cantidades especificadas por el usuario.

source: Parameters
es_es: Parámetros

source: Array or a sequence of vectors.
es_es: Arreglo o una secuencia de vecores.

source: The input data.
es_es: Los datos de entrada.

source: **positions**
es_es: **posiciones**

source: The positions of the violins. The ticks and limits are automatically set to match the positions.
es_es: Las posiciones de los violines. Los ticks y límites se ajustan automáticamente para que coincidan con las posiciones.

source: bool, default: True.
es_es: bool, por defecto: True.

source: If true, creates a vertical violin plot. Otherwise, creates a horizontal violin plot.
es_es: Si es verdadero, crea una parcela de violín vertical. De lo contrario, crea una parcela de violín horizontal.

source: Either a scalar or a vector that sets the maximal width of each violin. The default is 0.5, which uses about half of the available horizontal space.
es_es: Un escalar o un vector que establece el ancho máximo de cada violín. El valor por defecto es 0.5, que usa aproximadamente la mitad del espacio horizontal disponible.

source: **showmeans**
es_es: **significados mostrados**

source: bool, default: False
es_es: bool, por defecto: False

source: If `True`, will toggle rendering of the means.
es_es: Si es `True`, cambiará la representación de los medios.

source: bool, default: True
es_es: bool, por defecto: True

source: If `True`, will toggle rendering of the extrema.
es_es: Si es `True`, cambiará la representación del extremo.

source: If `True`, will toggle rendering of the medians.
es_es: Si es `True`, cambiará la representación de los medianos.

source: **quantiles**
es_es: **cantidades**

source: array-like, default: None
es_es: como array-like, default: ninguno

source: If not None, set a list of floats in interval [0, 1] for each violin, which stands for the quantiles that will be rendered for that violin.
es_es: Si no es Ninguno, establezca una lista de flotantes en el intervalo [0, 1] para cada violín, que significa las cantidades que serán renderizadas para ese violín.

source: **points**
es_es: **puntos**

source: int, default: 100
es_es: int, por defecto: 100

source: Defines the number of points to evaluate each of the gaussian kernel density estimations at.
es_es: Define el número de puntos en los que evaluar cada una de las estimaciones de densidad del núcleo gaussiano.

source: The method used to calculate the estimator bandwidth. This can be 'scott', 'silverman', a scalar constant or a callable. If a scalar, this will be used directly as `kde.factor`. If a callable, it should take a `GaussianKDE` instance as its only parameter and return a scalar. If None (default), 'scott' is used.
es_es: El método utilizado para calcular el ancho de banda del estimador. Esto puede ser 'scott', 'silverman', una constante escalar o una llamable. Si un escalar, se utilizará directamente como 'kde. actor`. Si es llamable, debería tomar una instancia `GaussianKDE` como único parámetro y devolver un escalar. Si Ninguno (por defecto), se usa 'scott'.

source: If given, the following parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception):
es_es: Si se dan, los siguientes parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción):

source: Returns
es_es: Devuelve

source: A dictionary mapping each component of the violinplot to a list of the corresponding collection instances created. The dictionary has the following keys:
es_es: Un diccionario que mapea cada componente del violinplot a una lista de las instancias de colección correspondientes creadas. El diccionario tiene las siguientes claves:

source: ``bodies``: A list of the `~.collections.PolyCollection` instances containing the filled area of each violin.
es_es: ``cuerpos``: Una lista de las instancias `~.collections.PolyCollection` que contienen el área llena de cada violín.

source: ``cmeans``: A `~.collections.LineCollection` instance that marks the mean values of each of the violin's distribution.
es_es: ``cmeans``: Una instancia `~.collections.LineCollection` que marca los valores medios de cada una de las distribuciones del violín.

source: ``cmins``: A `~.collections.LineCollection` instance that marks the bottom of each violin's distribution.
es_es: ``cmins``: Una instancia `~.collections.LineCollection` que marca la parte inferior de la distribución de cada violín.

source: ``cmaxes``: A `~.collections.LineCollection` instance that marks the top of each violin's distribution.
es_es: ``cmaxes``: Una instancia `~.collections.LineCollection` que marca la parte superior de la distribución de cada violín.

source: ``cbars``: A `~.collections.LineCollection` instance that marks the centers of each violin's distribution.
es_es: ``cbars``: Una instancia `~.collections.LineCollection` que marca los centros de la distribución de cada violín.

source: ``cmedians``: A `~.collections.LineCollection` instance that marks the median values of each of the violin's distribution.
es_es: ``cmedians``: Una instancia `~.collections.LineCollection` que marca los valores medianos de cada una de las distribuciones del violín.

source: ``cquantiles``: A `~.collections.LineCollection` instance created to identify the quantile values of each of the violin's distribution.
es_es: ``cquantiles``: Una instancia `~.collections.LineCollection` creada para identificar los valores cuantitativos de cada una de las distribuciones del violín.
