Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.setp.po
Languages: es_es

source: Set one or more properties on an `.Artist`, or list allowed values.
es_es: Establece una o más propiedades en un `.Artist`, o lista de valores permitidos.

source: Parameters
es_es: Parámetros

source: **obj** : `.Artist` or list of `.Artist`
es_es: **obj** : `.Artist` o lista de `.Artist`

source: Artist or list of Artist
es_es: Artista o lista de Artista

source: The artist(s) whose properties are being set or queried. When setting properties, all artists are affected; when querying the allowed values, only the first instance in the sequence is queried.
es_es: El artista(s) cuyas propiedades se están estableciendo o consultando. Al establecer propiedades, todos los artistas se ven afectados; al consultar los valores permitidos, sólo se consulta la primera instancia de la secuencia.

source: For example, two lines can be made thicker and red with a single call:
es_es: Por ejemplo, dos líneas pueden hacerse más gruesas y rojas con una sola llamada:

source: file-like, default:
es_es: archivo-como, predeterminado:

source: Where `setp` writes its output when asked to list allowed values.
es_es: Donde `setp` escribe su salida cuando se le pide listar los valores permitidos.

source: The default, ``None``, means `sys.stdout`.
es_es: El predeterminado, ``Ningun``, significa `sys.stdout`.

source: The properties to set. The following combinations are supported:
es_es: Las propiedades a establecer. Las siguientes combinaciones son compatibles:

source: Set the linestyle of a line to be dashed:
es_es: Establece el estilo de línea de una línea a ser discontinua:

source: Set multiple properties at once:
es_es: Establece varias propiedades a la vez:

source: List allowed values for a line's linestyle:
es_es: Lista de valores permitidos para el estilo de línea de una línea:

source: List all properties that can be set, and their allowed values:
es_es: Listar todas las propiedades que se pueden establecer, y sus valores permitidos:

source: `setp` also supports MATLAB style string/value pairs. For example, the following are equivalent:
es_es: `setp` también soporta pares de estilo MATLAB. Por ejemplo, los siguientes son equivalentes:

source: Examples using ``matplotlib.pyplot.setp``
es_es: Ejemplos usando ``matplotlib.pyplot.setp``

source: Creating annotated heatmaps
es_es: Creación de mapas térmicos anotados
