Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.imshow.po
Languages: es_es

source: Display data as an image, i.e., on a 2D regular raster.
es_es: Mostrar datos como una imagen, es decir, en un rastro regular 2D.

source: The input may either be actual RGB(A) data, or 2D scalar data, which will be rendered as a pseudocolor image. For displaying a grayscale image set up the colormapping using the parameters ``cmap='gray', vmin=0, vmax=255``.
es_es: La entrada puede ser datos RGB(A) reales, o datos escalares 2D, que serán renderizados como una imagen pseudocolor. Para mostrar una imagen en escala de grises, configure el mapeo de colores usando los parámetros ``cmap='gray', vmin=0, vmax=255``.

source: The number of pixels used to render an image is set by the Axes size and the *dpi* of the figure. This can lead to aliasing artifacts when the image is resampled because the displayed image size will usually not match the size of *X* (see :doc:`/gallery/images_contours_and_fields/image_antialiasing`). The resampling can be controlled via the *interpolation* parameter and/or :rc:`image.interpolation`.
es_es: El número de píxeles usados para renderizar una imagen es establecido por el tamaño de los ejes y el *dpi* de la figura. Esto puede llevar a artefactos de aliasing cuando la imagen se vuelve a muestrear porque el tamaño de la imagen mostrada normalmente no coincidirá con el tamaño de *X* (ver :doc:`/gallery/images_contours_and_fields/image_antialiasing`). El remuestreo puede ser controlado mediante el parámetro *interpolación* y/o :rc:`image.interpolation`.

source: Parameters
es_es: Parámetros

source: array-like or PIL image
es_es: imagen de matriz o PIL

source: The image data. Supported array shapes are:
es_es: Los datos de la imagen. Formas de matriz soportadas son:

source: (M, N): an image with scalar data. The values are mapped to colors using normalization and a colormap. See parameters *norm*, *cmap*, *vmin*, *vmax*.
es_es: (M, N): una imagen con datos escalares. Los valores se asignan a los colores usando la normalización y un mapa de color. Ver parámetros *normal*, *cmap*, *vmin*, *vmax*.

source: (M, N, 3): an image with RGB values (0-1 float or 0-255 int).
es_es: (M, N, 3): una imagen con valores RGB (0-1 float o 0-255 int).

source: (M, N, 4): an image with RGBA values (0-1 float or 0-255 int), i.e. including transparency.
es_es: (M, N, 4): una imagen con valores RGBA (0-1 float o 0-255 int), es decir, con transparencia.

source: The first two dimensions (M, N) define the rows and columns of the image.
es_es: Las dos primeras dimensiones (M, N) definen las filas y columnas de la imagen.

source: Out-of-range RGB(A) values are clipped.
es_es: Los valores fuera de rango RGB(A) son recortados.

source: **cmap** : str or `~matplotlib.colors.Colormap`, default: :rc:`image.cmap`
es_es: **cmap** : str o `~matplotlib.colors.Colormap`, por defecto: :rc:`image.cmap`

source: str or
es_es: str o

source: The Colormap instance or registered colormap name used to map scalar data to colors. This parameter is ignored for RGB(A) data.
es_es: La instancia de Colormap o nombre de mapa de color registrado utilizado para mapear datos escalares a colores. Este parámetro es ignorado para datos RGB(A).

source: **norm** : `~matplotlib.colors.Normalize`, optional
es_es: **norma** : `~matplotlib.colors.Normalize`, opcional

source: Normalize, optional
es_es: Normalizar, opcional

source: The `.Normalize` instance used to scale scalar data to the [0, 1] range before mapping to colors using *cmap*. By default, a linear scaling mapping the lowest value to 0 and the highest to 1 is used. This parameter is ignored for RGB(A) data.
es_es: La instancia `.Normalize` usada para escalar datos escalares al rango [0, 1] antes de mapear a colores usando *cmap*. De forma predeterminada, se utiliza un mapeo de escalado lineal con el valor más bajo a 0 y el más alto a 1. Este parámetro se ignora para los datos RGB(A).

source: **aspect** : {'equal', 'auto'} or float, default: :rc:`image.aspect`
es_es: **aspecto** : {'equal', 'auto'} o flotante, por defecto: :rc:`image.aspect`

source: {'equal', 'auto'} or float, default:
es_es: {'equal', 'auto'} o flotante, por defecto:

source: The aspect ratio of the Axes. This parameter is particularly relevant for images since it determines whether data pixels are square.
es_es: La relación de aspecto de los ejes. Este parámetro es particularmente relevante para las imágenes ya que determina si los píxeles de datos son cuadrados.

source: This parameter is a shortcut for explicitly calling `.Axes.set_aspect`. See there for further details.
es_es: Este parámetro es un acceso directo para llamar explícitamente `.Axes.set_aspect`. Vea allí para más detalles.

source: 'equal': Ensures an aspect ratio of 1. Pixels will be square (unless pixel sizes are explicitly made non-square in data coordinates using *extent*).
es_es: 'igual': Asegura una relación de aspecto de 1. Los píxeles serán cuadrados (a menos que los tamaños de píxeles sean explícitamente no cuadrados en las coordenadas de datos usando *extent*).

source: 'auto': The Axes is kept fixed and the aspect is adjusted so that the data fit in the Axes. In general, this will result in non-square pixels.
es_es: 'auto': Los ejes se mantienen fijos y el aspecto se ajusta para que los datos encajen en los ejes. En general, esto resultará en píxeles no cuadrados.

source: **interpolation** : str, default: :rc:`image.interpolation`
es_es: **interpolación** : str, por defecto: :rc:`image.interpolation`

source: str, default:
es_es: str, por defecto:

source: The interpolation method used.
es_es: El método de interpolación utilizado.

source: Supported values are 'none', 'antialiased', 'nearest', 'bilinear', 'bicubic', 'spline16', 'spline36', 'hanning', 'hamming', 'hermite', 'kaiser', 'quadric', 'catrom', 'gaussian', 'bessel', 'mitchell', 'sinc', 'lanczos', 'blackman'.
es_es: Los valores soportados son 'Ninguno', 'antialiased', 'cercano', 'bilinear', 'bicubic', 'spline16', 'spline36', 'hanning', 'hamming', 'hermite', 'kaiser', 'quadric', 'catrom', 'gaussian', 'bessel', 'mitchell', '/etc', 'lanczos', 'blackman'.

source: If *interpolation* is 'none', then no interpolation is performed on the Agg, ps, pdf and svg backends. Other backends will fall back to 'nearest'. Note that most SVG renderers perform interpolation at rendering and that the default interpolation method they implement may differ.
es_es: Si la *interpolación* es 'ninguno', entonces no se realiza ninguna interpolación en los backends Agg, ps, pdf y svg. Otros backends regresarán a 'cerca'. Tenga en cuenta que la mayoría de los renderizadores SVG realizan la interpolación al renderizar y que el método de interpolación por defecto que implementan puede diferir.

source: If *interpolation* is the default 'antialiased', then 'nearest' interpolation is used if the image is upsampled by more than a factor of three (i.e. the number of display pixels is at least three times the size of the data array). If the upsampling rate is smaller than 3, or the image is downsampled, then 'hanning' interpolation is used to act as an anti-aliasing filter, unless the image happens to be upsampled by exactly a factor of two or one.
es_es: Si la *interpolación* es la interpolación por defecto 'antialiased', entonces la interpolación 'más cercana' se utiliza si la imagen es mostrada por más de un factor de tres (i. , el número de píxeles de visualización es al menos tres veces el tamaño de la matriz de datos). Si la tasa de muestreo es menor que 3, o la imagen es muestreada, entonces la interpolación 'hanning' se utiliza para actuar como un filtro antialiasing, a menos que la imagen se muestre exactamente por un factor de dos o uno.

source: See :doc:`/gallery/images_contours_and_fields/interpolation_methods` for an overview of the supported interpolation methods, and :doc:`/gallery/images_contours_and_fields/image_antialiasing` for a discussion of image antialiasing.
es_es: Vea :doc:`/gallery/images_contours_and_fields/interpolation_methods` para una visión general de los métodos de interpolación soportados, y :doc:`/gallery/images_contours_and_fields/image_antialiasing` para una discusión sobre el aliasing de la imagen.

source: Some interpolation methods require an additional radius parameter, which can be set by *filterrad*. Additionally, the antigrain image resize filter is controlled by the parameter *filternorm*.
es_es: Algunos métodos de interpolación requieren un parámetro de radio adicional, que puede ser definido por *filterrad*. Adicionalmente, el filtro de redimensionamiento de imagen antigrano está controlado por el parámetro *filternorm*.

source: **interpolation_stage**
es_es: **interpolación_etapa**

source: {'data', 'rgba'}, default: 'data'
es_es: {'data', 'rgba'}por defecto: 'datos'

source: If 'data', interpolation is carried out on the data provided by the user. If 'rgba', the interpolation is carried out after the colormapping has been applied (visual interpolation).
es_es: Si 'data', la interpolación se realiza sobre los datos proporcionados por el usuario. Si 'rgba', la interpolación se lleva a cabo después de la aplicación del mapeo de colores (interpolación visual).

source: **alpha**
es_es: **alfa**

source: float or array-like, optional
es_es: flotante o tipo matriz, opcional

source: The alpha blending value, between 0 (transparent) and 1 (opaque). If *alpha* is an array, the alpha blending values are applied pixel by pixel, and *alpha* must have the same shape as *X*.
es_es: El valor de mezcla alfa, entre 0 (transparente) y 1 (opaco). Si *alpha* es una matriz, los valores de mezcla alfa son aplicados píxel por píxel, y *alpha* debe tener la misma forma que *X*.

source: float, optional
es_es: float, opcional

source: When using scalar data and no explicit *norm*, *vmin* and *vmax* define the data range that the colormap covers. By default, the colormap covers the complete value range of the supplied data. It is an error to use *vmin*/*vmax* when *norm* is given. When using RGB(A) data, parameters *vmin*/*vmax* are ignored.
es_es: Cuando se usan datos escalares y no hay *norma*, *vmin* y *vmax* definen el rango de datos que cubre el mapa de colores. Por defecto, el mapa de colores cubre el rango de valores completo de los datos suministrados. Es un error usar *vmin*/*vmax* cuando se da *norma*. Cuando se usan datos RGB(A), los parámetros *vmin*/*vmax* son ignorados.

source: **origin** : {'upper', 'lower'}, default: :rc:`image.origin`
es_es: **origin** : {'upper', 'lower'}, por defecto: :rc:`image.origin`

source: {'upper', 'lower'}, default:
es_es: {'upper', 'lower'}por defecto:

source: Place the [0, 0] index of the array in the upper left or lower left corner of the Axes. The convention (the default) 'upper' is typically used for matrices and images.
es_es: Coloque el índice [0, 0] de la matriz en la esquina superior izquierda o inferior de los ejes. La convención (el valor por defecto) se usa típicamente para matrices e imágenes.

source: Note that the vertical axis points upward for 'lower' but downward for 'upper'.
es_es: Tenga en cuenta que el eje vertical apunta hacia arriba para 'inferior' pero hacia abajo para 'arriba'.

source: See the :doc:`/tutorials/intermediate/imshow_extent` tutorial for examples and a more detailed description.
es_es: Vea el tutorial :doc:`/tutorials/intermediate/imshow_extent` para ejemplos y una descripción más detallada.

source: **extent**
es_es: **extensión**

source: floats (left, right, bottom, top), optional
es_es: flotantes (izquierda, derecha, abajo, arriba), opcional

source: The bounding box in data coordinates that the image will fill. The image is stretched individually along x and y to fill the box.
es_es: La caja delimitadora en las coordenadas de datos que la imagen se llenará. La imagen se estira individualmente a lo largo de x y y para llenar la caja.

source: The default extent is determined by the following conditions. Pixels have unit size in data coordinates. Their centers are on integer coordinates, and their center coordinates range from 0 to columns-1 horizontally and from 0 to rows-1 vertically.
es_es: El alcance por defecto está determinado por las siguientes condiciones. Los píxeles tienen tamaño de unidad en las coordenadas de datos. Sus centros están en coordenadas enteras, y sus coordenadas centradas varían de 0 a columnas 1 horizontalmente y de 0 a filas-1 verticalmente.

source: Note that the direction of the vertical axis and thus the default values for top and bottom depend on *origin*:
es_es: Tenga en cuenta que la dirección del eje vertical y los valores por defecto para la parte superior e inferior dependen de *origin*:

source: For ``origin == 'upper'`` the default is ``(-0.5, numcols-0.5, numrows-0.5, -0.5)``.
es_es: Para ``origin == 'upper'`` el valor por defecto es ``(-0.5, numcols-0.5, numrows-0.5, -0.5)``.

source: For ``origin == 'lower'`` the default is ``(-0.5, numcols-0.5, -0.5, numrows-0.5)``.
es_es: Para ``origin == 'lower'` el valor por defecto es ``(-0.5, numcols-0.5, -0.5, numrows-0.5)``.

source: **filternorm**
es_es: **filtro**

source: bool, default: True
es_es: bool, por defecto: True

source: A parameter for the antigrain image resize filter (see the antigrain documentation). If *filternorm* is set, the filter normalizes integer values and corrects the rounding errors. It doesn't do anything with the source floating point values, it corrects only integers according to the rule of 1.0 which means that any sum of pixel weights must be equal to 1.0. So, the filter function must produce a graph of the proper shape.
es_es: Un parámetro para el filtro de redimensionamiento de imagen antigrano (ver la documentación de antigranos). Si se establece *filternorm*, el filtro normaliza los valores enteros y corrige los errores de redondeo. No hace nada con los valores de coma flotante de la fuente, corrige sólo enteros de acuerdo a la regla de 1. lo que significa que cualquier suma de peso de píxeles debe ser igual a 1.0. Por lo tanto, la función de filtro debe producir un gráfico de la forma adecuada.

source: float > 0, default: 4.0
es_es: flotante > 0, por defecto: 4.0

source: The filter radius for filters that have a radius parameter, i.e. when interpolation is one of: 'sinc', 'lanczos' or 'blackman'.
es_es: El radio de filtro para los filtros que tienen un parámetro de radio, es decir, cuando la interpolación es uno de: 'ías', 'lanczos' o 'blackman'.

source: When *True*, use a full resampling method. When *False*, only resample when the output image is larger than the input image.
es_es: Cuando *True*, utilice un método de remuestreo completo. Cuando *False*, sólo vuelva a mostrar cuando la imagen de salida es más grande que la de entrada.

source: str, optional
es_es: str, opcional

source: Set the url of the created `.AxesImage`. See `.Artist.set_url`.
es_es: Establece la url del `.AxesImage`. Ver `.Artist.set_url`.

source: Returns
es_es: Devuelve

source: Other Parameters
es_es: Otros Parámetros

source: If given, all parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception).
es_es: Si se dan, todos los parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción).

source: Artist properties
es_es: Propiedades del artista

source: These parameters are passed on to the constructor of the `.AxesImage` artist.
es_es: Estos parámetros son pasados al constructor del artista `.AxesImage`.

source: Plot a matrix or an array as an image.
es_es: Trazar una matriz o una matriz como una imagen.

source: Unless *extent* is used, pixel centers will be located at integer coordinates. In other words: the origin will coincide with the center of pixel (0, 0).
es_es: A menos que se utilice *extent*, los centros de píxeles se ubicarán en coordenadas enteras. En otras palabras: el origen coincidirá con el centro de píxeles (0, 0).

source: There are two common representations for RGB images with an alpha channel:
es_es: Hay dos representaciones comunes para imágenes RVA con un canal alfa:

source: Straight (unassociated) alpha: R, G, and B channels represent the color of the pixel, disregarding its opacity.
es_es: Los canales R y G representan el color del píxel, sin tener en cuenta su opacidad.

source: Premultiplied (associated) alpha: R, G, and B channels represent the color of the pixel, adjusted for its opacity by multiplication.
es_es: Los canales premultiplicados (asociados) del alfa: R, G y B representan el color del píxel, ajustado por su opacidad por multiplicación.

source: `~matplotlib.pyplot.imshow` expects RGB images adopting the straight (unassociated) alpha representation.
es_es: `~matplotlib.pyplot.imshow` espera imágenes RGB adoptando la representación alfa recta (no asociada).

source: Examples using ``matplotlib.pyplot.imshow``
es_es: Ejemplos usando ``matplotlib.pyplot.imshow``

source: Hyperlinks
es_es: Hipervínculos
