Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.ticklabel_format.po
Languages: es_es

source: matplotlib.axes.Axes.ticklabel\_format
es_es: formato matplotlib.axes.Ejes.ticklabel\_

source: Configure the `.ScalarFormatter` used by default for linear axes.
es_es: Configura el `.ScalarFormatter` usado por defecto para los ejes lineales.

source: If a parameter is not set, the corresponding property of the formatter is left unchanged.
es_es: Si no se establece un parámetro, la propiedad correspondiente del formateador se deja sin cambios.

source: Parameters
es_es: Parámetros

source: {'x', 'y', 'both'}, default: 'both'
es_es: {'x', 'y', 'both'}, por defecto: 'ambos'

source: The axis to configure. Only major ticks are affected.
es_es: El eje a configurar. Sólo los principales ticks son afectados.

source: Whether to use scientific notation. The formatter default is to use scientific notation.
es_es: Si usar o no notación científica. El formateador por defecto es utilizar notación científica.

source: pair of ints (m, n)
es_es: par de pistas (m, n)

source: Scientific notation is used only for numbers outside the range 10\ :sup:`m` to 10\ :sup:`n` (and only if the formatter is configured to use scientific notation at all). Use (0, 0) to include all numbers. Use (m, m) where m != 0 to fix the order of magnitude to 10\ :sup:`m`. The formatter default is :rc:`axes.formatter.limits`.
es_es: La notación científica solo se utiliza para números fuera del rango 10\ :sup:`m` a 10\ :sup:`n` (y sólo si el formateador está configurado para usar notación científica en absoluto). Use (0, 0) para incluir todos los números. Usa (m, m) donde m != 0 para fijar el orden de magnitud a 10\ :sup:`m`. El formateador por defecto es :rc:`axes.formatter.limits`.

source: **useOffset**
es_es: **Desplazamiento de uso**

source: bool or float
es_es: bool o float

source: If True, the offset is calculated as needed. If False, no offset is used. If a numeric value, it sets the offset. The formatter default is :rc:`axes.formatter.useoffset`.
es_es: Si es verdadero, el offset se calcula según sea necesario. Si False, no se utiliza ningún offset . Si es un valor numérico, establece el desplazamiento. El formateador predeterminado es :rc:`axes.formatter.useoffset`.

source: **useLocale**
es_es: **useLocal**

source: Whether to format the number using the current locale or using the C (English) locale. This affects e.g. the decimal separator. The formatter default is :rc:`axes.formatter.use_locale`.
es_es: Whether to format the number using the current locale or using the C (English) locale. This affect e. . el separador decimal. El formateador predeterminado es :rc:`axes.formatter.use_locale`.

source: Render the offset and scientific notation in mathtext. The formatter default is :rc:`axes.formatter.use_mathtext`.
es_es: Procesa el desplazamiento y notación científica en matemáticas. El formateador predeterminado es :rc:`axes.formatter.use_mathtext`.

source: Raises
es_es: Plantea

source: AttributeError
es_es: Error de atributo

source: If the current formatter is not a `.ScalarFormatter`.
es_es: Si el formateador actual no es un `.ScalarFormatter`.

source: Examples using ``matplotlib.axes.Axes.ticklabel_format``
es_es: Ejemplos usando ``matplotlib.axes.Axes.ticklabel_format``

source: The default tick formatter
es_es: El formateador de marcadores por defecto
