Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.hist.po
Languages: es_es

source: Plot a histogram.
es_es: Trazar un histograma.

source: Compute and draw the histogram of *x*. The return value is a tuple (*n*, *bins*, *patches*) or ([*n0*, *n1*, ...], *bins*, [*patches0*, *patches1*, ...]) if the input contains multiple data. See the documentation of the *weights* parameter to draw a histogram of already-binned data.
es_es: Calcula y dibuja el histograma de *x*, el valor de retorno es una tupla (*n*, *bins*, *patches*) o ([*n0*, *n1*, ...], *bins*, [*patches0*, *patches1*, . .]) si la entrada contiene varios datos. Consulte la documentación del parámetro *pesos* para dibujar un histograma de datos ya binnados.

source: Multiple data can be provided via *x* as a list of datasets of potentially different length ([*x0*, *x1*, ...]), or as a 2D ndarray in which each column is a dataset. Note that the ndarray form is transposed relative to the list form.
es_es: Múltiples datos pueden proporcionarse a través de *x* como una lista de conjuntos de datos de longitud potencialmente diferente ([*x0*, *x1*, ... ), o como un ndarray 2D en el que cada columna es un conjunto de datos. Tenga en cuenta que el formulario ndarray se transpone en relación al formulario de lista.

source: Masked arrays are not supported.
es_es: Las matrices enmascaradas no están soportadas.

source: The *bins*, *range*, *weights*, and *density* parameters behave as in `numpy.histogram`.
es_es: Los parámetros *bins*, *range*, *pesos*, y *densidad* se comportan como en `numpy.histogram`.

source: Parameters
es_es: Parámetros

source: (n,) array or sequence of (n,) arrays
es_es: (n,) array o secuencia de (n,) arrays

source: Input values, this takes either a single array or a sequence of arrays which are not required to be of the same length.
es_es: Los valores de entrada, esto toma una sola matriz o una secuencia de matrices que no son obligadas a tener la misma longitud.

source: **bins** : int or sequence or str, default: :rc:`hist.bins`
es_es: **papeles** : int o secuencia o str, por defecto: :rc:`is.bins`

source: int or sequence or str, default:
es_es: int o secuencia o str, por defecto:

source: If *bins* is an integer, it defines the number of equal-width bins in the range.
es_es: Si *bins* es un entero, define el número de contenedores de ancho igual en el rango.

source: If *bins* is a sequence, it defines the bin edges, including the left edge of the first bin and the right edge of the last bin; in this case, bins may be unequally spaced. All but the last (righthand-most) bin is half-open. In other words, if *bins* is::
es_es: Si *bins* es una secuencia, define los bordes de la papelera, incluyendo el borde izquierdo de la primera papelera y el borde derecho de la última papelera; en este caso, los contenedores pueden estar separados desigualmente. Todo menos la última (derecha-la mayoría) bin está medio abierta. En otras palabras, si *bins* es::

source: then the first bin is ``[1, 2)`` (including 1, but excluding 2) and the second ``[2, 3)``. The last bin, however, is ``[3, 4]``, which *includes* 4.
es_es: entonces la primera papelera es ``[1, 2)`` (incluyendo 1, pero excluyendo 2) y la segunda ``[2, 3)``. La última papelera, sin embargo, es ``[3, 4]``, que *incluye* 4.

source: If *bins* is a string, it is one of the binning strategies supported by `numpy.histogram_bin_edges`: 'auto', 'fd', 'doane', 'scott', 'stone', 'rice', 'sturges', or 'sqrt'.
es_es: Si *bins* es una cadena, es una de las estrategias de binning apoyadas por `numpy.histogram_bin_edges`: 'auto', 'fd', 'doane', 'scott', 'stone', 'rice', 'sturges', o 'sqrt'.

source: tuple or None, default: None
es_es: tuple o ninguno, por defecto: ninguno

source: The lower and upper range of the bins. Lower and upper outliers are ignored. If not provided, *range* is ``(x.min(), x.max())``. Range has no effect if *bins* is a sequence.
es_es: El rango inferior y superior de los cubos se ignora. Si no se proporciona, *rango* es ``(x.min(), x.max())``. El rango no tiene efecto si *bins* es una secuencia.

source: If *bins* is a sequence or *range* is specified, autoscaling is based on the specified bin range instead of the range of x.
es_es: Si *bins* es una secuencia o *rango* es especificado, el autoescalado se basa en el rango de bin especificado en lugar del rango de x.

source: **density**
es_es: **densidad**

source: bool, default: False
es_es: bool, por defecto: False

source: If ``True``, draw and return a probability density: each bin will display the bin's raw count divided by the total number of counts *and the bin width* (``density = counts / (sum(counts) * np.diff(bins))``), so that the area under the histogram integrates to 1 (``np.sum(density * np.diff(bins)) == 1``).
es_es: Si es ``verdadero``, dibujar y devolver una densidad de probabilidad: cada papelera mostrará el recuento crudo de la papelera dividido por el número total de cuentas *y la anchura de la papelera* (``densidad = cuentas/ (cuentas) * np. iff(bins)``), para que el área debajo del histograma se integre a 1 (``np.sum(density * np.diff(bins)) == 1``).

source: If *stacked* is also ``True``, the sum of the histograms is normalized to 1.
es_es: Si *apilado* es también ``True``, la suma de los histogramas se normaliza a 1.

source: **weights**
es_es: **Pesos**

source: (n,) array-like or None, default: None
es_es: (n,) array-like o ninguno, por defecto: Ninguno

source: An array of weights, of the same shape as *x*. Each value in *x* only contributes its associated weight towards the bin count (instead of 1). If *density* is ``True``, the weights are normalized, so that the integral of the density over the range remains 1.
es_es: Una matriz de pesos, de la misma forma que *x*. Cada valor en *x* sólo contribuye su peso asociado al recuento de bin (en lugar de 1). Si la *densidad* es ``Verdada``, los pesos son normalizados, de modo que la parte integral de la densidad en el rango sigue siendo 1.

source: This parameter can be used to draw a histogram of data that has already been binned, e.g. using `numpy.histogram` (by treating each bin as a single point with a weight equal to its count) ::
es_es: Este parámetro se puede utilizar para dibujar un histograma de datos que ya ha sido binned, p.ej. usando `numpy.histogram` (tratando cada papelera como un solo punto con un peso igual a su cuenta) ::

source: (or you may alternatively use `~.bar()`).
es_es: (o puedes usar alternativamente `~.bar()`).

source: bool or -1, default: False
es_es: bool o -1, por defecto: False

source: If ``True``, then a histogram is computed where each bin gives the counts in that bin plus all bins for smaller values. The last bin gives the total number of datapoints.
es_es: Si es ``True``, entonces un histograma es calculado donde cada papelera da los recuentos en esa papelera más todas las papeleras para valores más pequeños. La última papelera da el número total de datos indicados.

source: If *density* is also ``True`` then the histogram is normalized such that the last bin equals 1.
es_es: Si la *densidad* es también ``True`` entonces el histograma está normalizado de tal manera que la última papelera es igual a 1.

source: If *cumulative* is a number less than 0 (e.g., -1), the direction of accumulation is reversed. In this case, if *density* is also ``True``, then the histogram is normalized such that the first bin equals 1.
es_es: Si *acumulativa* es un número menor que 0 (por ejemplo, -1), la dirección de la acumulación es invertida. En este caso, si la *densidad* es también ``True``, entonces el histograma está normalizado de tal manera que la primera papelera es igual a 1.

source: **bottom**
es_es: **inferior**

source: array-like, scalar, or None, default: None
es_es: , escalar o ninguno, por defecto: ninguno

source: Location of the bottom of each bin, ie. bins are drawn from ``bottom`` to ``bottom + hist(x, bins)`` If a scalar, the bottom of each bin is shifted by the same amount. If an array, each bin is shifted independently and the length of bottom must match the number of bins. If None, defaults to 0.
es_es: Ubicación de la parte inferior de cada papelera, ej. Las papeleras se extraen de ``bottom`` a ``bottom + medium(x, bins)`` Si un escalar, la parte inferior de cada papelera se desplaza por la misma cantidad. Si una matriz, cada papelera se desplaza de forma independiente y la longitud de la parte inferior debe coincidir con el número de papeleras. Si Ninguna, el valor predeterminado es 0.

source: **histtype**
es_es: **Tipo**

source: {'bar', 'barstacked', 'step', 'stepfilled'}, default: 'bar'
es_es: {'bar', 'barstacked', 'step', 'stepfilled'}, por defecto: 'bar'

source: The type of histogram to draw.
es_es: El tipo de histograma a dibujar.

source: 'bar' is a traditional bar-type histogram. If multiple data are given the bars are arranged side by side.
es_es: 'bar' es un histograma tradicional del tipo de barra. Si se dan múltiples datos, las barras se organizan al lado del mismo.

source: 'barstacked' is a bar-type histogram where multiple data are stacked on top of each other.
es_es: 'barstacked' es un histograma de tipo barras en el que se acumulan múltiples datos.

source: 'step' generates a lineplot that is by default unfilled.
es_es: 'step' genera un diagrama de línea que por defecto está desllenado.

source: 'stepfilled' generates a lineplot that is by default filled.
es_es: 'stepfilled' genera un diagrama de línea que se llena por defecto.

source: The horizontal alignment of the histogram bars.
es_es: La alineación horizontal de las barras del histograma.

source: 'left': bars are centered on the left bin edges.
es_es: 'izquierda': las barras se centran en los bordes de la papelera.

source: 'mid': bars are centered between the bin edges.
es_es: 'mid': las barras se centran entre los bordes de la basura.

source: 'right': bars are centered on the right bin edges.
es_es: 'derecha': las barras se centran en los bordes de la basura derecha.

source: **orientation**
es_es: **orientación**

source: {'vertical', 'horizontal'}, default: 'vertical'
es_es: {'vertical', 'horizontal'}, por defecto: 'vertical'

source: If 'horizontal', `~.Axes.barh` will be used for bar-type histograms and the *bottom* kwarg will be the left edges.
es_es: Si es 'horizontal', `~.Axes.barh` será usado para histogramas tipo barra y el kwarg *abajo* será el borde izquierdo.

source: float or None, default: None
es_es: flotante o ninguno, por defecto: ninguno

source: The relative width of the bars as a fraction of the bin width. If ``None``, automatically compute the width.
es_es: El ancho relativo de las barras como una fracción del ancho de la papelera. Si ``Ninguno``, calcula automáticamente el ancho.

source: Ignored if *histtype* is 'step' or 'stepfilled'.
es_es: Ignorado si el *tipo* es 'paso' o 'escalonado'.

source: **log**
es_es: **registro**

source: If ``True``, the histogram axis will be set to a log scale.
es_es: Si es ``True``, el eje del histograma se establecerá a una escala del registro.

source: color or array-like of colors or None, default: None
es_es: color o estilo matriz de colores o ninguno, por defecto: ninguno

source: Color or sequence of colors, one per dataset. Default (``None``) uses the standard line color sequence.
es_es: Color o secuencia de colores, uno por conjunto de datos. Por defecto (``Ninguno``) utiliza la secuencia de color de línea estándar.

source: **label**
es_es: **etiqueta**

source: str or None, default: None
es_es: str o ninguno, por defecto: Ninguno

source: String, or sequence of strings to match multiple datasets. Bar charts yield multiple patches per dataset, but only the first gets the label, so that `~.Axes.legend` will work as expected.
es_es: Cadena, o secuencia de cadenas para que coincidan con varios conjuntos de datos. Los gráficos de barras producen múltiples parches por conjunto de datos, pero sólo el primero obtiene la etiqueta, de modo que `~.Axes.legend` funcionará como se esperaba.

source: **stacked**
es_es: **apilado**

source: If ``True``, multiple data are stacked on top of each other If ``False`` multiple data are arranged side by side if histtype is 'bar' or on top of each other if histtype is 'step'
es_es: Si es ``verdadero``, múltiples datos se acumulan sobre el otro. Si ``False`` múltiples datos se organizan codo con codo si el tipo de persona es 'bar' o encima si el tipo de persona es 'paso'

source: Returns
es_es: Devuelve

source: array or list of arrays
es_es: array o lista de matrices

source: The values of the histogram bins. See *density* and *weights* for a description of the possible semantics. If input *x* is an array, then this is an array of length *nbins*. If input is a sequence of arrays ``[data1, data2, ...]``, then this is a list of arrays with the values of the histograms for each of the arrays in the same order. The dtype of the array *n* (or of its element arrays) will always be float even if no weighting or normalization is used.
es_es: Los valores de las bolsas de histograma, vea *densidad* y *pesos* para una descripción de los semánticos posibles. Si la entrada *x* es una matriz, entonces esta es una matriz de longitud *Textins*. Si la entrada es una secuencia de arrays ``[data1, data2, ... ``, entonces esta es una lista de matrices con los valores de los histogramas para cada una de las matrices en el mismo orden. El tipo de dtype de la matriz *n* (o de sus matrices de elementos) siempre estará flotante incluso si no se utiliza ninguna ponderación o normalización.

source: **bins**
es_es: **Papelas**

source: The edges of the bins. Length nbins + 1 (nbins left edges and right edge of last bin). Always a single array even when multiple data sets are passed in.
es_es: Los bordes de los cubos de longitud. Siempre una sola matriz incluso cuando se pasan múltiples conjuntos de datos.

source: **patches** : `.BarContainer` or list of a single `.Polygon` or list of such objects
es_es: **parches** : `.BarContainer` o lista de un solo `.Polygon` o lista de tales objetos

source: BarContainer or list of a single Polygon or list of such objects
es_es: Contenedor de barras o lista de un único polígono o lista de tales objetos

source: Container of individual artists used to create the histogram or list of such containers if there are multiple input datasets.
es_es: Contenedor de artistas individuales utilizados para crear el histograma o lista de dichos contenedores si hay múltiples conjuntos de datos de entrada.

source: Other Parameters
es_es: Otros Parámetros

source: If given, the following parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception):
es_es: Si se dan, los siguientes parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción):

source: *x*, *weights*
es_es: *x*, *pesos*

source: `~matplotlib.patches.Patch` properties
es_es: Propiedades `~matplotlib.patches.Patch`

source: :obj:`hist2d`
es_es: :obj:`Cadena2d`

source: 2D histogram with rectangular bins
es_es: Histograma 2D con contenedores rectangulares

source: 2D histogram with hexagonal bins
es_es: Histograma 2D con contenedores hexagonales

source: For large numbers of bins (>1000), 'step' and 'stepfilled' can be significantly faster than 'bar' and 'barstacked'.
es_es: Para grandes cantidades de contenedores (>1000), 'step' y 'stepfilled' puede ser significativamente más rápido que 'bar' y 'barra'.

source: Examples using ``matplotlib.axes.Axes.hist``
es_es: Ejemplos usando ``matplotlib.axes.Axes.nb``

source: Scatter plot with histograms
es_es: Gráfico de dispersión con histogramas

source: Scatter Histogram (Locatable Axes)
es_es: Histograma de dispersión (ejes localizables)

source: MRI With EEG
es_es: MRI con EEG

source: Basic Usage
es_es: Uso básico

source: Artist tutorial
es_es: Tutorial de artistas

source: Transformations Tutorial
es_es: Tutorial de transformaciones
