Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.lines.Line2D.po
Languages: es_es

source: Setting *markevery* will still only draw markers at actual data points. While the float argument form aims for uniform visual spacing, it has to coerce from the ideal spacing to the nearest available data point. Depending on the number and distribution of data points, the result may still not look evenly spaced.
es_es: Establecer *marcador cada* sólo dibujará marcadores en puntos de datos reales. Mientras que el argumento flotante tiene como objetivo un espaciado visual uniforme, tiene que coaccionar desde el espaciado ideal hasta el punto de datos disponible más cercano. Dependiendo del número y de la distribución de los puntos de datos, el resultado puede no parecer uniformemente espaciado.

source: When using a start offset to specify the first marker, the offset will be from the first data point which may be different from the first the visible data point if the plot is zoomed in.
es_es: Cuando se utiliza un desplazamiento inicial para especificar el primer marcador, el desplazamiento será desde el primer punto de datos, el cual puede ser diferente del primer punto de datos visibles si la parcela está encendida.

source: If zooming in on a plot when using float arguments then the actual data points that have markers will change because the distance between markers is always determined from the display-coordinates axes-bounding-box-diagonal regardless of the actual axes data limits.
es_es: Si se encajan en una parcela cuando se usan argumentos flotantes, los puntos de datos reales que tienen marcadores cambiarán porque la distancia entre los marcadores siempre se determina a partir de los ejes de las coordenadas de visualización que delimitan los ejes, independientemente de los límites de datos de los ejes reales.

source: Alias for `set_markeredgecolor`.
es_es: Alias para `set_markeredgecolor`.

source: Alias for `set_markeredgewidth`.
es_es: Alias para `set_markeredgewidth`.

source: Alias for `set_markerfacecolor`.
es_es: Alias para `set_markerfacecolor`.

source: Alias for `set_markerfacecoloralt`.
es_es: Alias para `set_markerfacecoloralt`.

source: Alias for `set_markersize`.
es_es: Alias para `set_markersize`.

source: Set the event picker details for the line.
es_es: Establecer los detalles del selector de eventos para la línea.

source: If a float, it is used as the pick radius in points.
es_es: Si un flotante, se utiliza como el radio de selección en puntos.

source: Set the pick radius used for containment tests.
es_es: Establece el radio de selección utilizado para las pruebas de contención.

source: Pick radius, in points.
es_es: Elegir el radio, en puntos.

source: How to draw the end caps if the line is solid (not `~Line2D.is_dashed`)
es_es: Cómo dibujar los topes finales si la línea es sólida (no `~Line2D.is_dashed`)

source: How to join segments if the line is solid (not `~Line2D.is_dashed`).
es_es: Cómo unir segmentos si la línea es sólida (no `~Line2D.is_dashed`).

source: Set the artist transform.
es_es: Establece la transformación del artista.

source: Transform
es_es: Transformar

source: Set the data array for x.
es_es: Establecer la matriz de datos para x.

source: Set the data array for y.
es_es: Establecer la matriz de datos para y.

source: Copy properties from *other* to self.
es_es: Copiar propiedades de *otro* a sí mismo.

source: Examples using ``matplotlib.lines.Line2D``
es_es: Ejemplos usando ``matplotlib.lines.Line2D``

source: The double pendulum problem
es_es: El problema del doble péndulo
