Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.artist.ArtistInspector.po
Languages: es_es

source: A helper class to inspect an `~matplotlib.artist.Artist` and return information about its settable properties and their current values.
es_es: Una clase auxiliar para inspeccionar un `~matplotlib.artist.Artist` y devolver información sobre sus propiedades configurables y sus valores actuales.

source: Initialize the artist inspector with an `Artist` or an iterable of `Artist`\s. If an iterable is used, we assume it is a homogeneous sequence (all `Artist`\s are of the same type) and it is your responsibility to make sure this is so.
es_es: Inicializa el artista inspector con un `Artist` o un iterable de `Artist`\s. Si se utiliza un iterable asumimos que es una secuencia homogénea (todos los `Artist`\s son del mismo tipo) y es responsabilidad suya asegurarse de que así sea.

source: Methods
es_es: Métodos

source: Initialize the artist inspector with an `Artist` or an iterable of `Artist`\s.
es_es: Inicializa el artista inspector con un `Artist` o un iterable de `Artist`\s.

source: Return 'PROPNAME or alias' if *s* has an alias, else return 'PROPNAME'.
es_es: Devuelve 'PROPNAME o alias' si *s* tiene un alias, de lo contrario devuelve 'PROPNAME'.

source: Return 'PROPNAME or alias' if *s* has an alias, else return 'PROPNAME', formatted for reST.
es_es: Devuelve 'PROPNAME o alias' si *s* tiene un alias, sino devuelve 'PROPNAME', formateado para reST.

source: Get a dict mapping property fullnames to sets of aliases for each alias in the :class:`~matplotlib.artist.ArtistInspector`.
es_es: Obtén un nombre de propiedad de mapeo de dados a conjuntos de alias para cada alias en el :class:`~matplotlib.artist.ArtistInspector`.

source: Get the attribute strings with setters for object.
es_es: Obtener las cadenas de atributos con setters para el objeto.

source: Get the legal arguments for the setter associated with *attr*.
es_es: Obtener los argumentos legales para el setter asociado con *attr*.

source: Return whether method object *o* is an alias for another method.
es_es: Devuelve si el objeto de método *o* es un alias para otro método.

source: Return the getters and actual values as list of strings.
es_es: Devuelve los getters y los valores reales como lista de cadenas.

source: If *prop* is *None*, return a list of strings of all settable properties and their valid values.
es_es: Si *prop* es *nunca*, retorna una lista de cadenas de todas las propiedades settable y sus valores válidos.

source: If *prop* is *None*, return a list of reST-formatted strings of all settable properties and their valid values.
es_es: Si *prop* es *nunca*, retorna una lista de cadenas con formato reST de todas las propiedades configurables y sus valores válidos.

source: Return a dictionary mapping property name -> value.
es_es: Devuelve un nombre de propiedad de mapeo de diccionarios -> valor.

source: e.g., for the line markerfacecolor property, which has an alias, return 'markerfacecolor or mfc' and for the transform property, which does not, return 'transform'.
es_es: por ejemplo, para la propiedad markerfacecolor de línea, que tiene un alias, devolver 'markerfacecolor o mfc' y para la propiedad transformación, que no devuelve 'transform'.

source: e.g., for lines::
es_es: e.g., para líneas::

source: For example, for a line, return ``['markerfacecolor', 'linewidth', ....]``.
es_es: Por ejemplo, para una línea, devolver ``['markerfacecolor', 'linewidth', ....]``.

source: This is done by querying the docstring of the setter for a line that begins with "ACCEPTS:" or ".. ACCEPTS:", and then by looking for a numpydoc-style documentation for the setter's first argument.
es_es: Esto se hace consultando la docstring del setter para una línea que comienza con "ACCEPTS:" o ".. ACCEPTS:", y luego buscando una documentación tipo numpydoc-style para el primer argumento del setter.

source: If *prop* is not *None*, it is a valid property name and that property will be returned as a string of property : valid values.
es_es: Si *prop* no es *Ninguno*, es un nombre de propiedad válido y esa propiedad será devuelta como una cadena de propiedad: valores válidos.

source: If *prop* is not *None*, it is a valid property name and that property will be returned as a string of "property : valid" values.
es_es: Si *prop* no es *Ninguno*, es un nombre de propiedad válido y esa propiedad será devuelta como una cadena de valores "property : valid".
