Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.getp.po
Languages: es_es

source: Return the value of an `.Artist`'s *property*, or print all of them.
es_es: Devuelve el valor de la *propiedad* de un `.Artist`, o imprime todas ellas.

source: Parameters
es_es: Parámetros

source: The queried artist; e.g., a `.Line2D`, a `.Text`, or an `~.axes.Axes`.
es_es: El artista consultado; por ejemplo, un `.Line2D`, un `.Text`, o un `~.axes.Axes`.

source: **property**
es_es: **propiedad**

source: str or None, default: None
es_es: str o ninguno, por defecto: Ninguno

source: If *property* is 'somename', this function returns ``obj.get_somename()``.
es_es: Si *property* es 'somename', esta función devuelve ``obj.get_somename()``.

source: If it's None (or unset), it *prints* all gettable properties from *obj*. Many properties have aliases for shorter typing, e.g. 'lw' is an alias for 'linewidth'. In the output, aliases and full property names will be listed as:
es_es: Si es Ninguno (o desconfigurado), *imprime* todas las propiedades de *objeto*. . 'lw' es un alias para 'ancho de línea'. En la salida, los alias y los nombres de propiedades completos se listarán como:

source: property or alias = value
es_es: propiedad o alias = valor

source: e.g.:
es_es: ej.:

source: linewidth or lw = 2
es_es: ancho de línea o lw = 2

source: Examples using ``matplotlib.pyplot.getp``
es_es: Ejemplos usando ``matplotlib.pyplot.getp``

source: Artist tutorial
es_es: Tutorial de artistas
