Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.colors.Colormap.po
Languages: es_es

source: Baseclass for all scalar to RGBA mappings.
es_es: Baseclass para todos los escalares a mapeos RGBA.

source: Typically, Colormap instances are used to convert data values (floats) from the interval ``[0, 1]`` to the RGBA color that the respective Colormap represents. For scaling of data into the ``[0, 1]`` interval see `matplotlib.colors.Normalize`. Subclasses of `matplotlib.cm.ScalarMappable` make heavy use of this ``data -> normalize -> map-to-color`` processing chain.
es_es: Por lo general, las instancias de mapa de color se utilizan para convertir los valores de datos (flotante) del intervalo ``[0, 1]`` al color RGBA que representa el mapa de color respectivo. Para escalar datos en el intervalo ``[0, 1]`` ver `matplotlib.colors.Normalize`. Subclases de `matplotlib. m.ScalarMappable` hace un uso intensivo de esta cadena de procesamiento ``datos-> normalizar-> map-to-color``.

source: Parameters
es_es: Parámetros

source: The name of the colormap.
es_es: El nombre del mapa de colores.

source: The number of rgb quantization levels.
es_es: El número de niveles de cuantificación de rgb.

source: float or int, ndarray or scalar
es_es: flotante o int, ndarray o escalar

source: The data value(s) to convert to RGBA. For floats, X should be in the interval ``[0.0, 1.0]`` to return the RGBA values ``X*100`` percent along the Colormap line. For integers, X should be in the interval ``[0, Colormap.N)`` to return RGBA values *indexed* from the Colormap with index ``X``.
es_es: El valor(es) de datos a convertir a RGBA. Para flotantes, X debe estar en el intervalo ``[0. , 1.0]`` para devolver el porcentaje de los valores RGBA ``X*100`` a lo largo de la línea Colormap. Para los enteros, X debe estar en el intervalo ``[0, Colormap.N)`` para devolver valores RGBA *indexado* del mapa de colores con el índice ``X``.

source: **alpha**
es_es: **alfa**

source: float or array-like or None
es_es: flotante o tipo array o ninguno

source: Alpha must be a scalar between 0 and 1, a sequence of such floats with shape matching X, or None.
es_es: La alfa debe ser un escalar entre 0 y 1, una secuencia de tales flotantes con forma que coincida con X, o ninguno.

source: If False (default), the returned RGBA values will be floats in the interval ``[0, 1]`` otherwise they will be uint8s in the interval ``[0, 255]``.
es_es: Si False (por defecto), los valores RGBA devueltos serán flotantes en el intervalo ``[0, 1]`` de lo contrario serán uint8s en el intervalo ``[0, 255]``.

source: Returns
es_es: Devuelve

source: Tuple of RGBA values if X is scalar, otherwise an array of
es_es: Múltiple de valores RGBA si X es escalar, de lo contrario un array de

source: RGBA values with a shape of ``X.shape + (4, )``.
es_es: Valores RGBA con una forma de ``X.shape + (4, )``.

source: When this colormap exists on a scalar mappable and colorbar_extend is not False, colorbar creation will pick up ``colorbar_extend`` as the default value for the ``extend`` keyword in the `matplotlib.colorbar.Colorbar` constructor.
es_es: Cuando este mapa de colores existe en un mapeable escalar y colorbar_extend no es falso, la creación de colorbar recogerá ``colorbar_extend`` como valor predeterminado para la palabra clave ``extend`` en el `matplotlib. constructor olorbar.Colorbar`.

source: Return a copy of the colormap.
es_es: Devuelve una copia del mapa de colores.

source: Get the color for masked values.
es_es: Obtener el color de los valores enmascarados.

source: Get the color for high out-of-range values.
es_es: Obtener el color para valores fuera de rango.

source: Get the color for low out-of-range values.
es_es: Obtener el color para valores bajos fuera de rango.

source: Return whether the colormap is grayscale.
es_es: Devuelve si el mapa de color es escala de grises.

source: Return a reversed instance of the Colormap.
es_es: Devuelve una instancia inversa del Colormap.

source: This function is not implemented for base class.
es_es: Esta función no está implementada para la clase base.

source: str, optional
es_es: str, opcional

source: The name for the reversed colormap. If it's None the name will be the name of the parent colormap + "_r".
es_es: El nombre del mapa de colores invertido. Si no es Ninguno el nombre será el nombre del mapa de colores padre + "_r".

source: Set the color for masked values.
es_es: Establecer el color de los valores enmascarados.

source: Set the colors for masked (*bad*) values and, when ``norm.clip = False``, low (*under*) and high (*over*) out-of-range values.
es_es: Establece los colores para los valores enmascarados (*malo*) y, cuando ``norm.clip = False``, bajo (*menos*) y alto (*sobre*) valores fuera de rango.

source: Set the color for high out-of-range values.
es_es: Establecer el color para valores fuera de rango.

source: Set the color for low out-of-range values.
es_es: Establecer el color para valores bajos fuera de rango.

source: Return a copy of the colormap, for which the colors for masked (*bad*) values and, when ``norm.clip = False``, low (*under*) and high (*over*) out-of-range values, have been set accordingly.
es_es: Devuelve una copia del mapa de color, para el cual los colores para los valores enmascarados (*malo*) y, cuando ``norma. labio = False``, bajo (*menos*) y alto (*sobre*) valores fuera de rango, se han establecido en consecuencia.

source: Examples using ``matplotlib.colors.Colormap``
es_es: Ejemplos usando ``matplotlib.colors.Colormap``

source: Multicolored lines
es_es: Líneas multicolores

source: Creating a colormap from a list of colors
es_es: Crear un mapa de colores a partir de una lista de colores

source: Left ventricle bullseye
es_es: Diana del ventrículo izquierdo

source: Customized Colorbars Tutorial
es_es: Tutorial de barras de colores personalizadas

source: Creating Colormaps in Matplotlib
es_es: Creación de mapas de colores en Matplotlib
