Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.eventplot.po
Languages: es_es

source: matplotlib.axes.Axes.eventplot
es_es: matplotlib.axes.Ejes.eventplot

source: Plot identical parallel lines at the given positions.
es_es: Trazar líneas paralelas idénticas en las posiciones dadas.

source: This type of plot is commonly used in neuroscience for representing neural events, where it is usually called a spike raster, dot raster, or raster plot.
es_es: Este tipo de trama se utiliza comúnmente en la neurociencia para representar eventos neuronales, donde se suele llamar un rastro de espiga, rastro de puntos o trama de rastro.

source: However, it is useful in any situation where you wish to show the timing or position of multiple sets of discrete events, such as the arrival times of people to a business on each day of the month or the date of hurricanes each year of the last century.
es_es: Sin embargo, es útil en cualquier situación en la que desee mostrar el tiempo o la posición de varios conjuntos de eventos discretos como los horarios de llegada de personas a un negocio cada día del mes o la fecha de los hurricanes cada año del siglo pasado.

source: Parameters
es_es: Parámetros

source: **positions**
es_es: **posiciones**

source: array-like or list of array-like
es_es: como matriz o lista de matriz

source: A 1D array-like defines the positions of one sequence of events.
es_es: Una matriz 1D define las posiciones de una secuencia de eventos.

source: Multiple groups of events may be passed as a list of array-likes. Each group can be styled independently by passing lists of values to *lineoffsets*, *linelengths*, *linewidths*, *colors* and *linestyles*.
es_es: Múltiples grupos de eventos pueden ser pasados como una lista de tipo matriz. Cada grupo puede ser diseñado de forma independiente pasando listas de valores a *conjuntos de lineas*, *longitudes de línea*, *anchuras de línea*, *colores* y *estilos de linea*.

source: Note that *positions* can be a 2D array, but in practice different event groups usually have different counts so that one will use a list of different-length arrays rather than a 2D array.
es_es: Ten en cuenta que *posiciones* puede ser una matriz 2D, pero en la práctica los diferentes grupos de eventos suelen tener diferentes contadores de modo que se usará una lista de matrices de longitud diferente en lugar de una matriz 2D.

source: **orientation**
es_es: **orientación**

source: {'horizontal', 'vertical'}, default: 'horizontal'
es_es: {'horizontal', 'vertical'}, por defecto: 'horizontal'

source: The direction of the event sequence:
es_es: La dirección de la secuencia de eventos:

source: 'horizontal': the events are arranged horizontally. The indicator lines are vertical.
es_es: 'horizontal': los eventos se organizan horizontalmente.

source: 'vertical': the events are arranged vertically. The indicator lines are horizontal.
es_es: 'vertical': los eventos se organizan verticalmente.

source: The offset of the center of the lines from the origin, in the direction orthogonal to *orientation*.
es_es: La compensación del centro de las líneas desde el origen, en la dirección ortogonal a la *orientación*.

source: If *positions* is 2D, this can be a sequence with length matching the length of *positions*.
es_es: Si *posiciones* es 2D, esto puede ser una secuencia con una longitud que coincida con la longitud de *posiciones*.

source: The total height of the lines (i.e. the lines stretches from ``lineoffset - linelength/2`` to ``lineoffset + linelength/2``).
es_es: La altura total de las líneas (es decir, las líneas se estira desde ``lineoffset - linelength/2`` hasta ``lineoffset + linelength/2``).

source: **linewidths** : float or array-like, default: :rc:`lines.linewidth`
es_es: **anchos de línea** : float o array-like default: :rc:`lines.linewidth`

source: The line width(s) of the event lines, in points.
es_es: El ancho(s) de línea(s) de las líneas del evento, en puntos.

source: **colors** : color or list of colors, default: :rc:`lines.color`
es_es: **colores** : color o lista de colores, por defecto: :rc:`lines.color`

source: color or list of colors, default:
es_es: color o lista de colores, por defecto:

source: The color(s) of the event lines.
es_es: El color (s) de las líneas de evento.

source: str or tuple or list of such values, default: 'solid'
es_es: str o tuple o lista de estos valores, por defecto: 'sólid'

source: Default is 'solid'. Valid strings are ['solid', 'dashed', 'dashdot', 'dotted', '-', '--', '-.', ':']. Dash tuples should be of the form::
es_es: Por defecto es 'sólido'. Las cadenas válidas son ['sólid', 'guionado', 'guiones', 'punted', '-', '--', '-.', ':']. Las tuplas de guión deben ser de la forma::

source: where *onoffseq* is an even length tuple of on and off ink in points.
es_es: donde *onoffseq* es una tupla de longitud uniforme de tinta encendida y apagada en puntos.

source: If given, the following parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception):
es_es: Si se dan, los siguientes parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción):

source: *positions*, *lineoffsets*, *linelengths*, *linewidths*, *colors*, *linestyles*
es_es: *posiciones*, *conjuntos de línea*, *longitudes de línea*, *anchode de línea*, *colores*, *linestyles*

source: Other keyword arguments are line collection properties. See `.LineCollection` for a list of the valid properties.
es_es: Otros argumentos de palabras clave son propiedades de colección de líneas. Vea `.LineCollection` para una lista de las propiedades válidas.

source: Returns
es_es: Devuelve

source: list of `.EventCollection`
es_es: lista de `.EventCollection`

source: The `.EventCollection` that were added.
es_es: El `.EventCollection` que fue añadido.

source: For *linelengths*, *linewidths*, *colors*, and *linestyles*, if only a single value is given, that value is applied to all lines. If an array-like is given, it must have the same length as *positions*, and each value will be applied to the corresponding row of the array.
es_es: Para *líneas*, *anchos de línea*, *colores*, y *linestyles*, si sólo se da un valor único, ese valor se aplica a todas las líneas. Si se da una matriz, debe tener la misma longitud que *posiciones*, y cada valor se aplicará a la fila correspondiente de la matriz.

source: Examples
es_es: Ejemplos

source: (`Source code <../../gallery/lines_bars_and_markers/eventplot_demo.py>`__, `png <../../gallery/lines_bars_and_markers/eventplot_demo.png>`__, `pdf <../../gallery/lines_bars_and_markers/eventplot_demo.pdf>`__)
es_es: (`Código fuente <../../gallery/lines_bars_and_markers/eventplot_demo.py>`__, `png <../../gallery/lines_bars_and_markers/eventplot_demo.png>`__, `pdf <../../gallery/lines_bars_and_markers/eventplot_demo.pdf>`__)

source: Examples using ``matplotlib.axes.Axes.eventplot``
es_es: Ejemplos usando ``matplotlib.axes.Axes.eventplot``
