Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.colors.BoundaryNorm.po
Languages: es_es

source: Generate a colormap index based on discrete intervals.
es_es: Genera un índice de mapa de colores basado en intervalos discretos.

source: Unlike `Normalize` or `LogNorm`, `BoundaryNorm` maps values to integers instead of to the interval 0-1.
es_es: A diferencia de `Normalize` o `LogNorm`, `BoundaryNorm` asigna valores a enteros en lugar del intervalo 0-1.

source: Mapping to the 0-1 interval could have been done via piece-wise linear interpolation, but using integers seems simpler, and reduces the number of conversions back and forth between integer and floating point.
es_es: El mapeo al intervalo 0-1 podría haberse hecho a través de una interpolación lineal en sentido pedido, pero el uso de enteros parece más simple, y reduce el número de conversiones entre enteros y coma flotante.

source: Parameters
es_es: Parámetros

source: **boundaries**
es_es: **límites**

source: Monotonically increasing sequence of at least 2 boundaries.
es_es: Monótonamente creciente secuencia de al menos 2 límites.

source: **ncolors**
es_es: **colores**

source: Number of colors in the colormap to be used.
es_es: Cantidad de colores en el mapa de colores a utilizar.

source: If clip is ``True``, out of range values are mapped to 0 if they are below ``boundaries[0]`` or mapped to ``ncolors - 1`` if they are above ``boundaries[-1]``.
es_es: Si el clip es ``Verdadero``, los valores fuera del rango se asignan a 0 si están por debajo de ``límites[0]`` o mapeados a ``ncolors - 1`` si están por encima de ``límites[-1]``.

source: If clip is ``False``, out of range values are mapped to -1 if they are below ``boundaries[0]`` or mapped to *ncolors* if they are above ``boundaries[-1]``. These are then converted to valid indices by `Colormap.__call__`.
es_es: Si el clip es ``False``, los valores fuera del rango se asignan a -1 si están por debajo de ``límites[0]`` o se asignan a *ncolors* si están por encima de ``límites[-1]``. Estos son luego convertidos a índices válidos por `Colormap.__call__`.

source: **extend**
es_es: **extensión**

source: {'neither', 'both', 'min', 'max'}, default: 'neither'
es_es: {'ninguno de los dos', 'ambos', 'min', 'max'}, por defecto: 'ninguno'

source: Extend the number of bins to include one or both of the regions beyond the boundaries. For example, if ``extend`` is 'min', then the color to which the region between the first pair of boundaries is mapped will be distinct from the first color in the colormap, and by default a `~matplotlib.colorbar.Colorbar` will be drawn with the triangle extension on the left or lower end.
es_es: Extender el número de cubos para incluir una o ambas regiones más allá de los límites. Por ejemplo, si ``extend`` es 'min', entonces el color al que se asigna la región entre el primer par de límites será distinto del primer color en el mapa de color, y por defecto un `~matplotlib. olorbar.Colorbar` se dibujará con la extensión del triángulo en el extremo izquierdo o inferior.

source: Returns
es_es: Devuelve

source: int16 scalar or array
es_es: escalar int16 o matriz

source: *boundaries* defines the edges of bins, and data falling within a bin is mapped to the color with the same index.
es_es: *límites* define los bordes de las papeleras, y los datos que caen dentro de una papelera se mapean al color con el mismo índice.

source: If the number of bins, including any extensions, is less than *ncolors*, the color index is chosen by linear interpolation, mapping the ``[0, nbins - 1]`` range onto the ``[0, ncolors - 1]`` range.
es_es: Si el número de papeleras, incluyendo cualquier extensión, es menor que *ncolors*, el índice de color es elegido por interpolación lineal, mapeando el rango ``[0, Textins - 1]`` en el rango ``[0, ncolors - 1]``.

source: Normalize *value* data in the ``[vmin, vmax]`` interval into the ``[0.0, 1.0]`` interval and return it.
es_es: Normaliza los datos de *valor* en el intervalo ``[vmin, vmax]`` en el intervalo ``[0.0, 1.0]`` y devuelve.

source: **value**
es_es: **valor**

source: Data to normalize.
es_es: Datos a normalizar.

source: If ``None``, defaults to ``self.clip`` (which defaults to ``False``).
es_es: Si ``ninguno``, el valor predeterminado es ``self.clip`` (que por defecto es ``False``).

source: If not already initialized, ``self.vmin`` and ``self.vmax`` are initialized using ``self.autoscale_None(value)``.
es_es: Si no se ha inicializado, ``self.vmin`` y ``self.vmax`` son inicializados usando ``self.autoscale_ichard (value)``.

source: Raises
es_es: Plantea

source: BoundaryNorm is not invertible, so calling this method will always raise an error
es_es: LimundaryNorm no es inverso, por lo que llamar a este método siempre generará un error

source: Examples using ``matplotlib.colors.BoundaryNorm``
es_es: Ejemplos usando ``matplotlib.colors.BoundaryNorm``

source: Creating annotated heatmaps
es_es: Creación de mapas térmicos anotados

source: Colormap Normalizations
es_es: Normalizaciones del mapa de colores
