Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.set_adjustable.po
Languages: es_es

source: matplotlib.axes.Axes.set\_adjustable
es_es: matplotlib.axes.Ejes.set\_ajustable

source: Set how the Axes adjusts to achieve the required aspect ratio.
es_es: Establecer cómo se ajustan los ejes para lograr la relación de aspecto requerida.

source: Parameters
es_es: Parámetros

source: **adjustable**
es_es: **ajustable**

source: If 'box', change the physical dimensions of the Axes. If 'datalim', change the ``x`` or ``y`` data limits.
es_es: Si es 'box', cambia las dimensiones físicas de los ejes. Si es 'datalim', cambia los límites de datos ``x`` o ``y``.

source: **share**
es_es: **Compartir**

source: bool, default: False
es_es: bool, por defecto: False

source: If ``True``, apply the settings to all shared Axes.
es_es: Si es ``True``, aplique la configuración a todos los ejes compartidos.

source: For a description of aspect handling.
es_es: Para una descripción del manejo de aspectos.

source: Shared Axes (of which twinned Axes are a special case) impose restrictions on how aspect ratios can be imposed. For twinned Axes, use 'datalim'. For Axes that share both x and y, use 'box'. Otherwise, either 'datalim' or 'box' may be used. These limitations are partly a requirement to avoid over-specification, and partly a result of the particular implementation we are currently using, in which the adjustments for aspect ratios are done sequentially and independently on each Axes as it is drawn.
es_es: Los ejes compartidos (de los cuales los ejes entrelazados son un caso especial) imponen restricciones sobre cómo se pueden imponer los coeficientes de aspecto. Para ejes gemelos, use 'datalim'. Para ejes que comparten x y y, use 'box'. De lo contrario, puede usarse 'datalim' o 'box'. Estas limitaciones son en parte un requisito para evitar la sobrerespecificación, y en parte un resultado de la aplicación concreta que estamos utilizando actualmente. En la que los ajustes para los ratios de aspecto se realizan de forma secuencial e independiente sobre cada eje, tal y como se dibuja.

source: Examples using ``matplotlib.axes.Axes.set_adjustable``
es_es: Ejemplos usando ``matplotlib.axes.Axes.set_justable``

source: Loglog Aspect
es_es: Aspecto Loglog
