Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.animation.FuncAnimation.po
Languages: es_es

source: Makes an animation by repeatedly calling a function *func*.
es_es: Hace una animación llamando repetidamente a una función *func*.

source: You must store the created Animation in a variable that lives as long as the animation should run. Otherwise, the Animation object will be garbage-collected and the animation stops.
es_es: Debes almacenar la Animación creada en una variable que vive siempre y cuando la animación deba ejecutarse. De lo contrario, el objeto de Animación será recolectado de basura y la animación se detiene.

source: Parameters
es_es: Parámetros

source: Figure
es_es: Figura

source: The figure object used to get needed events, such as draw or resize.
es_es: El objeto figura utilizado para obtener eventos necesarios, como dibujar o redimensionar.

source: callable
es_es: llamable

source: The function to call at each frame. The first argument will be the next value in *frames*. Any additional positional arguments can be supplied via the *fargs* parameter.
es_es: La función a llamar en cada fotograma. El primer argumento será el siguiente valor en *frames*. Cualquier argumento posicional adicional se puede suministrar a través del parámetro *fargs*.

source: The required signature is::
es_es: La firma requerida es::

source: If ``blit == True``, *func* must return an iterable of all artists that were modified or created. This information is used by the blitting algorithm to determine which parts of the figure have to be updated. The return value is unused if ``blit == False`` and may be omitted in that case.
es_es: Si ``blit == True``, *func* debe devolver un iterable de todos los artistas que fueron modificados o creados. Esta información es utilizada por el algoritmo de flitting para determinar qué partes de la figura deben ser actualizadas. El valor de retorno no se utiliza si ``blit == False`` y puede ser omitido en ese caso.

source: iterable, int, generator function, or None, optional
es_es: iterable, int, función generadora o ninguna, opcional

source: Source of data to pass *func* and each frame of the animation
es_es: Fuente de datos para pasar *función* y cada fotograma de la animación

source: If an iterable, then simply use the values provided. If the iterable has a length, it will override the *save_count* kwarg.
es_es: Si un iterable, simplemente use los valores proporcionados. Si el iterable tiene una longitud, anulará el kwarg.

source: If an integer, then equivalent to passing ``range(frames)``
es_es: Si un entero, entonces equivalente a pasar ``range(frames)``

source: If a generator function, then must have the signature::
es_es: Si una función generadora, entonces debe tener la firma::

source: If *None*, then equivalent to passing ``itertools.count``.
es_es: Si *nunca*, entonces equivalente a pasar ``itertools.count``.

source: In all of these cases, the values in *frames* is simply passed through to the user-supplied *func* and thus can be of any type.
es_es: En todos estos casos, los valores en *frames* son pasados simplemente a la *función* suministrada por el usuario y por lo tanto pueden ser de cualquier tipo.

source: callable, optional
es_es: llamable, opcional

source: A function used to draw a clear frame. If not given, the results of drawing from the first item in the frames sequence will be used. This function will be called once before the first frame.
es_es: Una función usada para dibujar un marco claro. Si no se proporciona, se utilizarán los resultados de la extracción del primer elemento de la secuencia de fotogramas. Esta función será llamada una vez antes del primer fotograma.

source: If ``blit == True``, *init_func* must return an iterable of artists to be re-drawn. This information is used by the blitting algorithm to determine which parts of the figure have to be updated. The return value is unused if ``blit == False`` and may be omitted in that case.
es_es: Si ``blit == True``, *init_func* debe devolver un iterable de artistas para volver a dibujar. Esta información es utilizada por el algoritmo de flitting para determinar qué partes de la figura deben ser actualizadas. El valor de retorno no se utiliza si ``blit == False`` y puede ser omitido en ese caso.

source: tuple or None, optional
es_es: tupla o ninguno, opcional

source: Additional arguments to pass to each call to *func*.
es_es: Argumentos adicionales para pasar a cada llamada a *func*.

source: **save_count**
es_es: **guardar_cuenta**

source: int, default: 100
es_es: int, por defecto: 100

source: Fallback for the number of values from *frames* to cache. This is only used if the number of frames cannot be inferred from *frames*, i.e. when it's an iterator without length or a generator.
es_es: Retroceder al número de valores de *frames* a la caché. Esto sólo se utiliza si el número de fotogramas no se puede inferir de *frames*, es decir, cuando es un iterador sin longitud ni generador.

source: **interval**
es_es: **intervalo**

source: int, default: 200
es_es: int, por defecto: 200

source: Delay between frames in milliseconds.
es_es: Retraso entre fotogramas en milisegundos.

source: **repeat_delay**
es_es: **Repetir_retraso**

source: int, default: 0
es_es: int, por defecto: 0

source: The delay in milliseconds between consecutive animation runs, if *repeat* is True.
es_es: El retraso en milisegundos entre la animación consecutiva se ejecuta, si *repetir* es verdadero.

source: **repeat**
es_es: **repetir**

source: bool, default: True
es_es: bool, por defecto: True

source: Whether the animation repeats when the sequence of frames is completed.
es_es: Si la animación se repite cuando se completa la secuencia de fotogramas.

source: bool, default: False
es_es: bool, por defecto: False

source: Whether blitting is used to optimize drawing. Note: when using blitting, any animated artists will be drawn according to their zorder; however, they will be drawn on top of any previous artists, regardless of their zorder.
es_es: Si el chorro se utiliza para optimizar el dibujo. Nota: al usar blitting, cualquier artista animado será dibujado de acuerdo a su zorder; sin embargo, serán dibujados encima de cualquier artista anterior, independientemente de su zorder.

source: Whether frame data is cached. Disabling cache might be helpful when frames contain large objects.
es_es: Si los datos de fotogramas se almacenan en caché. Deshabilitar caché puede ser útil cuando los fotogramas contienen objetos grandes.

source: Methods
es_es: Métodos

source: Return a new sequence of frame information.
es_es: Devuelve una nueva secuencia de información de fotogramas.

source: Return a new sequence of saved/cached frame information.
es_es: Devolver una nueva secuencia de información del fotograma guardado/caché.

source: Pause the animation.
es_es: Pausar la animación.

source: Resume the animation.
es_es: Reanudar la animación.

source: Save the animation as a movie file by drawing every frame.
es_es: Guarda la animación como un archivo de película dibujando cada fotograma.

source: Convert the animation to an HTML5 ``<video>`` tag.
es_es: Convierte la animación a una etiqueta HTML5 ``<video>`.

source: Generate HTML representation of the animation.
es_es: Generar representación HTML de la animación.
