Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.contourf.po
Languages: es_es

source: Plot filled contours.
es_es: Trazar contornos llenos.

source: Call signature::
es_es: Firma de llamada::

source: `.contour` and `.contourf` draw contour lines and filled contours, respectively. Except as noted, function signatures and return values are the same for both versions.
es_es: `.contour` y `.contourf` dibujan líneas de contorno y contornos llenados, respectivamente. Excepto como señalado, las firmas de funciones y los valores de retorno son los mismos para ambas versiones.

source: Parameters
es_es: Parámetros

source: array-like, optional
es_es: tipo arreglo, opcional

source: The coordinates of the values in *Z*.
es_es: Las coordenadas de los valores en *Z*.

source: *X* and *Y* must both be 2D with the same shape as *Z* (e.g. created via `numpy.meshgrid`), or they must both be 1-D such that ``len(X) == N`` is the number of columns in *Z* and ``len(Y) == M`` is the number of rows in *Z*.
es_es: *X* y *Y* deben ser 2D con la misma forma que *Z* (por ejemplo, creados mediante `numpy. eshgrid`), o ambos deben ser 1-D tal que ``len(X) == N`` es el número de columnas en *Z* y ``len(Y) == M`` es el número de filas en *Z*.

source: *X* and *Y* must both be ordered monotonically.
es_es: *X* y *Y* deben ser ordenados monotónicamente.

source: If not given, they are assumed to be integer indices, i.e. ``X = range(N)``, ``Y = range(M)``.
es_es: Si no se proporciona, se asumen que son índices enteros, es decir, ``X = range(N)``, ``Y = range(M)``.

source: (M, N) array-like
es_es: (M, N) matriz

source: The height values over which the contour is drawn.
es_es: Los valores de altura sobre los que se dibuja el contorno.

source: **levels**
es_es: **Niveles**

source: int or array-like, optional
es_es: int o tipo matriz, opcional

source: Determines the number and positions of the contour lines / regions.
es_es: Determina el número y las posiciones de las líneas / regiones de contorno.

source: If an int *n*, use `~matplotlib.ticker.MaxNLocator`, which tries to automatically choose no more than *n+1* "nice" contour levels between *vmin* and *vmax*.
es_es: Si un int *n*, use `~matplotlib.ticker.MaxNLocator`, que intenta elegir automáticamente no más de *n+1* niveles de contorno entre *vmin* y *vmax*.

source: If array-like, draw contour lines at the specified levels. The values must be in increasing order.
es_es: Si al estilo de la matriz, dibuja líneas de contorno en los niveles especificados. Los valores deben estar en orden creciente.

source: Returns
es_es: Devuelve

source: Other Parameters
es_es: Otros Parámetros

source: **corner_mask** : bool, default: :rc:`contour.corner_mask`
es_es: **corner_mask** : bool, predeterminado: :rc:`contour.corner_mask`

source: Enable/disable corner masking, which only has an effect if *Z* is a masked array. If ``False``, any quad touching a masked point is masked out. If ``True``, only the triangular corners of quads nearest those points are always masked out, other triangular corners comprising three unmasked points are contoured as usual.
es_es: Activar/desactivar la máscara de esquina, que sólo tiene efecto si *Z* es una matriz enmascarada. Si es ``False``, cualquier cuadrilátero que toque un punto enmascarado es enmascarado. Si es ``True``, sólo las esquinas triangulares de los cuadriláteros más cercanos a esos puntos siempre están enmascarados, otras esquinas triangulares que comprenden tres puntos sin enmascarar son contorneados como de costumbre.

source: **colors**
es_es: **colores**

source: color string or sequence of colors, optional
es_es: cadena de color o secuencia de colores, opcional

source: The colors of the levels, i.e. the lines for `.contour` and the areas for `.contourf`.
es_es: Los colores de los niveles, es decir, las líneas para `.contour` y las áreas para `.contourf`.

source: The sequence is cycled for the levels in ascending order. If the sequence is shorter than the number of levels, it's repeated.
es_es: La secuencia es ciclada para los niveles en orden ascendente. Si la secuencia es más corta que el número de niveles, se repite.

source: As a shortcut, single color strings may be used in place of one-element lists, i.e. ``'red'`` instead of ``['red']`` to color all levels with the same color. This shortcut does only work for color strings, not for other ways of specifying colors.
es_es: Como un acceso directo, se pueden utilizar cadenas de color simples en lugar de listas de un elemento, i. . ``'red'`` en lugar de ``['red']`` para colorear todos los niveles con el mismo color. Este acceso directo sólo funciona para cadenas de color, no para otras formas de especificar colores.

source: By default (value *None*), the colormap specified by *cmap* will be used.
es_es: Por defecto (valor *Ninguno*), se utilizará el mapa de colores especificado por *cmap*.

source: **alpha**
es_es: **alfa**

source: The alpha blending value, between 0 (transparent) and 1 (opaque).
es_es: El valor de mezcla alfa, entre 0 (transparente) y 1 (opaco).

source: **cmap** : str or `.Colormap`, default: :rc:`image.cmap`
es_es: **cmap** : str o `.Colormap`, por defecto: :rc:`image.cmap`

source: str or
es_es: str o

source: A `.Colormap` instance or registered colormap name. The colormap maps the level values to colors.
es_es: Una instancia `.Colormap` o nombre de mapa de colores registrado. El mapa de colores asigna los valores de nivel a colores.

source: If both *colors* and *cmap* are given, an error is raised.
es_es: Si ambos *colores* y *cmap* son dados, un error es levantado.

source: **norm** : `~matplotlib.colors.Normalize`, optional
es_es: **norma** : `~matplotlib.colors.Normalize`, opcional

source: Normalize, optional
es_es: Normalizar, opcional

source: If a colormap is used, the `.Normalize` instance scales the level values to the canonical colormap range [0, 1] for mapping to colors. If not given, the default linear scaling is used.
es_es: Si se utiliza un mapa de colores, la instancia `.Normalize` escala los valores de nivel al rango de mapa de colores canónico [0, 1] para mapear a colores. Si no se proporciona, se utiliza el escalado lineal predeterminado.

source: float, optional
es_es: float, opcional

source: If not *None*, either or both of these values will be supplied to the `.Normalize` instance, overriding the default color scaling based on *levels*.
es_es: Si no es *nunca*, cualquiera o ambos valores serán suministrados a la instancia `.Normalize`, sobreescribiendo la escala de color predeterminada basada en *niveles*.

source: **origin** : {*None*, 'upper', 'lower', 'image'}, default: None
es_es: **origin** : {*Ninguno*, 'arriba', 'lower', 'image'}, por defecto: Ninguno

source: Determines the orientation and exact position of *Z* by specifying the position of ``Z[0, 0]``. This is only relevant, if *X*, *Y* are not given.
es_es: Determina la orientación y posición exacta de *Z* especificando la posición de ``Z[0, 0]``. Esto sólo es relevante, si *X*, *Y* no son dados.

source: *None*: ``Z[0, 0]`` is at X=0, Y=0 in the lower left corner.
es_es: *Ninguno*: ``Z[0, 0]`` está en X=0, Y=0 en la esquina inferior izquierda.

source: 'lower': ``Z[0, 0]`` is at X=0.5, Y=0.5 in the lower left corner.
es_es: 'lower': ``Z[0, 0]`` está en X=0.5, Y=0.5 en la esquina inferior izquierda.

source: 'upper': ``Z[0, 0]`` is at X=N+0.5, Y=0.5 in the upper left corner.
es_es: 'upper': ``Z[0, 0]`` está en X=N+0.5, Y=0.5 en la esquina superior izquierda.

source: 'image': Use the value from :rc:`image.origin`.
es_es: 'image': Utilice el valor de :rc:`image.origin`.

source: **extent**
es_es: **extensión**

source: (x0, x1, y0, y1), optional
es_es: (x0, x1, y0, y1), opcional

source: If *origin* is not *None*, then *extent* is interpreted as in `.imshow`: it gives the outer pixel boundaries. In this case, the position of Z[0, 0] is the center of the pixel, not a corner. If *origin* is *None*, then (*x0*, *y0*) is the position of Z[0, 0], and (*x1*, *y1*) is the position of Z[-1, -1].
es_es: Si *origin* no es *nunca*, entonces *extent* es interpretado como en `.imshow`: da los límites de píxeles externos. En este caso, la posición de Z[0, 0] es el centro del píxel, no una esquina. Si *origen* es *nunca*, entonces (*x0*, *y0*) es la posición de Z[0, 0], y (*x1*, *y1*) es la posición de Z[-1, -1].

source: This argument is ignored if *X* and *Y* are specified in the call to contour.
es_es: Este argumento es ignorado si *X* y *Y* son especificados en la llamada al contorno.

source: **locator**
es_es: **localizador**

source: ticker.Locator subclass, optional
es_es: ticker.Subclase localizador, opcional

source: The locator is used to determine the contour levels if they are not given explicitly via *levels*. Defaults to `~.ticker.MaxNLocator`.
es_es: El localizador se utiliza para determinar los niveles de contorno si no se dan explícitamente a través de *niveles*. Por defecto es `~.ticker.MaxNLocator`.

source: **extend**
es_es: **extensión**

source: {'neither', 'both', 'min', 'max'}, default: 'neither'
es_es: {'ninguno de los dos', 'ambos', 'min', 'max'}, por defecto: 'ninguno'

source: Determines the ``contourf``-coloring of values that are outside the *levels* range.
es_es: Determina el ``contorno``-coloración de valores que están fuera del rango *niveles*.

source: If 'neither', values outside the *levels* range are not colored. If 'min', 'max' or 'both', color the values below, above or below and above the *levels* range.
es_es: Si 'ninguno', los valores fuera del rango *niveles* no están colorados. Si 'min', 'max' o 'ambos', colorear los valores debajo, arriba o abajo y encima del rango *levels*.

source: Values below ``min(levels)`` and above ``max(levels)`` are mapped to the under/over values of the `.Colormap`. Note that most colormaps do not have dedicated colors for these by default, so that the over and under values are the edge values of the colormap. You may want to set these values explicitly using `.Colormap.set_under` and `.Colormap.set_over`.
es_es: Valores por debajo de ``min(levels)`` y por encima de ``max(levels)`` se asignan a los valores bajo / superior del `.Colormap`. Tenga en cuenta que la mayoría de mapas de colores no tienen colores dedicados para estos de forma predeterminada, para que los valores superiores y inferiores sean los valores de borde del mapa de color. Puede querer establecer estos valores explícitamente usando `.Colormap.set_under` y `.Colormap.set_over`.

source: An existing `.QuadContourSet` does not get notified if properties of its colormap are changed. Therefore, an explicit call `.QuadContourSet.changed()` is needed after modifying the colormap. The explicit call can be left out, if a colorbar is assigned to the `.QuadContourSet` because it internally calls `.QuadContourSet.changed()`.
es_es: Un `.QuadContourSet` existente no es notificado si las propiedades de su mapa de colores son cambiadas. Por lo tanto, se necesita una llamada explícita `.QuadContourSet.changed()` después de modificar el mapa de color. La llamada explícita puede dejarse afuera, si una barra de colores es asignada al `.QuadContourSet` porque internamente llama `.QuadContourSet.changed()`.

source: Example::
es_es: Ejemplo::

source: registered units, optional
es_es: unidades registradas, opcional

source: Override axis units by specifying an instance of a :class:`matplotlib.units.ConversionInterface`.
es_es: Anular unidades de ejes especificando una instancia de un :class:`matplotlib.units.ConversionInterface`.

source: **antialiased**
es_es: **antialias**

source: Enable antialiasing, overriding the defaults. For filled contours, the default is *True*. For line contours, it is taken from :rc:`lines.antialiased`.
es_es: Habilitar antialiasing, sobreescribiendo los valores predeterminados. Para los contornos rellenados, el valor predeterminado es *Verdadero*. Para contornos de línea, se toma de :rc:`lines.antialiased`.

source: int >= 0, optional
es_es: int >= 0, opcional

source: If 0, no subdivision of the domain. Specify a positive integer to divide the domain into subdomains of *nchunk* by *nchunk* quads. Chunking reduces the maximum length of polygons generated by the contouring algorithm which reduces the rendering workload passed on to the backend and also requires slightly less RAM. It can however introduce rendering artifacts at chunk boundaries depending on the backend, the *antialiased* flag and value of *alpha*.
es_es: Si 0, no hay subdivisión del dominio. Especifique un entero positivo para dividir el dominio en subdominios de *nchunk* por cuadriláteros *nchunk*. La talla reduce la longitud máxima de los polígonos generados por el algoritmo de contornado que reduce la carga de trabajo de renderizado que pasa al backend y también requiere un poco menos de RAM. Sin embargo, puede introducir artefactos renderizadores en los límites de trozos dependiendo del backend, la bandera *antialiased* y el valor de *alpha*.

source: **linewidths** : float or array-like, default: :rc:`contour.linewidth`
es_es: **anchos de línea** : float o array-like default: :rc:`contour.linewidth`

source: *Only applies to* `.contour`.
es_es: *Sólo aplica a* `.contour`.

source: The line width of the contour lines.
es_es: El ancho de la línea de las líneas de contorno.

source: If a number, all levels will be plotted with this linewidth.
es_es: Si un número, todos los niveles serán trazados con este ancho de línea.

source: If a sequence, the levels in ascending order will be plotted with the linewidths in the order specified.
es_es: Si una secuencia, los niveles en orden ascendente se trazarán con el ancho de línea en el orden especificado.

source: If None, this falls back to :rc:`lines.linewidth`.
es_es: Si no, esto cae a :rc:`lines.linewidth`.

source: **linestyles** : {*None*, 'solid', 'dashed', 'dashdot', 'dotted'}, optional
es_es: **linestyles** : {*outer*, 'sólid', 'dashdot', 'dotted'}, opcional

source: If *linestyles* is *None*, the default is 'solid' unless the lines are monochrome. In that case, negative contours will take their linestyle from :rc:`contour.negative_linestyle` setting.
es_es: Si *linestyles* es *Ninguno*, el valor por defecto es 'sólid' a menos que las líneas sean monocromáticas. En ese caso, los contornos negativos tomarán su estilo de línea del ajuste :rc:`contour.negative_linestyle`.

source: *linestyles* can also be an iterable of the above strings specifying a set of linestyles to be used. If this iterable is shorter than the number of contour levels it will be repeated as necessary.
es_es: *linestyles* también puede ser un iterable de las cadenas anteriores especificando un conjunto de estilos de línea a utilizar. Si este iterable es menor que el número de niveles de contorno se repetirá según sea necesario.

source: **hatches**
es_es: **sombras**

source: list[str], optional
es_es: lista[str], opcional

source: *Only applies to* `.contourf`.
es_es: *Sólo aplica a* `.contourf`.

source: A list of cross hatch patterns to use on the filled areas. If None, no hatching will be added to the contour. Hatching is supported in the PostScript, PDF, SVG and Agg backends only.
es_es: Una lista de patrones de cobertizo cruzado para usar en las áreas llenadas. Si Ninguna, no se añadirá ninguna eclosión al contorno. El incubamiento sólo se admite en los backends de PostScript, PDF, SVG y Agg.

source: If given, all parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception).
es_es: Si se dan, todos los parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción).

source: `.contourf` differs from the MATLAB version in that it does not draw the polygon edges. To draw edges, add line contours with calls to `.contour`.
es_es: `.contourf` difiere de la versión MATLAB en que no dibuja los bordes del polígono. Para dibujar los bordes, añade contornos de línea con llamadas a `.contour`.

source: `.contourf` fills intervals that are closed at the top; that is, for boundaries *z1* and *z2*, the filled region is::
es_es: `.contourf` rellena los intervalos que están cerrados en la parte superior; es decir, para los límites *z1* y *z2*, la región llena es::

source: except for the lowest interval, which is closed on both sides (i.e. it includes the lowest value).
es_es: excepto para el intervalo más bajo, que se cierra por ambos lados (es decir, incluye el valor más bajo).

source: `.contour` and `.contourf` use a `marching squares <https://en.wikipedia.org/wiki/Marching_squares>`_ algorithm to compute contour locations. More information can be found in the source ``src/_contour.h``.
es_es: `.contour` y `.contourf` usan un algoritmo `marching squares <https://en.wikipedia.org/wiki/Marching_squares>`_ para calcular las ubicaciones del contorno. Puede encontrar más información en la fuente ``src/_contour.h``.

source: Examples using ``matplotlib.axes.Axes.contourf``
es_es: Ejemplos usando ``matplotlib.axes.Axes.contourf``

source: 3D box surface plot
es_es: Gráfico de la superficie de la caja 3D
