Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.lines.Line2D.po
Languages: es_es

source: A line - the line can have both a solid linestyle connecting all the vertices, and a marker at each vertex. Additionally, the drawing of the solid line is influenced by the drawstyle, e.g., one can create "stepped" lines in various styles.
es_es: Una línea - la línea puede tener tanto un estilo de línea sólido que conecta todos los vértices, como un marcador en cada vértice. Adicionalmente, el dibujo de la línea sólida está influenciado por el estilo de dibujo, por ejemplo, se pueden crear líneas "escalonadas" en varios estilos.

source: Create a `.Line2D` instance with *x* and *y* data in sequences of *xdata*, *ydata*.
es_es: Crea una instancia `.Line2D` con datos *x* y *y* en secuencias de *xdata*, *ydata*.

source: Additional keyword arguments are `.Line2D` properties:
es_es: Argumentos adicionales de palabras clave son propiedades `.Line2D`:

source: Property
es_es: Propiedad

source: Description
es_es: Descripción

source: a filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array
es_es: una función de filtro, que toma un arreglo de puntos flotantes (m, n, 3) y un valor de dpi, y devuelve un arreglo (m, n, 3)

source: scalar or None
es_es: escalar o None

source: :meth:`antialiased <matplotlib.lines.Line2D.set_antialiased>` or aa
es_es: :meth:`antialias <matplotlib.lines.Line2D.set_antialiased>` o aa

source: Patch or (Path, Transform) or None
es_es: Patch o (Path, Transform) o None

source: `.CapStyle` or {'butt', 'projecting', 'round'}
es_es: `.CapStyle` o {'butt', 'projecting', 'round'}

source: `.JoinStyle` or {'miter', 'round', 'bevel'}
es_es: `.JoinStyle` o {'miter', 'round', 'bevel'}

source: :meth:`dashes <matplotlib.lines.Line2D.set_dashes>`
es_es: :meth:`guiones <matplotlib.lines.Line2D.set_dashes>`

source: sequence of floats (on/off ink in points) or (None, None)
es_es: secuencia de flotantes (tinta encendida/apagada en puntos) o (Ninguna, Ninguna)

source: (2, N) array or two 1D arrays
es_es: (2, N) array o dos matrices 1D

source: :meth:`drawstyle <matplotlib.lines.Line2D.set_drawstyle>` or ds
es_es: :meth:`estilo de dibujo <matplotlib.lines.Line2D.set_drawstyle>` o ds

source: {'full', 'left', 'right', 'bottom', 'top', 'none'}
es_es: {'full', 'left', 'right', 'bottom', 'top', 'ninguno '}

source: :meth:`linestyle <matplotlib.lines.Line2D.set_linestyle>` or ls
es_es: :meth:`linestyle <matplotlib.lines.Line2D.set_linestyle>` o ls

source: float
es_es: de punto flotante (float)

source: marker style string, `~.path.Path` or `~.markers.MarkerStyle`
es_es: marker style string, `~.path.Path` o `~.markers.MarkerStyle`

source: :meth:`markeredgecolor <matplotlib.lines.Line2D.set_markeredgecolor>` or mec
es_es: :meth:`markeredgecolor <matplotlib.lines.Line2D.set_markeredgecolor>` o mec

source: :meth:`markeredgewidth <matplotlib.lines.Line2D.set_markeredgewidth>` or mew
es_es: :meth:`markeredgewidth <matplotlib.lines.Line2D.set_markeredgewidth>` o mío

source: :meth:`markerfacecolor <matplotlib.lines.Line2D.set_markerfacecolor>` or mfc
es_es: :meth:`markerfacecolor <matplotlib.lines.Line2D.set_markerfacecolor>` o mfc

source: :meth:`markerfacecoloralt <matplotlib.lines.Line2D.set_markerfacecoloralt>` or mfcalt
es_es: :meth:`markerfacecoloralt <matplotlib.lines.Line2D.set_markerfacecoloralt>` o mfcalt

source: :meth:`markersize <matplotlib.lines.Line2D.set_markersize>` or ms
es_es: :meth:`tamaño de marcador <matplotlib.lines.Line2D.set_markersize>` o ms

source: None or int or (int, int) or slice or list[int] or float or (float, float) or list[bool]
es_es: Ninguno o int o (int, int) o rebanada o lista[int] o decimal o (float, float) o lista[bool]

source: float or callable[[Artist, Event], tuple[bool, dict]]
es_es: decimal o llamable[[Artista, Evento], tuple[bool, dict]]

source: unknown
es_es: desconocido

source: 1D array
es_es: Matriz 1D

source: See :meth:`set_linestyle` for a description of the line styles, :meth:`set_marker` for a description of the markers, and :meth:`set_drawstyle` for a description of the draw styles.
es_es: Vea :meth:`set_linestyle` para una descripción de los estilos de línea, :meth:`set_marker` para una descripción de los marcadores, y :meth:`set_drawstyle` para una descripción de los estilos de dibujo.

source: Test whether *mouseevent* occurred on the line.
es_es: Evalúa si *mouseevent* ocurrió en la línea.

source: An event is deemed to have occurred "on" the line if it is less than ``self.pickradius`` (default: 5 points) away from it. Use `~.Line2D.get_pickradius` or `~.Line2D.set_pickradius` to get or set the pick radius.
es_es: Se considera que un evento ha ocurrido "en" la línea si está a menos de ``self.pickradius`` (por defecto: 5 puntos) de distancia. Usa `~.Line2D.get_pickradius` o `~.Line2D.set_pickradius` para obtener o establecer el radio de selección.

source: Parameters
es_es: Parámetros

source: Returns
es_es: Devuelve

source: Whether any values are within the radius.
es_es: Si cualquier valor está dentro del radio.

source: A dictionary ``{'ind': pointlist}``, where *pointlist* is a list of points of the line that are within the pickradius around the event position.
es_es: Un diccionario ``{'ind': pointlist}``, donde *lista de puntos* es una lista de puntos de la recta que están dentro del radio de selección alrededor de la posición del evento.

source: TODO: sort returned indices by distance
es_es: TODO: ordenar los índices devueltos por distancia

source: Draw the Artist (and its children) using the given renderer.
es_es: Dibuja el Artist (y sus hijos) usando el renderizador dado.

source: This has no effect if the artist is not visible (`.Artist.get_visible` returns False).
es_es: Esto no tiene efecto si el artist no es visible (`.Artist.get_visible` devuelve False).

source: **renderer** : `.RendererBase` subclass.
es_es: **renderer** : `.RendererBase` subclase.

source: RendererBase subclass.
es_es: Subclase RendererBase.

source: This method is overridden in the Artist subclasses.
es_es: Este método se sobrescribe en las subclases de Artist.

source: Alias for `get_antialiased`.
es_es: Alias para `get_antialiased`.

source: Return whether antialiased rendering is used.
es_es: Devuelve si se utiliza un renderizado antialias.

source: Alias for `get_color`.
es_es: Alias para `get_color`.

source: Return the line color.
es_es: Devuelve el color de la línea.

source: See also `~.Line2D.set_color`.
es_es: Vea también `~.Line2D.set_color`.

source: Return the `.CapStyle` for dashed lines.
es_es: Devuelve el `.CapStyle` para líneas discontinuas.

source: See also `~.Line2D.set_dash_capstyle`.
es_es: Vea también `~.Line2D.set_dash_capstyle`.

source: Return the `.JoinStyle` for dashed lines.
es_es: Devuelve el `.JoinStyle` para líneas discontinuas.

source: See also `~.Line2D.set_dash_joinstyle`.
es_es: Vea también `~.Line2D.set_dash_joinstyle`.

source: Return the line data as an ``(xdata, ydata)`` pair.
es_es: Devuelve los datos de línea como un par ``(xdata, ydata)``.

source: If *orig* is *True*, return the original data.
es_es: Si *origen* es *True*, devuelve los datos originales.

source: Return the drawstyle.
es_es: Devuelve el estilo dibujado.

source: See also `~.Line2D.set_drawstyle`.
es_es: Vea también `~.Line2D.set_drawstyle`.

source: Alias for `get_drawstyle`.
es_es: Alias para `get_drawstyle`.

source: Return the marker fill style.
es_es: Devuelve el estilo de relleno del marcador.

source: See also `~.Line2D.set_fillstyle`.
es_es: Vea también `~.Line2D.set_fillstyle`.

source: Return the linestyle.
es_es: Devuelve el estilo de línea.

source: See also `~.Line2D.set_linestyle`.
es_es: Vea también `~.Line2D.set_linestyle`.

source: Return the linewidth in points.
es_es: Devuelve el ancho de línea en puntos.

source: See also `~.Line2D.set_linewidth`.
es_es: Vea también `~.Line2D.set_linewidth`.

source: Alias for `get_linestyle`.
es_es: Alias para `get_linestyle`.

source: Alias for `get_linewidth`.
es_es: Alias para `get_linewidth`.

source: Return the line marker.
es_es: Devuelve el marcador de línea.

source: See also `~.Line2D.set_marker`.
es_es: Vea también `~.Line2D.set_marker`.

source: Return the marker edge color.
es_es: Devuelve el color del borde del marcador.

source: See also `~.Line2D.set_markeredgecolor`.
es_es: Vea también `~.Line2D.set_markeredgecolor`.

source: Return the marker edge width in points.
es_es: Devuelve el ancho del borde del marcador en puntos.

source: See also `~.Line2D.set_markeredgewidth`.
es_es: Vea también `~.Line2D.set_markeredgewidth`.

source: Return the marker face color.
es_es: Devuelve el color de la cara del marcador.

source: See also `~.Line2D.set_markerfacecolor`.
es_es: Vea también `~.Line2D.set_markerfacecolor`.

source: Return the alternate marker face color.
es_es: Devuelve el color alternativo de la cara del marcador.

source: See also `~.Line2D.set_markerfacecoloralt`.
es_es: Vea también `~.Line2D.set_markerfacecoloralt`.

source: Return the marker size in points.
es_es: Devuelve el tamaño del marcador en puntos.

source: See also `~.Line2D.set_markersize`.
es_es: Vea también `~.Line2D.set_markersize`.

source: Return the markevery setting for marker subsampling.
es_es: Devuelve la configuración de cada marcador para el submuestreo de marcadores.

source: See also `~.Line2D.set_markevery`.
es_es: Vea también `~.Line2D.set_markevery`.

source: Alias for `get_markeredgecolor`.
es_es: Alias para `get_markeredgecolor`.

source: Alias for `get_markeredgewidth`.
es_es: Alias para `get_markeredgewidth`.

source: Alias for `get_markerfacecolor`.
es_es: Alias para `get_markerfacecolor`.

source: Alias for `get_markerfacecoloralt`.
es_es: Alias para `get_markerfacecoloralt`.

source: Alias for `get_markersize`.
es_es: Alias para `get_markersize`.

source: Return the `~matplotlib.path.Path` associated with this line.
es_es: Devuelve el `~matplotlib.path.Path` asociado con esta línea.

source: Return the pick radius used for containment tests.
es_es: Devuelve el radio de selección usado para las pruebas de contención.

source: See `.contains` for more details.
es_es: Vea `.contains` para más detalles.

source: Return the `.CapStyle` for solid lines.
es_es: Devuelve el `.CapStyle` para líneas sólidas.

source: See also `~.Line2D.set_solid_capstyle`.
es_es: Vea también `~.Line2D.set_solid_capstyle`.

source: Return the `.JoinStyle` for solid lines.
es_es: Devuelve el `.JoinStyle` para líneas sólidas.

source: See also `~.Line2D.set_solid_joinstyle`.
es_es: Vea también `~.Line2D.set_solid_joinstyle`.

source: Get the artist's bounding box in display space.
es_es: Obtenga la caja delimitadora del artist en el espacio de visualización.

source: The bounding box' width and height are nonnegative.
es_es: La anchura y la altura de la caja delimitadora son no negativas.

source: Subclasses should override for inclusion in the bounding box "tight" calculation. Default is to return an empty bounding box at 0, 0.
es_es: Las subclases deben anularlo para incluirlo en el cálculo de la caja delimitadora "ajustada". Por defecto devuelve una caja delimitadora vacía en 0, 0.

source: Be careful when using this function, the results will not update if the artist window extent of the artist changes. The extent can change due to any changes in the transform stack, such as changing the axes limits, the figure size, or the canvas used (as is done when saving a figure). This can lead to unexpected behavior where interactive figures will look fine on the screen, but will save incorrectly.
es_es: Ten cuidado cuando uses esta función, los resultados no se actualizarán si la extensión de la ventana del artist cambia. La extensión puede cambiar debido a cualquier cambio en la pila de transformaciones, como cambiar los límites de los ejes, el tamaño de la figura o el lienzo utilizado (como se hace al guardar una figura). Esto puede llevar a un comportamiento inesperado donde las figuras interactivas se verán bien en la pantalla, pero se guardarán incorrectamente.

source: Return the xdata.
es_es: Devuelve el xdata.

source: If *orig* is *True*, return the original data, else the processed data.
es_es: Si *origen* es *True*, devuelve los datos originales, sino los datos procesados.

source: Return the *xy* data as a Nx2 numpy array.
es_es: Devuelve los datos *xy* como un arreglo numpy Nx2.

source: Return the ydata.
es_es: Devuelve los ydata.

source: Return whether line has a dashed linestyle.
es_es: Devuelve si la línea tiene un estilo de línea de guiones.

source: A custom linestyle is assumed to be dashed, we do not inspect the ``onoffseq`` directly.
es_es: Se asume que un estilo de línea personalizado se desvanece, no inspeccionamos el ``onoffseq`` directamente.

source: Set multiple properties at once.
es_es: Establece varias propiedades a la vez.

source: Supported properties are
es_es: Las propiedades admitidas son

source: :meth:`antialiased <matplotlib.lines.Line2D.set_antialiased>`
es_es: :meth:`antialias <matplotlib.lines.Line2D.set_antialiased>`

source: :meth:`drawstyle <matplotlib.lines.Line2D.set_drawstyle>`
es_es: :meth:`estilo de dibujo <matplotlib.lines.Line2D.set_drawstyle>`

source: :meth:`markeredgecolor <matplotlib.lines.Line2D.set_markeredgecolor>`
es_es: :meth:`marcador <matplotlib.lines.Line2D.set_markeredgecolor>`

source: Alias for `set_antialiased`.
es_es: Alias para `set_antialiased`.

source: Set whether to use antialiased rendering.
es_es: Establece si quieres usar el procesado antialias.

source: Alias for `set_color`.
es_es: Alias para `set_color`.

source: Set the color of the line.
es_es: Establecer el color de la línea.

source: How to draw the end caps if the line is `~Line2D.is_dashed`.
es_es: Cómo dibujar los topes finales si la línea es `~Line2D.is_dashed`.

source: **s** : `.CapStyle` or {'butt', 'projecting', 'round'}
es_es: **s** : `.CapStyle` o {'butt', 'projecting', 'round'}

source: CapStyle or {'butt', 'projecting', 'round'}
es_es: CapEstilo o {'butt', 'projecting', 'round'}

source: How to join segments of the line if it `~Line2D.is_dashed`.
es_es: Cómo unirse a segmentos de la línea si `~Line2D.is_dashed`.

source: **s** : `.JoinStyle` or {'miter', 'round', 'bevel'}
es_es: **s** : `.JoinStyle` o {'miter', 'round', 'bevel'}

source: JoinStyle or {'miter', 'round', 'bevel'}
es_es: Estilo de registro o {'miter', 'round', 'bevel'}

source: Set the dash sequence.
es_es: Establecer la secuencia de guión.

source: The dash sequence is a sequence of floats of even length describing the length of dashes and spaces in points.
es_es: La secuencia de guiones es una secuencia de flotantes de longitud uniforme que describe la longitud de guiones y espacios en puntos.

source: For example, (5, 2, 1, 2) describes a sequence of 5 point and 1 point dashes separated by 2 point spaces.
es_es: Por ejemplo, (5, 2, 1, 2) describe una secuencia de 5 puntos y 1 puntos separados por 2 espacios.

source: If *seq* is empty or ``(None, None)``, the linestyle will be set to solid.
es_es: Si *seq* está vacío o ``(None, Ninguno)``, el estilo de línea se establecerá en sólido.

source: Set the x and y data.
es_es: Establecer los datos x e y.

source: Set the drawstyle of the plot.
es_es: Establecer el estilo de dibujo de la parcela.

source: The drawstyle determines how the points are connected.
es_es: El estilo de dibujo determina cómo se conectan los puntos.

source: **drawstyle**
es_es: **estilo de dibujo**

source: For 'default', the points are connected with straight lines.
es_es: Para 'default', los puntos están conectados con líneas rectas.

source: The steps variants connect the points with step-like lines, i.e. horizontal lines with vertical steps. They differ in the location of the step:
es_es: Las variantes de pasos conectan los puntos con líneas de escalones, es decir, líneas horizontales con pasos verticales. Difieren en la ubicación del paso:

source: 'steps-pre': The step is at the beginning of the line segment, i.e. the line will be at the y-value of point to the right.
es_es: 'steps-pre': El paso está al comienzo del segmento de línea, es decir, la línea estará en el valor y del punto a la derecha.

source: 'steps-mid': The step is halfway between the points.
es_es: 'steps-mid': El paso está a mitad de camino entre los puntos.

source: 'steps-post: The step is at the end of the line segment, i.e. the line will be at the y-value of the point to the left.
es_es: 'steps-post: El paso está al final del segmento de línea, es decir, la línea estará en el valor y-del punto a la izquierda.

source: 'steps' is equal to 'steps-pre' and is maintained for backward-compatibility.
es_es: "pasos" es igual a "steps-pre" y se mantiene para la compatibilidad hacia atrás.

source: For examples see :doc:`/gallery/lines_bars_and_markers/step_demo`.
es_es: Para ejemplos vea :doc:`/gallery/lines_bars_and_markers/step_demo`.

source: Alias for `set_drawstyle`.
es_es: Alias para `set_drawstyle`.

source: Set the marker fill style.
es_es: Establece el estilo de relleno del marcador.

source: Possible values:
es_es: Valores posibles:

source: 'full': Fill the whole marker with the *markerfacecolor*.
es_es: 'full': Llene todo el marcador con el *markerfacecolor*.

source: 'left', 'right', 'bottom', 'top': Fill the marker half at the given side with the *markerfacecolor*. The other half of the marker is filled with *markerfacecoloralt*.
es_es: 'izquierda', 'derecha', 'abajo', 'arriba': Llena la mitad del marcador en el lado dado con el *color marcado*. La otra mitad del marcador está llena de *color marcado*.

source: 'none': No filling.
es_es: 'Ninguno': No hay relleno.

source: For examples see :ref:`marker_fill_styles`.
es_es: Para ejemplos vea :ref:`marker_fill_styles`.

source: Set the linestyle of the line.
es_es: Establece el estilo de línea de la línea.

source: A string:
es_es: Una cadena:

source: linestyle
es_es: estilo de línea

source: description
es_es: descripción

source: ``'-'`` or ``'solid'``
es_es: ``'-'`` o ``'sólid'``

source: solid line
es_es: línea sólida

source: ``'--'`` or ``'dashed'``
es_es: ``'--'`` o ``'guionado'``

source: dashed line
es_es: línea de guiones

source: ``'-.'`` or ``'dashdot'``
es_es: ``'-.'`` o ``'dashdot'``

source: dash-dotted line
es_es: línea punteada en guión

source: ``':'`` or ``'dotted'``
es_es: ``':'`` o ``'dotted'``

source: dotted line
es_es: línea de puntos

source: ``'none'``, ``'None'``, ``' '``, or ``''``
es_es: ``'ninguno '``, ``'Ninguno'``, ``' '``, o ``''``

source: draw nothing
es_es: no dibujar

source: Alternatively a dash tuple of the following form can be provided::
es_es: Alternativamente se puede proporcionar una tupla de guión de la siguiente forma::

source: where ``onoffseq`` is an even length tuple of on and off ink in points. See also :meth:`set_dashes`.
es_es: donde ``onoffseq`` es una tupla de longitud uniforme de tinta encendida y apagada en puntos. Ver también :meth:`set_dashes`.

source: For examples see :doc:`/gallery/lines_bars_and_markers/linestyles`.
es_es: Para ejemplos vea :doc:`/gallery/lines_bars_and_markers/linestyles`.

source: Set the line width in points.
es_es: Establecer el ancho de la línea en puntos.

source: Line width, in points.
es_es: Ancho de línea, en puntos.

source: Alias for `set_linestyle`.
es_es: Alias para `set_linestyle`.

source: Alias for `set_linewidth`.
es_es: Alias para `set_linewidth`.

source: Set the line marker.
es_es: Establecer marcador de línea.

source: **marker** : marker style string, `~.path.Path` or `~.markers.MarkerStyle`
es_es: **marcador** : cadena de estilo marcador, `~.path.Path` o `~.markers.MarkerStyle`

source: marker style string,
es_es: cadena de estilo marcador,

source: See `~matplotlib.markers` for full description of possible arguments.
es_es: Vea `~matplotlib.markers` para una descripción completa de los posibles argumentos.

source: Set the marker edge color.
es_es: Establecer el color del borde del marcador.

source: Set the marker edge width in points.
es_es: Ajuste el ancho del borde del marcador en puntos.

source: Marker edge width, in points.
es_es: Ancho de borde marcador, en puntos.

source: Set the marker face color.
es_es: Establece el color de la cara del marcador.

source: Set the alternate marker face color.
es_es: Establece el color alternativo del marcador de cara.

source: Set the marker size in points.
es_es: Establecer el tamaño del marcador en puntos.

source: Marker size, in points.
es_es: Tamaño del marcador, en puntos.

source: Set the markevery property to subsample the plot when using markers.
es_es: Establezca la propiedad markevery para suplir la parcela al usar marcadores.

source: e.g., if ``every=5``, every 5-th marker will be plotted.
es_es: por ejemplo, si ``cada=5``, cada 5-décimo marcador será trazado.

source: **every**
es_es: **cada**

source: Which markers to plot.
es_es: Qué marcadores trazar.

source: ``every=None``: every point will be plotted.
es_es: ``cada=n``: cada punto será trazado.

source: ``every=N``: every N-th marker will be plotted starting with marker 0.
es_es: ``cada=N``: cada marcador N-th será trazado comenzando con el marcador 0.

source: ``every=(start, N)``: every N-th marker, starting at index *start*, will be plotted.
es_es: ``every=(start, N)``: cada marcador N-th, comenzando en índice *start*, será trazado.

source: ``every=slice(start, end, N)``: every N-th marker, starting at index *start*, up to but not including index *end*, will be plotted.
es_es: ``every=slice(start, end, N)``: cada marcador N-th, comenzando en el índice *start*, hasta que no incluya el índice *end*, se trazará.

source: ``every=[i, j, m, ...]``: only markers at the given indices will be plotted.
es_es: ``cada=[i, j, m, ...]``: sólo se trazarán los marcadores en los índices dados.

source: ``every=[True, False, True, ...]``: only positions that are True will be plotted. The list must have the same length as the data points.
es_es: ``cada=[Verdadero, False, Verdadero...]``: sólo las posiciones que son Verdaderas serán trazadas. La lista debe tener la misma longitud que los puntos de datos.

source: ``every=0.1``, (i.e. a float): markers will be spaced at approximately equal visual distances along the line; the distance along the line between markers is determined by multiplying the display-coordinate distance of the axes bounding-box diagonal by the value of *every*.
es_es: ``cada=0.1``, (i.e. un float): los marcadores se espaciarán a distancias visuales aproximadamente iguales a lo largo de la línea; la distancia a lo largo de la línea entre los marcadores se determina multiplicando la distancia de las coordenadas de visualización de los ejes que delimitan el valor de *cada*.

source: ``every=(0.5, 0.1)`` (i.e. a length-2 tuple of float): similar to ``every=0.1`` but the first marker will be offset along the line by 0.5 multiplied by the display-coordinate-diagonal-distance along the line.
es_es: ``every=(0.5, 0.1)`` (es decir, una tupla de longitud 2 de float): similar a ``every=0. `` pero el primer marcador será compensado a lo largo de la línea por 0.5 multiplicado por el display-coordinate-diagonal-distancia a lo largo de la línea.

source: For examples see :doc:`/gallery/lines_bars_and_markers/markevery_demo`.
es_es: Para ejemplos vea :doc:`/gallery/lines_bars_and_markers/markevery_demo`.
