Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.colors.to_rgba_array.po
Languages: es_es

source: Convert *c* to a (n, 4) array of RGBA colors.
es_es: Convierte *c* a un array (n, 4) de colores RGBA.

source: Parameters
es_es: Parámetros

source: Matplotlib color or array of colors
es_es: Color de Matplotlib o matriz de colores

source: If *c* is a masked array, an ndarray is returned with a (0, 0, 0, 0) row for each masked value or row in *c*.
es_es: Si *c* es una matriz enmascarada, se devuelve un ndarray con una fila (0, 0, 0, 0) para cada valor enmascarado o fila en *c*.

source: **alpha**
es_es: **alfa**

source: float or sequence of floats, optional
es_es: flotante o secuencia de flotantes, opcional

source: If *alpha* is given, force the alpha value of the returned RGBA tuple to *alpha*.
es_es: Si se da *alpha*, fuerza el valor alfa de la tupla RGBA devuelta a *alpha*.

source: If None, the alpha value from *c* is used. If *c* does not have an alpha channel, then alpha defaults to 1.
es_es: Si Ninguna, se utiliza el valor alfa de *c*. Si *c* no tiene un canal alfa, entonces el valor alfa es 1.

source: *alpha* is ignored for the color value ``"none"`` (case-insensitive), which always maps to ``(0, 0, 0, 0)``.
es_es: *alpha* es ignorado para el valor de color ``"None "`` (mayúsculas y minúsculas), que siempre se mapea a ``(0, 0, 0, 0)``.

source: If *alpha* is a sequence and *c* is a single color, *c* will be repeated to match the length of *alpha*.
es_es: Si *alpha* es una secuencia y *c* es un solo color, *c* se repetirá para que coincida con la longitud de *alpha*.

source: Returns
es_es: Devuelve

source: (n, 4) array of RGBA colors, where each channel (red, green, blue, alpha) can assume values between 0 and 1.
es_es: (n, 4) array de colores RGBA, donde cada canal (rojo, verde, azul, alfa) puede asumir valores entre 0 y 1.

source: Examples using ``matplotlib.colors.to_rgba_array``
es_es: Ejemplos usando ``matplotlib.colors.to_rgba_array``

source: Specifying Colors
es_es: Especificación de colores
