Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.patches.ConnectionStyle.po
Languages: es_es

source: `ConnectionStyle` is a container class which defines several connectionstyle classes, which is used to create a path between two points. These are mainly used with `FancyArrowPatch`.
es_es: `ConnectionStyle` es una clase contenedor que define varias clases de estilo de conexión, que se utiliza para crear una ruta entre dos puntos. Estos se utilizan principalmente con `FancyArrowPatch`.

source: A connectionstyle object can be either created as::
es_es: Un objeto de estilo de conexión puede ser creado como::

source: or::
es_es: o::

source: The following classes are defined
es_es: Las siguientes clases están definidas

source: Class
es_es: Clase

source: Name
es_es: Nombre

source: Angle3
es_es: Angulo3

source: Angle
es_es: Ángulo

source: angleA=90, angleB=0, rad=0.0
es_es: ánguloA=90, ánguloB=0, rad=0.0

source: Arc
es_es: Arco

source: angleA=0, angleB=0, armA=None, armB=None, rad=0.0
es_es: ánguloA=0, ánguloB=0, arma=Ninguno, armB=Ninguno, rad=0.0

source: Bar
es_es: Barra

source: armA=0.0, armB=0.0, fraction=0.3, angle=None
es_es: armA=0.0, armB=0.0, fracción=0.3, ángulo=Ninguno

source: An instance of any connection style class is an callable object, whose call signature is::
es_es: Una instancia de cualquier clase de estilo de conexión es un objeto llamable, cuya firma de llamada es::

source: and it returns a `.Path` instance. *posA* and *posB* are tuples of (x, y) coordinates of the two points to be connected. *patchA* (or *patchB*) is given, the returned path is clipped so that it start (or end) from the boundary of the patch. The path is further shrunk by *shrinkA* (or *shrinkB*) which is given in points.
es_es: y devuelve una instancia de `.Path`. *posA* y *posB* son tuples de (x, y) coordenadas de los dos puntos a conectar. *patchA* (o *patchB*) es dado, la ruta devuelta es recortada para que comience (o final) del límite del parche. La ruta está aún más reducida por *shrinkA* (o *shrinkB*) que se da en puntos.

source: Return the instance of the subclass with the given style name.
es_es: Devuelve la instancia de la subclase con el nombre de estilo dado.

source: Creates a piecewise continuous quadratic Bezier path between two points. The path has a one passing-through point placed at the intersecting point of two lines which cross the start and end point, and have a slope of angleA and angleB, respectively. The connecting edges are rounded with *rad*.
es_es: Crea una ruta Bézier continua en el sentido de las piezas, entre dos puntos. El camino tiene un punto de paso a través situado en el punto de intersección de dos líneas que cruzan el punto de inicio y el punto final, y tienen una pendiente de ángulo y ángulo, respectivamente. Los bordes de conexión se redondean con *rad*.

source: starting angle of the path
es_es: ángulo inicial de la ruta

source: ending angle of the path
es_es: ángulo final de la ruta

source: *rad*
es_es: *radón*

source: rounding radius of the edge
es_es: radio de redondeo del borde

source: Creates a simple quadratic Bezier curve between two points. The middle control points is placed at the intersecting point of two lines which cross the start and end point, and have a slope of angleA and angleB, respectively.
es_es: Crea una curva Bézier cuadrática simple entre dos puntos. Los puntos de control medio se colocan en el punto de intersección de dos líneas que cruzan el punto de inicio y el punto final, y tienen una pendiente de ángulo y ángulo, respectivamente.

source: Creates a piecewise continuous quadratic Bezier path between two points. The path can have two passing-through points, a point placed at the distance of armA and angle of angleA from point A, another point with respect to point B. The edges are rounded with *rad*.
es_es: Crea una ruta Bézier continua en el sentido de las piezas, entre dos puntos. La ruta puede tener dos puntos de paseo, un punto situado a la distancia de armadura y ángulo de ángulo desde el punto A, otro con respecto al punto B. Los bordes son redondeados con *rad*.

source: length of the starting arm
es_es: longitud del brazo inicial

source: *armB* :
es_es: *brazoB* :

source: length of the ending arm
es_es: longitud del brazo final

source: rounding radius of the edges
es_es: radio de redondeo de los bordes

source: Creates a simple quadratic Bezier curve between two points. The curve is created so that the middle control point (C1) is located at the same distance from the start (C0) and end points(C2) and the distance of the C1 to the line connecting C0-C2 is *rad* times the distance of C0-C2.
es_es: Crea una curva Bézier cuadrática simple entre dos puntos. La curva se crea para que el punto de control medio (C1) se encuentre a la misma distancia desde los puntos de inicio (C0) y final (C2) y la distancia de la C1 a la línea que conecta C0-C2 es *rad* veces la distancia de C0-C2.

source: curvature of the curve.
es_es: curvatura de la curva.

source: A line with *angle* between A and B with *armA* and *armB*. One of the arms is extended so that they are connected in a right angle. The length of armA is determined by (*armA* + *fraction* x AB distance). Same for armB.
es_es: Una línea con *ángulo* entre A y B con *armA* y *armB*. Uno de los brazos es extendido para que estén conectados en un ángulo correcto. La longitud de la armadura está determinada por (*armA* + *fracción* x distancia AB). Igual para arma.

source: Parameters
es_es: Parámetros

source: minimum length of armA
es_es: longitud mínima de armadura

source: **armB**
es_es: **brazo**

source: minimum length of armB
es_es: longitud mínima del brazo

source: **fraction**
es_es: **fracción **

source: a fraction of the distance between two points that will be added to armA and armB.
es_es: una fracción de la distancia entre dos puntos que se añadirán a armA y armB.

source: float or None
es_es: float o None

source: angle of the connecting line (if None, parallel to A and B)
es_es: ángulo de la línea de conexión (si Ninguno, paralelo a A y B)
