Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.rc_context.po
Languages: es_es

source: matplotlib.pyplot.rc\_context
es_es: contexto de matplotlib.pyplot.rc\_

source: Return a context manager for temporarily changing rcParams.
es_es: Devuelve un gestor de contexto para cambiar temporalmente rcParams.

source: Parameters
es_es: Parámetros

source: The rcParams to temporarily set.
es_es: Los rcParams que se establecerán temporalmente.

source: str or path-like
es_es: str o como ruta

source: A file with Matplotlib rc settings. If both *fname* and *rc* are given, settings from *rc* take precedence.
es_es: Un archivo con la configuración rc de Matplotlib. Si se dan *fname* y *rc*, la configuración de *rc* tiene precedencia.

source: Examples
es_es: Ejemplos

source: Passing explicit values via a dict::
es_es: Pasando valores explícitos a través de un diccionario::

source: Loading settings from a file::
es_es: Cargando ajustes desde un archivo::

source: Examples using ``matplotlib.pyplot.rc_context``
es_es: Ejemplos usando ``matplotlib.pyplot.rc_context``

source: Style sheets reference
es_es: Referencia de las hojas de estilo

source: Matplotlib logo
es_es: Logotipo de Matplotlib
