Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.vlines.po
Languages: es_es

source: Plot vertical lines at each *x* from *ymin* to *ymax*.
es_es: Trazar líneas verticales en cada *x* de *ymin* a *ymax*.

source: Parameters
es_es: Parámetros

source: float or array-like
es_es: flotante o matriz

source: x-indexes where to plot the lines.
es_es: x-índices donde trazar las líneas.

source: Respective beginning and end of each line. If scalars are provided, all lines will have same length.
es_es: El principio y el final ajustados de cada línea. Si se proporcionan escalares, todas las líneas tendrán la misma longitud.

source: **colors** : list of colors, default: :rc:`lines.color`
es_es: **colores** : lista de colores, por defecto: :rc:`lines.color`

source: list of colors, default:
es_es: lista de colores, por defecto:

source: {'solid', 'dashed', 'dashdot', 'dotted'}, optional
es_es: {'sólid', 'guionado', 'punto de guion', 'punto'}, opcional

source: **label**
es_es: **etiqueta**

source: Returns
es_es: Devuelve

source: Other Parameters
es_es: Otros Parámetros

source: If given, the following parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception):
es_es: Si se dan, los siguientes parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción):

source: *x*, *ymin*, *ymax*, *colors*
es_es: *x*, *ymin*, *ymax*, *colores*

source: **\*\*kwargs** : `~matplotlib.collections.LineCollection` properties.
es_es: **\*\*kwargs** : propiedades `~matplotlib.collections.LineCollection`.

source: LineCollection properties.
es_es: Propiedades de LineCollection.

source: horizontal lines
es_es: líneas horizontales

source: vertical line across the Axes
es_es: línea vertical a través de los ejes

source: Examples using ``matplotlib.axes.Axes.vlines``
es_es: Ejemplos usando ``matplotlib.axes.Axes.vlines``

source: Creating a timeline with lines, dates, and text
es_es: Creación de una línea de tiempo con líneas, fechas y texto

source: hlines and vlines
es_es: hlines y vlines

source: Violin plot customization
es_es: Personalizar el gráfico de violín
