Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.tick_params.po
Languages: es_es

source: Change the appearance of ticks, tick labels, and gridlines.
es_es: Cambia la apariencia de ticks, etiquetas de ticks y cuadrículas.

source: Tick properties that are not explicitly set using the keyword arguments remain unchanged unless *reset* is True.
es_es: Las propiedades de marca que no están explícitamente definidas usando los argumentos de la palabra clave permanecen sin cambios a menos que *reset* sea True.

source: Parameters
es_es: Parámetros

source: {'x', 'y', 'both'}, default: 'both'
es_es: {'x', 'y', 'both'}, por defecto: 'ambos'

source: The axis to which the parameters are applied.
es_es: El eje al que se aplican los parámetros.

source: **which**
es_es: **qué**

source: {'major', 'minor', 'both'}, default: 'major'
es_es: {'major', 'minor', 'both'}, por defecto: 'major'

source: The group of ticks to which the parameters are applied.
es_es: Grupo de ticks al que se aplican los parámetros.

source: bool, default: False
es_es: bool, por defecto: False

source: Whether to reset the ticks to defaults before updating them.
es_es: Si desea restablecer los ticks a los predeterminados antes de actualizarlos.

source: Other Parameters
es_es: Otros Parámetros

source: **direction**
es_es: **dirección**

source: Puts ticks inside the axes, outside the axes, or both.
es_es: Pon ticks dentro de los ejes, fuera de los ejes, o ambos.

source: Tick length in points.
es_es: Marcar longitud en puntos.

source: Tick width in points.
es_es: Marcar ancho en puntos.

source: Tick color.
es_es: Color de tecleo.

source: Distance in points between tick and label.
es_es: Distancia en puntos entre tick y etiqueta.

source: **labelsize**
es_es: **tamaño de etiqueta**

source: float or str
es_es: flotante o str

source: Tick label font size in points or as a string (e.g., 'large').
es_es: Etiqueta el tamaño de la fuente en puntos o como una cadena (por ejemplo, 'large').

source: **labelcolor**
es_es: **Etiqueta**

source: Tick label color.
es_es: Color de la etiqueta.

source: **colors**
es_es: **colores**

source: Tick color and label color.
es_es: Etiqueta color color y etiqueta.

source: Tick and label zorder.
es_es: Marcar y etiquetar zorder.

source: **bottom, top, left, right**
es_es: **abajo, arriba, izquierda, derecha**

source: Whether to draw the respective ticks.
es_es: Si se dibujan los ticks respectivos.

source: Whether to draw the respective tick labels.
es_es: Si dibujar las etiquetas de tick respectivas.

source: **labelrotation**
es_es: **rotación de etiquetas**

source: Tick label rotation
es_es: Rotación de la etiqueta

source: **grid_color**
es_es: **rejilla de color**

source: Gridline color.
es_es: Color de la cuadrícula.

source: **grid_alpha**
es_es: **rejilla alfa**

source: Transparency of gridlines: 0 (transparent) to 1 (opaque).
es_es: Transparencia de las líneas de rejilla: 0 (transparente) a 1 (opaque).

source: **grid_linewidth**
es_es: **ancho de cuadrícula**

source: Width of gridlines in points.
es_es: Ancho de líneas de cuadrícula en puntos.

source: **grid_linestyle**
es_es: **estilo de cuadrícula**

source: Any valid `.Line2D` line style spec.
es_es: Cualquier especificación de estilo de línea `.Line2D` válida.

source: Examples
es_es: Ejemplos

source: This will make all major ticks be red, pointing out of the box, and with dimensions 6 points by 2 points. Tick labels will also be red. Gridlines will be red and translucent.
es_es: Esto hará que todos los garrapatos principales sean rojos, señalando fuera de la caja, y con dimensiones de 6 puntos por 2 puntos. Las etiquetas de truco también serán rojas. Las cuadrículas serán rojas y traslúcidas.

source: Examples using ``matplotlib.pyplot.tick_params``
es_es: Ejemplos usando ``matplotlib.pyplot.tick_params``

source: Shared Axis
es_es: Eje compartido
