Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.inset_axes.po
Languages: es_es

source: Add a child inset Axes to this existing Axes.
es_es: Agrega un eje de entrada hijo a este eje existente.

source: Parameters
es_es: Parámetros

source: **bounds**
es_es: **Límites**

source: [x0, y0, width, height]
es_es: [x0, y0, ancho, altura]

source: Lower-left corner of inset Axes, and its width and height.
es_es: Esquina inferior izquierda de ejes de entrada, y su anchura y altura.

source: **transform** : `.Transform`
es_es: **transforma** : `.Transform`

source: Transform
es_es: Transformar

source: Defaults to `ax.transAxes`, i.e. the units of *rect* are in Axes-relative coordinates.
es_es: Por defecto es `ax.transAxes`, es decir, las unidades de *rect* están en coordenadas relativas a ejes.

source: number
es_es: número

source: Defaults to 5 (same as `.Axes.legend`). Adjust higher or lower to change whether it is above or below data plotted on the parent Axes.
es_es: Por defecto es 5 (al igual que `.Axes.legend`). Ajuste superior o inferior para cambiar si está por encima o por debajo de los datos trazados en los ejes padres.

source: Other keyword arguments are passed on to the child `.Axes`.
es_es: Otros argumentos de palabra clave se pasan al hijo `.Axes`.

source: Returns
es_es: Devuelve

source: ax
es_es: hl

source: The created `~.axes.Axes` instance.
es_es: La instancia creada `~.axes.Axes`.

source: This method is experimental as of 3.0, and the API may change.
es_es: Este método es experimental a partir de 3.0, y la API puede cambiar.

source: Examples
es_es: Ejemplos

source: This example makes two inset Axes, the first is in Axes-relative coordinates, and the second in data-coordinates::
es_es: Este ejemplo hace dos ejes de entrada, el primero es en coordenadas relativas a ejes, y el segundo en coordenadas-datos::

source: Examples using ``matplotlib.axes.Axes.inset_axes``
es_es: Ejemplos usando ``matplotlib.axes.Axes.inset_axes``

source: Scatter plot with histograms
es_es: Gráfico de dispersión con histogramas

source: Placing Colorbars
es_es: Colocación de las barras de color

source: Zoom region inset axes
es_es: Ejes de inserción de la región de zoom
