Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.hexbin.po
Languages: es_es

source: Make a 2D hexagonal binning plot of points *x*, *y*.
es_es: Crea una parcela 2D hutonal de puntos *x*, *y*.

source: If *C* is *None*, the value of the hexagon is determined by the number of points in the hexagon. Otherwise, *C* specifies values at the coordinate (x[i], y[i]). For each hexagon, these values are reduced using *reduce_C_function*.
es_es: Si *C* es *n*, el valor del hexágono es determinado por el número de puntos en el hexágono. De lo contrario, *C* especifica valores en la coordenada (x[i], y[i]). Para cada hexágono, estos valores se reducen usando *reduce_C_function*.

source: Parameters
es_es: Parámetros

source: The data positions. *x* and *y* must be of the same length.
es_es: Las posiciones de los datos. *x* y *y* deben tener la misma longitud.

source: array-like, optional
es_es: tipo arreglo, opcional

source: If given, these values are accumulated in the bins. Otherwise, every point has a value of 1. Must be of the same length as *x* and *y*.
es_es: Si es dado, estos valores se acumulan en las papeleras. De lo contrario, cada punto tiene un valor de 1. Debe ser de la misma longitud que *x* y *y*.

source: int or (int, int), default: 100
es_es: int o (int, int), predeterminado: 100

source: If a single int, the number of hexagons in the *x*-direction. The number of hexagons in the *y*-direction is chosen such that the hexagons are approximately regular.
es_es: Si un único int, el número de hexágonos en la dirección *x*. El número de hexágonos en la dirección *y* es elegido de tal manera que los hexágonos son aproximadamente regulares.

source: Alternatively, if a tuple (*nx*, *ny*), the number of hexagons in the *x*-direction and the *y*-direction.
es_es: Alternativamente, si una tupla (*nx*, *ny*), el número de hexágonos en la dirección *x* y la dirección *y*.

source: **bins**
es_es: **Papelas**

source: 'log' or int or sequence, default: None
es_es: 'log' o int o secuencia, por defecto: ninguno

source: Discretization of the hexagon values.
es_es: Discretización del hexágono de valores.

source: If *None*, no binning is applied; the color of each hexagon directly corresponds to its count value.
es_es: Si *nunca*, no se aplica ninguna binning; el color de cada hexágono corresponde directamente a su valor de contabilidad.

source: If 'log', use a logarithmic scale for the colormap. Internally, :math:`log_{10}(i+1)` is used to determine the hexagon color. This is equivalent to ``norm=LogNorm()``.
es_es: Si 'log', use una escala logarítmica para el mapa de colores. Internamente, :math:`log_{10}(i+1)` se utiliza para determinar el color del hexágono. Esto es equivalente a ``norm=LogNorm()``.

source: If an integer, divide the counts in the specified number of bins, and color the hexagons accordingly.
es_es: Si un entero, divida los recuentos en el número especificado de papeleras, y coloree los hexágonos en consecuencia.

source: If a sequence of values, the values of the lower bound of the bins to be used.
es_es: Si una secuencia de valores, los valores del borde inferior de los contenedores a utilizar.

source: {'linear', 'log'}, default: 'linear'
es_es: {'linear', 'log'}, por defecto: 'lineal'

source: Use a linear or log10 scale on the horizontal axis.
es_es: Utilice una escala lineal o log10 en el eje horizontal.

source: Use a linear or log10 scale on the vertical axis.
es_es: Utilice una escala lineal o log10 en el eje vertical.

source: **mincnt** : int > 0, default: *None*
es_es: **mincnt** : int > 0, por defecto: *Ninguno*

source: int > 0, default:
es_es: int > 0, por defecto:

source: If not *None*, only display cells with more than *mincnt* number of points in the cell.
es_es: Si no *nunca*, sólo muestra celdas con más de *mincnt* número de puntos en la celda.

source: **marginals** : bool, default: *False*
es_es: **marginales** : bool, por defecto: *Falso*

source: If marginals is *True*, plot the marginal density as colormapped rectangles along the bottom of the x-axis and left of the y-axis.
es_es: Si los márgenes son *Verdaderos*, grafica la densidad marginal como rectángulos mapeados de color a lo largo del eje x e izquierda del eje y-.

source: **extent** : 4-tuple of float, default: *None*
es_es: **extent** : 4-tupla de flotante, por defecto: *Ninguno*

source: 4-tuple of float, default:
es_es: 4-tupla de flotante, por defecto:

source: The limits of the bins (xmin, xmax, ymin, ymax). The default assigns the limits based on *gridsize*, *x*, *y*, *xscale* and *yscale*.
es_es: Los límites de los contenedores (xmin, xmax, ymin, ymax). El valor por defecto asigna los límites basados en *gridsize*, *x*, *y*, *xscale* y *yscale*.

source: If *xscale* or *yscale* is set to 'log', the limits are expected to be the exponent for a power of 10. E.g. for x-limits of 1 and 50 in 'linear' scale and y-limits of 10 and 1000 in 'log' scale, enter (1, 50, 1, 3).
es_es: Si *xscale* o *yscale* está establecido en 'log', se espera que los límites sean el exponente de una potencia de 10. para límites x de 1 y 50 en escala 'lineal' y límites y-limits de 10 y 1000 en escala 'log', introduzca (1, 50, 1, 3).

source: Returns
es_es: Devuelve

source: A `.PolyCollection` defining the hexagonal bins.
es_es: Una `.PolyCollection` que define las papeleras hexagonales.

source: `.PolyCollection.get_offsets` contains a Mx2 array containing the x, y positions of the M hexagon centers.
es_es: `.PolyCollection.get_offsets` contiene una matriz Mx2 que contiene las posiciones x, y del hexágono M centrales.

source: `.PolyCollection.get_array` contains the values of the M hexagons.
es_es: `.PolyCollection.get_array` contiene los valores de los hexágonos M.

source: If *marginals* is *True*, horizontal bar and vertical bar (both PolyCollections) will be attached to the return collection as attributes *hbar* and *vbar*.
es_es: Si *marginales* es *True*, la barra horizontal y vertical (ambas PolyCollections) se adjuntarán a la colección de retorno como atributos *hbar* y *vbar*.

source: Other Parameters
es_es: Otros Parámetros

source: **cmap** : str or `~matplotlib.colors.Colormap`, default: :rc:`image.cmap`
es_es: **cmap** : str o `~matplotlib.colors.Colormap`, por defecto: :rc:`image.cmap`

source: str or
es_es: str o

source: The Colormap instance or registered colormap name used to map the bin values to colors.
es_es: La instancia de Colormap o nombre de mapa de color registrado utilizado para asignar los valores de la papelera a colores.

source: **norm** : `~matplotlib.colors.Normalize`, optional
es_es: **norma** : `~matplotlib.colors.Normalize`, opcional

source: Normalize, optional
es_es: Normalizar, opcional

source: The Normalize instance scales the bin values to the canonical colormap range [0, 1] for mapping to colors. By default, the data range is mapped to the colorbar range using linear scaling.
es_es: La instancia Normalize escala los valores de la papelera al rango de mapa de color canónico [0, 1] para mapear a colores. De forma predeterminada, el rango de datos se asigna al rango de la barra de colores usando escalado lineal.

source: The colorbar range. If *None*, suitable min/max values are automatically chosen by the `.Normalize` instance (defaults to the respective min/max values of the bins in case of the default linear scaling). It is an error to use *vmin*/*vmax* when *norm* is given.
es_es: El rango de la barra de color. Si *nunca*, los valores mínimos / máximos adecuados son automáticamente elegidos por el `. instancia ormalize` (por defecto a los respectivos valores min/max de los contenedores en caso de la escala lineal predeterminada). Es un error usar *vmin*/*vmax* cuando se da *norma*.

source: **alpha**
es_es: **alfa**

source: float between 0 and 1, optional
es_es: flotante entre 0 y 1, opcional

source: The alpha blending value, between 0 (transparent) and 1 (opaque).
es_es: El valor de mezcla alfa, entre 0 (transparente) y 1 (opaco).

source: **linewidths** : float, default: *None*
es_es: **Anchos de línea** : flotante, por defecto: *nunca*

source: float, default:
es_es: flotante, por defecto:

source: If *None*, defaults to 1.0.
es_es: Si *Ninguno*, el valor predeterminado es 1.0.

source: **edgecolors** : {'face', 'none', *None*} or color, default: 'face'
es_es: **colores** : {'cara', 'ninguno', *Ninguno*} o color, por defecto: 'cara'

source: {'face', 'none',
es_es: {'cara', 'ninguno',

source: The color of the hexagon edges. Possible values are:
es_es: El color de los bordes del hexágono. Los valores posibles son:

source: 'face': Draw the edges in the same color as the fill color.
es_es: 'cara': Dibuja los bordes en el mismo color que el color de relleno.

source: 'none': No edges are drawn. This can sometimes lead to unsightly unpainted pixels between the hexagons.
es_es: 'Ninguno': No hay bordes dibujados. Esto a veces puede llevar a píxeles sin pintar entre los hexágonos.

source: *None*: Draw outlines in the default color.
es_es: *Ninguno*: Dibuja contornos en el color predeterminado.

source: An explicit color.
es_es: Un color explícito.

source: **reduce_C_function** : callable, default: `numpy.mean`
es_es: **reduce_C_function** : llamable, predeterminado: `numpy.mean`

source: callable, default:
es_es: llamable, predeterminado:

source: The function to aggregate *C* within the bins. It is ignored if *C* is not given. This must have the signature::
es_es: La función para añadir *C* dentro de las papeleras. Se ignora si *C* no es dado. Esto debe tener la firma::

source: Commonly used functions are:
es_es: Comúnmente las funciones usadas son:

source: `numpy.mean`: average of the points
es_es: `numpy.mean`: promedio de los puntos

source: `numpy.sum`: integral of the point values
es_es: `numpy.sum`: parte integral de los valores de puntos

source: `numpy.amax`: value taken from the largest point
es_es: `numpy.amax`: valor tomado desde el punto más grande

source: If given, the following parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception):
es_es: Si se dan, los siguientes parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción):

source: **\*\*kwargs** : `~matplotlib.collections.PolyCollection` properties
es_es: **\*\*kwargs** : propiedades `~matplotlib.collections.PolyCollection`

source: PolyCollection properties
es_es: Propiedades de PolyCollection

source: All other keyword arguments are passed on to `.PolyCollection`:
es_es: Todos los otros argumentos de palabra clave se pasan a `.PolyCollection`:

source: Property
es_es: Propiedad

source: Description
es_es: Descripción

source: a filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array
es_es: una función de filtro, que toma un arreglo de puntos flotantes (m, n, 3) y un valor de dpi, y devuelve un arreglo (m, n, 3)

source: array-like or scalar or None
es_es: como matriz o escalar o ninguno

source: :meth:`antialiased <matplotlib.collections.Collection.set_antialiased>` or aa or antialiaseds
es_es: :meth:`antialias <matplotlib.collections.Collection.set_antialiased>` o aa o antialiaseds

source: bool or list of bools
es_es: libro o lista de bools

source: array-like or None
es_es: tipo array o ninguno

source: `.CapStyle` or {'butt', 'projecting', 'round'}
es_es: `.CapStyle` o {'butt', 'projecting', 'round'}

source: (vmin: float, vmax: float)
es_es: (vmin: flotante, vmax: flotante)

source: Patch or (Path, Transform) or None
es_es: Patch o (Path, Transform) o None

source: `.Colormap` or str or None
es_es: `.Colormap` o str o ninguno

source: color or list of rgba tuples
es_es: color o lista de tubos rgba

source: :meth:`edgecolor <matplotlib.collections.Collection.set_edgecolor>` or ec or edgecolors
es_es: :meth:`edgecolor <matplotlib.collections.Collection.set_edgecolor>` o ec o aristas colores

source: color or list of colors or 'face'
es_es: color o lista de colores o 'cara'

source: :meth:`facecolor <matplotlib.collections.Collection.set_facecolor>` or facecolors or fc
es_es: :meth:`carecolor <matplotlib.collections.Collection.set_facecolor>` o colores de caras o fc

source: color or list of colors
es_es: color o lista de colores

source: :meth:`hatch <matplotlib.collections.Collection.set_hatch>`
es_es: :meth:`colgante <matplotlib.collections.Collection.set_hatch>`

source: `.JoinStyle` or {'miter', 'round', 'bevel'}
es_es: `.JoinStyle` o {'miter', 'round', 'bevel'}

source: :meth:`linestyle <matplotlib.collections.Collection.set_linestyle>` or dashes or linestyles or ls
es_es: :meth:`linestyle <matplotlib.collections.Collection.set_linestyle>` o guiones o estilos de línea o ls

source: str or tuple or list thereof
es_es: str o tuple o lista de ellos

source: :meth:`linewidth <matplotlib.collections.Collection.set_linewidth>` or linewidths or lw
es_es: :meth:`ancho de línea <matplotlib.collections.Collection.set_linewidth>o ancho de línea o lw

source: float or list of floats
es_es: flotante o lista de flotantes

source: `.Normalize` or None
es_es: `.normalize` o Ninguno

source: (N, 2) or (2,) array-like
es_es: ((N, 2) o (2,) array-like

source: :meth:`paths <matplotlib.collections.PolyCollection.set_verts>`
es_es: :meth:`rutas <matplotlib.collections.PolyCollection.set_verts>`

source: list of array-like
es_es: lista de matriz

source: None or bool or float or callable
es_es: None o bool o float o callable

source: float
es_es: de punto flotante (float)

source: :meth:`sizes <matplotlib.collections._CollectionWithSizes.set_sizes>`
es_es: :meth:`tamaños <matplotlib.collections._CollectionWithSizes.set_sizes>`

source: ndarray or None
es_es: ndarray o ninguno

source: list of str or None
es_es: lista de str o ninguno

source: unknown
es_es: desconocido

source: :obj:`hist2d`
es_es: :obj:`Cadena2d`

source: 2D histogram rectangular bins
es_es: Contenedores rectangulares del histograma 2D

source: Examples using ``matplotlib.axes.Axes.hexbin``
es_es: Ejemplos usando ``matplotlib.axes.Axes.hexbin``

source: Hexagonal binned plot
es_es: Gráfico hexagonal de la bandeja de entrada
