Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axis.Axis.set_ticklabels.po
Languages: es_es

source: matplotlib.axis.Axis.set\_ticklabels
es_es: etiquetas matplotlib.axis.Axis.set\_ticklabels

source: Set the text values of the tick labels.
es_es: Establece los valores de texto de las etiquetas de tick.

source: Discouraged
es_es: Desanimado

source: The use of this method is discouraged, because of the dependency on tick positions. In most cases, you'll want to use ``set_[x/y]ticks(positions, labels)`` instead.
es_es: El uso de este método está desaconsejado, debido a la dependencia de las posiciones de tick. En la mayoría de los casos, querrá usar ``set_[x/y]ticks(positions, labels)`` en su lugar.

source: If you are using this method, you should always fix the tick positions before, e.g. by using `.Axis.set_ticks` or by explicitly setting a `~.ticker.FixedLocator`. Otherwise, ticks are free to move and the labels may end up in unexpected positions.
es_es: Si estás usando este método, siempre deberías arreglar las posiciones de tick antes, por ejemplo, usando `.Axis.set_ticks` o estableciendo explícitamente un `~. icker.FixedLocator`. De lo contrario, los ticks son libres de moverse y las etiquetas pueden terminar en posiciones inesperadas.

source: Parameters
es_es: Parámetros

source: **ticklabels** : sequence of str or of `.Text`\s
es_es: **ticklabels** : secuencia de str o de `.Text`\s

source: sequence of str or of
es_es: secuencia de str o de

source: Texts for labeling each tick location in the sequence set by `.Axis.set_ticks`; the number of labels must match the number of locations.
es_es: Textos para etiquetar la ubicación de cada tick en la secuencia establecida por `.Axis.set_ticks`; el número de etiquetas debe coincidir con el número de ubicaciones.

source: If True, set minor ticks instead of major ticks.
es_es: Si es verdad, establezca ticks menores en lugar de ticks mayores.

source: Text properties.
es_es: Propiedades de texto.

source: Returns
es_es: Devuelve

source: list of `.Text`\s
es_es: lista de `.Text`\s

source: For each tick, includes ``tick.label1`` if it is visible, then ``tick.label2`` if it is visible, in that order.
es_es: Para cada tick, incluye ``tick.label1`` si es visible, entonces ``tick.label2`` si es visible, en ese orden.
