Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.colors.LightSource.po
Languages: es_es

source: Create a light source coming from the specified azimuth and elevation. Angles are in degrees, with the azimuth measured clockwise from north and elevation up from the zero plane of the surface.
es_es: Crea una fuente de luz proveniente del azimut y la elevación especificados. Los ángulos son en grados, con el azimut medido en sentido de las agujas del norte y la elevación desde el plano cero de la superficie.

source: `shade` is used to produce "shaded" rgb values for a data array. `shade_rgb` can be used to combine an rgb image with an elevation map. `hillshade` produces an illumination map of a surface.
es_es: `shade` se usa para producir valores rgb "sombreados" para un array de datos. `shade_rgb` puede usarse para combinar una imagen rgb con un mapa de elevación. `hillshade` produce un mapa de iluminación de una superficie.

source: Specify the azimuth (measured clockwise from south) and altitude (measured up from the plane of the surface) of the light source in degrees.
es_es: Especifique el azimut (hacia el sur en sentido de las agujas del reloj) y la altitud (medida desde el plano de la superficie) de la fuente de luz en grados.

source: Parameters
es_es: Parámetros

source: float, default: 315 degrees (from the northwest)
es_es: flotante, por defecto: 315 grados (desde el noroeste)

source: The azimuth (0-360, degrees clockwise from North) of the light source.
es_es: El azimut (0-360, grados en sentido de las agujas del norte) de la fuente de luz.

source: float, default: 45 degrees
es_es: flotante, por defecto: 45 grados

source: The altitude (0-90, degrees up from horizontal) of the light source.
es_es: La altitud (0-90, grados arriba de horizontal) de la fuente de luz.

source: For backwards compatibility, the parameters *hsv_min_val*, *hsv_max_val*, *hsv_min_sat*, and *hsv_max_sat* may be supplied at initialization as well. However, these parameters will only be used if "blend_mode='hsv'" is passed into `shade` or `shade_rgb`. See the documentation for `blend_hsv` for more details.
es_es: Para compatibilidad con versiones anteriores, los parámetros *hsv_min_val*, *hsv_max_val*, *hsv_min_sat*, y *hsv_max_sat* pueden ser suministrados también en la inicialización. Sin embargo, estos parámetros sólo se utilizarán si "blend_mode='hsv'" se pasa a `shade` o `shade_rgb`. Consulte la documentación para `blend_hsv` para más detalles.

source: Take the input data array, convert to HSV values in the given colormap, then adjust those color values to give the impression of a shaded relief map with a specified light source. RGBA values are returned, which can then be used to plot the shaded image with imshow.
es_es: Tomar el array de datos de entrada, convertir a valores HSV en el mapa de color dado, luego ajuste esos valores de color para dar la impresión de un mapa de relieve sombreado con una fuente de luz especificada. Los valores RGBA son devueltos, que pueden ser usados para dibujar la imagen sombreada con imshow.

source: The color of the resulting image will be darkened by moving the (s, v) values (in hsv colorspace) toward (hsv_min_sat, hsv_min_val) in the shaded regions, or lightened by sliding (s, v) toward (hsv_max_sat, hsv_max_val) in regions that are illuminated. The default extremes are chose so that completely shaded points are nearly black (s = 1, v = 0) and completely illuminated points are nearly white (s = 0, v = 1).
es_es: El color de la imagen resultante se oscurecerá moviendo los valores (s, v) (en espacio de color hsv) hacia (hsv_min_sat, hsv_min_val) en las regiones sombreadas, o aligerado deslizando (s, v) hacia (hsv_max_sat, hsv_max_val) en las regiones que son iluminadas. Los extremos por defecto son elegidos para que los puntos completamente sombreados sean casi negros (s = 1, v = 0) y los puntos completamente iluminados son casi blancos (s = 0, v = 1).

source: An MxNx3 RGB array of floats ranging from 0 to 1 (color image).
es_es: Una matriz RGB MxNx3 de flotantes que van de 0 a 1 (imagen de color).

source: **intensity**
es_es: **intensidad**

source: An MxNx1 array of floats ranging from 0 to 1 (grayscale image).
es_es: Una matriz MxNx1 de flotantes que van desde 0 a 1 (imagen en escala de gris).

source: number, default: 1
es_es: número, predeterminado: 1

source: The maximum saturation value that the *intensity* map can shift the output image to.
es_es: El valor máximo de saturación al que el mapa de *intensidad* puede desplazar la imagen de salida.

source: number, optional
es_es: número, opcional

source: The minimum saturation value that the *intensity* map can shift the output image to. Defaults to 0.
es_es: El valor mínimo de saturación al que el mapa de *intensidad* puede desplazar la imagen de salida. Por defecto es 0.

source: The maximum value ("v" in "hsv") that the *intensity* map can shift the output image to. Defaults to 1.
es_es: El valor máximo ("v" en "hsv") al que el mapa de *intensidad* puede desplazar la imagen de salida. Por defecto es 1.

source: The minimum value ("v" in "hsv") that the *intensity* map can shift the output image to. Defaults to 0.
es_es: El valor mínimo ("v" en "hsv") al que el mapa de *intensidad* puede desplazar la imagen de salida. Por defecto es 0.

source: Returns
es_es: Devuelve

source: An MxNx3 RGB array representing the combined images.
es_es: Una matriz RGB MxNx3 que representa las imágenes combinadas.

source: Combine an rgb image with an intensity map using "overlay" blending.
es_es: Combina una imagen rgb con un mapa de intensidad usando la mezcla "overlay".

source: Combine an rgb image with an intensity map using "soft light" blending, using the "pegtop" formula.
es_es: Combina una imagen rgb con un mapa de intensidad usando la mezcla de "luz suave", usando la fórmula "pegtop".

source: The unit vector direction towards the light source.
es_es: La dirección del vector unitaria hacia la fuente de luz.

source: Calculate the illumination intensity for a surface using the defined azimuth and elevation for the light source.
es_es: Calcula la intensidad de iluminación de una superficie utilizando el azimut y la elevación definida para la fuente de luz.

source: This computes the normal vectors for the surface, and then passes them on to `shade_normals`
es_es: Esto calcula los vectores normales para la superficie, y luego los pasa a `shade_normals`

source: **elevation**
es_es: **altura**

source: 2D array-like
es_es: Arreglo 2D

source: The height values used to generate an illumination map
es_es: Los valores de altura usados para generar un mapa de iluminación

source: The amount to exaggerate the elevation values by when calculating illumination. This can be used either to correct for differences in units between the x-y coordinate system and the elevation coordinate system (e.g. decimal degrees vs. meters) or to exaggerate or de-emphasize topographic effects.
es_es: La cantidad a exceder los valores de elevación en el cálculo de la iluminación. Esto se puede utilizar para corregir las diferencias en unidades entre el sistema de coordenadas x-y y el sistema de coordenadas de elevación (e. . grados decimales vs. metros) o para atenuar o desenfatizar los efectos topográficos.

source: The x-spacing (columns) of the input *elevation* grid.
es_es: El espacio x (columnas) de la cuadrícula de *elevación* de entrada.

source: The y-spacing (rows) of the input *elevation* grid.
es_es: El espaciado y-(filas) de la cuadrícula de *elevación* de entrada.

source: **fraction**
es_es: **fracción **

source: Increases or decreases the contrast of the hillshade. Values greater than one will cause intermediate values to move closer to full illumination or shadow (and clipping any values that move beyond 0 or 1). Note that this is not visually or mathematically the same as vertical exaggeration.
es_es: Aumenta o disminuye el contraste de la sombra del color. Valores mayores a uno causarán que los valores intermedios se acerquen a la iluminación completa o a la sombra (y recortando cualquier valor que vaya más allá de 0 o 1). Tenga en cuenta que esto no es visualmente o matemáticamente lo mismo que la fijación vertical.

source: A 2D array of illumination values between 0-1, where 0 is completely in shadow and 1 is completely illuminated.
es_es: Una matriz 2D de valores de iluminación entre 0-1, donde 0 está completamente en la sombra y 1 está completamente iluminado.

source: Combine colormapped data values with an illumination intensity map (a.k.a. "hillshade") of the values.
es_es: Combina los valores de datos asignados a color con un mapa de intensidad de iluminación (también conocido como "hillshade") de los valores.

source: The height values used to generate a shaded map.
es_es: Los valores de altura utilizados para generar un mapa sombreado.

source: The colormap used to color the *data* array. Note that this must be a `~matplotlib.colors.Colormap` instance. For example, rather than passing in ``cmap='gist_earth'``, use ``cmap=plt.get_cmap('gist_earth')`` instead.
es_es: El mapa de colores usado para colorear la matriz *data*. Tenga en cuenta que debe ser una instancia `~matplotlib.colors.Colormap`. Por ejemplo, en lugar de pasar en ``cmap='gist_earth'``, use ``cmap=plt.get_cmap('gist_earth')`` en su lugar.

source: **norm** : `~matplotlib.colors.Normalize` instance, optional
es_es: **norma** : instancia `~matplotlib.colors.Normalize`, opcional

source: Normalize instance, optional
es_es: Normalizar la instancia, opcional

source: The normalization used to scale values before colormapping. If None, the input will be linearly scaled between its min and max.
es_es: La normalización usada para escalar valores antes del mapeo de colores. Si no, la entrada será escalada lineal entre su min y máximo.

source: {'hsv', 'overlay', 'soft'} or callable, optional
es_es: {'hsv', 'overlay', 'soft'} o llamable, opcional

source: The type of blending used to combine the colormapped data values with the illumination intensity. Default is "overlay". Note that for most topographic surfaces, "overlay" or "soft" appear more visually realistic. If a user-defined function is supplied, it is expected to combine an MxNx3 RGB array of floats (ranging 0 to 1) with an MxNx1 hillshade array (also 0 to 1). (Call signature ``func(rgb, illum, **kwargs)``) Additional kwargs supplied to this function will be passed on to the *blend_mode* function.
es_es: El tipo de mezcla utilizada para combinar los valores de datos asignados a colores con la intensidad de iluminación. Por defecto es "overlay". Tenga en cuenta que para la mayoría de las superficies topográficas, "overlay" o "soft" aparecen más visualmente realistas. Si se suministra una función definida por el usuario, se espera que combine una matriz RGB MxNx3 de flotantes (rango 0 a 1) con una matriz de sombra MxNx1 (también 0 a 1). (Firma completa ``func(rgb, illum, **kwargs)``) Los kwargs adicionales suministrados a esta función serán pasados a la función *blend_mode*.

source: float or None, optional
es_es: flotante o ninguno, opcional

source: The minimum value used in colormapping *data*. If *None* the minimum value in *data* is used. If *norm* is specified, then this argument will be ignored.
es_es: El valor mínimo usado en el mapeo de colores *data*. Si *nunca* el valor mínimo en *data* es usado. Si se especifica *norma*, este argumento será ignorado.

source: The maximum value used in colormapping *data*. If *None* the maximum value in *data* is used. If *norm* is specified, then this argument will be ignored.
es_es: El valor máximo usado en el mapeo de colores *data*. Si *nunca* se usa el valor máximo en *data*. Si se especifica *norma*, este argumento será ignorado.

source: The amount to exaggerate the elevation values by when calculating illumination. This can be used either to correct for differences in units between the x-y coordinate system and the elevation coordinate system (e.g. decimal degrees vs. meters) or to exaggerate or de-emphasize topography.
es_es: La cantidad a exceder los valores de elevación en el cálculo de la iluminación. Esto se puede utilizar para corregir las diferencias en unidades entre el sistema de coordenadas x-y y el sistema de coordenadas de elevación (e. . grados decimales vs. metros) o para acometer o des-enfatizar la topografía.

source: **Additional kwargs are passed on to the *blend_mode* function.**
es_es: **Los kwargs adicionales se pasan a la función *blend_mode*.**

source: An MxNx4 array of floats ranging between 0-1.
es_es: Una matriz MxNx4 de flotantes que oscilan entre 0-1.

source: Calculate the illumination intensity for the normal vectors of a surface using the defined azimuth and elevation for the light source.
es_es: Calcula la intensidad de iluminación de los vectores normales de una superficie utilizando el azimut definido y la elevación para la fuente de luz.

source: Imagine an artificial sun placed at infinity in some azimuth and elevation position illuminating our surface. The parts of the surface that slope toward the sun should brighten while those sides facing away should become darker.
es_es: Imagínese un sol artificial colocado en infinidad en una posición de azimut y elevación que ilumine nuestra superficie. Las partes de la superficie que se inclinan hacia el sol deben brillar mientras que los lados que miran hacia fuera deben volverse oscuros.

source: Use this light source to adjust the colors of the *rgb* input array to give the impression of a shaded relief map with the given *elevation*.
es_es: Usa esta fuente de luz para ajustar los colores de la matriz de entrada *rgb* para dar la impresión de un mapa de relieve sombreado con la *elevación* dada.

source: An (M, N, 3) RGB array, assumed to be in the range of 0 to 1.
es_es: Un arreglo (M, N, 3) RGB, asumido que está en el rango de 0 a 1.

source: An (M, N) array of the height values used to generate a shaded map.
es_es: Un array (M, N) de los valores de altura utilizados para generar un mapa sombreado.

source: number
es_es: número

source: The type of blending used to combine the colormapped data values with the illumination intensity. For backwards compatibility, this defaults to "hsv". Note that for most topographic surfaces, "overlay" or "soft" appear more visually realistic. If a user-defined function is supplied, it is expected to combine an MxNx3 RGB array of floats (ranging 0 to 1) with an MxNx1 hillshade array (also 0 to 1). (Call signature ``func(rgb, illum, **kwargs)``) Additional kwargs supplied to this function will be passed on to the *blend_mode* function.
es_es: El tipo de mezcla utilizada para combinar los valores de datos asignados a colores con la intensidad de iluminación. Para compatibilidad con versiones anteriores, este valor por defecto es "hsv". Tenga en cuenta que para la mayoría de las superficies topográficas, "overlay" o "soft" aparecen más realistas visualmente. Si se suministra una función definida por el usuario, se espera que combine una matriz RGB MxNx3 de flotantes (rango 0 a 1) con una matriz de sombra MxNx1 (también 0 a 1). (Firma completa ``func(rgb, illum, **kwargs)``) Los kwargs adicionales suministrados a esta función serán pasados a la función *blend_mode*.

source: An (m, n, 3) array of floats ranging between 0-1.
es_es: Un array (m, n, 3) de flotantes que oscilan entre 0-1.

source: Examples using ``matplotlib.colors.LightSource``
es_es: Ejemplos usando ``matplotlib.colors.LightSource``

source: Shading example
es_es: Ejemplo de sombreado

source: Shaded & power normalized rendering
es_es: Renderizado sombreado y de potencia normalizada

source: Frontpage 3D example
es_es: Ejemplo de portada 3D

source: AGG filter
es_es: Filtro AGG

source: Custom hillshading in a 3D surface plot
es_es: Sombreado personalizado en un gráfico de superficie 3D

source: Topographic hillshading
es_es: Hillshading topográfico
