Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.locator_params.po
Languages: es_es

source: Control behavior of major tick locators.
es_es: Controlar el comportamiento de los principales localizadores de tick.

source: Because the locator is involved in autoscaling, `~.Axes.autoscale_view` is called automatically after the parameters are changed.
es_es: Debido a que el localizador está involucrado en la autoescalado, `~.Axes.autoscale_view` es llamado automáticamente después de que los parámetros se cambian.

source: Parameters
es_es: Parámetros

source: {'both', 'x', 'y'}, default: 'both'
es_es: {'both', 'x', 'y'}, por defecto: 'ambos'

source: The axis on which to operate.
es_es: El eje en el que operar.

source: **tight**
es_es: **endurecido**

source: bool or None, optional
es_es: libro o ninguno, opcional

source: Parameter passed to `~.Axes.autoscale_view`. Default is None, for no change.
es_es: Parámetro pasado a `~.Axes.autoscale_view`. Por defecto Ninguno, para ningún cambio.

source: Other Parameters
es_es: Otros Parámetros

source: Remaining keyword arguments are passed to directly to the ``set_params()`` method of the locator. Supported keywords depend on the type of the locator. See for example `~.ticker.MaxNLocator.set_params` for the `.ticker.MaxNLocator` used by default for linear axes.
es_es: Los argumentos de palabra clave restantes se pasan directamente al método ``set_params()`` del localizador. Las palabras clave soportadas dependen del tipo del localizador. Vea por ejemplo `~.ticker.MaxNLocator.set_params` para el `.ticker.MaxNLocator` usado por defecto para ejes lineales.

source: Examples
es_es: Ejemplos

source: When plotting small subplots, one might want to reduce the maximum number of ticks and use tight bounds, for example::
es_es: Al trazar subparcelas pequeñas, uno podría querer reducir el número máximo de ticks y usar límites ajustados, por ejemplo::
