Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.pcolorfast.po
Languages: es_es

source: Create a pseudocolor plot with a non-regular rectangular grid.
es_es: Crea una gráfica pseudocolor con una cuadrícula rectangular no regular.

source: Call signature::
es_es: Firma de llamada::

source: This method is similar to `~.Axes.pcolor` and `~.Axes.pcolormesh`. It's designed to provide the fastest pcolor-type plotting with the Agg backend. To achieve this, it uses different algorithms internally depending on the complexity of the input grid (regular rectangular, non-regular rectangular or arbitrary quadrilateral).
es_es: Este método es similar a `~.Axes.pcolor` y `~.Axes.pcolormesh`. Está diseñado para proporcionar la plotación de tipo pcolor más rápida con el backend Agg. Para lograr esto, utiliza diferentes algoritmos internamente dependiendo de la complejidad de la rejilla de entrada (rectangular regular, rectangular no regular o arbitrario).

source: This method is experimental. Compared to `~.Axes.pcolor` or `~.Axes.pcolormesh` it has some limitations:
es_es: Este método es experimental. Comparado con `~.Axes.pcolor` o `~.Axes.pcolormesh` tiene algunas limitaciones:

source: It supports only flat shading (no outlines)
es_es: Sólo soporta sombreado plano (sin contornos)

source: It lacks support for log scaling of the axes.
es_es: Carece de soporte para la escalada de troncos de los ejes.

source: It does not have a have a pyplot wrapper.
es_es: No tiene un envoltorio con pyplot.

source: Parameters
es_es: Parámetros

source: The image data. Supported array shapes are:
es_es: Los datos de la imagen. Formas de matriz soportadas son:

source: (M, N): an image with scalar data. The data is visualized using a colormap.
es_es: (M, N): una imagen con datos escalares. Los datos se visualizan usando un mapa de colores.

source: (M, N, 3): an image with RGB values (0-1 float or 0-255 int).
es_es: (M, N, 3): una imagen con valores RGB (0-1 float o 0-255 int).

source: (M, N, 4): an image with RGBA values (0-1 float or 0-255 int), i.e. including transparency.
es_es: (M, N, 4): una imagen con valores RGBA (0-1 float o 0-255 int), es decir, con transparencia.

source: The first two dimensions (M, N) define the rows and columns of the image.
es_es: Las dos primeras dimensiones (M, N) definen las filas y columnas de la imagen.

source: This parameter can only be passed positionally.
es_es: Este parámetro sólo se puede pasar posicionalmente.

source: **X, Y** : tuple or array-like, default: ``(0, N)``, ``(0, M)``
es_es: **X, Y** : tupla o tipo matriz, por defecto: ``(0, N)``, ``(0, M)``

source: tuple or array-like, default:
es_es: tuple o tipo matriz por defecto:

source: *X* and *Y* are used to specify the coordinates of the quadrilaterals. There are different ways to do this:
es_es: *X* y *Y* se utilizan para especificar las coordenadas de los cuadriláteros. Hay diferentes maneras de hacer esto:

source: Use tuples ``X=(xmin, xmax)`` and ``Y=(ymin, ymax)`` to define a *uniform rectangular grid*.
es_es: Usa tuples ``X=(xmin, xmax)`` y ``Y=(ymin, ymax)`` para definir una *cuadrícula rectangular uniforme*.

source: The tuples define the outer edges of the grid. All individual quadrilaterals will be of the same size. This is the fastest version.
es_es: Las tuberías definen los bordes externos de la cuadrícula. Todos los cuadriláteros individuales tendrán el mismo tamaño. Esta es la versión más rápida.

source: Use 1D arrays *X*, *Y* to specify a *non-uniform rectangular grid*.
es_es: Utilice arrays 1D *X*, *Y* para especificar una *cuadrícula rectangular no uniforme*.

source: In this case *X* and *Y* have to be monotonic 1D arrays of length *N+1* and *M+1*, specifying the x and y boundaries of the cells.
es_es: En este caso *X* y *Y* tienen que ser arreglos monotónicos 1D de longitud *N+1* y *M+1*, especificar los límites x e y de las células.

source: The speed is intermediate. Note: The grid is checked, and if found to be uniform the fast version is used.
es_es: La velocidad es intermedia. Nota: La cuadrícula está marcada, y si se descubre que es uniforme se utiliza la versión rápida.

source: Use 2D arrays *X*, *Y* if you need an *arbitrary quadrilateral grid* (i.e. if the quadrilaterals are not rectangular).
es_es: Utilice arrays 2D *X*, *Y* si necesita una *cuadrícula cuadrilátero arbitraria* (es decir, si los cuadriláteros no son rectangulares).

source: In this case *X* and *Y* are 2D arrays with shape (M + 1, N + 1), specifying the x and y coordinates of the corners of the colored quadrilaterals.
es_es: En este caso *X* y *Y* son arrays 2D con forma (M + 1, N + 1), especificar las coordenadas x e y de las esquinas de los cuadriláteros de color.

source: This is the most general, but the slowest to render. It may produce faster and more compact output using ps, pdf, and svg backends, however.
es_es: Este es el más general, pero el más bajo de renderizar. Puede producir una salida más rápida y compacta usando ps, pdf y svg backends.

source: These arguments can only be passed positionally.
es_es: Estos argumentos sólo se pueden pasar por alto.

source: **cmap** : str or `~matplotlib.colors.Colormap`, default: :rc:`image.cmap`
es_es: **cmap** : str o `~matplotlib.colors.Colormap`, por defecto: :rc:`image.cmap`

source: str or
es_es: str o

source: A Colormap instance or registered colormap name. The colormap maps the *C* values to colors.
es_es: Una instancia de Colormap o nombre de mapa de color registrado. El mapa de colores asigna los valores *C* a colores.

source: **norm** : `~matplotlib.colors.Normalize`, optional
es_es: **norma** : `~matplotlib.colors.Normalize`, opcional

source: Normalize, optional
es_es: Normalizar, opcional

source: The Normalize instance scales the data values to the canonical colormap range [0, 1] for mapping to colors. By default, the data range is mapped to the colorbar range using linear scaling.
es_es: La instancia Normalize escala los valores de datos al rango de mapa de color canónico [0, 1] para mapear a colores. De forma predeterminada, el rango de datos se asigna al rango de la barra de colores usando escalado lineal.

source: The colorbar range. If *None*, suitable min/max values are automatically chosen by the `.Normalize` instance (defaults to the respective min/max values of *C* in case of the default linear scaling). It is an error to use *vmin*/*vmax* when *norm* is given.
es_es: El rango de la barra de color. Si *nunca*, los valores mínimos / máximos adecuados son automáticamente elegidos por el `. instancia ormalize` (por defecto a los respectivos valores min/max de *C* en caso de la escala lineal predeterminada). Es un error usar *vmin*/*vmax* cuando se da *norma*.

source: **alpha**
es_es: **alfa**

source: The alpha blending value, between 0 (transparent) and 1 (opaque).
es_es: El valor de mezcla alfa, entre 0 (transparente) y 1 (opaco).

source: bool, default: False
es_es: bool, por defecto: False

source: Whether to snap the mesh to pixel boundaries.
es_es: Ajustar la malla a límites de píxeles.

source: Returns
es_es: Devuelve

source: `.AxesImage` or `.PcolorImage` or `.QuadMesh`
es_es: `.AxesImage` o `.PcolorImage` o `.QuadMesh`

source: The return type depends on the type of grid:
es_es: El tipo de retorno depende del tipo de cuadrícula:

source: `.AxesImage` for a regular rectangular grid.
es_es: `.AxesImage` para una cuadrícula rectangular regular.

source: `.PcolorImage` for a non-regular rectangular grid.
es_es: `.PcolorImage` para una cuadrícula rectangular no regular.

source: `.QuadMesh` for a non-rectangular grid.
es_es: `.QuadMesh` para una cuadrícula no rectangular.

source: Other Parameters
es_es: Otros Parámetros

source: If given, all parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception).
es_es: Si se dan, todos los parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción).

source: Supported additional parameters depend on the type of grid. See return types of *image* for further description.
es_es: Los parámetros adicionales soportados dependen del tipo de cuadrícula. Vea los tipos de *imagen* para más descripción.

source: Examples using ``matplotlib.axes.Axes.pcolorfast``
es_es: Ejemplos usando ``matplotlib.axes.Axes.pcolorfast``

source: Pcolor Demo
es_es: Demostración pcolor
