Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.patches.ArrowStyle.po
Languages: es_es

source: `ArrowStyle` is a container class which defines several arrowstyle classes, which is used to create an arrow path along a given path. These are mainly used with `FancyArrowPatch`.
es_es: `ArrowStyle` es una clase contenedor que define varias clases de estilo de flecha, que se utiliza para crear una ruta de flecha a lo largo de una ruta determinada. Estos se utilizan principalmente con `FancyArrowPatch`.

source: A arrowstyle object can be either created as::
es_es: Un objeto estilo flecha puede ser creado como::

source: or::
es_es: o::

source: The following classes are defined
es_es: Las siguientes clases están definidas

source: Class
es_es: Clase

source: Name
es_es: Nombre

source: Curve
es_es: Curva

source: CurveA
es_es: Curva A

source: head_length=0.4, head_width=0.2, widthA=1.0, widthB=1.0, lengthA=0.2, lengthB=0.2, angleA=0, angleB=0, scaleA=None, scaleB=None
es_es: head_length=0.4, head_width=0.2, widthA=1.0, widthB=1.0, lengthA=0.2, lengthB=0.2, angleA=0, angleB=0, scaleA=ninguno, scaleB=None

source: CurveB
es_es: CurvaB

source: CurveAB
es_es: Curva AB

source: BracketA
es_es: Paréntesis A

source: widthA=1.0, lengthA=0.2, angleA=0
es_es: widthA=1.0, longitudA=0.2, ánguloA=0

source: BracketB
es_es: ParéntesisB

source: widthB=1.0, lengthB=0.2, angleB=0
es_es: anchoB=1.0, longitudB=0.2, ánguloB=0

source: BracketAB
es_es: Paréntesis AB

source: widthA=1.0, angleA=0, widthB=1.0, angleB=0
es_es: widthA=1.0, ánguloA=0, anchoB=1.0, ánguloB=0

source: BracketCurve
es_es: Curva de corchete

source: widthA=1.0, lengthA=0.2, angleA=None
es_es: widthA=1.0, lengthA=0.2, ánguloA=Ninguno

source: CurveBracket
es_es: Bracket de curva

source: widthB=1.0, lengthB=0.2, angleB=None
es_es: anchoB=1.0, longitudB=0.2, angleB=Ninguno

source: Fancy
es_es: Lujoso

source: Wedge
es_es: Cuña

source: An instance of any arrow style class is a callable object, whose call signature is::
es_es: Una instancia de cualquier clase de estilo flecha es un objeto llamable, cuya firma de llamada es::

source: and it returns a tuple of a `.Path` instance and a boolean value. *path* is a `.Path` instance along which the arrow will be drawn. *mutation_size* and *aspect_ratio* have the same meaning as in `BoxStyle`. *linewidth* is a line width to be stroked. This is meant to be used to correct the location of the head so that it does not overshoot the destination point, but not all classes support it.
es_es: y devuelve una tuple de una instancia `.Path` y un valor booleano. *path* es un `. ath` instancia a lo largo de la cual se dibujará la flecha. *mutation_size* y *aspect_ratio* tienen el mismo significado que en `BoxStyle`. El *ancho de línea* es un ancho de línea a trazar. Se supone que se utilizará para corregir la ubicación de la cabeza de modo que no se sobrepase el punto de destino, pero no todas las clases lo soportan.

source: Return the instance of the subclass with the given style name.
es_es: Devuelve la instancia de la subclase con el nombre de estilo dado.

source: An arrow with vertical bars ``|`` at both ends.
es_es: Una flecha con barras verticales ``|`` en ambos extremos.

source: Parameters
es_es: Parámetros

source: float, default: 1.0
es_es: float, por defecto: 1.0

source: Width of the bracket.
es_es: Ancho del soporte.

source: float, default: 0 degrees
es_es: flotante, por defecto: 0 grados

source: Orientation of the bracket, as a counterclockwise angle. 0 degrees means perpendicular to the line.
es_es: Orientación del corchete, como un ángulo en sentido contrario a las agujas del reloj 0 grados significa perpendicular a la línea.

source: An arrow with an outward square bracket at its start.
es_es: Una flecha con un brazo cuadrado hacia afuera al comienzo.

source: float, default: 0.2
es_es: float, por defecto: 0.2

source: Length of the bracket.
es_es: Longitud del corchete.

source: An arrow with outward square brackets at both ends.
es_es: Una flecha con corchetes cuadrados hacia afuera en ambos extremos.

source: An arrow with an outward square bracket at its end.
es_es: Una flecha con un brazo cuadrado hacia afuera al final.

source: An arrow with an outward square bracket at its start and a head at the end.
es_es: Una flecha con un brazo cuadrado exterior al principio y una cabeza al final.

source: A simple curve without any arrow head.
es_es: Una curva simple sin cabeza de flecha.

source: **head_length**
es_es: **largo_cabeza**

source: float, default: 0.4
es_es: float, por defecto: 0.4

source: Length of the arrow head, relative to *mutation_scale*.
es_es: Longitud de la cabeza de flecha, relativa a *mutation_scale*.

source: Width of the arrow head, relative to *mutation_scale*.
es_es: Ancho de la cabeza de flecha, relativo a *mutation_scale*.

source: Width of the bracket at the beginning of the arrow
es_es: Ancho del corchete al comienzo de la flecha

source: Width of the bracket at the end of the arrow
es_es: Ancho del brazo al final de la flecha

source: Length of the bracket at the beginning of the arrow
es_es: Longitud del corchete al comienzo de la flecha

source: Length of the bracket at the end of the arrow
es_es: Longitud del corchete al final de la flecha

source: float, default 0
es_es: flotante, por defecto 0

source: Orientation of the bracket at the beginning, as a counterclockwise angle. 0 degrees means perpendicular to the line.
es_es: Orientación del brazalete al principio, como un ángulo en sentido contrario a las agujas del reloj 0 grados significa perpendicular a la línea.

source: **scaleA** : float, default *mutation_size*
es_es: **scaleA** : flotante, por defecto *mutation_size*

source: float, default
es_es: flotante, por defecto

source: The mutation_size for the beginning bracket
es_es: El mutation_size para el corchete inicial

source: **scaleB** : float, default *mutation_size*
es_es: **scaleB** : flotante, por defecto *mutation_size*

source: The mutation_size for the end bracket
es_es: El mutation_size para el soporte final

source: An arrow with a head at its begin point.
es_es: Una flecha con una cabeza en su punto de partida.

source: An arrow with heads both at the begin and the end point.
es_es: Una flecha con cabezas tanto en el punto de inicio como en el final.

source: An arrow with a head at its end point.
es_es: Una flecha con una cabeza en su punto final.

source: An arrow with an outward square bracket at its end and a head at the start.
es_es: Una flecha con un brazo cuadrado exterior al final y una cabeza al comienzo.

source: An arrow with filled triangle head at the begin.
es_es: Una flecha con triángulo lleno cabeza al comienzo.

source: An arrow with filled triangle heads at both ends.
es_es: Una flecha con un triángulo lleno cabezas en ambos extremos.

source: An arrow with filled triangle head at the end.
es_es: Una flecha con la cabeza de triángulo llena al final.

source: A fancy arrow. Only works with a quadratic Bezier curve.
es_es: Una flecha de lujo. Solo funciona con una curva Bézier cuadrática.

source: Length of the arrow head.
es_es: Longitud de la cabeza de flecha.

source: Width of the arrow head.
es_es: Ancho de la cabeza de flecha.

source: Width of the arrow tail.
es_es: Ancho de la cola de flechas.

source: The transmute method is the very core of the ArrowStyle class and must be overridden in the subclasses. It receives the path object along which the arrow will be drawn, and the mutation_size, with which the arrow head etc. will be scaled. The linewidth may be used to adjust the path so that it does not pass beyond the given points. It returns a tuple of a Path instance and a boolean. The boolean value indicate whether the path can be filled or not. The return value can also be a list of paths and list of booleans of a same length.
es_es: El método transmute es el núcleo mismo de la clase ArrowStyle y debe ser sobreescrito en las subclases. Recibe el objeto de ruta a lo largo del cual se dibujará la flecha y el tamaño_mutación, con el cual se escalará la cabeza de la flecha etc. El ancho de línea se puede utilizar para ajustar la ruta para que no pase más allá de los puntos dados. Devuelve una tupla de una instancia de Ruta y un booleano. El valor booleano indica si la ruta se puede rellenar o no. El valor devuelto también puede ser una lista de rutas y una lista de booleanos de la misma longitud.

source: A simple arrow. Only works with a quadratic Bezier curve.
es_es: Una flecha simple. Solo funciona con una curva Bézier cuadrática.

source: Wedge(?) shape. Only works with a quadratic Bezier curve. The begin point has a width of the tail_width and the end point has a width of 0. At the middle, the width is shrink_factor*tail_width.
es_es: Forma (?). Solo funciona con una curva Bézier cuadrática. El punto de inicio tiene un ancho de la anchura tail_width y el punto final tiene un ancho de 0. En el medio, el ancho es shrink_factor*tail_width.

source: Width of the tail.
es_es: Ancho de la cola.

source: Fraction of the arrow width at the middle point.
es_es: Fracción del ancho de la flecha en el punto intermedio.
