Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.colors.Normalize.po
Languages: es_es

source: A class which, when called, linearly normalizes data into the ``[0.0, 1.0]`` interval.
es_es: Una clase que, cuando se llama, normaliza los datos en el intervalo ``[0.0, 1.0]``.

source: Parameters
es_es: Parámetros

source: float or None
es_es: float o None

source: If *vmin* and/or *vmax* is not given, they are initialized from the minimum and maximum value, respectively, of the first input processed; i.e., ``__call__(A)`` calls ``autoscale_None(A)``.
es_es: Si no se da *vmin* y/o *vmax*, se inicializan a partir del valor mínimo y máximo, respectivamente, del primer proceso de entrada; i. ., ``__call__(A)`` llama a ``autoscale_deleta(A)``.

source: bool, default: False
es_es: bool, por defecto: False

source: If ``True`` values falling outside the range ``[vmin, vmax]``, are mapped to 0 or 1, whichever is closer, and masked values are set to 1. If ``False`` masked values remain masked.
es_es: Si los valores ``True`` que caen fuera del rango ``[vmin, vmax]``, son asignados a 0 o 1, cualquiera que esté más cerca, y los valores enmascarados se establecen a 1. Si los valores enmascarados ``False`` permanecen enmascarados.

source: Clipping silently defeats the purpose of setting the over, under, and masked colors in a colormap, so it is likely to lead to surprises; therefore the default is ``clip=False``.
es_es: Recortar silenciosamente derrota el propósito de poner los colores alto, bajo y enmascarados en un mapa de color, por lo que es probable que conduzca a sorpresas; por lo tanto, el valor por defecto es ``clip=False``.

source: Returns 0 if ``vmin == vmax``.
es_es: Devuelve 0 si ``vmin == vmax``.

source: Normalize *value* data in the ``[vmin, vmax]`` interval into the ``[0.0, 1.0]`` interval and return it.
es_es: Normaliza los datos de *valor* en el intervalo ``[vmin, vmax]`` en el intervalo ``[0.0, 1.0]`` y devuelve.

source: **value**
es_es: **valor**

source: Data to normalize.
es_es: Datos a normalizar.

source: If ``None``, defaults to ``self.clip`` (which defaults to ``False``).
es_es: Si ``ninguno``, el valor predeterminado es ``self.clip`` (que por defecto es ``False``).

source: If not already initialized, ``self.vmin`` and ``self.vmax`` are initialized using ``self.autoscale_None(value)``.
es_es: Si no se ha inicializado, ``self.vmin`` y ``self.vmax`` son inicializados usando ``self.autoscale_ichard (value)``.

source: Set *vmin*, *vmax* to min, max of *A*.
es_es: Establecer *vmin*, *vmax* a min, máximo de *A*.

source: If vmin or vmax are not set, use the min/max of *A* to set them.
es_es: Si vmin o vmax no están definidos, use el min/max de *A* para establecerlos.

source: Homogenize the input *value* for easy and efficient normalization.
es_es: Homogenizar el *valor* de entrada para una normalización fácil y eficiente.

source: *value* can be a scalar or sequence.
es_es: *valor* puede ser escalar o secuencia.

source: Returns
es_es: Devuelve

source: **result**
es_es: **resultado**

source: masked array
es_es: matriz enmascarada

source: Masked array with the same shape as *value*.
es_es: Matriz enmascarada con la misma forma que *valor*.

source: **is_scalar**
es_es: **es_escalar**

source: Whether *value* is a scalar.
es_es: Si *valor* es un escalar.

source: Float dtypes are preserved; integer types with two bytes or smaller are converted to np.float32, and larger types are converted to np.float64. Preserving float32 when possible, and using in-place operations, greatly improves speed for large arrays.
es_es: Se conservan los tipos float; los tipos enteros con dos bytes o más pequeños se convierten a np.float32, y los tipos más grandes se convierten en np. loat64. Preservando float32 cuando sea posible, y usando operaciones in situ, mejora en gran medida la velocidad para matrices grandes.

source: Return whether vmin and vmax are set.
es_es: Devuelve si se han establecido vmin y vmax.

source: Examples using ``matplotlib.colors.Normalize``
es_es: Ejemplos usando ``matplotlib.colors.Normalize``

source: Creating annotated heatmaps
es_es: Creación de mapas térmicos anotados

source: Colormap Normalizations
es_es: Normalizaciones del mapa de colores

source: Colormap Normalizations Symlognorm
es_es: Normalizaciones del mapa de colores Symlognorm

source: Basic Usage
es_es: Uso básico

source: Constrained Layout Guide
es_es: Guía de diseño restringido
