Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.bar_label.po
Languages: es_es

source: matplotlib.axes.Axes.bar\_label
es_es: matplotlib.axes.Ejes.bar\_etiqueta

source: Label a bar plot.
es_es: Etiqueta una parcela de barras.

source: Adds labels to bars in the given `.BarContainer`. You may need to adjust the axis limits to fit the labels.
es_es: Añade etiquetas a las barras en el `.BarContainer` dado. Puede que necesites ajustar los límites del eje para ajustarlos a las etiquetas.

source: Parameters
es_es: Parámetros

source: **container** : `.BarContainer`
es_es: **contenedor** : `.BarContainer`

source: BarContainer
es_es: Contenedor de Bars

source: Container with all the bars and optionally errorbars, likely returned from `.bar` or `.barh`.
es_es: Contenedor con todas las barras y opcionalmente barras de error, probablemente devuelto de `.bar` o `.barh`.

source: array-like, optional
es_es: tipo arreglo, opcional

source: A list of label texts, that should be displayed. If not given, the label texts will be the data values formatted with *fmt*.
es_es: Una lista de textos de etiqueta, que deben mostrarse. Si no se proporciona, los textos de la etiqueta serán los valores de datos formateados con *fmt*.

source: str, default: '%g'
es_es: str, por defecto: '%g'

source: A format string for the label.
es_es: Una cadena de formato para la etiqueta.

source: **label_type**
es_es: **tipo_etiqueta**

source: {'edge', 'center'}, default: 'edge'
es_es: {'edge', 'center'}, por defecto: 'borde'

source: The label type. Possible values:
es_es: El tipo de etiqueta. Valores posibles:

source: 'edge': label placed at the end-point of the bar segment, and the value displayed will be the position of that end-point.
es_es: 'edge': etiqueta colocada en el punto final del segmento de barras, y el valor mostrado será la posición de ese punto final.

source: 'center': label placed in the center of the bar segment, and the value displayed will be the length of that segment. (useful for stacked bars, i.e., :doc:`/gallery/lines_bars_and_markers/bar_label_demo`)
es_es: 'center': etiqueta colocada en el centro del segmento de barras, y el valor mostrado será la longitud de ese segmento. (útil para barras apiladas, es decir, :doc:`/gallery/lines_bars_and_markers/bar_label_demo`)

source: Distance of label from the end of the bar, in points.
es_es: Distancia de la etiqueta desde el final de la barra, en puntos.

source: Any remaining keyword arguments are passed through to `.Axes.annotate`.
es_es: Cualquier argumento de palabra clave restante se pasa a `.Axes.annotate`.

source: Returns
es_es: Devuelve

source: list of `.Text`
es_es: lista de `.Text`

source: A list of `.Text` instances for the labels.
es_es: Una lista de instancias `.Text` para las etiquetas.

source: Examples using ``matplotlib.axes.Axes.bar_label``
es_es: Ejemplos usando ``matplotlib.axes.Axes.bar_label``

source: Bar Label Demo
es_es: Demo de la etiqueta de la barra

source: Grouped bar chart with labels
es_es: Gráfico de barras agrupadas con etiquetas

source: Bar of pie
es_es: Barra de torta
