Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.streamplot.po
Languages: es_es

source: Draw streamlines of a vector flow.
es_es: Dibuja secuencias de un flujo vectorial.

source: Parameters
es_es: Parámetros

source: 1D/2D arrays
es_es: arrays 1D/2D

source: Evenly spaced strictly increasing arrays to make a grid. If 2D, all rows of *x* must be equal and all columns of *y* must be equal; i.e., they must be as if generated by ``np.meshgrid(x_1d, y_1d)``.
es_es: Evenly espacied strictly increasing arrays to make a grid. Si 2D, todas las filas de *x* deben ser iguales y todas las columnas de *y* deben ser iguales; i. ., deben ser como si fueran generados por ``np.meshgrid(x_1d, y_1d)``.

source: 2D arrays
es_es: Arreglos 2D

source: *x* and *y*-velocities. The number of rows and columns must match the length of *y* and *x*, respectively.
es_es: *x* y *y*-velocidades. El número de filas y columnas debe coincidir con la longitud de *y* y *x*, respectivamente.

source: **density**
es_es: **densidad**

source: float or (float, float)
es_es: flotante o (flotante, flotante)

source: Controls the closeness of streamlines. When ``density = 1``, the domain is divided into a 30x30 grid. *density* linearly scales this grid. Each cell in the grid can have, at most, one traversing streamline. For different densities in each direction, use a tuple (density_x, density_y).
es_es: Controla la cercanía de los streamlines. Cuando ``densidad = 1``, el dominio se divide en una cuadrícula de 30x30. *densidad* escala lineal esta cuadrícula. Cada célula en la cuadrícula puede tener, como máximo, una línea de flujo de travesía. Para diferentes densidades en cada dirección, utilice una tupla (densidad_x, densidad_y).

source: float or 2D array
es_es: array decimal o 2D

source: The width of the stream lines. With a 2D array the line width can be varied across the grid. The array must have the same shape as *u* and *v*.
es_es: La anchura de las líneas de transmisión. Con una matriz 2D la anchura de la línea puede variar a través de la cuadrícula. La matriz debe tener la misma forma que *u* y *v*.

source: color or 2D array
es_es: color o matriz 2D

source: The streamline color. If given an array, its values are converted to colors using *cmap* and *norm*. The array must have the same shape as *u* and *v*.
es_es: El color de la secuencia. Si se le da una matriz, sus valores se convierten a colores usando *cmap* y *normal*. La matriz debe tener la misma forma que *u* y *v*.

source: Colormap used to plot streamlines and arrows. This is only used if *color* is an array.
es_es: Mapa de color usado para graficar secuencias y flechas. Esto sólo se utiliza si *color* es una matriz.

source: **norm** : `~matplotlib.colors.Normalize`
es_es: **norma** : `~matplotlib.colors.Normalize`

source: Normalize object used to scale luminance data to 0, 1. If ``None``, stretch (min, max) to (0, 1). This is only used if *color* is an array.
es_es: Normalizar objeto usado para escalar datos de luminancia a 0, 1. Si ``Ningun``, estirar (min, max) a (0, 1). Esto sólo se utiliza si *color* es una matriz.

source: **arrowsize**
es_es: **tamaño**

source: Scaling factor for the arrow size.
es_es: Factor de escala para el tamaño de la flecha.

source: **arrowstyle**
es_es: **estilo de flecha**

source: Arrow style specification. See `~matplotlib.patches.FancyArrowPatch`.
es_es: Especificación de estilo de flecha. Vea `~matplotlib.patches.FancyArrowPatch`.

source: **minlength**
es_es: **minlongitud**

source: Minimum length of streamline in axes coordinates.
es_es: Longitud mínima de la línea en las coordenadas de los ejes.

source: Nx2 array
es_es: Matriz Nx2

source: Coordinates of starting points for the streamlines in data coordinates (the same coordinates as the *x* and *y* arrays).
es_es: Coordenadas de puntos de inicio para las líneas de transmisión en coordenadas de datos (las mismas coordenadas que las matrices *x* y *y*).

source: The zorder of the stream lines and arrows. Artists with lower zorder values are drawn first.
es_es: El zorder de las líneas de flujo y las flechas. Los artistas con valores de zorder más bajos se dibujan primero.

source: **maxlength**
es_es: **máximo**

source: Maximum length of streamline in axes coordinates.
es_es: Longitud máxima de la línea en las coordenadas de los ejes.

source: **integration_direction**
es_es: **dirección de integración**

source: {'forward', 'backward', 'both'}, default: 'both'
es_es: {'forward', 'backward', 'both'}, por defecto: 'ambos'

source: Integrate the streamline in forward, backward or both directions.
es_es: Integre el flujo hacia delante, hacia atrás o hacia ambas direcciones.

source: If given, the following parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception):
es_es: Si se dan, los siguientes parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción):

source: Returns
es_es: Devuelve

source: Container object with attributes
es_es: Objeto contenedor con atributos

source: ``lines``: `.LineCollection` of streamlines
es_es: ``líneas``: `.LineCollection` de streamlines

source: ``arrows``: `.PatchCollection` containing `.FancyArrowPatch` objects representing the arrows half-way along stream lines.
es_es: ``flechas``: `.PatchCollection` que contiene objetos `.FancyArrowPatch` que representan las flechas a medio camino a lo largo de las líneas del flujo.

source: This container will probably change in the future to allow changes to the colormap, alpha, etc. for both lines and arrows, but these changes should be backward compatible.
es_es: Este contenedor probablemente cambiará en el futuro para permitir cambios en el mapa de color, alfa, etc. tanto para líneas como flechas, pero estos cambios deben ser compatibles con el paso atrás.

source: Examples using ``matplotlib.axes.Axes.streamplot``
es_es: Ejemplos usando ``matplotlib.axes.Axes.streamplot``

source: Streamplot
es_es: Gráfico de flujo
