Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.xkcd.po
Languages: es_es

source: Turn on `xkcd <https://xkcd.com/>`_ sketch-style drawing mode. This will only have effect on things drawn after this function is called.
es_es: Activa `xkcd <https://xkcd.com/>`_ modo de dibujo estilo croquis. Esto solo tendrá efecto en las cosas dibujadas después de llamar a esta función.

source: For best results, the "Humor Sans" font should be installed: it is not included with Matplotlib.
es_es: Para obtener mejores resultados, la fuente "Humor Sans" debe ser instalada: no está incluida con Matplotlib.

source: Parameters
es_es: Parámetros

source: **scale**
es_es: **escala**

source: float, optional
es_es: float, opcional

source: The amplitude of the wiggle perpendicular to the source line.
es_es: La amplitud de la peluca perpendicular a la línea de fuente.

source: The length of the wiggle along the line.
es_es: La longitud de la muñeca a lo largo de la línea.

source: **randomness**
es_es: **aleatoria**

source: The scale factor by which the length is shrunken or expanded.
es_es: Factor de escala por el cual la longitud es reducida o ampliada.

source: This function works by a number of rcParams, so it will probably override others you have set before.
es_es: Esta función funciona con un número de rcParams, por lo que probablemente sobreescribirá a otras que hayas configurado antes.

source: If you want the effects of this function to be temporary, it can be used as a context manager, for example::
es_es: Si quieres que los efectos de esta función sean temporales, se puede utilizar como un gestor de contextos, por ejemplo::

source: Examples using ``matplotlib.pyplot.xkcd``
es_es: Ejemplos usando ``matplotlib.pyplot.xkcd``
