Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.gridspec.SubplotSpec.po
Languages: es_es

source: The location of a subplot in a `GridSpec`.
es_es: La ubicación de una subparcela en un `GridSpec`.

source: Likely, you'll never instantiate a `SubplotSpec` yourself. Instead you will typically obtain one from a `GridSpec` using item-access.
es_es: Probablemente, nunca instanciarás un `SubplotSpec` tú mismo. En su lugar, normalmente obtendrás uno de un `GridSpec` usando acceso-elemento.

source: Parameters
es_es: Parámetros

source: The GridSpec, which the subplot is referencing.
es_es: El gridSpec, al que hace referencia el subgráfico.

source: The subplot will occupy the num1-th cell of the given gridspec. If num2 is provided, the subplot will span between num1-th cell and num2-th cell *inclusive*.
es_es: La subparcela ocupará la célula número 1 de la cuadrícula dada. Si se proporciona el número 2, la subparcela se extenderá entre la celda número 1 y la celda número 2 *inclusive*.

source: The index starts from 0.
es_es: El índice comienza desde 0.

source: The columns spanned by this subplot, as a `range` object.
es_es: Las columnas espaciadas por esta subparcela, como un objeto `range`.

source: Return the subplot geometry as tuple ``(n_rows, n_cols, start, stop)``.
es_es: Devuelve la geometría subplot como tuple ``(n_rows, n_cols, start, stop)``.

source: The indices *start* and *stop* define the range of the subplot within the `GridSpec`. *stop* is inclusive (i.e. for a single cell ``start == stop``).
es_es: Los índices *start* y *stop* definen el rango de la subparada dentro de la `GridSpec`. *stop* es inclusivo (es decir, para una celda única ``start == stop``).

source: Update the subplot position from ``figure.subplotpars``.
es_es: Actualizar la posición de subplot desde ``figure.subplotpars``.

source: Return the topmost `SubplotSpec` instance associated with the subplot.
es_es: Devuelve la instancia topmost `SubplotSpec` asociada con el subplot.

source: The rows spanned by this subplot, as a `range` object.
es_es: Las filas extendidas por esta subparcela, como un objeto `range`.

source: Create a GridSpec within this subplot.
es_es: Crear una GridSpec dentro de esta subparcela.

source: The created `.GridSpecFromSubplotSpec` will have this `SubplotSpec` as a parent.
es_es: El `.GridSpecFromSubplotSpec` creado tendrá este `SubplotSpec` como padre.

source: **nrows**
es_es: **nnfilas**

source: Number of rows in grid.
es_es: Número de filas en cuadrícula.

source: **ncols**
es_es: **ncoles**

source: Number or columns in grid.
es_es: Número o columnas en la cuadrícula.

source: Returns
es_es: Devuelve

source: Other Parameters
es_es: Otros Parámetros

source: All other parameters are passed to `.GridSpecFromSubplotSpec`.
es_es: Todos los demás parámetros se pasan a `.GridSpecFromSubplotSpec`.

source: Examples
es_es: Ejemplos

source: Adding three subplots in the space occupied by a single subplot::
es_es: Añadiendo tres subparcelas en el espacio ocupado por una única subparcela::

source: Examples using ``matplotlib.gridspec.SubplotSpec``
es_es: Ejemplos usando ``matplotlib.gridspec.SubplotSpec``

source: Constrained Layout Guide
es_es: Guía de diseño restringido

source: Arranging multiple Axes in a Figure
es_es: Organizar varios ejes en una figura
