Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.scatter.po
Languages: es_es

source: A scatter plot of *y* vs. *x* with varying marker size and/or color.
es_es: Un diagrama de dispersión de *y* vs. *x* con diferente tamaño del marcador y/o color.

source: Parameters
es_es: Parámetros

source: float or array-like, shape (n, )
es_es: flotante o tipo matriz, forma (n, )

source: The data positions.
es_es: Las posiciones de los datos.

source: float or array-like, shape (n, ), optional
es_es: flotante o tipo matriz, forma (n, ), opcional

source: The marker size in points**2. Default is ``rcParams['lines.markersize'] ** 2``.
es_es: El tamaño del marcador en puntos**2. Por defecto es ``rcParams['lines.markersize'] ** 2``.

source: array-like or list of colors or color, optional
es_es: estilo matriz o lista de colores o color, opcional

source: The marker colors. Possible values:
es_es: Los colores del marcador. Valores posibles:

source: A scalar or sequence of n numbers to be mapped to colors using *cmap* and *norm*.
es_es: Un escalar o secuencia de números n a ser mapeado a los colores usando *cmap* y *norma*.

source: A 2D array in which the rows are RGB or RGBA.
es_es: Un Arreglo 2D en la que las filas son RGB o RGBA.

source: A sequence of colors of length n.
es_es: Una secuencia de colores de longitud n.

source: A single color format string.
es_es: Una sola cadena de formato de color.

source: Note that *c* should not be a single numeric RGB or RGBA sequence because that is indistinguishable from an array of values to be colormapped. If you want to specify the same RGB or RGBA value for all points, use a 2D array with a single row. Otherwise, value- matching will have precedence in case of a size matching with *x* and *y*.
es_es: Tenga en cuenta que *c* no debe ser una sola secuencia numérica RGB o RGBA porque es indistinguishable de una matriz de valores para ser mapeado de colores. Si desea especificar el mismo valor RGB o RGBA para todos los puntos, utilice una matriz 2D con una sola fila. De lo contrario, la coincidencia de valores tendrá precedencia en caso de que el tamaño coincida con *x* y *y*.

source: If you wish to specify a single color for all points prefer the *color* keyword argument.
es_es: Si desea especificar un solo color para todos los puntos prefiere el argumento de palabra clave *color*.

source: Defaults to `None`. In that case the marker color is determined by the value of *color*, *facecolor* or *facecolors*. In case those are not specified or `None`, the marker color is determined by the next color of the ``Axes``' current "shape and fill" color cycle. This cycle defaults to :rc:`axes.prop_cycle`.
es_es: Por defecto, el color del marcador está determinado por el valor de *color*, *facecolor* o *facecolors*. En caso de que no se especificen o `Ninguno`, el color del marcador es determinado por el siguiente color del ciclo de color de los ``Ejes``' actual "Forma y relleno". Este ciclo por defecto es :rc:`axes.prop_cycle`.

source: The marker style. *marker* can be either an instance of the class or the text shorthand for a particular marker. See :mod:`matplotlib.markers` for more information about marker styles.
es_es: El estilo del marcador. *marcador* puede ser una instancia de la clase o la abreviatura del texto para un marcador en particular. Vea :mod:`matplotlib.markers` para más información sobre los estilos de marcadores.

source: **cmap** : str or `~matplotlib.colors.Colormap`, default: :rc:`image.cmap`
es_es: **cmap** : str o `~matplotlib.colors.Colormap`, por defecto: :rc:`image.cmap`

source: str or
es_es: str o

source: A `.Colormap` instance or registered colormap name. *cmap* is only used if *c* is an array of floats.
es_es: Una instancia `.Colormap` o nombre de mapa de color registrado. *cmap* sólo se utiliza si *c* es un array de flotantes.

source: **norm** : `~matplotlib.colors.Normalize`, default: None
es_es: **norma** : `~matplotlib.colors.Normalize`, por defecto: Ninguno

source: Normalize, default: None
es_es: Normalizar, predeterminado: ninguno

source: If *c* is an array of floats, *norm* is used to scale the color data, *c*, in the range 0 to 1, in order to map into the colormap *cmap*. If *None*, use the default `.colors.Normalize`.
es_es: Si *c* es un array de flotantes, *normal* es usado para escalar los datos de color, *c*, en el rango de 0 a 1, para mapear en el mapa de colores *cmap*. Si *nunca*, utilice el `.colors.Normalize` predeterminado.

source: *vmin* and *vmax* are used in conjunction with the default norm to map the color array *c* to the colormap *cmap*. If None, the respective min and max of the color array is used. It is an error to use *vmin*/*vmax* when *norm* is given.
es_es: *vmin* y *vmax* son usados junto con la norma por defecto para mapear la matriz de colores *c* al mapa de colores *cmap*. Si Ninguna, se usa el mínimo y máximo respectivo de la matriz de colores. Es un error usar *vmin*/*vmax* cuando se da *norma*.

source: **alpha**
es_es: **alfa**

source: The alpha blending value, between 0 (transparent) and 1 (opaque).
es_es: El valor de mezcla alfa, entre 0 (transparente) y 1 (opaco).

source: **linewidths** : float or array-like, default: :rc:`lines.linewidth`
es_es: **anchos de línea** : float o array-like default: :rc:`lines.linewidth`

source: The linewidth of the marker edges. Note: The default *edgecolors* is 'face'. You may want to change this as well.
es_es: El ancho de línea de los bordes del marcador. Nota: Los *bordes* por defecto son 'cara'. Es posible que quieras cambiar esto también.

source: **edgecolors** : {'face', 'none', *None*} or color or sequence of color, default: :rc:`scatter.edgecolors`
es_es: **colores** : {'cara', 'ninguno', *Ninguno*} o color o secuencia de color, por defecto: :rc:`scatter.edgecolors`

source: {'face', 'none',
es_es: {'cara', 'ninguno',

source: The edge color of the marker. Possible values:
es_es: El color del borde del marcador. Valores posibles:

source: 'face': The edge color will always be the same as the face color.
es_es: 'cara': El color del borde siempre será el mismo que el color de la cara.

source: 'none': No patch boundary will be drawn.
es_es: 'Ninguno': No se dibujará límite de parches.

source: A color or sequence of colors.
es_es: Un color o secuencia de colores.

source: For non-filled markers, *edgecolors* is ignored. Instead, the color is determined like with 'face', i.e. from *c*, *colors*, or *facecolors*.
es_es: Para los marcadores no rellenos, se ignoran los *colores*, sino que el color se determina como con 'cara', es decir, de *c*, *colores*, o *colores*.

source: **plotnonfinite**
es_es: **plotnonfinito**

source: bool, default: False
es_es: bool, por defecto: False

source: Whether to plot points with nonfinite *c* (i.e. ``inf``, ``-inf`` or ``nan``). If ``True`` the points are drawn with the *bad* colormap color (see `.Colormap.set_bad`).
es_es: Si para graficar puntos con no finito *c* (es decir, ``inf``, ``-inf`` o ``nan``). Si es ``True`` los puntos se dibujan con el color *mal* del mapa de color (ver `.Colormap.set_bad`).

source: Returns
es_es: Devuelve

source: Other Parameters
es_es: Otros Parámetros

source: If given, the following parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception):
es_es: Si se dan, los siguientes parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción):

source: *x*, *y*, *s*, *linewidths*, *edgecolors*, *c*, *facecolor*, *facecolors*, *color*
es_es: *x*, *y*, *s*, *lineas*, *bordes*, *c*, *facecolor*, *facecolors*, *colores*, *color*

source: **\*\*kwargs** : `~matplotlib.collections.Collection` properties
es_es: **\*\*kwargs** : `~matplotlib.collections.Collection` propiedades

source: Collection properties
es_es: Propiedades de la colección

source: To plot scatter plots when markers are identical in size and color.
es_es: Para graficar los gráficos de dispersión cuando los marcadores son idénticos en tamaño y color.

source: The `.plot` function will be faster for scatterplots where markers don't vary in size or color.
es_es: La función `.plot` será más rápida para dispersiones donde los marcadores no varían en tamaño o color.

source: Any or all of *x*, *y*, *s*, and *c* may be masked arrays, in which case all masks will be combined and only unmasked points will be plotted.
es_es: Cualquiera o todo de *x*, *y*, *s*, y *c* pueden ser matrices enmascaradas, en cuyo caso se combinarán todas las máscaras y sólo se trazarán los puntos desenmascarados.

source: Fundamentally, scatter works with 1D arrays; *x*, *y*, *s*, and *c* may be input as N-D arrays, but within scatter they will be flattened. The exception is *c*, which will be flattened only if its size matches the size of *x* and *y*.
es_es: En términos generales, scatter funciona con matrices 1D; *x*, *y*, *s*, y *c* pueden ser entradas como matrices N-D, pero dentro de scatter serán aplanadas. La excepción es *c*, que se aplanará sólo si su tamaño coincide con el tamaño de *x* y *y*.

source: Examples using ``matplotlib.pyplot.scatter``
es_es: Ejemplos usando ``matplotlib.pyplot.scatter``

source: Hyperlinks
es_es: Hipervínculos
