Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.animation.MovieWriterRegistry.po
Languages: es_es

source: matplotlib.animation.MovieWriterRegistry
es_es: matplotlib.animation.Registro Escritor

source: Registry of available writer classes by human readable name.
es_es: Registro de clases de escritores disponibles por nombre legible para humanos.

source: Methods
es_es: Métodos

source: :py:obj:`is_available <matplotlib.animation.MovieWriterRegistry.is_available>`\ \(name\)
es_es: :py:obj:`is_available <matplotlib.animation.MovieWriterRegistry.is_available>`\ \(nombre\)

source: Check if given writer is available by name.
es_es: Compruebe si el escritor dado está disponible por su nombre.

source: Get a list of available MovieWriters.
es_es: Obtén una lista de escritores de Mooms disponibles.

source: :py:obj:`register <matplotlib.animation.MovieWriterRegistry.register>`\ \(name\)
es_es: :py:obj:`register <matplotlib.animation.MovieWriterRegistry.register>`\ \(nombre\)

source: Decorator for registering a class under a name.
es_es: Decorador para registrar una clase bajo un nombre.

source: Parameters
es_es: Parámetros

source: Returns
es_es: Devuelve

source: Example use::
es_es: Ejemplo de uso::
