Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.markers.MarkerStyle.po
Languages: es_es

source: A class representing marker types.
es_es: Una clase que representa los tipos de marcadores.

source: Instances are immutable. If you need to change anything, create a new instance.
es_es: Las instancias son inmutables. Si necesitas cambiar algo, crea una nueva instancia.

source: Attributes
es_es: Atributos

source: list
es_es: lista

source: All known markers.
es_es: Todos los marcadores conocidos.

source: **filled_markers**
es_es: **marcadores**

source: All known filled markers. This is a subset of *markers*.
es_es: Todos los marcadores rellenados conocidos. Este es un subconjunto de *marcadores*.

source: **fillstyles**
es_es: **estilos de fill**

source: The supported fillstyles.
es_es: Los estilos de imagen soportados.

source: Parameters
es_es: Parámetros

source: str, array-like, Path, MarkerStyle, or None, default: None
es_es: str, tipo matriz, Path, MarkerStyle, o None, por defecto: Ninguno

source: Another instance of *MarkerStyle* copies the details of that ``marker``.
es_es: Otra instancia de *MarkerStyle* copia los detalles de ese ``marcador``.

source: *None* means no marker.
es_es: *nunca* significa que no hay marcador.

source: For other possible marker values see the module docstring `matplotlib.markers`.
es_es: Para otros posibles valores marcadores vea el módulo docstring `matplotlib.markers`.

source: str, default:
es_es: str, por defecto:

source: One of 'full', 'left', 'right', 'bottom', 'top', 'none'.
es_es: Uno de "full", "izquierda", "derecha", "abajo", "arriba", "ninguno".

source: Return a `.Path` for the alternate part of the marker.
es_es: Devuelve un `.Path` para la parte alternativa del marcador.

source: For unfilled markers, this is *None*; for filled markers, this is the area to be drawn with *markerfacecoloralt*.
es_es: Para los marcadores sin rellenar, esto es *nunca*; para los marcadores llenos, este es el área a ser dibujada con *markerfacecoloralt*.

source: Return the transform to be applied to the `.Path` from `MarkerStyle.get_alt_path()`.
es_es: Devuelve la transformación a aplicar al `.Path` desde `MarkerStyle.get_alt_path()`.

source: Return a `.Path` for the primary part of the marker.
es_es: Devuelve un `.Path` para la parte principal del marcador.

source: For unfilled markers this is the whole marker, for filled markers, this is the area to be drawn with *markerfacecolor*.
es_es: Para los marcadores sin rellenar este es el marcador completo, para los marcadores llenos, este es el área a ser dibujada con *markerfacecolor*.

source: Return the transform to be applied to the `.Path` from `MarkerStyle.get_path()`.
es_es: Devuelve la transformación que se aplicará al `.Path` desde `MarkerStyle.get_path()`.

source: Examples using ``matplotlib.markers.MarkerStyle``
es_es: Ejemplos usando ``matplotlib.markers.MarkerStyle``

source: Marker reference
es_es: Referencia del indicador

source: Mapping marker properties to multivariate data
es_es: Asignación de las propiedades de los marcadores a los datos multivariantes
