Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.step.po
Languages: es_es

source: Make a step plot.
es_es: Crear una parcela.

source: Call signatures::
es_es: Firma de llamadas::

source: This is just a thin wrapper around `.plot` which changes some formatting options. Most of the concepts and parameters of plot can be used here as well.
es_es: Esto es sólo un envoltorio delgado alrededor de `.plot` que cambia algunas opciones de formato. Aquí también se pueden utilizar la mayoría de los conceptos y parámetros del gráfico.

source: This method uses a standard plot with a step drawstyle: The *x* values are the reference positions and steps extend left/right/both directions depending on *where*.
es_es: Este método utiliza un gráfico estándar con un estilo de dibujo de pasos: Los valores *x* son las posiciones de referencia y los pasos extienden hacia la izquierda/derecha/ambas direcciones dependiendo de *donde*.

source: For the common case where you know the values and edges of the steps, use `~.Axes.stairs` instead.
es_es: Para el caso común donde conozcas los valores y bordes de los pasos, usa `~.Axes.stairs` en su lugar.

source: Parameters
es_es: Parámetros

source: 1D sequence of x positions. It is assumed, but not checked, that it is uniformly increasing.
es_es: Secuencia 1D de posiciones x. Se asume pero no se comprueba, que está aumentando uniformemente.

source: 1D sequence of y levels.
es_es: Secuencia 1D de los niveles y.

source: str, optional
es_es: str, opcional

source: A format string, e.g. 'g' for a green line. See `.plot` for a more detailed description.
es_es: Una cadena de formato, por ejemplo, 'g' para una línea verde. Ver `.plot` para una descripción más detallada.

source: Note: While full format strings are accepted, it is recommended to only specify the color. Line styles are currently ignored (use the keyword argument *linestyle* instead). Markers are accepted and plotted on the given positions, however, this is a rarely needed feature for step plots.
es_es: Nota: Aunque se aceptan cadenas de formato completo, se recomienda especificar sólo el color. Los estilos de línea se ignoran actualmente (utilice el argumento de palabra clave *linestyle* en su lugar). Los marcadores son aceptados y trazados en las posiciones dadas, sin embargo, esta es una característica raramente necesaria para las parcelas de pasos.

source: **where**
es_es: **dónde**

source: Define where the steps should be placed:
es_es: Define dónde deben colocarse los pasos:

source: 'pre': The y value is continued constantly to the left from every *x* position, i.e. the interval ``(x[i-1], x[i]]`` has the value ``y[i]``.
es_es: 'pre': El valor y se continúa constantemente a la izquierda desde cada posición *x*, i. . el intervalo ``(x[i-1], x[i]]`` tiene el valor ``y[i]``.

source: 'post': The y value is continued constantly to the right from every *x* position, i.e. the interval ``[x[i], x[i+1])`` has the value ``y[i]``.
es_es: 'post': El valor y se continúa constantemente a la derecha desde cada posición *x*, i. . el intervalo ``[x[i], x[i+1])`` tiene el valor ``y[i]``.

source: 'mid': Steps occur half-way between the *x* positions.
es_es: 'mid': Los pasos ocurren a mitad de camino entre las posiciones *x*.

source: An object with labelled data. If given, provide the label names to plot in *x* and *y*.
es_es: Un objeto con datos etiquetados. Si es dado, proporcione los nombres de las etiquetas para trazar en *x* y *y*.

source: Additional parameters are the same as those for `.plot`.
es_es: Los parámetros adicionales son los mismos que los de `.plot`.

source: Returns
es_es: Devuelve

source: list of `.Line2D`
es_es: lista de `.Line2D`

source: Objects representing the plotted data.
es_es: Objetos que representan los datos trazados.

source: Examples using ``matplotlib.pyplot.step``
es_es: Ejemplos usando ``matplotlib.pyplot.step``

source: Stairs Demo
es_es: Demo de escaleras

source: Step Demo
es_es: Demo del escalón
