Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.colors.from_levels_and_colors.po
Languages: es_es

source: matplotlib.colors.from\_levels\_and\_colors
es_es: matplotlib.colors.from\_levels\_y\_colors

source: A helper routine to generate a cmap and a norm instance which behave similar to contourf's levels and colors arguments.
es_es: Una rutina auxiliar para generar un cmap y una instancia de la norma que se comportan de forma similar a los niveles y colores de contorno.

source: Parameters
es_es: Parámetros

source: **levels**
es_es: **Niveles**

source: sequence of numbers
es_es: secuencia de números

source: The quantization levels used to construct the `BoundaryNorm`. Value ``v`` is quantized to level ``i`` if ``lev[i] <= v < lev[i+1]``.
es_es: Los niveles de cuantificación utilizados para construir el `BoundaryNorm`. El valor ``v`` se cuantifica al nivel ``i`` si ``lev[i] <= v < lev[i+1]``.

source: **colors**
es_es: **colores**

source: sequence of colors
es_es: secuencia de colores

source: The fill color to use for each level. If *extend* is "neither" there must be ``n_level - 1`` colors. For an *extend* of "min" or "max" add one extra color, and for an *extend* of "both" add two colors.
es_es: El color de relleno a usar para cada nivel. Si *extende* es "dos" debe haber colores ``n_level - 1``. Para una *extensión* de "min" o "max" añadir un color extra, y para una *extensión* de "ambos" añadir dos colores.

source: **extend**
es_es: **extensión**

source: {'neither', 'min', 'max', 'both'}, optional
es_es: {'ninguno de los dos', 'min', 'max', 'ambos'}, opcional

source: The behaviour when a value falls out of range of the given levels. See `~.Axes.contourf` for details.
es_es: El comportamiento cuando un valor cae fuera del rango de los niveles dados. Vea `~.Axes.contourf` para detalles.

source: Returns
es_es: Devuelve

source: **norm** : `~matplotlib.colors.Colormap`
es_es: **norma** : `~matplotlib.colors.Colormap`
