Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.figure.po
Languages: es_es

source: Create a new figure, or activate an existing figure.
es_es: Crear una nueva figura, o activar una figura existente.

source: Parameters
es_es: Parámetros

source: **num** : int or str or `.Figure`, optional
es_es: **num** : int o str o `.Figure`, opcional

source: int or str or
es_es: int o str o

source: A unique identifier for the figure.
es_es: Un identificador único para la figura.

source: If a figure with that identifier already exists, this figure is made active and returned. An integer refers to the ``Figure.number`` attribute, a string refers to the figure label.
es_es: Si ya existe una figura con ese identificador, esta cifra se activa y se devuelve. Un entero se refiere al atributo ``Figure.number``, una cadena se refiere a la etiqueta de la figura.

source: If there is no figure with the identifier or *num* is not given, a new figure is created, made active and returned. If *num* is an int, it will be used for the ``Figure.number`` attribute, otherwise, an auto-generated integer value is used (starting at 1 and incremented for each new figure). If *num* is a string, the figure label and the window title is set to this value.
es_es: Si no hay una figura con el identificador o *num* no es dada, se crea una nueva figura, se activa y se regresa. Si *num* es un int, se utilizará para el ``Figure. atributo umber``` de lo contrario, se utiliza un valor entero generado automáticamente (a partir de 1 y incrementado para cada nueva figura). Si *num* es una cadena, la etiqueta de la figura y el título de la ventana se ajusta a este valor.

source: **figsize** : (float, float), default: :rc:`figure.figsize`
es_es: **figsize** : (float, float), por defecto: :rc:`figure.figsize`

source: Width, height in inches.
es_es: Anchura, altura en pulgadas.

source: **dpi** : float, default: :rc:`figure.dpi`
es_es: **dpi** : float, por defecto: :rc:`figure.dpi`

source: float, default:
es_es: flotante, por defecto:

source: The resolution of the figure in dots-per-inch.
es_es: La resolución de la figura en los puntos perinchos.

source: **facecolor** : color, default: :rc:`figure.facecolor`
es_es: **facecolor** : color, por defecto: :rc:`figure.facecolor`

source: color, default:
es_es: color, por defecto:

source: The background color.
es_es: El color de fondo.

source: **edgecolor** : color, default: :rc:`figure.edgecolor`
es_es: **borde** : color, por defecto: :rc:`figure.edgecolor`

source: The border color.
es_es: El color de la frontera.

source: bool, default: True
es_es: bool, por defecto: True

source: If False, suppress drawing the figure frame.
es_es: Si False, reprime el cuadro de dibujo.

source: **FigureClass** : subclass of `~matplotlib.figure.Figure`
es_es: **FigureClass** : subclase de `~matplotlib.figure.Figure`

source: subclass of
es_es: subclase de

source: Optionally use a custom `.Figure` instance.
es_es: Opcionalmente use una instancia personalizada de `.Figure`.

source: **clear**
es_es: **limpiar**

source: bool, default: False
es_es: bool, por defecto: False

source: If True and the figure already exists, then it is cleared.
es_es: Si es verdad y la cifra ya existe, entonces se borra.

source: **tight_layout** : bool or dict, default: :rc:`figure.autolayout`
es_es: **tight_layout** : bool o dict, por defecto: :rc:`figure.autolayout`

source: bool or dict, default:
es_es: libro o diccionario, por defecto:

source: If ``False`` use *subplotpars*. If ``True`` adjust subplot parameters using `.tight_layout` with default padding. When providing a dict containing the keys ``pad``, ``w_pad``, ``h_pad``, and ``rect``, the default `.tight_layout` paddings will be overridden.
es_es: Si ``False`` usa *subplotpars*. Si ``True`` ajusta los parámetros de subplot usando `.tight_layout` con el relleno predeterminado. Al proporcionar un dictado que contenga las claves ``pad``, ``w_pad``, ``h_pad``, y ``rect``, los repuestos por defecto `.tight_layout` serán anulados.

source: If ``True`` use constrained layout to adjust positioning of plot elements. Like ``tight_layout``, but designed to be more flexible. See :doc:`/tutorials/intermediate/constrainedlayout_guide` for examples. (Note: does not work with `add_subplot` or `~.pyplot.subplot2grid`.)
es_es: Si ``True`` usa un diseño restringido para ajustar la posición de los elementos de la gráfica. Como ``tight_layout``, pero diseñado para ser más flexible. Vea :doc:`/tutorials/intermediate/constrainedlayout_guide` para ejemplos. (Nota: no funciona con `add_subplot` o `~.pyplot.subplot2grid`.)

source: optional
es_es: opcional

source: See `~.matplotlib.figure.Figure` for other possible arguments.
es_es: Vea `~.matplotlib.figure.Figure` para otros argumentos posibles.

source: Returns
es_es: Devuelve

source: The `.Figure` instance returned will also be passed to new_figure_manager in the backends, which allows to hook custom `.Figure` classes into the pyplot interface. Additional kwargs will be passed to the `.Figure` init function.
es_es: La instancia `.Figure` devuelta también se pasará a new_figure_manager en los backends, lo que permite enganchar personalizado `. clases de igure` en la interfaz de pyplot. Los kwargs adicionales serán pasados a la función init `.Figure`.

source: If you are creating many figures, make sure you explicitly call `.pyplot.close` on the figures you are not using, because this will enable pyplot to properly clean up the memory.
es_es: Si estás creando muchas figuras, asegúrate de llamar explícitamente a `.pyplot. perder` en las cifras que no está usando, porque esto permitirá a pyplot limpiar adecuadamente la memoria.

source: `~matplotlib.rcParams` defines the default values, which can be modified in the matplotlibrc file.
es_es: `~matplotlib.rcParams` define los valores por defecto, que pueden ser modificados en el archivo matplotlibrc.

source: Examples using ``matplotlib.pyplot.figure``
es_es: Ejemplos usando ``matplotlib.pyplot.figure``

source: Frame grabbing
es_es: Agarre de fotogramas

source: Interactive functions
es_es: Funciones interactivas

source: Hyperlinks
es_es: Hipervínculos

source: Rotating a 3D plot
es_es: Rotación de un gráfico 3D

source: Rotating 3D wireframe plot
es_es: Rotación de la trama de alambre 3D

source: SVG Histogram
es_es: Histograma SVG

source: Tool Manager
es_es: Administrador de herramientas
