Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.secondary_yaxis.po
Languages: es_es

source: matplotlib.axes.Axes.secondary\_yaxis
es_es: matplotlib.axes.Ejes.secundario\_yaxis

source: Add a second y-axis to this Axes.
es_es: Agrega un segundo eje Y a este eje.

source: For example if we want to have a second scale for the data plotted on the yaxis.
es_es: Por ejemplo, si queremos tener una segunda escala para los datos trazados en la yaxis.

source: Parameters
es_es: Parámetros

source: **location**
es_es: **ubicación**

source: {'top', 'bottom', 'left', 'right'} or float
es_es: {'arriba', 'abajo', 'izquierda', 'derecha'} o flotante

source: The position to put the secondary axis. Strings can be 'top' or 'bottom' for orientation='x' and 'right' or 'left' for orientation='y'. A float indicates the relative position on the parent axes to put the new axes, 0.0 being the bottom (or left) and 1.0 being the top (or right).
es_es: La posición para poner el eje secundario. Las cadenas pueden ser 'arriba' o 'abajo' para orientación='x' y 'derecha' o 'izquierda' para orientación='y'. Un flotante indica la posición relativa en los ejes superiores para colocar los ejes nuevos, 0. siendo la parte inferior (o izquierda) y 1.0 siendo la parte superior (o derecha).

source: **functions**
es_es: **funciones**

source: 2-tuple of func, or Transform with an inverse
es_es: 2-tupla de función, o transformarse con un inverso

source: If a 2-tuple of functions, the user specifies the transform function and its inverse. i.e. ``functions=(lambda x: 2 / x, lambda x: 2 / x)`` would be an reciprocal transform with a factor of 2.
es_es: Si un 2-tuple de funciones, el usuario especifica la función de transformación y su inversa. ``functions=(lambda x: 2 / x, lambda x: 2 / x)`` sería una transformación reciproca con un factor de 2.

source: The user can also directly supply a subclass of `.transforms.Transform` so long as it has an inverse.
es_es: El usuario también puede proporcionar directamente una subclase de `.transforms.Transform` siempre y cuando tenga una inversión.

source: See :doc:`/gallery/subplots_axes_and_figures/secondary_axis` for examples of making these conversions.
es_es: Vea :doc:`/gallery/subplots_axes_and_figures/secondary_axis` para ver ejemplos de hacer estas conversiones.

source: Returns
es_es: Devuelve

source: **ax**
es_es: **ej**

source: axes._secondary_axes.SecondaryAxis
es_es: ejes._secundario_ejes.Eje secundario

source: Other Parameters
es_es: Otros Parámetros

source: **\*\*kwargs** : `~matplotlib.axes.Axes` properties.
es_es: **\*\*kwargs** : propiedades `~matplotlib.axes.Axes`.

source: Axes properties.
es_es: Propiedades de ejes.

source: Other miscellaneous axes parameters.
es_es: Otros ejes diversos parámetros.

source: This method is experimental as of 3.1, and the API may change.
es_es: Este método es experimental a partir de 3.1, y la API puede cambiar.

source: Examples
es_es: Ejemplos

source: Add a secondary Axes that converts from radians to degrees
es_es: Agrega un eje secundario que se convierte de radianes a grados

source: (`Source code <../../api/_as_gen/matplotlib-axes-Axes-secondary_yaxis-1.py>`__, `png <../../api/_as_gen/matplotlib-axes-Axes-secondary_yaxis-1.png>`__, `pdf <../../api/_as_gen/matplotlib-axes-Axes-secondary_yaxis-1.pdf>`__)
es_es: (`Código fuente <../../api/_as_gen/matplotlib-axes-Axes-secondary_yaxis-1.py>`__, `png <../../api/_as_gen/matplotlib-axes-Axes-secondary_yaxis-1.png>`__, `pdf <../../api/_as_gen/matplotlib-axes-Axes-secondary_yaxis-1.pdf>`__)

source: Examples using ``matplotlib.axes.Axes.secondary_yaxis``
es_es: Ejemplos usando ``matplotlib.axes.Axes.secondary_yaxis``

source: Secondary Axis
es_es: Eje secundario
