Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.xcorr.po
Languages: es_es

source: Plot the cross correlation between *x* and *y*.
es_es: Trazar la correlación cruzada entre *x* y *y*.

source: The correlation with lag k is defined as :math:`\sum_n x[n+k] \cdot y^*[n]`, where :math:`y^*` is the complex conjugate of :math:`y`.
es_es: La correlación con lag k se define como :math:`\sum_n x[n+k] \cdot y^*[n]`, donde :math:`y^*` es la conjugada compleja de :math:`y`.

source: Parameters
es_es: Parámetros

source: array-like of length n
es_es: array-like de longitud n

source: **detrend** : callable, default: `.mlab.detrend_none` (no detrending)
es_es: **detrend** : llamable, por defecto: `.mlab.detrend_none ` (sin dañar)

source: callable, default:
es_es: llamable, predeterminado:

source: A detrending function applied to *x* and *y*. It must have the signature ::
es_es: Una función perjudicial aplicada a *x* y *y*. Debe tener la firma ::

source: **normed**
es_es: **nordió**

source: bool, default: True
es_es: bool, por defecto: True

source: If ``True``, input vectors are normalised to unit length.
es_es: Si es ``True``, los vectores de entrada se normalizan para la longitud unida.

source: Determines the plot style.
es_es: Determina el estilo de la parcela.

source: If ``True``, vertical lines are plotted from 0 to the xcorr value using `.Axes.vlines`. Additionally, a horizontal line is plotted at y=0 using `.Axes.axhline`.
es_es: Si es ``True``, las líneas verticales se trazan de 0 al valor xcorr usando `.Axes.vlines`. Además, una línea horizontal se traza en y=0 usando `.Axes.axhline`.

source: If ``False``, markers are plotted at the xcorr values using `.Axes.plot`.
es_es: Si es ``False``, los marcadores son trazados en los valores de xcorr usando `.Axes.plot`.

source: int, default: 10
es_es: int, por defecto: 10

source: Number of lags to show. If None, will return all ``2 * len(x) - 1`` lags.
es_es: Número de marcas a mostrar. Si Ninguna, devolverá todos ``2 * len(x) - 1`` retrasos.

source: Returns
es_es: Devuelve

source: **lags** : array (length ``2*maxlags+1``)
es_es: **retraso** : array (longitud ``2*maxlags+1``)

source: array (length
es_es: array (longitud

source: The lag vector.
es_es: El vector de retraso.

source: **c** : array (length ``2*maxlags+1``)
es_es: **c** : array (longitud ``2*maxlags+1``)

source: array (length
es_es: array (longitud

source: The auto correlation vector.
es_es: El vector de la correlación automática.

source: **line** : `.LineCollection` or `.Line2D`
es_es: **línea** : `.LineCollection` o `.Line2D`

source: LineCollection or Line2D
es_es: LineCollection o Line2D

source: `.Artist` added to the Axes of the correlation:
es_es: `.Artist` añadido a los ejes de la correlación:

source: `.LineCollection` if *usevlines* is True.
es_es: `.LineCollection` si *usevlines* es True.

source: `.Line2D` if *usevlines* is False.
es_es: `.Line2D` si *usevlines* es False.

source: **b** : `.Line2D` or None
es_es: **b** : `.Line2D` o Ninguno

source: Line2D or None
es_es: Line2D o ninguno

source: Horizontal line at 0 if *usevlines* is True None *usevlines* is False.
es_es: Línea horizontal en 0 si *usevlines* es True None *usevlines* es False.

source: Other Parameters
es_es: Otros Parámetros

source: **linestyle** : `.Line2D` property, optional
es_es: **linestyle** : propiedad `.Line2D`, opcional

source: Line2D property, optional
es_es: Propiedad Line2D, opcional

source: The linestyle for plotting the data points. Only used if *usevlines* is ``False``.
es_es: El estilo de línea para trazar los puntos de datos. Sólo se utiliza si *usevlines* es ``False``.

source: str, default: 'o'
es_es: str, por defecto: 'o'

source: The marker for plotting the data points. Only used if *usevlines* is ``False``.
es_es: El marcador para trazar los puntos de datos. Sólo se utiliza si *usevlines* es ``False``.

source: If given, the following parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception):
es_es: Si se dan, los siguientes parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción):

source: Additional parameters are passed to `.Axes.vlines` and `.Axes.axhline` if *usevlines* is ``True``; otherwise they are passed to `.Axes.plot`.
es_es: Los parámetros adicionales se pasan a `.Axes.vlines` y `.Axes.axhline` si *usevlines* es ``True``; de lo contrario se pasan a `.Axes.plot`.

source: The cross correlation is performed with `numpy.correlate` with ``mode = "full"``.
es_es: La correlación cruzada se realiza con `numpy.correlate` con ``mode = "full"``.

source: Examples using ``matplotlib.axes.Axes.xcorr``
es_es: Ejemplos usando ``matplotlib.axes.Axes.xcorr``

source: Cross- and Auto-Correlation Demo
es_es: Demo de correlación cruzada y automática
