Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.hist2d.po
Languages: es_es

source: Make a 2D histogram plot.
es_es: Crea un histograma 2D.

source: Parameters
es_es: Parámetros

source: array-like, shape (n, )
es_es: estilo matriz (n, )

source: **bins**
es_es: **Papelas**

source: None or int or [int, int] or array-like or [array, array]
es_es: Ninguno o int o [int, int] o matriz similar o [array, array]

source: The bin specification:
es_es: La especificación de la papelera:

source: If int, the number of bins for the two dimensions (nx=ny=bins).
es_es: Si int, el número de cubos para las dos dimensiones (nx=ny=bins).

source: If ``[int, int]``, the number of bins in each dimension (nx, ny = bins).
es_es: Si ``[int, int]``, el número de contenedores en cada dimensión (nx, ny = bins).

source: If array-like, the bin edges for the two dimensions (x_edges=y_edges=bins).
es_es: Si es como array, los bordes de la papelera para las dos dimensiones (x_edges=y_edges=bins).

source: If ``[array, array]``, the bin edges in each dimension (x_edges, y_edges = bins).
es_es: Si ``[array, array]``, los bordes de la bin en cada dimensión (x_edges, y_edges = bins).

source: The default value is 10.
es_es: El valor por defecto es 10.

source: array-like shape(2, 2), optional
es_es: forma(2, 2), opcional

source: The leftmost and rightmost edges of the bins along each dimension (if not specified explicitly in the bins parameters): ``[[xmin, xmax], [ymin, ymax]]``. All values outside of this range will be considered outliers and not tallied in the histogram.
es_es: Los bordes más izquierdos y rectos de los contenedores a lo largo de cada dimensión (si no se especifica explícitamente en los parámetros de contenidos): ``[[xmin, xmax], [ymin, ymax]]``. Todos los valores fuera de este rango serán considerados atípicos y no contabilizados en el histograma.

source: **density**
es_es: **densidad**

source: bool, default: False
es_es: bool, por defecto: False

source: Normalize histogram. See the documentation for the *density* parameter of `~.Axes.hist` for more details.
es_es: Normaliza el histograma de la documentación. Para más detalles, consulta el parámetro *densidad* de `~.Axes.nb`.

source: **weights**
es_es: **Pesos**

source: array-like, shape (n, ), optional
es_es: opcional (n), forma (n)

source: An array of values w_i weighing each sample (x_i, y_i).
es_es: Un array de valores con el peso de cada muestra (x_i, y_i).

source: All bins that has count less than *cmin* or more than *cmax* will not be displayed (set to NaN before passing to imshow) and these count values in the return value count histogram will also be set to nan upon return.
es_es: No se mostrarán todos los contenedores que hayan contado menos de *cmin* o más de *cmax* (ajustados a NaN antes de pasar a imshow) y estos valores en el recuento de valores retornados del histograma también se establecerán en nan cuando regrese.

source: Returns
es_es: Devuelve

source: 2D array
es_es: Arreglo 2D

source: The bi-dimensional histogram of samples x and y. Values in x are histogrammed along the first dimension and values in y are histogrammed along the second dimension.
es_es: El histograma bidimensional de muestras x y y. Los valores en x son histogramados a lo largo de la primera dimensión y los valores en y son histogramados a lo largo de la segunda dimensión.

source: 1D array
es_es: Matriz 1D

source: The bin edges along the x axis.
es_es: Los bordes de la basura a lo largo del eje x.

source: The bin edges along the y axis.
es_es: Los bordes de la basura a lo largo del eje y.

source: **image** : `~.matplotlib.collections.QuadMesh`
es_es: **imagen** : `~.matplotlib.collections.QuadMesh`

source: Other Parameters
es_es: Otros Parámetros

source: Colormap or str, optional
es_es: Colormap o str, opcional

source: A `.colors.Colormap` instance. If not set, use rc settings.
es_es: Una instancia `.colors.Colormap`. Si no se establece, utilice la configuración de rc.

source: Normalize, optional
es_es: Normalizar, opcional

source: A `.colors.Normalize` instance is used to scale luminance data to ``[0, 1]``. If not set, defaults to `.colors.Normalize()`.
es_es: Una instancia `.colors.Normalize` se utiliza para escalar los datos de luminancia a ``[0, 1]``. Si no se establece, por defecto a `.colors.Normalize()`.

source: None or scalar, optional
es_es: Ninguno o escalar, opcional

source: Arguments passed to the `~.colors.Normalize` instance.
es_es: Argumentos pasados a la instancia `~.colors.Normalize`.

source: **alpha** : ``0 <= scalar <= 1`` or ``None``, optional
es_es: **alfa** : ``0 <= escalar <= 1`` o ``Ninguno``, opcional

source: 0 <= scalar <= 1 or None, optional
es_es: 0 <= escalar <= 1 o ninguno, opcional

source: The alpha blending value.
es_es: El valor de mezcla alfa.

source: If given, the following parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception):
es_es: Si se dan, los siguientes parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción):

source: *x*, *y*, *weights*
es_es: *x*, *y*, *pesos*

source: Additional parameters are passed along to the `~.Axes.pcolormesh` method and `~matplotlib.collections.QuadMesh` constructor.
es_es: Se pasan parámetros adicionales al método `~.Axes.pcolormesh` y al constructor `~matplotlib.collections.QuadMesh`.

source: :obj:`hist`
es_es: :obj:`Expansión`

source: 1D histogram plotting
es_es: Dibujo de histogramas 1D

source: 2D histogram with hexagonal bins
es_es: Histograma 2D con contenedores hexagonales

source: Currently ``hist2d`` calculates its own axis limits, and any limits previously set are ignored.
es_es: En la actualidad, ``Succes2d`` calcula sus propios límites de eje, y cualquier límite previamente establecido se ignora.

source: Rendering the histogram with a logarithmic color scale is accomplished by passing a `.colors.LogNorm` instance to the *norm* keyword argument. Likewise, power-law normalization (similar in effect to gamma correction) can be accomplished with `.colors.PowerNorm`.
es_es: Renderizar el histograma con una escala de color logarítmica se logra pasando una instancia `.colors.LogNorm` al argumento de la palabra clave *normal*. De la misma manera, la normalización de la ley del poder (similar en efecto a la corrección gamma) puede ser completada con `.colors.PowerNorm`.

source: Examples using ``matplotlib.axes.Axes.hist2d``
es_es: Ejemplos usando ``matplotlib.axes.Axes.Text2d``

source: Histograms
es_es: Histogramas

source: Exploring normalizations
es_es: Explorar las normalizaciones
