Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.matshow.po
Languages: es_es

source: Plot the values of a 2D matrix or array as color-coded image.
es_es: Trazar los valores de una matriz 2D o matriz como imagen codificada por color.

source: The matrix will be shown the way it would be printed, with the first row at the top. Row and column numbering is zero-based.
es_es: La matriz se mostrará de la forma en que se imprimiría, con la primera fila en la parte superior.

source: Parameters
es_es: Parámetros

source: (M, N) array-like
es_es: (M, N) matriz

source: The matrix to be displayed.
es_es: La matriz a mostrar.

source: Returns
es_es: Devuelve

source: Other Parameters
es_es: Otros Parámetros

source: More general function to plot data on a 2D regular raster.
es_es: Función más general para graficar datos en un rastro regular 2D.

source: This is just a convenience function wrapping `.imshow` to set useful defaults for displaying a matrix. In particular:
es_es: Esta es sólo una función de conveniencia envolviendo `.imshow` para establecer valores predeterminados útiles para mostrar una matriz. En particular:

source: Set ``origin='upper'``.
es_es: Establecer ``origin='upper'``.

source: Set ``interpolation='nearest'``.
es_es: Establecer ``interpolation='nearest'``.

source: Set ``aspect='equal'``.
es_es: Establecer ``aspect='equal'``.

source: Ticks are placed to the left and above.
es_es: Los trucos se colocan a la izquierda y arriba.

source: Ticks are formatted to show integer indices.
es_es: Ticks están formateados para mostrar índices enteros.
