Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.triplot.po
Languages: es_es

source: Draw a unstructured triangular grid as lines and/or markers.
es_es: Dibuja una cuadrícula triangular no estructurada como líneas y/o marcadores.

source: The triangulation to plot can be specified in one of two ways; either::
es_es: La triangulación de la trama puede especificarse de una de dos maneras; o bien ::

source: where triangulation is a `.Triangulation` object, or
es_es: donde la triangulación es un objeto de `.triangulación`, o

source: in which case a Triangulation object will be created. See `.Triangulation` for a explanation of these possibilities.
es_es: en cuyo caso se creará un objeto de triangulación. Ver `.Triangulación` para una explicación de estas posibilidades.

source: The remaining args and kwargs are the same as for `~.Axes.plot`.
es_es: Los argumentos restantes y kwargs son los mismos que para `~.Axes.plot`.

source: Returns
es_es: Devuelve

source: The drawn triangles edges.
es_es: Los bordes triángulos dibujados.

source: The drawn marker nodes.
es_es: Los nodos marcadores dibujados.

source: Examples using ``matplotlib.axes.Axes.triplot``
es_es: Ejemplos usando ``matplotlib.axes.Axes.triplot``

source: Trifinder Event Demo
es_es: Demostración de eventos de Trifinder
