Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axis.Axis.set_major_formatter.po
Languages: es_es

source: matplotlib.axis.Axis.set\_major\_formatter
es_es: formato matplotlib.axis.Axis.set\_mayor\_formatter

source: Set the formatter of the major ticker.
es_es: Establece el formateador del ticker principal.

source: In addition to a `~matplotlib.ticker.Formatter` instance, this also accepts a ``str`` or function.
es_es: Además de una instancia `~matplotlib.ticker.Formatter`, esto también acepta una ``str`` o función.

source: For a ``str`` a `~matplotlib.ticker.StrMethodFormatter` is used. The field used for the value must be labeled ``'x'`` and the field used for the position must be labeled ``'pos'``. See the `~matplotlib.ticker.StrMethodFormatter` documentation for more information.
es_es: Para un ``str`` se usa un `~matplotlib.ticker.StrMethodFormatter`. El campo usado para el valor debe ser etiquetado como ``'x'`` y el campo usado para la posición debe ser etiquetado ``'pos'``. Vea la documentación `~matplotlib.ticker.StrMethodFormatter` para más información.

source: For a function, a `~matplotlib.ticker.FuncFormatter` is used. The function must take two inputs (a tick value ``x`` and a position ``pos``), and return a string containing the corresponding tick label. See the `~matplotlib.ticker.FuncFormatter` documentation for more information.
es_es: Para una función, se usa un `~matplotlib.ticker.FuncFormatter`. La función debe tomar dos entradas (un valor de tick ``x`` y una posición ``pos``), y devolver una cadena que contenga la etiqueta correspondiente de tick. Vea la documentación `~matplotlib.ticker.FuncFormatter` para más información.

source: Parameters
es_es: Parámetros

source: **formatter** : `~matplotlib.ticker.Formatter`, ``str``, or function
es_es: **formateador** : `~matplotlib.ticker.Formatter`, ``str``, o función

source: Formatter, str, or function
es_es: Formato, str, o función

source: Examples using ``matplotlib.axis.Axis.set_major_formatter``
es_es: Ejemplos usando ``matplotlib.axis.Axis.set_major_formatter``

source: Date tick labels
es_es: Etiquetas de los marcadores de fecha

source: Custom tick formatter for time series
es_es: Formateador de marcadores personalizado para series temporales

source: Custom Ticker1
es_es: Ticker1 personalizado

source: Date Index Formatter
es_es: Formateador de índices de fechas

source: Basic Usage
es_es: Uso básico

source: Artist tutorial
es_es: Tutorial de artistas

source: Text in Matplotlib Plots
es_es: Texto en los gráficos de Matplotlib
