Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.autoscale_view.po
Languages: es_es

source: matplotlib.axes.Axes.autoscale\_view
es_es: matplotlib.axes.Ejes.autoescalar\_ver

source: Autoscale the view limits using the data limits.
es_es: Autoescalar los límites de la vista usando los límites de datos.

source: Parameters
es_es: Parámetros

source: **tight**
es_es: **endurecido**

source: bool or None
es_es: bool o None

source: If *True*, only expand the axis limits using the margins. Note that unlike for `autoscale`, ``tight=True`` does *not* set the margins to zero.
es_es: Si es *True*, solo expande los límites del eje usando los márgenes. Tenga en cuenta que a diferencia de `autoscale`, ``tight=True`` *no* establece los márgenes a cero.

source: If *False* and :rc:`axes.autolimit_mode` is 'round_numbers', then after expansion by the margins, further expand the axis limits using the axis major locator.
es_es: Si *False* y :rc:`axes.autolimit_mode` es 'round_numbers', luego después de la expansión por los marginos, expande aún más los límites del eje utilizando el localizador principal del eje.

source: If None (the default), reuse the value set in the previous call to `autoscale_view` (the initial value is False, but the default style sets :rc:`axes.autolimit_mode` to 'data', in which case this behaves like True).
es_es: Si Ninguno (el predeterminado), reutilice el valor establecido en la llamada anterior a `autoscale_view` (el valor inicial es False, pero el estilo predeterminado establece :rc:`ejes. utolimit_mode` a 'data', en cuyo caso esto se comporta como True).

source: bool, default: True
es_es: bool, por defecto: True

source: Whether to autoscale the x axis.
es_es: Autoescalar el eje x.

source: **scaley**
es_es: **escala**

source: Whether to autoscale the y axis.
es_es: Autoescalar el eje y.

source: The autoscaling preserves any preexisting axis direction reversal.
es_es: El autoescalado conserva cualquier dirección de eje preexistente inversa.

source: The data limits are not updated automatically when artist data are changed after the artist has been added to an Axes instance. In that case, use :meth:`matplotlib.axes.Axes.relim` prior to calling autoscale_view.
es_es: Los límites de datos no se actualizan automáticamente cuando los datos del artista se cambian después de que el artista haya sido añadido a una instancia de Ejes. En ese caso, use :meth:`matplotlib.axes.Axes.relim` antes de llamar a autoscale_view.

source: If the views of the Axes are fixed, e.g. via `set_xlim`, they will not be changed by autoscale_view(). See :meth:`matplotlib.axes.Axes.autoscale` for an alternative.
es_es: Si las vistas de los ejes son corregidas, por ejemplo, a través de `set_xlim`, no serán cambiadas por autoscale_view(). Vea :meth:`matplotlib.axes.Axes.autoscale` para una alternativa.

source: Examples using ``matplotlib.axes.Axes.autoscale_view``
es_es: Ejemplos usando ``matplotlib.axes.Axes.autoscale_view``

source: Line, Poly and RegularPoly Collection with autoscaling
es_es: Colección de líneas, polígonos y polígonos regulares con autoescalado

source: Ellipse Collection
es_es: Colección Ellipse

source: Autoscaling
es_es: Autoescalado
