Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.xticks.po
Languages: es_es

source: Get or set the current tick locations and labels of the x-axis.
es_es: Obtener o establecer las ubicaciones y etiquetas actuales del eje x.

source: Pass no arguments to return the current values without modifying them.
es_es: Pasar ningún argumento para devolver los valores actuales sin modificarlos.

source: Parameters
es_es: Parámetros

source: array-like, optional
es_es: tipo arreglo, opcional

source: The list of xtick locations. Passing an empty list removes all xticks.
es_es: La lista de ubicaciones xtick. Pasar una lista vacía elimina todos los xticks.

source: The labels to place at the given *ticks* locations. This argument can only be passed if *ticks* is passed as well.
es_es: Las etiquetas a colocar en las ubicaciones de *ticks* dadas. Este argumento sólo se puede pasar si también se pasan *ticks*.

source: `.Text` properties can be used to control the appearance of the labels.
es_es: Las propiedades `.Text` se pueden utilizar para controlar la apariencia de las etiquetas.

source: Returns
es_es: Devuelve

source: The list of xtick locations.
es_es: La lista de ubicaciones xtick.

source: labels
es_es: etiquetas

source: The list of xlabel `.Text` objects.
es_es: La lista de objetos xlabel `.Text`.

source: Calling this function with no arguments (e.g. ``xticks()``) is the pyplot equivalent of calling `~.Axes.get_xticks` and `~.Axes.get_xticklabels` on the current axes. Calling this function with arguments is the pyplot equivalent of calling `~.Axes.set_xticks` and `~.Axes.set_xticklabels` on the current axes.
es_es: Llamar a esta función sin argumentos (por ejemplo, ``xticks()``) es el equivalente a pyplot de llamar a `~.Axes.get_xticks` y `~.Axes.get_xticklabels` en los ejes actuales. Llamar a esta función con argumentos es el equivalente pyplot de llamar a `~.Axes.set_xticks` y `~.Axes.set_xticklabels` en los ejes actuales.

source: Examples
es_es: Ejemplos

source: Examples using ``matplotlib.pyplot.xticks``
es_es: Ejemplos usando ``matplotlib.pyplot.xticks``

source: Secondary Axis
es_es: Eje secundario

source: Table Demo
es_es: Demostración de la tabla

source: Rotating custom tick labels
es_es: Rotación de las etiquetas de los marcadores personalizados
