Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axes.Axes.bxp.po
Languages: es_es

source: Drawing function for box and whisker plots.
es_es: Función de dibujo para parcelas de caja y whisker.

source: Make a box and whisker plot for each column of *x* or each vector in sequence *x*. The box extends from the lower to upper quartile values of the data, with a line at the median. The whiskers extend from the box to show the range of the data. Flier points are those past the end of the whiskers.
es_es: Crea un cuadro y una gráfica de whisker para cada columna de *x* o cada vector en secuencia *x*. El cuadro se extiende desde los valores del cuartil inferior hasta el superior de los datos, con una línea en la mediana. Los whiskers se extienden desde la caja para mostrar el rango de los datos.

source: Parameters
es_es: Parámetros

source: list of dicts
es_es: lista de dictos

source: A list of dictionaries containing stats for each boxplot. Required keys are:
es_es: Una lista de diccionarios que contienen estadísticas para cada boxplot. Las claves requeridas son:

source: ``med``: Median (scalar).
es_es: ``med``: mediano (escalar).

source: ``q1``, ``q3``: First & third quartiles (scalars).
es_es: ``q1``, ``q3``: Primer y tercer cuartiles (escalares).

source: ``whislo``, ``whishi``: Lower & upper whisker positions (scalars).
es_es: ``whislo``, ``whishi``: Bajas y posiciones superiores de whisker (escalares).

source: Optional keys are:
es_es: Las claves opcionales son:

source: ``mean``: Mean (scalar). Needed if ``showmeans=True``.
es_es: ``mean``: Media (escalar). Necesario si ``showmeans=True``.

source: ``fliers``: Data beyond the whiskers (array-like). Needed if ``showfliers=True``.
es_es: ``fliers``: Datos más allá de los whiskers (array-like). Necesario si ``showfliers=True``.

source: ``cilo``, ``cihi``: Lower & upper confidence intervals about the median. Needed if ``shownotches=True``.
es_es: ``cilo``, ``cihi``: Intervalos de confianza bajos y superiores sobre la mediana. Necesario si ``shownotches=True``.

source: ``label``: Name of the dataset (str). If available, this will be used a tick label for the boxplot
es_es: ``Etiqueta``: Nombre del conjunto de datos (str). Si está disponible, se utilizará una etiqueta de marca para el boxplot

source: **positions**
es_es: **posiciones**

source: The positions of the boxes. The ticks and limits are automatically set to match the positions.
es_es: Las posiciones de las casillas. Los ticks y los límites se ajustan automáticamente para que coincidan con las posiciones.

source: float or array-like, default: None
es_es: flotante o tipo matriz: Ninguno

source: The widths of the boxes. The default is ``clip(0.15*(distance between extreme positions), 0.15, 0.5)``.
es_es: Los anchos de las cajas. El valor predeterminado es ``clip(0.15*(distancia entre posiciones extremas), 0.15, 0.5)``.

source: bool, default: True
es_es: bool, por defecto: True

source: If `True` (default), makes the boxes vertical. If `False`, makes horizontal boxes.
es_es: Si `True` (por defecto), hace las cajas verticales. Si `False`, hace cajas horizontales.

source: **patch_artist**
es_es: **parche_artista**

source: bool, default: False
es_es: bool, por defecto: False

source: If `False` produces boxes with the `.Line2D` artist. If `True` produces boxes with the `~matplotlib.patches.Patch` artist.
es_es: Si `False` produce cajas con el artista `.Line2D`. Si `True` produce cajas con el artista `~matplotlib.patches.Patch`.

source: **shownotches, showmeans, showcaps, showbox, showfliers**
es_es: **muestras, vitrinas, escaparates, showbox, showfliers**

source: Whether to draw the CI notches, the mean value (both default to False), the caps, the box, and the fliers (all three default to True).
es_es: Si para dibujar las notas CI, el valor promedio (tanto por defecto como False), los mayúsculas, la caja y los voladores (los tres por defecto a True).

source: **boxprops, whiskerprops, capprops, flierprops, medianprops, meanprops**
es_es: **boxprops, whiskerprops, capprops, flierprops, medianprops, significativos**

source: Artist properties for the boxes, whiskers, caps, fliers, medians, and means.
es_es: Propiedades del artista para las cajas, whiskers, capas, fliers, medianos y medias.

source: **meanline**
es_es: **linea**

source: If `True` (and *showmeans* is `True`), will try to render the mean as a line spanning the full width of the box according to *meanprops*. Not recommended if *shownotches* is also True. Otherwise, means will be shown as points.
es_es: Si `True` (y *showmeans* es `True`), intentará renderizar la media como una línea que abarca el ancho completo de la caja de acuerdo a *meanprops*. No se recomienda si las *notas* también son verdaderas. De lo contrario, se mostrará como puntos.

source: If True, the tick locations and labels will be adjusted to match the boxplot positions.
es_es: Si es verdadero, la ubicación de la marca y las etiquetas se ajustarán para que coincidan con las posiciones de la casilla.

source: **zorder** : float, default: ``Line2D.zorder = 2``
es_es: **zorder** : float, por defecto: ``Line2D.zorder = 2``

source: float, default:
es_es: flotante, por defecto:

source: The zorder of the resulting boxplot.
es_es: El zorder de la parcela de caja resultante.

source: Returns
es_es: Devuelve

source: A dictionary mapping each component of the boxplot to a list of the `.Line2D` instances created. That dictionary has the following keys (assuming vertical boxplots):
es_es: Un diccionario que mapea cada componente de la boxplot a una lista de las instancias de `.Line2D` creadas. Ese diccionario tiene las siguientes teclas (asumiendo cuadros verticales):

source: ``boxes``: main bodies of the boxplot showing the quartiles, and the median's confidence intervals if enabled.
es_es: ``boxes``: cuerpos principales de la caja mostrando los cuartillos y los intervalos de confianza del mediano si está habilitado.

source: ``medians``: horizontal lines at the median of each box.
es_es: ``medianos``: líneas horizontales en la mediana de cada caja.

source: ``whiskers``: vertical lines up to the last non-outlier data.
es_es: ``whiskers``: líneas verticales hasta los últimos datos no atípicos.

source: ``caps``: horizontal lines at the ends of the whiskers.
es_es: ``caps``: líneas horizontales en los extremos de los whiskers.

source: ``fliers``: points representing data beyond the whiskers (fliers).
es_es: ``fliers``: puntos que representan datos más allá de los whiskers (fliers).

source: ``means``: points or lines representing the means.
es_es: ``significa``: puntos o líneas que representan los medios.

source: Examples
es_es: Ejemplos

source: (`Source code <../../gallery/statistics/bxp.py>`__, `png <../../gallery/statistics/bxp_00_00.png>`__, `pdf <../../gallery/statistics/bxp_00_00.pdf>`__)
es_es: (`Código fuente <../../gallery/Statiss/bxp.py>`__, `png <../../gallery/Statiss/bxp_00.png>`__, `pdf <../../gallery/Statiss/bxp_00_00.pdf>`__)

source: (`png <../../gallery/statistics/bxp_01_00.png>`__, `pdf <../../gallery/statistics/bxp_01_00.pdf>`__)
es_es: (`png <../../gallery/Statiss/bxp_01_00.png>`__, `pdf <../../gallery/Statiss/bxp_01_00.pdf>`__)
