Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.quiver.Quiver.po
Languages: es_es

source: Specialized PolyCollection for arrows.
es_es: PolyCollection Especializada para flechas.

source: The only API method is set_UVC(), which can be used to change the size, orientation, and color of the arrows; their locations are fixed when the class is instantiated. Possibly this method will be useful in animations.
es_es: El único método API es set_UVC(), que puede ser usado para cambiar el tamaño, orientación y color de las flechas; sus ubicaciones son fijas cuando la clase es instanciada. Posiblemente este método será útil en las animaciones.

source: Much of the work in this class is done in the draw() method so that as much information as possible is available about the plot. In subsequent draw() calls, recalculation is limited to things that might have changed, so there should be no performance penalty from putting the calculations in the draw() method.
es_es: Gran parte del trabajo en esta clase se realiza en el método draw() de modo que esté disponible tanta información como sea posible acerca de la parcela. En llamadas posteriores a draw(), el recálculo se limita a cosas que podrían haber cambiado, por lo que no debería haber una pena de rendimiento al poner los cálculos en el método draw().

source: The constructor takes one required argument, an Axes instance, followed by the args and kwargs described by the following pyplot interface documentation:
es_es: El constructor toma un argumento requerido, una instancia de ejes, seguido por los argumentos y kwargs descritos por la siguiente documentación de interfaz de pyplot:

source: Plot a 2D field of arrows.
es_es: Trazar un campo 2D de flechas.

source: Call signature::
es_es: Firma de llamada::

source: *X*, *Y* define the arrow locations, *U*, *V* define the arrow directions, and *C* optionally sets the color.
es_es: *X*, *Y* define las ubicaciones de las flechas, *U*, *V* define las direcciones de las flechas, y *C* opcionalmente establece el color.

source: Each arrow is internally represented by a filled polygon with a default edge linewidth of 0. As a result, an arrow is rather a filled area, not a line with a head, and `.PolyCollection` properties like *linewidth*, *linestyle*, *facecolor*, etc. act accordingly.
es_es: Cada flecha está representada internamente por un polígono lleno con un ancho de línea predeterminado de 0. Como resultado, una flecha es más bien un área llena, no una línea con una cabeza, y `. Las propiedades de olyCollection` como *ancho de línea*, *linestyle*, *facecolor*, etc. actúan en consecuencia.

source: **Arrow size**
es_es: **Tamaño de flecha**

source: The default settings auto-scales the length of the arrows to a reasonable size. To change this behavior see the *scale* and *scale_units* parameters.
es_es: La configuración por defecto escala automáticamente la longitud de las flechas a un tamaño razonable. Para cambiar este comportamiento vea los parámetros *escala* y *scale_units*.

source: **Arrow shape**
es_es: **Forma de flecha**

source: The defaults give a slightly swept-back arrow; to make the head a triangle, make *headaxislength* the same as *headlength*. To make the arrow more pointed, reduce *headwidth* or increase *headlength* and *headaxislength*. To make the head smaller relative to the shaft, scale down all the head parameters. You will probably do best to leave minshaft alone.
es_es: Los valores por defecto dan una flecha ligeramente barrida; para hacer de la cabeza un triángulo, haz que *headaxislength* sea igual que *longitud de la cabeza*. Para hacer la flecha más apuntada, reduce el *ancho de la cabeza* o incrementa la *longitud de la cabeza* y la *cabeza*. Para hacer la cabeza más pequeña en relación con el shaft, reduzca todos los parámetros de la cabeza. Probablemente harás lo mejor para dejar el shaft solo.

source: **Arrow outline**
es_es: **Esquema de flecha**

source: *linewidths* and *edgecolors* can be used to customize the arrow outlines.
es_es: Los *anchos de línea* y *colores* pueden utilizarse para personalizar los contornos de las flechas.

source: Parameters
es_es: Parámetros

source: 1D or 2D array-like, optional
es_es: Opcional para matrices 1D o 2D

source: The x and y coordinates of the arrow locations.
es_es: Las coordenadas x e y de las localizaciones de flechas.

source: If not given, they will be generated as a uniform integer meshgrid based on the dimensions of *U* and *V*.
es_es: Si no se dan, se generarán como una red entera uniforme basada en las dimensiones de *U* y *V*.

source: If *X* and *Y* are 1D but *U*, *V* are 2D, *X*, *Y* are expanded to 2D using ``X, Y = np.meshgrid(X, Y)``. In this case ``len(X)`` and ``len(Y)`` must match the column and row dimensions of *U* and *V*.
es_es: Si *X* y *Y* son 1D pero *U*, *V* son 2D, *X*, *Y* se expanden a 2D usando ``X, Y = np.meshgrid(X, Y)``. En este caso ``len(X)`` y ``len(Y)`` deben coincidir con las dimensiones de columna y fila de *U* y *V*.

source: 1D or 2D array-like
es_es: Arreglo 1D o 2D

source: The x and y direction components of the arrow vectors.
es_es: Los componentes de dirección x e y de los vectores de flecha.

source: They must have the same number of elements, matching the number of arrow locations. *U* and *V* may be masked. Only locations unmasked in *U*, *V*, and *C* will be drawn.
es_es: Deben tener el mismo número de elementos, coincidiendo con el número de localizaciones de flechas. *U* y *V* pueden ser enmascarados. Sólo se dibujarán ubicaciones desenmascaradas en *U*, *V*, y *C*.

source: Numeric data that defines the arrow colors by colormapping via *norm* and *cmap*.
es_es: Datos numéricos que definen los colores de las flechas mediante mapeo de colores a través de *normal* y *cmap*.

source: This does not support explicit colors. If you want to set colors directly, use *color* instead. The size of *C* must match the number of arrow locations.
es_es: Esto no soporta colores explícitos. Si quieres establecer colores directamente, usa *color* en su lugar. El tamaño de *C* debe coincidir con el número de ubicaciones de flecha.

source: **units**
es_es: **Unidades**

source: The arrow dimensions (except for *length*) are measured in multiples of this unit.
es_es: Las dimensiones de la flecha (excepto la *longitud*) se miden en múltiplos de esta unidad.

source: The following values are supported:
es_es: Los siguientes valores son compatibles:

source: 'width', 'height': The width or height of the axis.
es_es: 'ancho', 'altura': El ancho o la altura del eje.

source: 'dots', 'inches': Pixels or inches based on the figure dpi.
es_es: 'puntos', 'pulgadas': Pixeles o pulgadas basados en la figura dpi.

source: 'x', 'y', 'xy': *X*, *Y* or :math:`\sqrt{X^2 + Y^2}` in data units.
es_es: 'x', 'y', 'xy': *X*, *Y* o :math:`\sqrt{X^2 + Y^2}` en unidades de datos.

source: The arrows scale differently depending on the units. For 'x' or 'y', the arrows get larger as one zooms in; for other units, the arrow size is independent of the zoom state. For 'width or 'height', the arrow size increases with the width and height of the axes, respectively, when the window is resized; for 'dots' or 'inches', resizing does not change the arrows.
es_es: Las flechas escalan de forma diferente dependiendo de las unidades. Para 'x' o 'y', las flechas se hacen más grandes como un zoom; para otras unidades, el tamaño de la flecha es independiente del estado de zoom. Para 'anchura o 'altura', el tamaño de la flecha aumenta con el ancho y la altura de los ejes, respectivamente, cuando la ventana es redimensionada; para 'puntos' o 'pulgadas', cambiar el tamaño no cambia las flechas.

source: **angles**
es_es: **Ángulos**

source: {'uv', 'xy'} or array-like, default: 'uv'
es_es: {'uv', 'xy'} o tipo matriz: 'uv'

source: Method for determining the angle of the arrows.
es_es: Método para determinar el ángulo de las flechas.

source: 'uv': The arrow axis aspect ratio is 1 so that if *U* == *V* the orientation of the arrow on the plot is 45 degrees counter-clockwise from the horizontal axis (positive to the right).
es_es: 'uv': La relación de aspecto del eje de flecha es 1 de manera que si *U* == *V* la orientación de la flecha en la parcela es 45 grados en sentido contrario a las manecillas del eje horizontal (positivo a la derecha).

source: Use this if the arrows symbolize a quantity that is not based on *X*, *Y* data coordinates.
es_es: Usa esto si las flechas simbolizan una cantidad que no se basa en coordenadas de *X*, *Y* de datos.

source: 'xy': Arrows point from (x, y) to (x+u, y+v). Use this for plotting a gradient field, for example.
es_es: 'xy': Las flechas apuntan de (x, y) a (x+u, y+v). Usa esto para trazar un campo gradiente, por ejemplo.

source: Alternatively, arbitrary angles may be specified explicitly as an array of values in degrees, counter-clockwise from the horizontal axis.
es_es: Alternativamente, los ángulos arbitrarios pueden especificarse explícitamente como un array de valores en grados, en sentido contrario a las manecillas del eje horizontal.

source: In this case *U*, *V* is only used to determine the length of the arrows.
es_es: En este caso *U*, *V* sólo se utiliza para determinar la longitud de las flechas.

source: Note: inverting a data axis will correspondingly invert the arrows only with ``angles='xy'``.
es_es: Nota: invertir un eje de datos invertirá correspondientemente las flechas sólo con ``angles='xy'``.

source: **scale**
es_es: **escala**

source: float, optional
es_es: float, opcional

source: Number of data units per arrow length unit, e.g., m/s per plot width; a smaller scale parameter makes the arrow longer. Default is *None*.
es_es: Número de unidades de datos por unidad de longitud de flecha, por ejemplo, m/s por ancho de gráfico; un parámetro de escala más pequeño hace la flecha más larga. Por defecto *Ninguno*.

source: If *None*, a simple autoscaling algorithm is used, based on the average vector length and the number of vectors. The arrow length unit is given by the *scale_units* parameter.
es_es: Si *nunca*, se utiliza un simple algoritmo de autoescalado, basado en la longitud media del vector y el número de vectores. La unidad de longitud de flecha es dada por el parámetro *scale_units*.

source: **scale_units**
es_es: **unidades de escala**

source: If the *scale* kwarg is *None*, the arrow length unit. Default is *None*.
es_es: Si el kwarg de *escala* es *Ninguno*, la longitud de la flecha. Por defecto es *Ninguno*.

source: e.g. *scale_units* is 'inches', *scale* is 2.0, and ``(u, v) = (1, 0)``, then the vector will be 0.5 inches long.
es_es: p. ej., *scale_units* es 'pulgadas', *escala* es 2.0, y ``(u, v) = (1, 0)``, entonces el vector será de 0,5 pulgadas de largo.

source: If *scale_units* is 'width' or 'height', then the vector will be half the width/height of the axes.
es_es: Si *scale_units* es 'ancho' o 'altura', entonces el vector será la mitad del ancho/altura de los ejes.

source: If *scale_units* is 'x' then the vector will be 0.5 x-axis units. To plot vectors in the x-y plane, with u and v having the same units as x and y, use ``angles='xy', scale_units='xy', scale=1``.
es_es: Si *scale_units* es 'x', el vector será de 0.5 unidades de eje X. Para graficar vectores en el plano x-y con u y v con las mismas unidades que x y y, use ``angles='xy', scale_units='xy', scale=1``.

source: Shaft width in arrow units; default depends on choice of units, above, and number of vectors; a typical starting value is about 0.005 times the width of the plot.
es_es: Ancho del corte en las unidades de flecha; por defecto depende de la elección de unidades, arriba y el número de vectores; un valor inicial típico es de aproximadamente 0. 05 veces el ancho de la parcela.

source: **headwidth**
es_es: **ancho de cabeza**

source: float, default: 3
es_es: float, por defecto: 3

source: Head width as multiple of shaft width.
es_es: Ancho del encabezado como múltiplo de ancho del shaft.

source: **headlength**
es_es: **Longitud de cabeza**

source: float, default: 5
es_es: float, por defecto: 5

source: Head length as multiple of shaft width.
es_es: Longitud de la cabeza como múltiplo de ancho del shaft.

source: float, default: 4.5
es_es: float, por defecto: 4.5

source: Head length at shaft intersection.
es_es: Longitud del cabezal en la intersección del shaft.

source: Length below which arrow scales, in units of head length. Do not set this to less than 1, or small arrows will look terrible!
es_es: Longitud por debajo de qué escala de flecha, en unidades de longitud de la cabeza. No lo establezcas a menos de 1, ¡o las flechas pequeñas parecerán terribles!

source: **minlength**
es_es: **minlongitud**

source: Minimum length as a multiple of shaft width; if an arrow length is less than this, plot a dot (hexagon) of this diameter instead.
es_es: Longitud mínima como un múltiplo de ancho de eje; si la longitud de una flecha es menor que ésta, en su lugar grafica un punto (hexágono) de este diámetro.

source: {'tail', 'mid', 'middle', 'tip'}, default: 'tail'
es_es: {'tail', 'mid', 'middle', 'tip'}, por defecto: 'tail'

source: The part of the arrow that is anchored to the *X*, *Y* grid. The arrow rotates about this point.
es_es: La parte de la flecha que está anclada a la cuadrícula *X*, *Y*. La flecha gira sobre este punto.

source: 'mid' is a synonym for 'middle'.
es_es: 'mid' es un sinónimo de 'middle'.

source: color or color sequence, optional
es_es: color o secuencia de colores, opcional

source: Explicit color(s) for the arrows. If *C* has been set, *color* has no effect.
es_es: Color explícito para las flechas. Si se ha establecido *C*, *color* no tiene efecto.

source: This is a synonym for the `.PolyCollection` *facecolor* parameter.
es_es: Este es un sinónimo para el parámetro `.PolyCollection` *facecolor*.

source: Returns
es_es: Devuelve

source: Other Parameters
es_es: Otros Parámetros

source: DATA_PARAMETER_PLACEHOLDER
es_es: PLAYLACEHOLDER

source: **\*\*kwargs** : `~matplotlib.collections.PolyCollection` properties, optional
es_es: **\*\*kwargs** : `~matplotlib.collections.PolyCollection` propiedades, opcional

source: PolyCollection properties, optional
es_es: Propiedades de PolyColtion, opcional

source: All other keyword arguments are passed on to `.PolyCollection`:
es_es: Todos los otros argumentos de palabra clave se pasan a `.PolyCollection`:

source: Property
es_es: Propiedad

source: Description
es_es: Descripción

source: a filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array
es_es: una función de filtro, que toma un arreglo de puntos flotantes (m, n, 3) y un valor de dpi, y devuelve un arreglo (m, n, 3)

source: array-like or scalar or None
es_es: como matriz o escalar o ninguno

source: :meth:`antialiased <matplotlib.collections.Collection.set_antialiased>` or aa or antialiaseds
es_es: :meth:`antialias <matplotlib.collections.Collection.set_antialiased>` o aa o antialiaseds

source: bool or list of bools
es_es: libro o lista de bools

source: array-like or None
es_es: tipo array o ninguno

source: `.CapStyle` or {'butt', 'projecting', 'round'}
es_es: `.CapStyle` o {'butt', 'projecting', 'round'}

source: (vmin: float, vmax: float)
es_es: (vmin: flotante, vmax: flotante)

source: Patch or (Path, Transform) or None
es_es: Patch o (Path, Transform) o None

source: `.Colormap` or str or None
es_es: `.Colormap` o str o ninguno

source: color or list of rgba tuples
es_es: color o lista de tubos rgba

source: :meth:`edgecolor <matplotlib.collections.Collection.set_edgecolor>` or ec or edgecolors
es_es: :meth:`edgecolor <matplotlib.collections.Collection.set_edgecolor>` o ec o aristas colores

source: color or list of colors or 'face'
es_es: color o lista de colores o 'cara'

source: :meth:`facecolor <matplotlib.collections.Collection.set_facecolor>` or facecolors or fc
es_es: :meth:`carecolor <matplotlib.collections.Collection.set_facecolor>` o colores de caras o fc

source: color or list of colors
es_es: color o lista de colores

source: :meth:`hatch <matplotlib.collections.Collection.set_hatch>`
es_es: :meth:`colgante <matplotlib.collections.Collection.set_hatch>`

source: `.JoinStyle` or {'miter', 'round', 'bevel'}
es_es: `.JoinStyle` o {'miter', 'round', 'bevel'}

source: :meth:`linestyle <matplotlib.collections.Collection.set_linestyle>` or dashes or linestyles or ls
es_es: :meth:`linestyle <matplotlib.collections.Collection.set_linestyle>` o guiones o estilos de línea o ls

source: str or tuple or list thereof
es_es: str o tuple o lista de ellos

source: :meth:`linewidth <matplotlib.collections.Collection.set_linewidth>` or linewidths or lw
es_es: :meth:`ancho de línea <matplotlib.collections.Collection.set_linewidth>o ancho de línea o lw

source: float or list of floats
es_es: flotante o lista de flotantes

source: `.Normalize` or None
es_es: `.normalize` o Ninguno

source: (N, 2) or (2,) array-like
es_es: ((N, 2) o (2,) array-like

source: :meth:`paths <matplotlib.collections.PolyCollection.set_verts>`
es_es: :meth:`rutas <matplotlib.collections.PolyCollection.set_verts>`

source: list of array-like
es_es: lista de matriz

source: None or bool or float or callable
es_es: None o bool o float o callable

source: float
es_es: de punto flotante (float)

source: :meth:`sizes <matplotlib.collections._CollectionWithSizes.set_sizes>`
es_es: :meth:`tamaños <matplotlib.collections._CollectionWithSizes.set_sizes>`

source: ndarray or None
es_es: ndarray o ninguno

source: list of str or None
es_es: lista de str o ninguno

source: unknown
es_es: desconocido

source: :obj:`.Axes.quiverkey`
es_es: :obj:`.Ejes.quiverkey`

source: Add a key to a quiver plot.
es_es: Agrega una clave a una parcela de quiver.

source: Draw the Artist (and its children) using the given renderer.
es_es: Dibuja el Artist (y sus hijos) usando el renderizador dado.

source: This has no effect if the artist is not visible (`.Artist.get_visible` returns False).
es_es: Esto no tiene efecto si el artist no es visible (`.Artist.get_visible` devuelve False).

source: **renderer** : `.RendererBase` subclass.
es_es: **renderer** : `.RendererBase` subclase.

source: RendererBase subclass.
es_es: Subclase RendererBase.

source: This method is overridden in the Artist subclasses.
es_es: Este método se sobrescribe en las subclases de Artist.

source: Remove the artist from the figure if possible.
es_es: Quite al artista de la figura si es posible.

source: The effect will not be visible until the figure is redrawn, e.g., with `.FigureCanvasBase.draw_idle`. Call `~.axes.Axes.relim` to update the axes limits if desired.
es_es: El efecto no será visible hasta que la figura sea redibujada, por ejemplo, con `.FigureCanvasBase.draw_idle`. Llame `~.axes.Axes.relim` para actualizar los límites de ejes si lo desea.

source: Note: `~.axes.Axes.relim` will not see collections even if the collection was added to the axes with *autolim* = True.
es_es: Nota: `~.axes.Axes.relim` no verá colecciones incluso si la colección fue añadida a los ejes con *autolim* = True.

source: Note: there is no support for removing the artist's legend entry.
es_es: Nota: no hay soporte para eliminar la entrada de la leyenda del artista.

source: Set multiple properties at once.
es_es: Establece varias propiedades a la vez.

source: Supported properties are
es_es: Las propiedades admitidas son

source: Examples using ``matplotlib.quiver.Quiver``
es_es: Ejemplos usando ``matplotlib.quiver.Quiver``

source: Advanced quiver and quiverkey functions
es_es: Funciones avanzadas de quiver y quiverkey

source: Quiver Simple Demo
es_es: Demostración de Quiver Simple
