Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.stackplot.po
Languages: es_es

source: Draw a stacked area plot.
es_es: Dibuja una parcela de área apilada.

source: Parameters
es_es: Parámetros

source: (N,) array-like
es_es: (N,) tipo array

source: (M, N) array-like
es_es: (M, N) matriz

source: The data is assumed to be unstacked. Each of the following calls is legal::
es_es: Se supone que los datos no están apilados. Cada una de las siguientes llamadas es legal::

source: **baseline**
es_es: **línea base**

source: {'zero', 'sym', 'wiggle', 'weighted_wiggle'}
es_es: {'zero', 'simo', 'peluca', 'pesado_peluca'}

source: Method used to calculate the baseline:
es_es: Método usado para calcular la línea base:

source: ``'zero'``: Constant zero baseline, i.e. a simple stacked plot.
es_es: ``'zero'``: Constante línea de base cero, es decir, una parcela apilada.

source: ``'sym'``: Symmetric around zero and is sometimes called 'ThemeRiver'.
es_es: ``'sim'``: Simétrico alrededor de cero y a veces se llama 'ThemeRiver'.

source: ``'wiggle'``: Minimizes the sum of the squared slopes.
es_es: ``'wiggle'``: Minimiza la suma de las pendientes.

source: ``'weighted_wiggle'``: Does the same but weights to account for size of each layer. It is also called 'Streamgraph'-layout. More details can be found at http://leebyron.com/streamgraph/.
es_es: ``'weighted_wiggle'``: Hace lo mismo pero tiene que tener en cuenta el tamaño de cada capa. También se llama 'Streamgraph'-layout. Puede encontrar más detalles en http://leebyron.com/streamgraph/.

source: list of str, optional
es_es: lista de str, opcional

source: A sequence of labels to assign to each data series. If unspecified, then no labels will be applied to artists.
es_es: Una secuencia de etiquetas para asignar a cada serie de datos. Si no se especifica, no se aplicarán etiquetas a los artistas.

source: **colors**
es_es: **colores**

source: list of color, optional
es_es: lista de color, opcional

source: A sequence of colors to be cycled through and used to color the stacked areas. The sequence need not be exactly the same length as the number of provided *y*, in which case the colors will repeat from the beginning.
es_es: Una secuencia de colores a ser ciclada a través y usada para colorar las áreas apiladas. La secuencia no tiene que ser exactamente la misma longitud que el número de *y* proporcionado, en cuyo caso los colores se repetirán desde el principio.

source: If not specified, the colors from the Axes property cycle will be used.
es_es: Si no se especifica, se utilizarán los colores del ciclo de propiedades de los ejes.

source: If given, all parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception).
es_es: Si se dan, todos los parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción).

source: All other keyword arguments are passed to `.Axes.fill_between`.
es_es: Todos los otros argumentos de palabra clave se pasan a `.Axes.fill_between`.

source: Returns
es_es: Devuelve

source: list of `.PolyCollection`
es_es: lista de `.PolyCollection`

source: A list of `.PolyCollection` instances, one for each element in the stacked area plot.
es_es: Una lista de instancias `.PolyCollection`, una para cada elemento en la parcela de áreas.
