Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.gridspec.GridSpecBase.po
Languages: es_es

source: A base class of GridSpec that specifies the geometry of the grid that a subplot will be placed.
es_es: Una clase base de GridSpec que especifica la geometría de la cuadrícula que se colocará un subgráfico.

source: Parameters
es_es: Parámetros

source: **nrows, ncols**
es_es: **nfilas, ncoles**

source: The number of rows and columns of the grid.
es_es: El número de filas y columnas de la cuadrícula.

source: **width_ratios** : array-like of length *ncols*, optional
es_es: **width_ratios** : array-like de longitud *ncols*, opcional

source: array-like of length
es_es: longitud del array

source: Defines the relative widths of the columns. Each column gets a relative width of ``width_ratios[i] / sum(width_ratios)``. If not given, all columns will have the same width.
es_es: Define el ancho relativo de las columnas. Cada columna obtiene un ancho relativo de ``width_ratios[i] / suma(width_ratios)``. Si no se dan, todas las columnas tendrán el mismo anchura.

source: **height_ratios** : array-like of length *nrows*, optional
es_es: **altura_ratios** : tipo matriz de longitud *nrows*, opcional

source: Defines the relative heights of the rows. Each row gets a relative height of ``height_ratios[i] / sum(height_ratios)``. If not given, all rows will have the same height.
es_es: Define las alturas relativas de las filas. Cada fila tiene una altura relativa de ``height_ratios[i] / suma(height_ratios)``. Si no se da, todos los registros tendrán la misma altura.

source: Return a tuple containing the number of rows and columns in the grid.
es_es: Devuelve una tupla que contiene el número de filas y columnas en la cuadrícula.

source: Return the positions of the grid cells in figure coordinates.
es_es: Devuelve las posiciones de las celdas de la cuadrícula en las coordenadas de la figura.

source: Figure
es_es: Figura

source: The figure the grid should be applied to. The subplot parameters (margins and spacing between subplots) are taken from *fig*.
es_es: La figura a la que se debe aplicar la cuadrícula. Los parámetros de subtrazo (márgenes y espacio entre subgráficos) se toman de *figura*.

source: **raw**
es_es: **crudo**

source: bool, default: False
es_es: bool, por defecto: False

source: If *True*, the subplot parameters of the figure are not taken into account. The grid spans the range [0, 1] in both directions without margins and there is no space between grid cells. This is used for constrained_layout.
es_es: Si es *True*, los parámetros de subtrazo de la figura no son tenidos en cuenta. La cuadrícula abarca el rango [0, 1] en ambas direcciones sin márgenes y no hay espacio entre las celdas de la cuadrícula.

source: Returns
es_es: Devuelve

source: **bottoms, tops, lefts, rights**
es_es: **inferiores, superiores, izquierdas, derechas**

source: The bottom, top, left, right positions of the grid cells in figure coordinates.
es_es: La posición inferior, superior, izquierda y derecha de las células de la cuadrícula en las coordenadas de la figura.

source: Return the height ratios.
es_es: Devuelve las proporciones de altura.

source: This is *None* if no height ratios have been set explicitly.
es_es: Esto es *nunca* si ninguna relación de altura se ha establecido explícitamente.

source: This is *None* if no width ratios have been set explicitly.
es_es: Esto es *nunca* si no se han establecido proporciones de ancho explícitamente.

source: The number of columns in the grid.
es_es: El número de columnas en la cuadrícula.

source: Create and return a `.SubplotSpec` instance.
es_es: Crea y devuelve una instancia `.SubplotSpec`.

source: The position of the subplot in the grid as ``(row_index, column_index)``.
es_es: La posición del subplot en la cuadrícula como ``(row_index, column_index)``.

source: **rowspan, colspan**
es_es: **renglón, colapso**

source: int, default: 1
es_es: int, por defecto: 1

source: The number of rows and columns the subplot should span in the grid.
es_es: El número de filas y columnas que el subgrafico debe extenderse en la cuadrícula.

source: The number of rows in the grid.
es_es: El número de filas en la cuadrícula.

source: Set the relative heights of the rows.
es_es: Establece las alturas relativas de las filas.

source: *height_ratios* must be of length *nrows*. Each row gets a relative height of ``height_ratios[i] / sum(height_ratios)``.
es_es: *height_ratios* debe ser de longitud *nrows*. Cada fila tiene una altura relativa de ``height_ratios[i] / suma(height_ratios)``.

source: Set the relative widths of the columns.
es_es: Establece el ancho relativo de las columnas.

source: *width_ratios* must be of length *ncols*. Each column gets a relative width of ``width_ratios[i] / sum(width_ratios)``.
es_es: *width_ratios* debe ser de longitud *ncols*. Cada columna obtiene un ancho relativo de ``width_ratios[i] / suma(width_ratios)``.

source: Add all subplots specified by this `GridSpec` to its parent figure.
es_es: Agrega todas las subparcelas especificadas por este `GridSpec` a su figura padre.

source: See `.Figure.subplots` for detailed documentation.
es_es: Vea `.Figure.subplots` para documentación detallada.

source: Examples using ``matplotlib.gridspec.GridSpecBase``
es_es: Ejemplos usando ``matplotlib.gridspec.GridSpecBase``

source: Nested Gridspecs
es_es: Gridspecs anidados

source: Constrained Layout Guide
es_es: Guía de diseño restringido

source: Tight Layout guide
es_es: Guía de diseño ajustado
