Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.pyplot.matshow.po
Languages: es_es

source: Display an array as a matrix in a new figure window.
es_es: Muestra una matriz como una matriz en una nueva ventana de figura.

source: The origin is set at the upper left hand corner and rows (first dimension of the array) are displayed horizontally. The aspect ratio of the figure window is that of the array, unless this would make an excessively short or narrow figure.
es_es: El origen se establece en la esquina superior izquierda y las filas (primera dimensión de la matriz) se muestran horizontalmente. La relación de aspecto de la ventana de la figura es la de la matriz, a menos que esto haga una figura excesivamente corta o estrecha.

source: Tick labels for the xaxis are placed on top.
es_es: Etiquetas para el xaxis se colocan en la parte superior.

source: Parameters
es_es: Parámetros

source: 2D array-like
es_es: Arreglo 2D

source: The matrix to be displayed.
es_es: La matriz a mostrar.

source: None or int or False
es_es: Ninguno o int o False

source: If *None*, create a new figure window with automatic numbering.
es_es: Si *nunca*, cree una nueva ventana de figuras con numeración automática.

source: If a nonzero integer, draw into the figure with the given number (create it if it does not exist).
es_es: Si un entero no cero, dibuja en la figura con el número dado (créalo si no existe).

source: If 0, use the current axes (or create one if it does not exist).
es_es: Si es 0, utilice los ejes actuales (o cree uno si no existe).

source: Because of how `.Axes.matshow` tries to set the figure aspect ratio to be the one of the array, strange things may happen if you reuse an existing figure.
es_es: Debido a cómo `.Axes. atshow` intenta establecer la relación de aspecto de figura para ser la de la matriz, cosas extrañas pueden ocurrir si reutiliza una figura existente.

source: Returns
es_es: Devuelve

source: Other Parameters
es_es: Otros Parámetros

source: Examples using ``matplotlib.pyplot.matshow``
es_es: Ejemplos usando ``matplotlib.pyplot.matshow``
