Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/matplotlib.axis.Axis.grid.po
Languages: es_es

source: matplotlib.axis.Axis.grid
es_es: matplotlib.axis.Ax.grid

source: Configure the grid lines.
es_es: Configurar las líneas de la cuadrícula.

source: Parameters
es_es: Parámetros

source: bool or None
es_es: bool o None

source: Whether to show the grid lines. If any *kwargs* are supplied, it is assumed you want the grid on and *visible* will be set to True.
es_es: Si se muestran las líneas de la cuadrícula. Si se suministran *kwargs*, se asume que quieres que la red esté encendida y *visible* se establecerá en True.

source: If *visible* is *None* and there are no *kwargs*, this toggles the visibility of the lines.
es_es: Si *visible* es *nunca* y no hay *kwargs*, esto cambia la visibilidad de las líneas.

source: **which**
es_es: **qué**

source: The grid lines to apply the changes on.
es_es: Las líneas de cuadrícula para aplicar los cambios encendidos.

source: **\*\*kwargs** : `.Line2D` properties
es_es: **\*\*kwargs** : propiedades `.Line2D`

source: Line2D properties
es_es: Propiedades Line2D

source: Define the line properties of the grid, e.g.::
es_es: Definir las propiedades de línea de la cuadrícula, p. ej.::

source: Examples using ``matplotlib.axis.Axis.grid``
es_es: Ejemplos usando ``matplotlib.axis.Axis.grid``

source: Symlog Demo
es_es: Demo de Symlog
