Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.axes_grid1.axes_divider.po
Languages: es_es

source: mpl\_toolkits.axes\_grid1.axes\_divider
es_es: mpl\_toolkits.axes\_grid1.ejes\_divider

source: Helper classes to adjust the positions of multiple axes at drawing time.
es_es: Clases de helper para ajustar las posiciones de múltiples ejes en tiempo de dibujo.

source: Classes
es_es: Clases

source: Divider based on the pre-existing axes.
es_es: Divider basado en los ejes preexistentes.

source: A callable object which returns the position and size of a given AxesDivider cell.
es_es: Un objeto llamable que devuelve la posición y el tamaño de una celda AxesDivider determinada.

source: :py:obj:`Divider <mpl_toolkits.axes_grid1.axes_divider.Divider>`\ \(fig\, pos\, horizontal\, vertical\[\, ...\]\)
es_es: :py:obj:`Divider <mpl_toolkits.axes_grid1.axes_divider.Divider>`\ \(figura\, pos\, horizontal\, vertical\[\, ...\]\)

source: An Axes positioning class.
es_es: Una clase de posicionamiento de los ejes.

source: :py:obj:`HBoxDivider <mpl_toolkits.axes_grid1.axes_divider.HBoxDivider>`\ \(fig\, \*args\[\, horizontal\, ...\]\)
es_es: :py:obj:`HBoxDivider <mpl_toolkits.axes_grid1.axes_divider.HBoxDivider>`\ \(figura\, \*args\[\, horizontal\, ...\]\)

source: A `SubplotDivider` for laying out axes horizontally, while ensuring that they have equal heights.
es_es: Un `SubplotDivider` para trazar ejes horizontalmente, asegurando al mismo tiempo que tengan las mismas alturas.

source: :py:obj:`SubplotDivider <mpl_toolkits.axes_grid1.axes_divider.SubplotDivider>`\ \(fig\, \*args\[\, horizontal\, ...\]\)
es_es: :py:obj:`SubplotDivider <mpl_toolkits.axes_grid1.axes_divider.SubplotDivider>`\ \(figura\, \*args\[\, horizontal\, ...\]\)

source: The Divider class whose rectangle area is specified as a subplot geometry.
es_es: La clase Divider cuyo área del rectángulo se especifica como una geometría de subtráfico.

source: :py:obj:`VBoxDivider <mpl_toolkits.axes_grid1.axes_divider.VBoxDivider>`\ \(fig\, \*args\[\, horizontal\, ...\]\)
es_es: :py:obj:`VBoxDivider <mpl_toolkits.axes_grid1.axes_divider.VBoxDivider>`\ \(figura\, \*args\[\, horizontal\, ...\]\)

source: A `SubplotDivider` for laying out axes vertically, while ensuring that they have equal widths.
es_es: Un `SubplotDivider` para trazar ejes verticalmente, asegurando al mismo tiempo que tengan las mismas anchuras.

source: Functions
es_es: Funciones

source: :py:obj:`make_axes_area_auto_adjustable <mpl_toolkits.axes_grid1.axes_divider.make_axes_area_auto_adjustable>`\ \(ax\[\, ...\]\)
es_es: :py:obj:`make_axes_área_auto_ajustable <mpl_toolkits.axes_grid1.axes_divider.make_axes_area_auto_adjustable>`\ \(ax\[\, ...\]\)

source: :py:obj:`make_axes_locatable <mpl_toolkits.axes_grid1.axes_divider.make_axes_locatable>`\ \(axes\)
es_es: :py:obj:`make_axes_locatable <mpl_toolkits.axes_grid1.axes_divider.make_axes_locatable>`\ \(ejes\)
