Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.axes_grid1.axes_divider.Divider.po
Languages: es_es

source: mpl\_toolkits.axes\_grid1.axes\_divider.Divider
es_es: mpl\_toolkits.axes\_grid1.ejes\_divider.Divider

source: An Axes positioning class.
es_es: Una clase de posicionamiento de los ejes.

source: The divider is initialized with lists of horizontal and vertical sizes (:mod:`mpl_toolkits.axes_grid1.axes_size`) based on which a given rectangular area will be divided.
es_es: El divisor se inicializa con listas de tamaños horizontales y verticales (:mod:`mpl_toolkits.axes_grid1.axes_size`) basado en el cual se dividirá un área rectangular determinada.

source: The `new_locator` method then creates a callable object that can be used as the *axes_locator* of the axes.
es_es: El método `new_locator` crea un objeto llamable que puede ser usado como *axes_locator* de los ejes.

source: Parameters
es_es: Parámetros

source: Figure
es_es: Figura

source: tuple of 4 floats
es_es: tupla de 4 flotantes

source: Position of the rectangle that will be divided.
es_es: Posición del rectángulo que será dividido.

source: **horizontal** : list of :mod:`~mpl_toolkits.axes_grid1.axes_size`
es_es: **horizontal**: lista de :mod:`~mpl_toolkits.axes_grid1.axes_size`

source: list of
es_es: lista de

source: Sizes for horizontal division.
es_es: Tamaños para la división horizontal.

source: **vertical** : list of :mod:`~mpl_toolkits.axes_grid1.axes_size`
es_es: **vertical** : lista de :mod:`~mpl_toolkits.axes_grid1.axes_size`

source: Sizes for vertical division.
es_es: Tamaños para la división vertical.

source: **aspect**
es_es: **Aspecto**

source: Whether overall rectangular area is reduced so that the relative part of the horizontal and vertical scales have the same scale.
es_es: Si el área rectangular total se reduce de modo que la parte relativa de las escalas horizontal y vertical tengan la misma escala.

source: **anchor**
es_es: **ancla**

source: Placement of the reduced rectangle, when *aspect* is True.
es_es: Colocación del rectángulo reducido, cuando *aspecto* es verdadero.

source: Return the anchor.
es_es: Devuelve el fondo.

source: Return aspect.
es_es: Retornar aspecto.

source: Return horizontal sizes.
es_es: Devolver tamaños horizontales.

source: Return the position of the rectangle.
es_es: Devuelve la posición del rectángulo.

source: Return vertical sizes.
es_es: Devolver tamaños verticales.

source: Integers specifying the column-position of the cell. When *nx1* is None, a single *nx*-th column is specified. Otherwise location of columns spanning between *nx* to *nx1* (but excluding *nx1*-th column) is specified.
es_es: Los enteros que especifican la posición de la columna de la celda. Cuando *nx1* no es Ninguno, se especifica una sola columna *nx*. De lo contrario, se especifica la ubicación de las columnas que se extiende entre *nx* a *nx1* (pero excluyendo la columna *nx1*).

source: Same as *nx* and *nx1*, but for row positions.
es_es: Igual que *nx* y *nx1*, pero para las posiciones de filas.

source: **axes**
es_es: **ejes**

source: Return a new `AxesLocator` for the specified cell.
es_es: Devuelve un nuevo `AxesLocator` para la celda especificada.

source: (float, float) or {'C', 'SW', 'S', 'SE', 'E', 'NE', ...}
es_es: (float, float) o {'C', 'SW', 'S', 'SE', 'E', 'NE', ...}

source: Either an (*x*, *y*) pair of relative coordinates (0 is left or bottom, 1 is right or top), 'C' (center), or a cardinal direction ('SW', southwest, is bottom left, etc.).
es_es: O bien un par (*x*, *y*) de coordenadas relativas (0 es izquierda o abajo, 1 es derecha o arriba), 'C' (centro), o una dirección cardinal ('SW', suroeste, es abajo a la izquierda, etc.).

source: **h** : list of :mod:`~mpl_toolkits.axes_grid1.axes_size`
es_es: **h** : lista de :mod:`~mpl_toolkits.axes_grid1.axes_size`

source: sizes for horizontal division
es_es: tamaños para la división horizontal

source: Set the position of the rectangle.
es_es: Define la posición del rectángulo.

source: position of the rectangle that will be divided
es_es: posición del rectángulo que se dividirá

source: **v** : list of :mod:`~mpl_toolkits.axes_grid1.axes_size`
es_es: **v** : lista de :mod:`~mpl_toolkits.axes_grid1.axes_size`

source: sizes for vertical division
es_es: tamaños para la división vertical
