Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.axisartist.angle_helper.ExtremeFinderCycle.po
Languages: es_es

source: mpl\_toolkits.axisartist.angle\_helper.ExtremeFinderCycle
es_es: mpl\_toolkits.axisartist.ángulo\_helper.ExtremeFinderCycle

source: This subclass handles the case where one or both coordinates should be taken modulo 360, or be restricted to not exceed a specific range.
es_es: Esta subclase maneja el caso en el que una o ambas coordenadas deben ser tomadas modulo 360, o estar restringidas a no exceder un rango específico.

source: Parameters
es_es: Parámetros

source: The number of samples in each direction.
es_es: El número de muestras en cada dirección.

source: 360 or None
es_es: 360 o ninguno

source: If not None, values in the corresponding direction are taken modulo *lon_cycle* or *lat_cycle*; in theory this can be any number but the implementation actually assumes that it is 360 (if not None); other values give nonsensical results.
es_es: Si no es Ninguno, los valores en la dirección correspondiente se toman modulo *lon_cycle* o *lat_cycle*; en teoría esto puede ser cualquier número, pero la implementación en realidad asume que es 360 (si no lo es nunca); otros valores dan resultados sin sentido.

source: This is done by "unwrapping" the transformed grid coordinates so that jumps are less than a half-cycle; then normalizing the span to no more than a full cycle.
es_es: Esto se hace desenvolviendo las coordenadas de la cuadrícula transformada para que los saltos sean inferiores a la mitad del ciclo; a continuación normalizar el tramo a no más que un ciclo completo.

source: For example, if values are in the union of the [0, 2] and [358, 360] intervals (typically, angles measured modulo 360), the values in the second interval are normalized to [-2, 0] instead so that the values now cover [-2, 2]. If values are in a range of [5, 1000], this gets normalized to [5, 365].
es_es: Por ejemplo, si los valores están en la unión de los intervalos [0, 2] y [358, 360] (típicamente, los ángulos medida modulo 360), los valores en el segundo intervalo son normalizados a [-2, 0] en su lugar para que los valores ahora cubran [-2, 2]. Si los valores están en un rango de [5, 1000], esto se normaliza a [5, 365].

source: (float, float) or None
es_es: (flotante, flotante) o ninguno

source: If not None, the computed bounding box is clipped to the given range in the corresponding direction.
es_es: Si no es Ninguna, la casilla de límite calculada se recorta al rango dado en la dirección correspondiente.

source: Compute an approximation of the bounding box obtained by applying *transform_xy* to the box delimited by ``(x1, y1, x2, y2)``.
es_es: Calcula una aproximación de la caja de límites obtenida aplicando *transform_xy* a la caja delimitada por ``(x1, y1, x2, y2)``.

source: The intended use is to have ``(x1, y1, x2, y2)`` in axes coordinates, and have *transform_xy* be the transform from axes coordinates to data coordinates; this method then returns the range of data coordinates that span the actual axes.
es_es: El uso previsto es tener ``(x1, y1, x2, y2)`` en coordenadas de ejes, y *transform_xy* ser la transformación de coordenadas de ejes a coordenadas de datos; este método devuelve el rango de coordenadas de datos que abarcan los ejes reales.

source: The computation is done by sampling ``nx * ny`` equispaced points in the ``(x1, y1, x2, y2)`` box and finding the resulting points with extremal coordinates; then adding some padding to take into account the finite sampling.
es_es: El cálculo se hace muestreando los puntos ecualizados ``nx * ny`` en el ``(x1, y1, x2, y2)`` caja y encontrar los puntos resultantes con coordenadas extremas; a continuación, añadiendo un poco de relleno para tener en cuenta el muestreo finito.

source: As each sampling step covers a relative range of *1/nx* or *1/ny*, the padding is computed by expanding the span covered by the extremal coordinates by these fractions.
es_es: Como cada paso de muestreo cubre un rango relativo de *1/nx* o *1/ny*, el relleno se calcula expandiendo el intervalo cubierto por las coordenadas extremas por estas fracciones.

source: Examples using ``mpl_toolkits.axisartist.angle_helper.ExtremeFinderCycle``
es_es: Ejemplos usando ``mpl_toolkits.axisartist.angle_helper.ExtremeFinderCycle``

source: floating_axis demo
es_es: demo floating_axis
