Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.mplot3d.art3d.get_dir_vector.po
Languages: es_es

source: Return a direction vector.
es_es: Devuelve un vector de direcci칩n.

source: Parameters
es_es: Par치metros

source: {'x', 'y', 'z', None, 3-tuple}
es_es: {'x', 'y', 'z', Ninguno, 3-tuple}

source: The direction. Possible values are:
es_es: La direcci칩n. Los valores posibles son:

source: 'x': equivalent to (1, 0, 0)
es_es: 'x': equivalente a (1, 0, 0)

source: 'y': equivalent to (0, 1, 0)
es_es: 'y': equivalente a (0, 1, 0)

source: 'z': equivalent to (0, 0, 1)
es_es: 'z': equivalente a (0, 0, 1)

source: *None*: equivalent to (0, 0, 0)
es_es: *Ninguno*: equivalente a (0, 0, 0)

source: an iterable (x, y, z) is converted to a NumPy array, if not already
es_es: un iterable (x, y, z) se convierte en una matriz NumPy, si no ya

source: Returns
es_es: Devuelve

source: The direction vector.
es_es: El vector de direcci칩n.
