Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.axes_grid1.inset_locator.InsetPosition.po
Languages: es_es

source: mpl\_toolkits.axes\_grid1.inset\_locator.InsetPosition
es_es: mpl\_toolkits.ejes\_grid1.inset\_locator.InsetPosition

source: An object for positioning an inset axes.
es_es: Un objeto para posicionar los ejes de inyección.

source: This is created by specifying the normalized coordinates in the axes, instead of the figure.
es_es: Esto se crea especificando las coordenadas normalizadas en los ejes, en lugar de la figura.

source: Parameters
es_es: Parámetros

source: **parent** : `matplotlib.axes.Axes`
es_es: **padre** : `matplotlib.axes.Axes`

source: Axes to use for normalizing coordinates.
es_es: Ejes a usar para normalizar coordenadas.

source: iterable of four floats
es_es: iterable de cuatro flotantes

source: The left edge, bottom edge, width, and height of the inset axes, in units of the normalized coordinate of the *parent* axes.
es_es: El borde izquierdo, el borde inferior, el ancho y la altura de los ejes de entrada, en unidades de la coordenada normalizada de los ejes *padre*.

source: :meth:`matplotlib.axes.Axes.set_axes_locator`
es_es: :meth:`matplotlib.axes.Ejes.set_axes_locator`

source: Examples
es_es: Ejemplos

source: The following bounds the inset axes to a box with 20% of the parent axes's height and 40% of the width. The size of the axes specified ([0, 0, 1, 1]) ensures that the axes completely fills the bounding box:
es_es: Los siguientes limitan los ejes de entrada a una caja con el 20% de la altura de los ejes matrices y el 40% de la ancha. El tamaño de los ejes especificados ([0, 0, 1, 1]) asegura que los ejes llenen completamente la caja delimitadora:

source: Call self as a function.
es_es: Llamarse a sí mismo como función.
