Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.mplot3d.axes3d.Axes3D.po
Languages: es_es

source: Set the axes box aspect.
es_es: Establece el aspecto de la caja de ejes.

source: The box aspect is the ratio of height to width in display units for each face of the box when viewed perpendicular to that face. This is not to be confused with the data aspect (which for Axes3D is always 'auto'). The default ratios are 4:4:3 (x:y:z).
es_es: El aspecto de la caja es la relación de altura a anchura en las unidades de visualización de cada cara de la caja cuando se ve perpendicular a esa cara. Esto no debe confundirse con el aspecto de datos (que para Axes3D es siempre 'auto'). Los ratios por defecto son 4:4:3 (x:y:z).

source: To simulate having equal aspect in data space, set the box aspect to match your data range in each dimension.
es_es: Para simular tener un aspecto igual en el espacio de datos, establezca el aspecto de la caja para que coincida con su rango de datos en cada dimensión.

source: *zoom* controls the overall size of the Axes3D in the figure.
es_es: *zoom* controla el tamaño total del Eje 3D en la figura.

source: Changes the physical dimensions of the Axes3D, such that the ratio of the axis lengths in display units is x:y:z.
es_es: Cambia las dimensiones físicas de los Ejes3D, de tal forma que la proporción de las longitudes del eje en las unidades de visualización es x:y:z.

source: If None, defaults to 4:4:3
es_es: Si Ninguno, por defecto es 4:4:3

source: Control overall size of the Axes3D in the figure.
es_es: Controla el tamaño total del Eje 3D en la figura.

source: Set whether the 3D axes panels are drawn.
es_es: Define si los ejes 3D están dibujados.

source: Set the projection type.
es_es: Define el tipo de proyección.

source: Set a title for the Axes.
es_es: Establece un título para los ejes.

source: Set one of the three available Axes titles. The available titles are positioned above the Axes in the center, flush with the left edge, and flush with the right edge.
es_es: Establezca uno de los tres títulos de Ejes disponibles. Los títulos disponibles están situados encima de los ejes en el centro, se limpian con el borde izquierdo y se limpian con el borde derecho.

source: **label**
es_es: **etiqueta**

source: Text to use for the title
es_es: Texto a usar para el título

source: A dictionary controlling the appearance of the title text, the default *fontdict* is::
es_es: Un diccionario que controla la apariencia del texto del título, la *fuente* predeterminada es::

source: **loc** : {'center', 'left', 'right'}, default: :rc:`axes.titlelocation`
es_es: **loc** : {'center', 'left', 'right'}, por defecto: :rc:`axes.titlelocation`

source: {'center', 'left', 'right'}, default:
es_es: {'center', 'left', 'right'}por defecto:

source: Which title to set.
es_es: Qué título establecer.

source: **y** : float, default: :rc:`axes.titley`
es_es: **y** : float, por defecto: :rc:`axes.titley`

source: Vertical Axes loation for the title (1.0 is the top). If None (the default), y is determined automatically to avoid decorators on the Axes.
es_es: Loación de los ejes verticales para el título (1.0 es la parte superior). Si Ninguno (el predeterminado), y se determina automáticamente para evitar los decoradores en los ejes.

source: **pad** : float, default: :rc:`axes.titlepad`
es_es: **pad** : float, por defecto: :rc:`axes.titlepad`

source: The offset of the title from the top of the Axes, in points.
es_es: La compensación del título desde la parte superior de los ejes, en puntos.

source: The matplotlib text instance representing the title
es_es: La instancia de texto matplotlib que representa el título

source: **\*\*kwargs** : `.Text` properties
es_es: **\*\*kwargs** : propiedades `.Text`

source: Text properties
es_es: Propiedades del texto

source: Other keyword arguments are text properties, see `.Text` for a list of valid text properties.
es_es: Otros argumentos de palabras clave son propiedades de texto, vea `.Text` para una lista de propiedades de texto válidas.

source: Alias for `set_xlim3d`.
es_es: Alias para `set_xlim3d`.

source: Set 3D x limits.
es_es: Ajuste x límites 3D.

source: See :meth:`matplotlib.axes.Axes.set_xlim` for full documentation.
es_es: Vea :meth:`matplotlib.axes.Axes.set_xlim` para la documentación completa.

source: Set padding of X data limits prior to autoscaling.
es_es: Define el relleno de los límites de datos X antes de autoescalar.

source: *m* times the data interval will be added to each end of that interval before it is used in autoscaling. For example, if your data is in the range [0, 2], a factor of ``m = 0.1`` will result in a range [-0.2, 2.2].
es_es: *m* veces el intervalo de datos será añadido a cada extremo de ese intervalo antes de ser usado en la autoescalado. Por ejemplo, si sus datos están en el rango [0, 2], un factor de ``m = 0.1`` resultará en un rango [-0.2, 2.2].

source: Negative values -0.5 < m < 0 will result in clipping of the data range. I.e. for a data range [0, 2], a factor of ``m = -0.1`` will result in a range [0.2, 1.8].
es_es: Valores negativos -0.5 < m < 0 resultará en un recorte del rango de datos. Ej.e. para un rango de datos [0, 2], un factor de ``m = -0.1`` resultará en un rango [0.2, 1.8].

source: float greater than -0.5
es_es: float mayor que -0,5

source: Set the x-axis scale.
es_es: Define la escala del eje x.

source: **value**
es_es: **valor**

source: The axis scale type to apply. 3D axes currently only support linear scales; other scales yield nonsensical results.
es_es: El tipo de escala del eje a aplicar. Los ejes 3D actualmente sólo soportan escalas lineales; otras escalas producen resultados sin sentido.

source: Keyword arguments are nominally forwarded to the scale class, but none of them is applicable for linear scales.
es_es: Los argumentos de palabra clave son enviados nominalmente a la clase de escala, pero ninguno de ellos es aplicable para escalas lineales.

source: Alias for `set_ylim3d`.
es_es: Alias para `set_ylim3d`.

source: Set 3D y limits.
es_es: Establecer límites en 3D.

source: See :meth:`matplotlib.axes.Axes.set_ylim` for full documentation.
es_es: Vea :meth:`matplotlib.axes.Axes.set_ylim` para la documentación completa.

source: Set padding of Y data limits prior to autoscaling.
es_es: Define los límites de datos en Y antes de autoescalar.

source: Set the y-axis scale.
es_es: Define la escala del eje y.

source: Set the lower and upper numerical bounds of the z-axis.
es_es: Establece los límites numéricos inferiores y superiores del eje z.

source: This method will honor axes inversion regardless of parameter order. It will not change the autoscaling setting (`.get_autoscalez_on()`).
es_es: Este método hará honor a la inversión de ejes independientemente del orden de los parámetros. No cambiará la configuración de autoescalado (`.get_autoscalez_on()`).

source: Set zlabel. See doc for `.set_ylabel` for description.
es_es: Establece la etiqueta zlabel. Ver el documento para `.set_ylabel` para la descripción.

source: Alias for `set_zlim3d`.
es_es: Alias para `set_zlim3d`.

source: Set 3D z limits.
es_es: Establecer límites en z 3D.

source: See :meth:`matplotlib.axes.Axes.set_ylim` for full documentation
es_es: Vea :meth:`matplotlib.axes.Axes.set_ylim` para la documentación completa

source: Set padding of Z data limits prior to autoscaling.
es_es: Define los límites de datos de Z antes de autoescalar.

source: *m* times the data interval will be added to each end of that interval before it is used in autoscaling.
es_es: *m* veces el intervalo de datos será añadido a cada extremo de ese intervalo antes de ser usado en la autoescalado.

source: accepts: float in range 0 to 1
es_es: acepta: flotante en rango 0 a 1

source: Set the z-axis scale.
es_es: Define la escala del eje z.

source: Set the zaxis' labels with list of string labels.
es_es: Establece las etiquetas de zaxis con una lista de etiquetas de cadenas.

source: This method should only be used after fixing the tick positions using `.Axes3D.set_zticks`. Otherwise, the labels may end up in unexpected positions.
es_es: Este método sólo debe utilizarse después de corregir las posiciones de tick usando `.Axes3D.set_zticks`. De lo contrario, las etiquetas pueden terminar en posiciones inesperadas.

source: list of str
es_es: lista de str

source: The label texts.
es_es: Los textos de la etiqueta.

source: A dictionary controlling the appearance of the ticklabels. The default *fontdict* is::
es_es: Un diccionario que controla la apariencia de las etiquetas. La *fuente* predeterminada es:

source: Whether to set the minor ticklabels rather than the major ones.
es_es: Si hay que establecer las etiquetas menores en lugar de las más importantes.

source: list of `.Text`
es_es: lista de `.Text`

source: The labels.
es_es: Las etiquetas.

source: **\*\*kwargs** : `~.text.Text` properties.
es_es: **\*\*kwargs** : propiedades `~.text.Text`.

source: Text properties.
es_es: Propiedades de texto.

source: Set the zaxis' tick locations and optionally labels.
es_es: Establezca las ubicaciones de las marcas de zaxis y opcionalmente las etiquetas.

source: If necessary, the view limits of the Axis are expanded so that all given ticks are visible.
es_es: Si es necesario, los límites de vista del eje se expanden para que todos los ticks sean visibles.

source: list of floats
es_es: lista de flotantes

source: List of tick locations.
es_es: Lista de ubicaciones de tick.

source: list of str, optional
es_es: lista de str, opcional

source: List of tick labels. If not set, the labels show the data value.
es_es: Lista de etiquetas de tick. Si no se establece, las etiquetas muestran el valor de los datos.

source: If ``False``, set the major ticks; if ``True``, the minor ticks.
es_es: Si es ``False``, establezca los ticks principales; si es ``True``, los ticks menores.

source: `.Text` properties for the labels. These take effect only if you pass *labels*. In other cases, please use `~.Axes.tick_params`.
es_es: Propiedades `.Text` para las etiquetas. Estas tienen efecto sólo si pasas *etiquetas*. En otros casos, por favor usa `~.Axes.tick_params`.

source: The mandatory expansion of the view limits is an intentional design choice to prevent the surprise of a non-visible tick. If you need other limits, you should set the limits explicitly after setting the ticks.
es_es: La expansión obligatoria de los límites de vista es una elección intencionada de diseño para evitar la sorpresa de un tick no visible. Si necesita otros límites, debe establecer los límites explícitamente después de establecer los ticks.

source: Create a 3D stem plot.
es_es: Crea una trama de tallo 3D.

source: A stem plot draws lines perpendicular to a baseline, and places markers at the heads. By default, the baseline is defined by *x* and *y*, and stems are drawn vertically from *bottom* to *z*.
es_es: Una trama de tallo dibuja líneas perpendiculares a una línea de base, y coloca los marcadores en la cabeza. De forma predeterminada, la línea de referencia es definida por *x* y *y*, y los tallos se extraen verticalmente de *abajo* a *z*.

source: The positions of the heads of the stems. The stems are drawn along the *orientation*-direction from the baseline at *bottom* (in the *orientation*-coordinate) to the heads. By default, the *x* and *y* positions are used for the baseline and *z* for the head position, but this can be changed by *orientation*.
es_es: Las posiciones de los jefes de los tallos. Los tallos se dibujan a lo largo de la *orientación*-dirección desde la línea de base en *abajo* (en la *orientación*-coordinación) hacia la cabeza. De forma predeterminada, las posiciones *x* y *y* se utilizan para la línea base y *z* para la posición principal, pero esto puede cambiarse por *orientación*.

source: str, default: 'C0-'
es_es: str, por defecto: 'C0-'

source: A string defining the properties of the vertical lines. Usually, this will be a color or a color and a linestyle:
es_es: Una cadena que define las propiedades de las líneas verticales. Normalmente, esto será un color o un color y un estilo de línea:

source: Character
es_es: Carácter

source: Line Style
es_es: Estilo de línea

source: solid line
es_es: línea sólida

source: dashed line
es_es: línea de guiones

source: dash-dot line
es_es: línea de punto de guión

source: dotted line
es_es: línea de puntos

source: Note: While it is technically possible to specify valid formats other than color or color and linestyle (e.g. 'rx' or '-.'), this is beyond the intention of the method and will most likely not result in a reasonable plot.
es_es: Nota: Mientras que técnicamente es posible especificar formatos válidos que no sean el color o el color y el estilo de línea (p. ej. 'rx' o '-.'), esto va más allá de la intención del método y lo más probable es que no resulte en una trama razonable.

source: str, default: 'C0o'
es_es: str, por defecto: 'C0o'

source: A string defining the properties of the markers at the stem heads.
es_es: Una cadena que define las propiedades de los marcadores en las cabezas del tallo.

source: **basefmt**
es_es: **base**

source: str, default: 'C3-'
es_es: str, por defecto: 'C3-'

source: A format string defining the properties of the baseline.
es_es: Una cadena de formato que define las propiedades de la línea base.

source: **bottom**
es_es: **inferior**

source: The position of the baseline, in *orientation*-coordinates.
es_es: La posición de la línea de base, en coordenadas de *orientación*.

source: str, default: None
es_es: str, por defecto: ninguno

source: The label to use for the stems in legends.
es_es: La etiqueta a usar para los tallos en leyendas.

source: **orientation**
es_es: **orientación**

source: The direction along which stems are drawn.
es_es: La dirección a lo largo de la cual los tallos se dibujan.

source: The container may be treated like a tuple (*markerline*, *stemlines*, *baseline*)
es_es: El contenedor puede ser tratado como una tupla (*marcador de línea*, *líneas de tallo*, *línea de referencia*)

source: (`Source code <../../gallery/mplot3d/stem3d_demo.py>`__, `png <../../gallery/mplot3d/stem3d_demo_00_00.png>`__, `pdf <../../gallery/mplot3d/stem3d_demo_00_00.pdf>`__)
es_es: (`Código fuente <../../gallery/mplot3d/stem3d_demo.py>`__, `png <../../gallery/mplot3d/stem3d_demo_00_00.png>`__, `pdf <../../gallery/mplot3d/stem3d_demo_00_00.pdf>`__)

source: Add text to the plot. kwargs will be passed on to Axes.text, except for the *zdir* keyword, which sets the direction to be used as the z direction.
es_es: Añade texto al gráfico. Los kwargs se pasarán a Axes.text, excepto la palabra clave *zdir*, que establece la dirección que se utilizará como dirección z.

source: Add text to the Axes.
es_es: Añadir texto a los ejes.

source: Add the text *s* to the Axes at location *x*, *y* in data coordinates.
es_es: Añade el texto *s* a los ejes en la ubicación *x*, *y* en las coordenadas de datos.

source: The position to place the text. By default, this is in data coordinates. The coordinate system can be changed using the *transform* parameter.
es_es: La posición para colocar el texto. De forma predeterminada, esto está en coordenadas de datos. El sistema de coordenadas puede cambiarse usando el parámetro *transform*.

source: The text.
es_es: El texto.

source: dict, default: None
es_es: dictamen, predeterminado: ninguno

source: A dictionary to override the default text properties. If fontdict is None, the defaults are determined by `.rcParams`.
es_es: Un diccionario para sobreescribir las propiedades de texto predeterminadas. Si fontdict no es ninguno, los valores por defecto son determinados por `.rcParams`.

source: The created `.Text` instance.
es_es: La instancia `.Text` creada.

source: **\*\*kwargs** : `~matplotlib.text.Text` properties.
es_es: **\*\*kwargs** : propiedades `~matplotlib.text.Text`.

source: Other miscellaneous text parameters.
es_es: Otros parámetros de texto variados.

source: dict with properties for `.patches.FancyBboxPatch`
es_es: dict con propiedades para `.patches.FancyBboxPatch`

source: :meth:`fontfamily <matplotlib.text.Text.set_fontfamily>` or family
es_es: :meth:`fontfamily <matplotlib.text.Text.set_fontfamily>` o familia

source: :meth:`fontproperties <matplotlib.text.Text.set_fontproperties>` or font or font_properties
es_es: :meth:`fontproperties <matplotlib.text.Text.set_fontproperties>` o font o font_properties

source: `.font_manager.FontProperties` or `str` or `pathlib.Path`
es_es: `.font_manager.FontProperties` o `str` o `pathlib.Path`

source: :meth:`fontsize <matplotlib.text.Text.set_fontsize>` or size
es_es: :meth:`fontsize <matplotlib.text.Text.set_fontsize>` o size

source: {a numeric value in range 0-1000, 'ultra-condensed', 'extra-condensed', 'condensed', 'semi-condensed', 'normal', 'semi-expanded', 'expanded', 'extra-expanded', 'ultra-expanded'}
es_es: {un valor numérico en el rango 0-1000, 'ultra-condensed', 'extra-condensed', 'condensed', 'semi-condensed', 'normal', 'semi-expanded', 'expanded', 'extra-expanded', 'ultra-expanded'}

source: :meth:`fontstyle <matplotlib.text.Text.set_fontstyle>` or style
es_es: :meth:`fontstyle <matplotlib.text.Text.set_fontstyle>` o style

source: :meth:`fontvariant <matplotlib.text.Text.set_fontvariant>` or variant
es_es: :meth:`fontvariant <matplotlib.text.Text.set_fontvariant>` o variant

source: {a numeric value in range 0-1000, 'ultralight', 'light', 'normal', 'regular', 'book', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'}
es_es: {un valor numérico en el rango 0-1000, 'ultralight', 'light', 'normal', 'regular', 'book', 'medium', 'roman', 'semibold', 'demibold', 'demi', 'bold', 'heavy', 'extra bold', 'black'}

source: float (multiple of font size)
es_es: float (múltiplo del tamaño de la fuente)

source: :meth:`multialignment <matplotlib.text.Text.set_multialignment>` or ma
es_es: :meth:`multialignment <matplotlib.text.Text.set_multialignment>` o ma

source: float or {'vertical', 'horizontal'}
es_es: float o {'vertical', 'horizontal'}

source: Individual keyword arguments can be used to override any given parameter::
es_es: Los argumentos de palabra clave individual pueden ser usados para reemplazar cualquier parámetro dado::

source: The default transform specifies that text is in data coords, alternatively, you can specify text in axis coords ((0, 0) is lower-left and (1, 1) is upper-right). The example below places text in the center of the Axes::
es_es: La transformación por defecto especifica que el texto está en coordenadas de datos, alternativamente, puede especificar texto en las coordenadas del eje (0, 0) es inferior izquierda y (1, 1) es superior derecha). El siguiente ejemplo coloca texto en el centro de los Ejes::

source: You can put a rectangular box around the text instance (e.g., to set a background color) by using the keyword *bbox*. *bbox* is a dictionary of `~matplotlib.patches.Rectangle` properties. For example::
es_es: Puede poner un cuadro rectangular alrededor de la instancia de texto (por ejemplo, para establecer un color de fondo) usando la palabra clave *bbox*. *bbox* es un diccionario de las propiedades `~matplotlib.patches.Rectangle`. Por ejemplo::

source: Convenience method for changing the appearance of ticks and tick labels.
es_es: Método de conveniencia para cambiar la apariencia de ticks y etiquetas de tick.

source: See :meth:`matplotlib.axes.Axes.tick_params` for more complete documentation.
es_es: Vea :meth:`matplotlib.axes.Axes.tick_params` para documentación más completa.

source: The only difference is that setting *axis* to 'both' will mean that the settings are applied to all three axes. Also, the *axis* parameter also accepts a value of 'z', which would mean to apply to only the z-axis.
es_es: La única diferencia es que configurar *eje* a 'ambos' significará que los ajustes se aplican a los tres ejes. Además, el parámetro *eje* también acepta un valor de 'z', lo que significaría que se aplicaría sólo al eje z.

source: Also, because of how Axes3D objects are drawn very differently from regular 2D axes, some of these settings may have ambiguous meaning. For simplicity, the 'z' axis will accept settings as if it was like the 'y' axis.
es_es: Además, debido a cómo los objetos Axes3D se dibujan de forma muy diferente a los ejes 2D normales, algunos de estos ajustes pueden tener un significado ambiguo. Por simplicidad, el eje 'z' aceptará ajustes como si fuera como si fuera el eje 'y'.

source: Axes3D currently ignores some of these settings.
es_es: Axes3D actualmente ignora algunos de estos ajustes.

source: This method currently produces incorrect output due to a longstanding bug in 3D PolyCollection rendering.
es_es: Este método produce actualmente una salida incorrecta debido a un error de larga data en la representación de PolyCollection 3D.

source: Input data. See `~matplotlib.axes.Axes.tricontour` for acceptable data shapes.
es_es: Datos de entrada. Ver `~matplotlib.axes.Axes.tricontour` para las formas de datos aceptables.

source: Other arguments are forwarded to `matplotlib.axes.Axes.tricontour`.
es_es: Los demás argumentos se envían a `matplotlib.axes.Axes.tricontour`.

source: Input data. See `~matplotlib.axes.Axes.tricontourf` for acceptable data shapes.
es_es: Datos de entrada. Ver `~matplotlib.axes.Axes.tricontourf` para las formas de datos aceptables.

source: Other arguments are forwarded to `matplotlib.axes.Axes.tricontourf`.
es_es: Los demás argumentos se envían a `matplotlib.axes.Axes.tricontourf`.

source: Extend the `~.Axes.dataLim` Bbox to include the given points.
es_es: Extiende el cuadro `~.Axes.dataLim` para incluir los puntos dados.

source: If no data is set currently, the Bbox will ignore its limits and set the bound to be the bounds of the xydata (*xys*). Otherwise, it will compute the bounds of the union of its current data and the data in *xys*.
es_es: Si no hay datos configurados actualmente, la Bbox ignorará sus límites y establecerá los límites de los xydata (*xys*). De lo contrario, calculará los límites de la unión de sus datos actuales y los datos en *xys*.

source: 2D array-like
es_es: Arreglo 2D

source: The points to include in the data limits Bbox. This can be either a list of (x, y) tuples or a Nx2 array.
es_es: Los puntos a incluir en la casilla límites de datos. Puede ser una lista de (x, y) tuples o una matriz Nx2.

source: Whether to update the x/y limits.
es_es: Si actualizar los límites x/y.

source: Set the elevation and azimuth of the axes in degrees (not radians).
es_es: Establece la elevación y azimut de los ejes en grados (no radianes).

source: This can be used to rotate the axes programmatically.
es_es: Esto puede utilizarse para rotar los ejes de forma programática.

source: The elevation angle in the vertical plane in degrees. If None then the initial value as specified in the `Axes3D` constructor is used.
es_es: El ángulo de elevación en el plano vertical en grados. Si Ninguno entonces se utiliza el valor inicial como se especifica en el constructor 'Axes3D'.

source: The azimuth angle in the horizontal plane in degrees. If None then the initial value as specified in the `Axes3D` constructor is used.
es_es: El ángulo de azimut en el plano horizontal en grados. Si Ninguno, entonces el valor inicial especificado en el constructor `Axes3D` es usado.

source: **vertical_axis**
es_es: **eje vertical**

source: {"z", "x", "y"}, default: "z"
es_es: {"z", "x", "y"}, por defecto: "z"

source: The axis to align vertically. *azim* rotates about this axis.
es_es: El eje para alinear verticalmente. *azim* gira sobre este eje.

source: Plot a set of filled voxels
es_es: Trazar un conjunto de vóxeles rellenados
