Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.axes_grid1.axes_size.po
Languages: es_es

source: mpl\_toolkits.axes\_grid1.axes\_size
es_es: mpl\_toolkits.axes\_grid1.ejes\_tamaño\_

source: Provides classes of simple units that will be used with AxesDivider class (or others) to determine the size of each axes. The unit classes define `get_size` method that returns a tuple of two floats, meaning relative and absolute sizes, respectively.
es_es: Proporciona clases de unidades simples que se usarán con la clase AxesDivider (o otros) para determinar el tamaño de cada eje. Las clases unitarias definen el método `get_size` que devuelve una tupla de dos flotantes, lo que significa tamaños relativos y absolutos, respectivamente.

source: Note that this class is nothing more than a simple tuple of two floats. Take a look at the Divider class to see how these two values are used.
es_es: Tenga en cuenta que esta clase no es más que una simple tupla de dos flotantes. Echa un vistazo a la clase Divider para ver cómo se utilizan estos dos valores.

source: Classes
es_es: Clases

source: :py:obj:`Add <mpl_toolkits.axes_grid1.axes_size.Add>`\ \(a\, b\)
es_es: :py:obj:`Añadir <mpl_toolkits.axes_grid1.axes_size.Add>`\ \(a\, b\)

source: Scaled size whose relative part corresponds to the data width of the *axes* multiplied by the *aspect*.
es_es: Tamaño escalado cuya parte relativa corresponde al ancho de datos de los *ejes* multiplicados por el *aspecto*.

source: :py:obj:`AxesY <mpl_toolkits.axes_grid1.axes_size.AxesY>`\ \(axes\[\, aspect\, ref\_ax\]\)
es_es: :py:obj:`EjesY <mpl_toolkits.axes_grid1.axes_size.AxesY>`\ \(ejes\[\, aspect\, ref\_ax\]\)

source: Scaled size whose relative part corresponds to the data height of the *axes* multiplied by the *aspect*.
es_es: Tamaño escalado cuya parte relativa corresponde a la altura de los datos de los *ejes* multiplicados por el *aspecto*.

source: :py:obj:`Fixed <mpl_toolkits.axes_grid1.axes_size.Fixed>`\ \(fixed\_size\)
es_es: :py:obj:`Corregido <mpl_toolkits.axes_grid1.axes_size.Fixed>`\ \(fixed\_size\)

source: Simple fixed size with absolute part = *fixed_size* and relative part = 0.
es_es: Tamaño fijo simple con parte absoluta = *fixed_size* y parte relativa = 0.

source: :py:obj:`Fraction <mpl_toolkits.axes_grid1.axes_size.Fraction>`\ \(fraction\, ref\_size\)
es_es: :py:obj:`Fracción <mpl_toolkits.axes_grid1.axes_size.Fraction>`\ \(fraction\, ref\_size\)

source: An instance whose size is a *fraction* of the *ref_size*.
es_es: Una instancia cuyo tamaño es una *fracción* del *ref_size*.

source: Size whose absolute part is either the largest width or the largest height of the given *artist_list*.
es_es: Tamaño cuya parte absoluta es o bien la mayor anchura o la mayor altura de la *artist_list* dada.

source: Size whose absolute part is the largest height of the given *artist_list*.
es_es: Tamaño cuya parte absoluta es la altura más grande de la *artist_list* dada.

source: Size whose absolute part is the largest width of the given *artist_list*.
es_es: Tamaño cuya parte absoluta es el ancho más grande de la *artist_list* dada.

source: :py:obj:`Padded <mpl_toolkits.axes_grid1.axes_size.Padded>`\ \(size\, pad\)
es_es: :py:obj:`Añadido <mpl_toolkits.axes_grid1.axes_size.Padded>`\ \(tamaño\, pad\)

source: Return a instance where the absolute part of *size* is increase by the amount of *pad*.
es_es: Devuelve una instancia donde la parte absoluta de *size* es incrementada por la cantidad de *pad*.

source: :py:obj:`Scalable <mpl_toolkits.axes_grid1.axes_size.Scalable>`\
es_es: :py:obj:`Escalable <mpl_toolkits.axes_grid1.axes_size.Scalable>`\

source: alias of :py:class:`mpl_toolkits.axes_grid1.axes_size.Scaled`
es_es: alias de :py:class:`mpl_toolkits.axes_grid1.axes_size.Escalado`

source: :py:obj:`Scaled <mpl_toolkits.axes_grid1.axes_size.Scaled>`\ \(scalable\_size\)
es_es: :py:obj:`Escalado <mpl_toolkits.axes_grid1.axes_size.Scaled>`\ \(escalable\_size\)

source: Simple scaled(?) size with absolute part = 0 and relative part = *scalable_size*.
es_es: Tamaño simple escalado(?) con parte absoluta = 0 y parte relativa = *escalable_size*.

source: Functions
es_es: Funciones

source: Create a Fixed unit when the first argument is a float, or a Fraction unit if that is a string that ends with %.
es_es: Crea una unidad fija cuando el primer argumento es un float, o una Fracción si es una cadena que termina con %.
