Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.mplot3d.axes3d.Axes3D.po
Languages: es_es

source: All voxels are plotted as 1x1x1 cubes on the axis, with ``filled[0, 0, 0]`` placed with its lower corner at the origin. Occluded faces are not plotted.
es_es: Todos los vóxeles son graficados como cubos 1x1x1 en el eje, con ``llenados[0, 0, 0]`` colocados con su esquina inferior en el origen. Los rostros ocultos no están trazados.

source: **filled**
es_es: **llenado**

source: 3D np.array of bool
es_es: Np.array 3D de bool

source: A 3D array of values, with truthy values indicating which voxels to fill
es_es: Una matriz 3D de valores, con valores verdaderos que indican los vóxeles a llenar

source: 3D np.array, optional
es_es: np.array 3D, opcional

source: The coordinates of the corners of the voxels. This should broadcast to a shape one larger in every dimension than the shape of *filled*. These can be used to plot non-cubic voxels.
es_es: Las coordenadas de las esquinas de los vóxeles. Esto debería transmitirse a una forma más grande en cada dimensión que la forma de *llenado*. Se pueden utilizar para trazar vóxeles no cúbicos.

source: If not specified, defaults to increasing integers along each axis, like those returned by :func:`~numpy.indices`. As indicated by the ``/`` in the function signature, these arguments can only be passed positionally.
es_es: Si no se especifica, por defecto aumenta enteros a lo largo de cada eje, como los devueltos por :func:`~numpy. ndices`. Como indica el ``/`` en la firma de la función, estos argumentos sólo pueden ser pasados posicionalmente.

source: array-like, optional
es_es: tipo arreglo, opcional

source: The color to draw the faces and edges of the voxels. Can only be passed as keyword arguments. These parameters can be:
es_es: El color para dibujar las caras y bordes de los vóxeles. Sólo se puede pasar como argumentos de palabra clave. Estos parámetros pueden ser:

source: A single color value, to color all voxels the same color. This can be either a string, or a 1D rgb/rgba array
es_es: Un único valor de color, para colorear todos los vóxeles del mismo color. Esto puede ser una cadena, o una matriz 1D rgb/rgba

source: ``None``, the default, to use a single color for the faces, and the style default for the edges.
es_es: ``nunca``, el valor predeterminado, para usar un solo color para las caras, y el estilo predeterminado para los bordes.

source: A 3D ndarray of color names, with each item the color for the corresponding voxel. The size must match the voxels.
es_es: Un ndarray 3D de nombres de color, con cada elemento el color del vóxel correspondiente. El tamaño debe coincidir con los vóxeles.

source: A 4D ndarray of rgb/rgba data, with the components along the last axis.
es_es: Un ndarray 4D de datos rgb/rgba, con los componentes a lo largo del último eje.

source: Additional keyword arguments to pass onto `~mpl_toolkits.mplot3d.art3d.Poly3DCollection`.
es_es: Argumentos adicionales de palabras clave para pasar a `~mpl_toolkits.mplot3d.art3d.Poly3DCollection`.

source: **faces**
es_es: **caras**

source: A dictionary indexed by coordinate, where ``faces[i, j, k]`` is a `.Poly3DCollection` of the faces drawn for the voxel ``filled[i, j, k]``. If no faces were drawn for a given voxel, either because it was not asked to be drawn, or it is fully occluded, then ``(i, j, k) not in faces``.
es_es: Un diccionario indexado por coordenada, donde ``faces[i, j, k]`` es un `.Poly3DCollection` de las caras dibujadas para el voxel ``filled[i, j, k]``. Si no se dibujaron caras para un vóxel determinado, ya sea porque no se le pidió que se dibujara, o está completamente oculto, entonces ``(i, j, k) no en las caras``.

source: (`Source code <../../gallery/mplot3d/voxels.py>`__, `png <../../gallery/mplot3d/voxels.png>`__, `pdf <../../gallery/mplot3d/voxels.pdf>`__)
es_es: (`Código fuente <../../gallery/mplot3d/voxels.py>`__, `png <../../gallery/mplot3d/voxels.png>`__, `pdf <../../gallery/mplot3d/voxels.pdf>`__)

source: (`Source code <../../gallery/mplot3d/voxels_rgb.py>`__, `png <../../gallery/mplot3d/voxels_rgb.png>`__, `pdf <../../gallery/mplot3d/voxels_rgb.pdf>`__)
es_es: (`Código fuente <../../gallery/mplot3d/voxels_rgb.py>`__, `png <../../gallery/mplot3d/voxels_rgb.png>`__, `pdf <../../gallery/mplot3d/voxels_rgb.pdf>`__)

source: (`Source code <../../gallery/mplot3d/voxels_torus.py>`__, `png <../../gallery/mplot3d/voxels_torus.png>`__, `pdf <../../gallery/mplot3d/voxels_torus.pdf>`__)
es_es: (`Código fuente <../../gallery/mplot3d/voxels_torus.py>`__, `png <../../gallery/mplot3d/voxels_torus.png>`__, `pdf <../../gallery/mplot3d/voxels_torus.pdf>`__)

source: (`Source code <../../gallery/mplot3d/voxels_numpy_logo.py>`__, `png <../../gallery/mplot3d/voxels_numpy_logo.png>`__, `pdf <../../gallery/mplot3d/voxels_numpy_logo.pdf>`__)
es_es: (`Código fuente <../../gallery/mplot3d/voxels_numpy_logo.py>`__, `png <../../gallery/mplot3d/voxels_numpy_logo.png>`__, `pdf <../../gallery/mplot3d/voxels_numpy_logo.pdf>`__)

source: Set up axis ticks and labels to treat data along the zaxis as dates.
es_es: Establezca etiquetas y ticks de eje para tratar los datos a lo largo del zaxis como fechas.

source: **tz** : str or `datetime.tzinfo`, default: :rc:`timezone`
es_es: **tz** : str o `datetime.tzinfo`, por defecto: :rc:`timezone`

source: str or
es_es: str o

source: The timezone used to create date labels.
es_es: La zona horaria utilizada para crear etiquetas de fecha.

source: This function is merely provided for completeness, but 3D axes do not support dates for ticks, and so this may not work as expected.
es_es: Esta función se proporciona simplemente para su integridad, pero los ejes 3D no soportan fechas para ticks, por lo que esto puede no funcionar como se esperaba.

source: Returns True if the z-axis is inverted.
es_es: Devuelve Verdadero si el eje Z es invertido.
