Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.mplot3d.axes3d.Axes3D.po
Languages: es_es

source: renderer that will be used to draw the figures (i.e. ``fig.canvas.get_renderer()``)
es_es: renderizador que se utilizará para dibujar las figuras (es decir, ``fig.canvas.get_renderer()``)

source: **bbox_extra_artists** : list of `.Artist` or ``None``
es_es: **bbox_extra_artistas** : lista de `.Artist` o ``None ``

source: list of
es_es: lista de

source: List of artists to include in the tight bounding box. If ``None`` (default), then all artist children of the Axes are included in the tight bounding box.
es_es: Lista de artistas a incluir en la caja de límites ajustada. Si ``Ninguno`` (por defecto), entonces todos los hijos de los artistas de los ejes están incluidos en la caja ajustada.

source: **call_axes_locator**
es_es: **localizador_ejes**

source: If *call_axes_locator* is ``False``, it does not call the ``_axes_locator`` attribute, which is necessary to get the correct bounding box. ``call_axes_locator=False`` can be used if the caller is only interested in the relative size of the tightbbox compared to the Axes bbox.
es_es: Si *call_axes_locator* es ``False``, no llama el atributo ``_axes_locator``, que es necesario para obtener la caja de límites correcta. ``call_axes_locator=False`` puede ser usado si la persona que llama sólo está interesada en el tamaño relativo de la caja con tightbbox comparada con la caja con los ejes.

source: **for_layout_only**
es_es: **solo_diseño**

source: default: False
es_es: por defecto: False

source: The bounding box will *not* include the x-extent of the title and the xlabel, or the y-extent of the ylabel.
es_es: El recuadro *no* incluirá la extensión x del título y la etiqueta x, o el alcance de la etiqueta ylabel.

source: Bounding box in figure pixel coordinates.
es_es: Cuadro delimitador en coordenadas de píxeles de figura.

source: Get 3D world limits.
es_es: Obtener límites de mundo en 3D.

source: Alias for `get_xlim3d`.
es_es: Alias para `get_xlim3d`.

source: Return the x-axis view limits.
es_es: Devuelve los límites de la vista del eje x.

source: **left, right**
es_es: **izquierda, derecha**

source: The current x-axis limits in data coordinates.
es_es: Límites actuales de eje x en coordenadas de datos.

source: The x-axis may be inverted, in which case the *left* value will be greater than the *right* value.
es_es: El eje x puede ser invertido, en cuyo caso el valor *izquierda* será mayor que el valor *derecha*.

source: Alias for `get_ylim3d`.
es_es: Alias para `get_ylim3d`.

source: Return the y-axis view limits.
es_es: Devuelve los límites de la vista del eje y.

source: **bottom, top**
es_es: **abajo, arriba**

source: The current y-axis limits in data coordinates.
es_es: Límites del eje Y en las coordenadas de datos.

source: The y-axis may be inverted, in which case the *bottom* value will be greater than the *top* value.
es_es: El eje Y puede ser invertido, en cuyo caso el valor *inferior* será mayor que el valor *superior*.

source: Return the ``ZAxis`` (`~.axis3d.Axis`) instance.
es_es: Devuelve la instancia ``ZAxis`` (`~.axis3d.Axis`).

source: Return the lower and upper z-axis bounds, in increasing order.
es_es: Devuelve los límites inferiores y superiores en orden creciente.

source: Return the zaxis' grid lines as a list of `.Line2D`\s.
es_es: Devuelve las líneas de cuadrícula de zaxis como una lista de `.Line2D`\s.

source: Get the z-label text string.
es_es: Obtener la cadena de texto en la etiqueta z.

source: Alias for `get_zlim3d`.
es_es: Alias para `get_zlim3d`.

source: Get 3D z limits.
es_es: Obtener límites de z 3D.

source: Return the zaxis' major tick labels, as a list of `~.text.Text`.
es_es: Devuelve las etiquetas principales de tick, como una lista de `~.text.Text`.

source: Return the zaxis' minor tick labels, as a list of `~.text.Text`.
es_es: Devuelve las etiquetas de tick menores de zaxis, como una lista de `~.text.Text`.

source: Get the zaxis' tick labels.
es_es: Obtener las etiquetas de ticks de zaxis.

source: Whether to return the minor or the major ticklabels.
es_es: Si se devuelve el menor o el mayor sello de etiquetas.

source: **which**
es_es: **qué**

source: None, ('minor', 'major', 'both')
es_es: Ninguno, ('menor', 'mayor', 'ambos')

source: Overrides *minor*.
es_es: Sobreescribe *menor*.

source: Selects which ticklabels to return
es_es: Selecciona qué etiquetas retornar

source: list of `~matplotlib.text.Text`
es_es: lista de `~matplotlib.text.Text`

source: The tick label strings are not populated until a ``draw`` method has been called.
es_es: Las cadenas de etiquetas de tick no se llenan hasta que se haya llamado a un método ``draw``.

source: See also: `~.pyplot.draw` and `~.FigureCanvasBase.draw`.
es_es: Vea también: `~.pyplot.draw` y `~.FigureCanvasBase.draw`.

source: Return the zaxis' tick lines as a list of `.Line2D`\s.
es_es: Devuelve las líneas de ticks de zaxis como una lista de `.Line2D`\s.

source: Return the zaxis' tick locations in data coordinates.
es_es: Devuelve las ubicaciones de ticks de los zaxis en las coordenadas de datos.

source: Set / unset 3D grid.
es_es: Establecer / quitar cuadrícula 3D.

source: Currently, this function does not behave the same as :meth:`matplotlib.axes.Axes.grid`, but it is intended to eventually support that behavior.
es_es: Actualmente, esta función no se comporta de la misma manera que :meth:`matplotlib.axes.Axes.grid`, pero está pensada para soportar ese comportamiento.

source: Invert the z-axis.
es_es: Invertir el eje z.

source: Convenience method for controlling tick locators.
es_es: Método de comodidad para controlar los localizadores de ticket.

source: See :meth:`matplotlib.axes.Axes.locator_params` for full documentation. Note that this is for Axes3D objects, therefore, setting *axis* to 'both' will result in the parameters being set for all three axes. Also, *axis* can also take a value of 'z' to apply parameters to the z axis.
es_es: Vea :meth:`matplotlib.axes.Axes.locator_params` para la documentación completa. Tenga en cuenta que esto es para objetos Ejes3D, por lo tanto, configurar *eje* a 'ambos' dará como resultado que los parámetros se establezcan para los tres ejes. Además, el *eje* también puede tomar un valor de 'z' para aplicar parámetros al eje z.

source: Convenience method to set or retrieve autoscaling margins.
es_es: Método de conveniencia para establecer o recuperar márgenes de autoescalado.

source: Call signatures::
es_es: Firma de llamadas::

source: returns xmargin, ymargin, zmargin
es_es: devuelve xmargin, ymargin, zmargin

source: All forms above set the xmargin, ymargin and zmargin parameters. All keyword parameters are optional. A single positional argument specifies xmargin, ymargin and zmargin. Passing both positional and keyword arguments for xmargin, ymargin, and/or zmargin is invalid.
es_es: Todos los formularios anteriores establecen los parámetros xmargin, ymargin y zmargin. Todos los parámetros de palabra clave son opcionales. Un único argumento posicional especifica xmargin, ymargin y zmargin. Pasar los argumentos de posición y palabra clave para xmargin, ymargin, y/o zmargin no es válido.

source: The *tight* parameter is passed to :meth:`autoscale_view`, which is executed after a margin is changed; the default here is *True*, on the assumption that when margins are specified, no additional padding to match tick marks is usually desired. Setting *tight* to *None* will preserve the previous setting.
es_es: El parámetro *tight* se pasa a :meth:`autoscale_view`, que se ejecuta después de que se cambia un margen; el valor por defecto aquí es *True*, en la suposición de que cuando se especifican márgenes, no se suele desear ningún relleno adicional para que coincida con las marcas de tick. Configurar *tight* a *nunca* preservará la configuración anterior.

source: Specifying any margin changes only the autoscaling; for example, if *xmargin* is not None, then *xmargin* times the X data interval will be added to each end of that interval before it is used in autoscaling.
es_es: Especificar cualquier margen sólo cambia la autoescalada; por ejemplo, si *xmargin* no es ninguno, luego *xmargin* veces que el intervalo de datos X se agregará a cada extremo de ese intervalo antes de que se use en la autocalado.

source: Set the mouse buttons for 3D rotation and zooming.
es_es: Ajuste los botones del ratón para la rotación 3D y el zooming.

source: int or list of int, default: 1
es_es: int o lista de int, por defecto: 1

source: The mouse button or buttons to use for 3D rotation of the axes.
es_es: El botón del ratón o los botones para la rotación 3D de los ejes.

source: int or list of int, default: 3
es_es: int o lista de int, por defecto: 3

source: The mouse button or buttons to use to zoom the 3D axes.
es_es: El botón del ratón o los botones a usar para acercar los ejes 3D.

source: Plot 2D or 3D data.
es_es: Graficar datos en 2D o 3D.

source: x coordinates of vertices.
es_es: coordenadas x de los vértices.

source: y coordinates of vertices.
es_es: coordenadas y de los vértices.

source: z coordinates of vertices; either one for all points or one for each point.
es_es: coordenadas z de los vértices; una para todos los puntos o una para cada punto.

source: Other arguments are forwarded to `matplotlib.axes.Axes.plot`.
es_es: Los demás argumentos se envían a `matplotlib.axes.Axes.plot`.

source: Create a surface plot.
es_es: Crear un gráfico de superficie.

source: By default it will be colored in shades of a solid color, but it also supports colormapping by supplying the *cmap* argument.
es_es: Por defecto se coloreará en tonos de un color sólido, pero también admite la asignación de colores suministrando el argumento *cmap*.

source: The *rcount* and *ccount* kwargs, which both default to 50, determine the maximum number of samples used in each direction. If the input data is larger, it will be downsampled (by slicing) to these numbers of points.
es_es: Los kwargs *rcount* y *ccount*, que por defecto son 50, determinan el número máximo de muestras utilizadas en cada dirección. Si los datos de entrada son más grandes, se muestrearán a la baja (por corte) a estos números de puntos.

source: To maximize rendering speed consider setting *rstride* and *cstride* to divisors of the number of rows minus 1 and columns minus 1 respectively. For example, given 51 rows rstride can be any of the divisors of 50.
es_es: Para maximizar la velocidad de renderizado, considere establecer *rstride* y *cstride* como divisores del número de filas menos 1 y de columnas menos 1, respectivamente. Por ejemplo, dadas 51 filas, rstride puede ser cualquiera de los divisores de 50.

source: Similarly, a setting of *rstride* and *cstride* equal to 1 (or *rcount* and *ccount* equal the number of rows and columns) can use the optimized path.
es_es: Del mismo modo, una configuración de *rstride* y *cstride* igual a 1 (o *rcount* y *ccount* igual al número de filas y columnas) puede utilizar la ruta optimizada.

source: 2D arrays
es_es: Arreglos 2D

source: Data values.
es_es: Valores de los datos.

source: Maximum number of samples used in each direction. If the input data is larger, it will be downsampled (by slicing) to these numbers of points. Defaults to 50.
es_es: Número máximo de muestras utilizadas en cada dirección. Si los datos de entrada son más grandes, se muestrearán a la baja (por corte) hasta este número de puntos. El valor predeterminado es 50.

source: Downsampling stride in each direction. These arguments are mutually exclusive with *rcount* and *ccount*. If only one of *rstride* or *cstride* is set, the other defaults to 10.
es_es: Muestreo descendente en cada dirección. Estos argumentos son mutuamente excluyentes con *rcount* y *ccount*. Si sólo se establece uno de los argumentos *rstride* o *cstride*, el otro tiene un valor predeterminado de 10.

source: 'classic' mode uses a default of ``rstride = cstride = 10`` instead of the new default of ``rcount = ccount = 50``.
es_es: El modo 'classic' utiliza un valor por defecto de ``rstride = cstride = 10`` en lugar del nuevo valor por defecto de ``rcount = ccount = 50``.

source: Color of the surface patches.
es_es: Color de las zonas de la superficie.

source: Colormap of the surface patches.
es_es: Mapa de colores de las zonas de la superficie.

source: Colors of each individual patch.
es_es: Colores de cada zona individual.

source: Normalization for the colormap.
es_es: Normalización del mapa de colores.

source: Bounds for the normalization.
es_es: Límites para la normalización.

source: Whether to shade the facecolors. Shading is always disabled when *cmap* is specified.
es_es: Si se sombrean los colores de la cara. El sombreado siempre está desactivado cuando se especifica *cmap*.

source: Other arguments are forwarded to `.Poly3DCollection`.
es_es: Los demás argumentos se envían a `.Poly3DCollection`.

source: Plot a triangulated surface.
es_es: Graficar una superficie triangulada.

source: The (optional) triangulation can be specified in one of two ways; either::
es_es: La triangulación (opcional) puede especificarse de dos maneras::

source: where triangulation is a `~matplotlib.tri.Triangulation` object, or::
es_es: donde la triangulación es un objeto `~matplotlib.tri.Triangulation`, o::

source: in which case a Triangulation object will be created. See `.Triangulation` for a explanation of these possibilities.
es_es: en cuyo caso se creará un objeto de triangulación. Ver `.Triangulación` para una explicación de estas posibilidades.

source: The remaining arguments are::
es_es: Los argumentos restantes son::

source: where *Z* is the array of values to contour, one per point in the triangulation.
es_es: donde *Z* es el arreglo de valores a contornear, uno por punto de la triangulación.

source: Data values as 1D arrays.
es_es: Valores de datos como arreglos 1D.

source: A colormap for the surface patches.
es_es: Un mapa de colores para las zonas de superficie.

source: An instance of Normalize to map values to colors.
es_es: Una instancia de Normalize para asignar valores a colores.

source: Minimum and maximum value to map.
es_es: Valor mínimo y máximo a mapear.

source: All other arguments are passed on to :class:`~mpl_toolkits.mplot3d.art3d.Poly3DCollection`
es_es: Todos los demás argumentos se pasan a :class:`~mpl_toolkits.mplot3d.art3d.Poly3DCollection`

source: Plot a 3D wireframe.
es_es: Graficar un wireframe 3D.

source: Maximum number of samples used in each direction. If the input data is larger, it will be downsampled (by slicing) to these numbers of points. Setting a count to zero causes the data to be not sampled in the corresponding direction, producing a 3D line plot rather than a wireframe plot. Defaults to 50.
es_es: Número máximo de muestras utilizadas en cada dirección. Si los datos de entrada son más grandes, se muestrearán en menor medida (mediante el corte) hasta este número de puntos. Establecer un recuento a cero hace que los datos no sean muestreados en la dirección correspondiente, produciendo un gráfico de líneas 3D en lugar de un gráfico de wireframe. El valor predeterminado es 50.

source: Downsampling stride in each direction. These arguments are mutually exclusive with *rcount* and *ccount*. If only one of *rstride* or *cstride* is set, the other defaults to 1. Setting a stride to zero causes the data to be not sampled in the corresponding direction, producing a 3D line plot rather than a wireframe plot.
es_es: Muestreo descendente en cada dirección. Estos argumentos son mutuamente excluyentes con *rcount* y *ccount*. Si sólo se establece uno de los argumentos *rstride* o *cstride*, el otro tiene el valor predeterminado de 1. Si se establece un stride a cero, los datos no se muestrean en la dirección correspondiente, lo que produce un gráfico de líneas 3D en lugar de un gráfico wireframe.

source: 'classic' mode uses a default of ``rstride = cstride = 1`` instead of the new default of ``rcount = ccount = 50``.
es_es: El modo 'classic' utiliza un valor por defecto de ``rstride = cstride = 1`` en lugar del nuevo valor por defecto de ``rcount = ccount = 50``.

source: Other arguments are forwarded to `.Line3DCollection`.
es_es: Los demás argumentos se envían a `.Line3DCollection`.

source: Plot a 3D field of arrows.
es_es: Graficar un campo de flechas en 3D.

source: The arguments could be array-like or scalars, so long as they they can be broadcast together. The arguments can also be masked arrays. If an element in any of argument is masked, then that corresponding quiver element will not be plotted.
es_es: Los argumentos pueden ser arrays o escalares, siempre que se puedan emitir juntos. Los argumentos también pueden ser arrays enmascarados. Si un elemento de cualquiera de los argumentos está enmascarado, ese elemento quiver correspondiente no se graficará.

source: The x, y and z coordinates of the arrow locations (default is tail of arrow; see *pivot* kwarg).
es_es: Las coordenadas x, y y z de las ubicaciones de las flechas (por defecto es la cola de la flecha; ver el kwarg *pivot*).

source: The x, y and z components of the arrow vectors.
es_es: Los componentes x, y y z de los vectores flecha.

source: The length of each quiver.
es_es: La longitud de cada quiver.

source: The ratio of the arrow head with respect to the quiver.
es_es: La relación de la punta de la flecha con respecto al quiver.

source: The part of the arrow that is at the grid point; the arrow rotates about this point, hence the name *pivot*.
es_es: La parte de la flecha que está en el punto de la malla; la flecha gira alrededor de este punto, de ahí el nombre de *pivot*.

source: Whether all arrows are normalized to have the same length, or keep the lengths defined by *u*, *v*, and *w*.
es_es: Si todas las flechas se normalizan para tener la misma longitud, o mantienen las longitudes definidas por *u*, *v* y *w*.

source: Any additional keyword arguments are delegated to :class:`~matplotlib.collections.LineCollection`
es_es: Cualquier argumento de palabra clave adicional se delega en :class:`~matplotlib.collections.LineCollection`

source: Create a scatter plot.
es_es: Crear un gráfico de dispersión.

source: The z-positions. Either an array of the same length as *xs* and *ys* or a single value to place all points in the same plane.
es_es: Las posiciones z. O bien un arreglo de la misma longitud que *xs* y *ys* o un único valor para situar todos los puntos en el mismo plano.

source: The axis direction for the *zs*. This is useful when plotting 2D data on a 3D Axes. The data must be passed as *xs*, *ys*. Setting *zdir* to 'y' then plots the data to the x-z-plane.
es_es: La dirección del eje para los *zs*. Esto es útil cuando se trazan datos 2D en un eje 3D. Los datos deben ser pasados como *xs*, *ys*. Si se establece *zdir* como 'y', los datos se grafican en el plano x-z.

source: See also :doc:`/gallery/mplot3d/2dcollections3d`.
es_es: Ver también :doc:`/gallery/mplot3d/2dcollections3d`.

source: The marker size in points**2. Either an array of the same length as *xs* and *ys* or a single value to make all markers the same size.
es_es: El tamaño del marcador en puntos**2. Puede ser un arreglo de la misma longitud que *xs* y *ys* o un único valor para que todos los marcadores tengan el mismo tamaño.

source: The marker color. Possible values:
es_es: El color del marcador. Valores posibles:

source: A single color format string.
es_es: Una sola cadena de formato de color.

source: A sequence of colors of length n.
es_es: Una secuencia de colores de longitud n.

source: A sequence of n numbers to be mapped to colors using *cmap* and *norm*.
es_es: Una secuencia de n números para ser mapeados a colores usando *cmap* y *norm*.

source: A 2D array in which the rows are RGB or RGBA.
es_es: Un Arreglo 2D en la que las filas son RGB o RGBA.

source: For more details see the *c* argument of `~.axes.Axes.scatter`.
es_es: Para más detalles, ver el argumento *c* de `~.axes.Axes.scatter`.

source: Whether to shade the scatter markers to give the appearance of depth. Each call to ``scatter()`` will perform its depthshading independently.
es_es: Si se sombrean los marcadores de dispersión para dar la apariencia de profundidad. Cada invocación a ``scatter()`` realizará su sombreado de profundidad de forma independiente.

source: All other arguments are passed on to `~.axes.Axes.scatter`.
es_es: Todos los demás argumentos se pasan a `~.axes.Axes.scatter`.

source: Set multiple properties at once.
es_es: Establece varias propiedades a la vez.

source: Supported properties are
es_es: Las propiedades admitidas son

source: Set the aspect ratios.
es_es: Definir los ratios de aspecto.

source: Axes 3D does not current support any aspect but 'auto' which fills the axes with the data limits.
es_es: Axes 3D no soporta actualmente ningún aspecto sino 'auto' que rellena los ejes con los límites de datos.

source: To simulate having equal aspect in data space, set the ratio of your data limits to match the value of `.get_box_aspect`. To control box aspect ratios use `~.Axes3D.set_box_aspect`.
es_es: Para simular tener un aspecto igual en el espacio de datos, establezca la relación de sus límites de datos para que coincida con el valor de `. et_box_aspect`. Para controlar los ratios de aspecto de caja use `~.Axes3D.set_box_aspect`.

source: **aspect**
es_es: **Aspecto**

source: Possible values:
es_es: Valores posibles:

source: value
es_es: valor

source: description
es_es: descripción

source: automatic; fill the position rectangle with data.
es_es: automático; llena el rectángulo de posición con datos.

source: **adjustable**
es_es: **ajustable**

source: Currently ignored by Axes3D
es_es: Actualmente ignorado por Axes3D

source: If not *None*, this defines which parameter will be adjusted to meet the required aspect. See `.set_adjustable` for further details.
es_es: Si no es *nunca*, esto define qué parámetro será ajustado para cumplir con el aspecto requerido. Vea `.set_adjustable` para más detalles.

source: **anchor**
es_es: **ancla**

source: None or str or 2-tuple of float, optional
es_es: Ninguno o str o 2 tuplas de flotante, opcional

source: If not *None*, this defines where the Axes will be drawn if there is extra space due to aspect constraints. The most common way to to specify the anchor are abbreviations of cardinal directions:
es_es: Si no *nunca*, esto define dónde se dibujarán los ejes si hay espacio extra debido a restricciones de aspecto. La forma más común de especificar el ancla son las abreviaturas de direcciones cardinales:

source: centered
es_es: centrado

source: lower left corner
es_es: esquina inferior izquierda

source: middle of bottom edge
es_es: medio del borde inferior

source: lower right corner
es_es: esquina inferior derecha

source: See `~.Axes.set_anchor` for further details.
es_es: Vea `~.Axes.set_anchor` para más detalles.

source: **share**
es_es: **Compartir**

source: If ``True``, apply the settings to all shared Axes.
es_es: Si es ``True``, aplique la configuración a todos los ejes compartidos.

source: Set whether autoscaling is applied to each axis on the next draw or call to `.Axes.autoscale_view`.
es_es: Establece si la autoescalado se aplica a cada eje en el siguiente dibujo o llama a `.Axes.autoscale_view`.

source: Set whether the z-axis is autoscaled on the next draw or call to `.Axes.autoscale_view`.
es_es: Establece si el eje Z es autoescalado en el siguiente dibujo o llama a `.Axes.autoscale_view`.

source: Turn the x- and y-axis off.
es_es: Desactiva el eje x y y.

source: This affects the axis lines, ticks, ticklabels, grid and axis labels.
es_es: Esto afecta a las líneas de ejes, ticklabels, cuadrícula y etiquetas de ejes.

source: Turn the x- and y-axis on.
es_es: Enciende el eje x y y-.
