Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.axes_grid1.parasite_axes.HostAxesBase.po
Languages: es_es

source: mpl\_toolkits.axes\_grid1.parasite\_axes.HostAxesBase
es_es: mpl\_toolkits.axes\_grid1.parasito\_axes.HostAxesBase

source: Add a parasite axes to this host.
es_es: Agrega un eje parásito a este host.

source: Despite this method's name, this should actually be thought of as an ``add_parasite_axes`` method.
es_es: A pesar del nombre de este método, esto debería ser considerado como un método ``add_parasite_axes``.

source: *tr* may be `.Transform`, in which case the following relation will hold: ``parasite.transData = tr + host.transData``. Alternatively, it may be None (the default), no special relationship will hold between the parasite's and the host's ``transData``.
es_es: *tr* puede ser `.Transform`, en cuyo caso la siguiente relación se mantendrá: ``parasite.transData = tr + host.transData``. Alternativamente, puede ser Ninguno (el predeterminado), ninguna relación especial se mantendrá entre el parásito y el host ``transData``.

source: Create a twin of Axes with no shared axis.
es_es: Crea un doble de ejes sin eje compartido.

source: While self will have ticks on the left and bottom axis, the returned axes will have ticks on the top and right axis.
es_es: Mientras que el auto tendrá ticks en el eje izquierdo e inferior, los ejes devueltos tendrán ticks en el eje superior y derecho.

source: Create a twin of Axes with a shared x-axis but independent y-axis.
es_es: Crea un doble de ejes con eje x compartido pero eje y-independiente.

source: The y-axis of self will have ticks on the left and the returned axes will have ticks on the right.
es_es: El eje de sí mismo tendrá ticks a la izquierda y los ejes devueltos tendrán ticks a la derecha.

source: Create a twin of Axes with a shared y-axis but independent x-axis.
es_es: Crea un doble de ejes con eje compartido pero eje x independiente.

source: The x-axis of self will have ticks on the bottom and the returned axes will have ticks on the top.
es_es: El eje x del yo tendrá ticks en la parte inferior y los ejes devueltos tendrán ticks en la parte superior.

source: Examples using ``mpl_toolkits.axes_grid1.parasite_axes.HostAxesBase``
es_es: Ejemplos usando ``mpl_toolkits.axes_grid1.parasite_axes.HostAxesBase``

source: floating_axis demo
es_es: demo floating_axis
