Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.axisartist.axis_artist.po
Languages: es_es

source: mpl\_toolkits.axisartist.axis\_artist
es_es: mpl\_toolkits.axisartist.axis\_artista

source: The :mod:`.axis_artist` module implements custom artists to draw axis elements (axis lines and labels, tick lines and labels, grid lines).
es_es: El módulo :mod:`.axis_artist` implementa artists personalizados para dibujar los elementos de los ejes (líneas y etiquetas de los ejes, líneas y etiquetas de tick, líneas de la malla).

source: Axis lines and labels and tick lines and labels are managed by the `AxisArtist` class; grid lines are managed by the `GridlinesCollection` class.
es_es: Líneas de ejes y etiquetas, líneas de tick y etiquetas son gestionadas por la clase `AxisArtist`; las líneas de cuadrícula son gestionadas por la clase `GridlinesCollection`.

source: There is one `AxisArtist` per Axis; it can be accessed through the ``axis`` dictionary of the parent Axes (which should be a `mpl_toolkits.axislines.Axes`), e.g. ``ax.axis["bottom"]``.
es_es: Hay un `AxisArtist` por eje; se puede acceder a él a través del diccionario ``axis`` de los ejes padres (que debería ser un `mpl_toolkits.axislines.Axes`), por ejemplo, ``ax.axis["bottom"]``.

source: Children of the AxisArtist are accessed as attributes: ``.line`` and ``.label`` for the axis line and label, ``.major_ticks``, ``.major_ticklabels``, ``.minor_ticks``, ``.minor_ticklabels`` for the tick lines and labels (e.g. ``ax.axis["bottom"].line``).
es_es: Se accede a los hijos del AxisArtist como atributos: ``.line`` y ``.label`` para la línea y etiqueta del eje, ``.major_ticks``, ``. ajor_ticklabels``, ``.minor_ticks``, ``.minor_ticklabels`` para las líneas y etiquetas de tick (e.g. ``ax.axis["abajo"].line``).

source: Children properties (colors, fonts, line widths, etc.) can be set using setters, e.g. ::
es_es: Propiedades hijas (colores, fuentes, anchos de línea, etc.) pueden establecerse usando configuradores, por ejemplo, ::

source: However, things like the locations of ticks, and their ticklabels need to be changed from the side of the grid_helper.
es_es: Sin embargo, cosas como las ubicaciones de ticks, y sus etiquetas de ticklabels necesitan ser cambiadas desde el lado del grid_helper.

source: axis_direction
es_es: dirección del eje

source: `AxisArtist`, `AxisLabel`, `TickLabels` have an *axis_direction* attribute, which adjusts the location, angle, etc. The *axis_direction* must be one of "left", "right", "bottom", "top", and follows the Matplotlib convention for rectangular axis.
es_es: `AxisArtist`, `AxisLabel`, `TickLabels` tienen un atributo *axis_direction*, que ajusta la ubicación, ángulo, etc. El *axis_direction* debe ser uno de "izquierda", "derecha", "abajo", "arriba", y seguir la convención de Matplotlib para el eje rectangular.

source: For example, for the *bottom* axis (the left and right is relative to the direction of the increasing coordinate),
es_es: Por ejemplo, para el eje *inferior* (la izquierda y la derecha son relativas a la dirección de la coordenada creciente),

source: ticklabels and axislabel are on the right
es_es: las etiquetas y axislabel están a la derecha

source: ticklabels and axislabel have text angle of 0
es_es: las etiquetas y axislabel tienen un ángulo de texto de 0

source: ticklabels are baseline, center-aligned
es_es: las etiquetas de referencia están alineadas al centro

source: axislabel is top, center-aligned
es_es: axislabel está arriba, alineado al centro

source: The text angles are actually relative to (90 + angle of the direction to the ticklabel), which gives 0 for bottom axis.
es_es: Los ángulos de texto son en realidad relativos a (90 + ángulo de la dirección a la etiqueta), lo que da 0 para el eje inferior.

source: Parameter
es_es: Parámetro

source: ticklabels location
es_es: ubicación de etiquetas

source: axislabel location
es_es: ubicación de axislabel

source: ticklabels angle
es_es: ángulo de etiquetas

source: ticklabel ha
es_es: etiqueta ha

source: axislabel ha
es_es: ha axislabel

source: Ticks are by default direct opposite side of the ticklabels. To make ticks to the same side of the ticklabels, ::
es_es: Los trucos son por defecto el lado opuesto directo de las etiquetas. Para hacer ticks al mismo lado de las etiquetas, ::

source: The following attributes can be customized (use the ``set_xxx`` methods):
es_es: Los siguientes atributos se pueden personalizar (usar los métodos ``set_xxx`):

source: `Ticks`: ticksize, tick_out
es_es: `Ticks`: tamaño de tick, tick_out

source: Classes
es_es: Clases

source: :py:obj:`AxisArtist <mpl_toolkits.axisartist.axis_artist.AxisArtist>`\ \(axes\, helper\[\, offset\, ...\]\)
es_es: :py:obj:`AxisArtist <mpl_toolkits.axisartist.axis_artist.AxisArtist>`\ \(ejes\, helper\[\, offset\, ...\]\)

source: An artist which draws axis (a line along which the n-th axes coord is constant) line, ticks, ticklabels, and axis label.
es_es: Un artista que dibuja el eje (una línea a lo largo de la cual la coordenada de los ejes propios es constante), la línea, las tick, las etiquetas y la etiqueta del eje.

source: Axis Label.
es_es: Etiqueta Eje.

source: Parameters
es_es: Parámetros

source: A base class for AxisLabel and TickLabels.
es_es: Una clase base para AxisLabel y TickLabels.

source: Tick Labels.
es_es: Etiquetas de tick.

source: Ticks are derived from Line2D, and note that ticks themselves are markers.
es_es: Los trucos se derivan de Line2D, y tengan en cuenta que los mismos ticks son marcadores.
