Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.axes_grid1.axes_grid.Grid.po
Languages: es_es

source: mpl\_toolkits.axes\_grid1.axes\_grid.Grid
es_es: ejes\mpl\_toolkits.ejes\_grid1.ejes\_grid.Grid

source: A grid of Axes.
es_es: Una rejilla de ejes.

source: In Matplotlib, the axes location (and size) is specified in normalized figure coordinates. This may not be ideal for images that needs to be displayed with a given aspect ratio; for example, it is difficult to display multiple images of a same size with some fixed padding between them. AxesGrid can be used in such case.
es_es: En Matplotlib, la ubicación (y el tamaño) de los ejes se especifica en las coordenadas de figuras normalizadas. Esto puede no ser ideal para imágenes que necesitan ser mostradas con una relación de aspecto determinada; por ejemplo, es difícil mostrar múltiples imágenes del mismo tamaño con un relleno fijo entre ellas. AxesGrid se puede utilizar en este caso.

source: Parameters
es_es: Parámetros

source: Figure
es_es: Figura

source: The parent figure.
es_es: La figura padre.

source: (float, float, float, float) or int
es_es: (flotante, flotante, flotante) o int

source: The axes position, as a ``(left, bottom, width, height)`` tuple or as a three-digit subplot position code (e.g., "121").
es_es: La posición de los ejes, como una tupla ``(izquierda, inferior, anchura, altura)`` o como un código de posición de tres dígitos (ej., "121").

source: Number of rows and columns in the grid.
es_es: Número de filas y columnas en la cuadrícula.

source: int or None, default: None
es_es: int o Ninguno, predeterminado: Ninguno

source: If not None, only the first *ngrids* axes in the grid are created.
es_es: Si no Ninguno, sólo se crean los primeros ejes *ngrids* de la cuadrícula.

source: **direction**
es_es: **dirección**

source: {"row", "column"}, default: "row"
es_es: {"fila", "column"}, por defecto: "fila"

source: Whether axes are created in row-major ("row by row") or column-major order ("column by column"). This also affects the order in which axes are accessed using indexing (``grid[index]``).
es_es: Si los ejes se crean en la fila mayor ("fila por fila") o en el orden column-major ("columna por columna"). Esto también afecta al orden en el que se accede a los ejes usando indexación (``grid[index]``).

source: float or (float, float), default: 0.02
es_es: flotante o (flotante), por defecto: 0.02

source: Padding or (horizontal padding, vertical padding) between axes, in inches.
es_es: Relleno o (relleno horizontal, relleno vertical) entre ejes, en pulgadas.

source: **share_all**
es_es: **Compartir_todo**

source: bool, default: False
es_es: bool, por defecto: False

source: Whether all axes share their x- and y-axis. Overrides *share_x* and *share_y*.
es_es: Si todos los ejes comparten su eje x y y-. Sobreescribe *share_x* y *share_y*.

source: **share_x**
es_es: **compartir_x**

source: bool, default: True
es_es: bool, por defecto: True

source: Whether all axes of a column share their x-axis.
es_es: Si todos los ejes de una columna comparten su eje x.

source: **share_y**
es_es: **compartir_y**

source: Whether all axes of a row share their y-axis.
es_es: Si todos los ejes de una fila comparten su eje y.

source: **label_mode**
es_es: **Etiqueta_modo**

source: {"L", "1", "all"}, default: "L"
es_es: {"L", "1", "all"}, por defecto: "L"

source: Determines which axes will get tick labels:
es_es: Determina qué ejes obtendrán etiquetas de tick:

source: "L": All axes on the left column get vertical tick labels; all axes on the bottom row get horizontal tick labels.
es_es: "L": Todos los ejes de la columna izquierda obtienen etiquetas verticales de tick; todos los ejes de la fila inferior obtienen etiquetas de ticks horizontales.

source: "1": Only the bottom left axes is labelled.
es_es: "1": Sólo los ejes inferiores a la izquierda están etiquetados.

source: "all": all axes are labelled.
es_es: "todos": todos los ejes están etiquetados.

source: **axes_class** : subclass of `matplotlib.axes.Axes`, default: None
es_es: **axes_class** : subclase de `matplotlib.axes.Axes`, por defecto: ninguno

source: subclass of
es_es: subclase de

source: **aspect**
es_es: **Aspecto**

source: Whether the axes aspect ratio follows the aspect ratio of the data limits.
es_es: Si la relación de aspecto de los ejes sigue la relación de aspecto de los límites de datos.

source: Return the aspect of the SubplotDivider.
es_es: Devuelve el aspecto del SubplotDivider.

source: Return the axes padding.
es_es: Devuelve el relleno de los ejes.

source: Returns
es_es: Devuelve

source: Padding (horizontal pad, vertical pad) in inches.
es_es: Relleno (pad horizontal, almohadilla vertical) en pulgadas.

source: Return the number of rows and columns of the grid as (nrows, ncols).
es_es: Devuelve el número de filas y columnas de la cuadrícula como (nrows, ncols).

source: Set the aspect of the SubplotDivider.
es_es: Establece el aspecto del SubplotDivider.

source: Set the padding between the axes.
es_es: Define el relleno entre los ejes.

source: The padding (horizontal pad, vertical pad) in inches.
es_es: El relleno (pad horizontal, almohadilla vertical) en pulgadas.

source: Define which axes have tick labels.
es_es: Definir qué ejes tienen etiquetas de tick.

source: The label mode:
es_es: El modo etiqueta:
