Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.mplot3d.axes3d.Axes3D.po
Languages: es_es

source: 3D axes object.
es_es: Objeto de ejes 3D.

source: Parameters
es_es: Parámetros

source: Figure
es_es: Figura

source: The parent figure.
es_es: La figura padre.

source: (float, float, float, float)
es_es: (flotante, flotante, flotante)

source: The ``(left, bottom, width, height)`` axes position.
es_es: La posición de los ejes ``(izquierda, inferior, anchura, altura)``.

source: float, default: -60
es_es: flotante, por defecto: -60

source: Azimuthal viewing angle.
es_es: Ángulo de visión azimutal.

source: float, default: 30
es_es: float, por defecto: 30

source: Elevation viewing angle.
es_es: Ángulo de visión.

source: **sharez**
es_es: **compartir**

source: Axes3D, optional
es_es: Ejes3D, opcional

source: Other axes to share z-limits with.
es_es: Otros ejes con los que compartir Z-limites.

source: The projection type, default 'persp'.
es_es: El tipo de proyección, por defecto 'persp'.

source: **computed_zorder**
es_es: **calculado_zorder**

source: bool, default: True
es_es: bool, por defecto: True

source: If True, the draw order is computed based on the average position of the `.Artist`\s along the view direction. Set to False if you want to manually control the order in which Artists are drawn on top of each other using their *zorder* attribute. This can be used for fine-tuning if the automatic order does not produce the desired result. Note however, that a manual zorder will only be correct for a limited view angle. If the figure is rotated by the user, it will look wrong from certain angles.
es_es: Si es verdadero, el orden de dibujo se calcula basándose en la posición media de los `.Artist`\s a lo largo de la dirección de la vista. Establezca en False si desea controlar manualmente el orden en el que los Artistas se dibujan entre sí usando su atributo *zorder*. Esto se puede utilizar para ajustar de forma fina si el orden automático no produce el resultado deseado. Tenga en cuenta, sin embargo, que un zorder manual sólo será correcto para un ángulo de vista limitado. Si la figura es rotada por el usuario, parecerá equivocada desde ciertos ángulos.

source: **auto_add_to_figure**
es_es: **auto_añadir_a_figura**

source: Prior to Matplotlib 3.4 Axes3D would add themselves to their host Figure on init. Other Axes class do not do this.
es_es: Antes de Matplotlib 3.4 Axes3D se añadiría a su Figura de host al inicio. Otros ejes no hacen esto.

source: This behavior is deprecated in 3.4, the default will change to False in 3.5. The keyword will be undocumented and a non-False value will be an error in 3.6.
es_es: Este comportamiento está obsoleto en 3.4, el valor por defecto cambiará a False en 3.5. La palabra clave será indocumentada y un valor no False será un error en 3.6.

source: Other optional keyword arguments:
es_es: Otros argumentos opcionales de palabras clave:

source: Property
es_es: Propiedad

source: Description
es_es: Descripción

source: a filter function, which takes a (m, n, 3) float array and a dpi value, and returns a (m, n, 3) array
es_es: una función de filtro, que toma un arreglo de puntos flotantes (m, n, 3) y un valor de dpi, y devuelve un arreglo (m, n, 3)

source: scalar or None
es_es: escalar o None

source: (float, float) or {'C', 'SW', 'S', 'SE', 'E', 'NE', ...}
es_es: (float, float) o {'C', 'SW', 'S', 'SE', 'E', 'NE', ...}

source: unknown
es_es: desconocido

source: :meth:`autoscalez_on <mpl_toolkits.mplot3d.axes3d.Axes3D.set_autoscalez_on>`
es_es: :meth:`autoescalez_on <mpl_toolkits.mplot3d.axes3d.Axes3D.set_autoscalez_on>`

source: 3-tuple of floats or None
es_es: 3 tuplas de flotantes o ninguno

source: Patch or (Path, Transform) or None
es_es: Patch o (Path, Transform) o None

source: :meth:`facecolor <matplotlib.axes.Axes.set_facecolor>` or fc
es_es: :meth:`facecolor <matplotlib.axes.Axes.set_facecolor>` o fc

source: None or bool or float or callable
es_es: None o bool o float o callable

source: [left, bottom, width, height] or `~matplotlib.transforms.Bbox`
es_es: [left, bottom, width, height] o `~matplotlib.transforms.Bbox`

source: float or None
es_es: float o None

source: :meth:`xlim3d <mpl_toolkits.mplot3d.axes3d.Axes3D.set_xlim3d>` or xlim
es_es: :meth:`xlim3d <mpl_toolkits.mplot3d.axes3d.Axes3D.set_xlim3d>` o xlim

source: {"linear"}
es_es: {"lineal"}

source: :meth:`ylim3d <mpl_toolkits.mplot3d.axes3d.Axes3D.set_ylim3d>` or ylim
es_es: :meth:`ylim3d <mpl_toolkits.mplot3d.axes3d.Axes3D.set_ylim3d>` o ylim

source: :meth:`zlim3d <mpl_toolkits.mplot3d.axes3d.Axes3D.set_zlim3d>` or zlim
es_es: :meth:`zlim3d <mpl_toolkits.mplot3d.axes3d.Axes3D.set_zlim3d>` o zlim

source: float
es_es: de punto flotante (float)

source: Add a 3D collection object to the plot.
es_es: Añade un objeto de colección 3D al gráfico.

source: 2D collection types are converted to a 3D version by modifying the object and adding z coordinate information.
es_es: Los tipos de colección 2D se convierten en una versión 3D modificando el objeto y añadiendo información de coordenadas z.

source: Supported are:
es_es: Se admiten:

source: Adjust the Axes for a specified data aspect ratio.
es_es: Ajuste los ejes para una relación de aspecto de datos especificada.

source: Depending on `.get_adjustable` this will modify either the Axes box (position) or the view limits. In the former case, `~matplotlib.axes.Axes.get_anchor` will affect the position.
es_es: Dependiendo de `.get_adjustable` esto modificará la caja de ejes (posición) o los límites de la vista. En el primer caso, `~matplotlib.axes.Axes.get_anchor` afectará a la posición.

source: For a description of aspect ratio handling.
es_es: Para una descripción de la relación de aspecto.

source: Set how the Axes adjusts to achieve the required aspect ratio.
es_es: Establecer cómo se ajustan los ejes para lograr la relación de aspecto requerida.

source: Set the position in case of extra space.
es_es: Define la posición en caso de espacio extra.

source: This is called automatically when each Axes is drawn. You may need to call it yourself if you need to update the Axes position and/or view limits before the Figure is drawn.
es_es: Esto se llama automáticamente cuando se dibuja cada eje. Puede que necesite llamarlo usted mismo si necesita actualizar la posición de los ejes y/o los límites de vista antes de dibujar la Figura.

source: Convenience method for simple axis view autoscaling. See :meth:`matplotlib.axes.Axes.autoscale` for full explanation. Note that this function behaves the same, but for all three axes. Therefore, 'z' can be passed for *axis*, and 'both' applies to all three axes.
es_es: Método de comodidad para autoescalado simple de la vista de ejes. Vea :meth:`matplotlib.axes.Axes.autoscale` para una explicación completa. Tenga en cuenta que esta función se comporta la misma, pero para los tres ejes. Por lo tanto, "z" se puede pasar por *eje*, y "ambos" se aplica a los tres ejes.

source: Autoscale the view limits using the data limits. See :meth:`matplotlib.axes.Axes.autoscale_view` for documentation. Note that this function applies to the 3D axes, and as such adds the *scalez* to the function arguments.
es_es: Autoscale los límites de la vista usando los límites de datos. Vea :meth:`matplotlib.axes.Axes.autoscale_view` para documentación. Tenga en cuenta que esta función se aplica a los ejes 3D, y como tal añade la *escalez* a los argumentos de la función.

source: Add 2D bar(s).
es_es: Añadir barra(s) 2D.

source: The x coordinates of the left sides of the bars.
es_es: Las coordenadas x de los lados izquierdos de las barras.

source: The height of the bars.
es_es: La altura de las barras.

source: Z coordinate of bars; if a single value is specified, it will be used for all bars.
es_es: Coordenada Z de las barras; si se especifica un solo valor, se utilizará para todas las barras.

source: When plotting 2D data, the direction to use as z ('x', 'y' or 'z').
es_es: Al graficar datos 2D, la dirección a utilizar como z ('x', 'y' o 'z').

source: If given, all parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception).
es_es: Si se dan, todos los parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción).

source: Other arguments are forwarded to `matplotlib.axes.Axes.bar`.
es_es: Los demás argumentos se envían a `matplotlib.axes.Axes.bar`.

source: Returns
es_es: Devuelve

source: Generate a 3D barplot.
es_es: Genera una trama de barras 3D.

source: This method creates three dimensional barplot where the width, depth, height, and color of the bars can all be uniquely set.
es_es: Este método crea tridimensionales tridimensionales donde la anchura, profundidad, altura y color de las barras pueden ser ajustadas únicamente.

source: The coordinates of the anchor point of the bars.
es_es: Las coordenadas del punto de anclaje de las barras.

source: float or array-like
es_es: flotante o matriz

source: The width, depth, and height of the bars, respectively.
es_es: La anchura, profundidad y altura de los bares, respectivamente.

source: sequence of colors, optional
es_es: secuencia de colores, opcional

source: The color of the bars can be specified globally or individually. This parameter can be:
es_es: El color de las barras puede especificarse global o individualmente. Este parámetro puede ser:

source: A single color, to color all bars the same color.
es_es: Un solo color, para colorear todos los barras del mismo color.

source: An array of colors of length N bars, to color each bar independently.
es_es: Una matriz de colores de longitud N barras para colorear cada barra independientemente.

source: An array of colors of length 6, to color the faces of the bars similarly.
es_es: Una matriz de colores de longitud 6, para colorear las caras de las barras de forma similar.

source: An array of colors of length 6 * N bars, to color each face independently.
es_es: Una matriz de colores de longitud 6 * N barras para colorear cada cara independientemente.

source: When coloring the faces of the boxes specifically, this is the order of the coloring:
es_es: Cuando se colorean las caras de las cajas específicamente, este es el orden del color:

source: -Z (bottom of box)
es_es: -Z (parte inferior de la caja)

source: +Z (top of box)
es_es: +Z (parte superior de la caja)

source: str, optional
es_es: str, opcional

source: The z-axis sorting scheme passed onto `~.art3d.Poly3DCollection`
es_es: El esquema de clasificación de eje Z pasado a `~.art3d.Poly3DCollection`

source: When true, this shades the dark sides of the bars (relative to the plot's source of light).
es_es: Cuando es verdadero, esto sombra los lados oscuros de las barras (en relación a la fuente de luz de la parcela).

source: The lightsource to use when *shade* is True.
es_es: La fuente de luz que se utilizará cuando *sombra* sea True.

source: Any additional keyword arguments are passed onto `~.art3d.Poly3DCollection`.
es_es: Cualquier argumento adicional de palabra clave se pasa a `~.art3d.Poly3DCollection`.

source: **collection** : `~.art3d.Poly3DCollection`
es_es: **colección** : `~.art3d.Poly3DCollection`

source: A collection of three dimensional polygons representing the bars.
es_es: Una colección de poligones tridimensionales que representan las barras.

source: Return whether this axes supports the pan/zoom button functionality.
es_es: Devuelve si este eje soporta la funcionalidad del botón de pan/zoom.

source: 3D axes objects do not use the pan/zoom button.
es_es: Los objetos de ejes 3D no utilizan el botón pan/zoom.

source: Return whether this axes supports the zoom box button functionality.
es_es: Devuelve si este eje soporta la funcionalidad del botón de la caja de zoom.

source: 3D axes objects do not use the zoom box button.
es_es: Los objetos de ejes 3D no utilizan el botón de la caja de zoom.

source: Clear the Axes.
es_es: Despeja los ejes.

source: Currently not implemented for 3D axes, and returns *None*.
es_es: Actualmente no está implementado para ejes 3D, y devuelve *Ninguno*.

source: Create a 3D contour plot.
es_es: Cree un gráfico de contorno en 3D.

source: Input data. See `~matplotlib.axes.Axes.contour` for acceptable data shapes.
es_es: Datos de entrada. Ver `~matplotlib.axes.Axes.contour` para las formas de datos aceptables.

source: bool, default: False
es_es: bool, por defecto: False

source: Whether to extend contour in 3D.
es_es: Si se extiende el contorno en 3D.

source: Step size for extending contour.
es_es: Tamaño del paso para extender el contorno.

source: The direction to use.
es_es: La dirección a utilizar.

source: float, optional
es_es: float, opcional

source: If specified, plot a projection of the contour lines at this position in a plane normal to zdir.
es_es: Si se especifica, grafica una proyección de las curvas de nivel en esta posición en un plano normal a zdir.

source: Other arguments are forwarded to `matplotlib.axes.Axes.contour`.
es_es: Los demás argumentos se envían a `matplotlib.axes.Axes.contour`.

source: Create a 3D filled contour plot.
es_es: Crea un gráfico de contornos rellenos en 3D.

source: Input data. See `~matplotlib.axes.Axes.contourf` for acceptable data shapes.
es_es: Datos de entrada. Ver `~matplotlib.axes.Axes.contourf` para las formas de datos aceptables.

source: Other arguments are forwarded to `matplotlib.axes.Axes.contourf`.
es_es: Los demás argumentos se envían a `matplotlib.axes.Axes.contourf`.

source: For artists in an axes, if the zaxis has units support, convert *z* using zaxis unit type
es_es: Para los artistas en un eje, si el zaxis tiene soporte de unidades, convertir *z* usando un tipo de unidad zaxis

source: Disable mouse buttons for 3D rotation and zooming.
es_es: Desactivar los botones del ratón para la rotación 3D y el zooming.

source: Draw the Artist (and its children) using the given renderer.
es_es: Dibuja el Artist (y sus hijos) usando el renderizador dado.

source: This has no effect if the artist is not visible (`.Artist.get_visible` returns False).
es_es: Esto no tiene efecto si el artist no es visible (`.Artist.get_visible` devuelve False).

source: **renderer** : `.RendererBase` subclass.
es_es: **renderer** : `.RendererBase` subclase.

source: RendererBase subclass.
es_es: Subclase RendererBase.

source: This method is overridden in the Artist subclasses.
es_es: Este método se sobrescribe en las subclases de Artist.

source: Plot lines and/or markers with errorbars around them.
es_es: Trazar líneas y/o marcadores con barras de error a su alrededor.

source: *x*/*y*/*z* define the data locations, and *xerr*/*yerr*/*zerr* define the errorbar sizes. By default, this draws the data markers/lines as well the errorbars. Use fmt='none' to draw errorbars only.
es_es: *x*/*y*/*z* define las ubicaciones de los datos, y *xerr*/*yerr*/*zerr* define los tamaños de la barra de error. De forma predeterminada, esto dibuja los marcadores/líneas de datos así como las barras de error. Use fmt='None ' para dibujar sólo barras de error.

source: The data positions.
es_es: Las posiciones de los datos.

source: float or array-like, shape (N,) or (2, N), optional
es_es: flotante o tipo matriz, forma (N,) o (2, N), opcional

source: The errorbar sizes:
es_es: Tamaños de la barra de error:

source: scalar: Symmetric +/- values for all data points.
es_es: escala: Valores simétricos +/- para todos los puntos de datos.

source: shape(N,): Symmetric +/-values for each data point.
es_es: shape(N,): Valores simétricos +/-para cada punto de datos.

source: shape(2, N): Separate - and + values for each bar. First row contains the lower errors, the second row contains the upper errors.
es_es: shape(2, N): Separar - y + valores para cada barra. La primera fila contiene los errores inferiores, la segunda fila contiene los errores superiores.

source: *None*: No errorbar.
es_es: *Ninguno*: No hay barra de error.

source: Note that all error arrays should have *positive* values.
es_es: Tenga en cuenta que todas las matrices de error deben tener valores *positivos*.

source: The format for the data points / data lines. See `.plot` for details.
es_es: El formato para los puntos de datos / líneas de datos. Vea `.plot` para más detalles.

source: Use 'none' (case insensitive) to plot errorbars without any data markers.
es_es: Utilice 'ninguno ' (mayúsculas y minúsculas) para trazar barras de error sin marcadores de datos.

source: color, default: None
es_es: color, por defecto: ninguno

source: The color of the errorbar lines. If None, use the color of the line connecting the markers.
es_es: El color de las líneas de la barra de error. Si no, utilice el color de la línea que conecta los marcadores.

source: The linewidth of the errorbar lines. If None, the linewidth of the current style is used.
es_es: El ancho de línea de las líneas de la barra de error. Si no, se utiliza el ancho de línea del estilo actual.

source: **capsize** : float, default: :rc:`errorbar.capsize`
es_es: **capsize** : float, por defecto: :rc:`errorbar.capsize`

source: float, default:
es_es: flotante, por defecto:

source: The length of the error bar caps in points.
es_es: La longitud de los límites de la barra de error en puntos.

source: An alias to the keyword argument *markeredgewidth* (a.k.a. *mew*). This setting is a more sensible name for the property that controls the thickness of the error bar cap in points. For backwards compatibility, if *mew* or *markeredgewidth* are given, then they will over-ride *capthick*. This may change in future releases.
es_es: Un alias al argumento de palabra clave *markeredgewidth* (a.k.a. *mew*). Esta opción es un nombre más sensato para la propiedad que controla el espesor de la tapa de la barra de error en puntos. Para compatibilidad hacia atrás, si se da *mew* o *markeredgewidth*, entonces anularán *capthick*. Esto puede cambiar en futuras versiones.

source: If True, will plot the errorbars above the plot symbols. Default is below.
es_es: Si es verdadero, trazará las barras de error encima de los símbolos de la traza. Por defecto está a continuación.

source: These arguments can be used to indicate that a value gives only lower limits. In that case a caret symbol is used to indicate this. *lims*-arguments may be scalars, or array-likes of the same length as the errors. To use limits with inverted axes, `~.Axes.set_xlim` or `~.Axes.set_ylim` must be called before :meth:`errorbar`. Note the tricky parameter names: setting e.g. *ylolims* to True means that the y-value is a *lower* limit of the True value, so, only an *upward*-pointing arrow will be drawn!
es_es: Estos argumentos pueden ser usados para indicar que un valor sólo da límites inferiores. En ese caso se utiliza un símbolo caret para indicar esto. *lims*-arguments may be scalars, or array-likkes of the same length than the errors. To use limits with inverted axes, `~.Axes. et_xlim` o `~.Axes.set_ylim` deben ser llamados antes de :meth:`errorbar`. Tenga en cuenta los nombres de parámetros complicados: configuración p. ej. *ylolims* a True significa que el valor Y es un límite *menor* del valor Verdadero, así que ¡solo una flecha *ascendente*-apuntando hacia arriba se dibujará!

source: Same as above, but for controlling the upper limits.
es_es: Igual que arriba, pero para controlar los límites superiores.

source: **errorevery**
es_es: **errorcada**

source: int or (int, int), default: 1
es_es: int o (int, int), predeterminado: 1

source: draws error bars on a subset of the data. *errorevery* =N draws error bars on the points (x[::N], y[::N], z[::N]). *errorevery* =(start, N) draws error bars on the points (x[start::N], y[start::N], z[start::N]). e.g. errorevery=(6, 3) adds error bars to the data at (x[6], x[9], x[12], x[15], ...). Used to avoid overlapping error bars when two series share x-axis values.
es_es: dibuja barras de error en un subconjunto de datos. *errorcada* =N dibuja barras de error en los puntos (x[::N], y[::N], z[::N]). *errorcada* =(inicio, N) dibuja barras de error en los puntos (x[start::N], y[start::N], z[start::N]). ej. errorevery=(6, 3) añade barras de error a los datos en (x[6], x[9], x[12], x[15], . .). Utilizado para evitar barras de error superpuestas cuando dos series comparten valores de eje x.

source: **errlines**
es_es: **errores**

source: list
es_es: lista

source: List of `~mpl_toolkits.mplot3d.art3d.Line3DCollection` instances each containing an errorbar line.
es_es: Lista de instancias `~mpl_toolkits.mplot3d.art3d.Line3DCollection` que contienen una línea de barra de error.

source: List of `~mpl_toolkits.mplot3d.art3d.Line3D` instances each containing a capline object.
es_es: Lista de instancias `~mpl_toolkits.mplot3d.art3d.Line3D` que contienen cada una de ellas un objeto de caplina.

source: List of `~mpl_toolkits.mplot3d.art3d.Line3D` instances each containing a marker with an upper or lower limit.
es_es: Lista de instancias `~mpl_toolkits.mplot3d.art3d.Line3D` que contienen cada una de ellas un marcador con un límite superior o inferior.

source: Other Parameters
es_es: Otros Parámetros

source: If given, the following parameters also accept a string ``s``, which is interpreted as ``data[s]`` (unless this raises an exception):
es_es: Si se dan, los siguientes parámetros también aceptan una cadena ``s``, que se interpreta como ``data[s]`` (a menos que se produzca una excepción):

source: All other keyword arguments for styling errorbar lines are passed `~mpl_toolkits.mplot3d.art3d.Line3DCollection`.
es_es: Todos los otros argumentos de palabra clave para estilizar líneas de barra de error se pasan `~mpl_toolkits.mplot3d.art3d.Line3DCollection`.

source: Examples
es_es: Ejemplos

source: (`Source code <../../gallery/mplot3d/errorbar3d.py>`__, `png <../../gallery/mplot3d/errorbar3d.png>`__, `pdf <../../gallery/mplot3d/errorbar3d.pdf>`__)
es_es: (`Código fuente <../../gallery/mplot3d/errorbar3d.py>`__, `png <../../gallery/mplot3d/errorbar3d.png>`__, `pdf <../../gallery/mplot3d/errorbar3d.pdf>`__)

source: Given the 2D view coordinates attempt to guess a 3D coordinate. Looks for the nearest edge to the point and then assumes that the point is at the same z location as the nearest point on the edge.
es_es: Dadas las coordenadas de la vista 2D intentan adivinar una coordenada 3D. Busca el borde más cercano al punto y asume que el punto está en la misma posición z que el punto más cercano en el borde.

source: Return *z* string formatted. This function will use the :attr:`fmt_zdata` attribute if it is callable, else will fall back on the zaxis major formatter
es_es: Devuelve una cadena *z* formateada. Esta función utilizará el atributo :attr:`fmt_zdata` si es llamable, de lo contrario se recurrirá al formateador principal de zaxis

source: Return True if each axis is autoscaled, False otherwise.
es_es: Devuelve Verdadero si cada eje es autoescalado, False de otra manera.

source: Return whether the z-axis is autoscaled.
es_es: Devuelve si el eje Z está autoescalado.

source: Get whether the 3D axes panels are drawn.
es_es: Obtener si los ejes 3D están dibujados.

source: Create the projection matrix from the current viewing position.
es_es: Crear la matriz de proyección desde la posición de visualización actual.

source: Return the tight bounding box of the axes, including axis and their decorators (xlabel, title, etc).
es_es: Devuelve la caja de límites apretada de los ejes, incluyendo el eje y sus decoradores (xlabel, título, etc).

source: Artists that have ``artist.set_in_layout(False)`` are not included in the bbox.
es_es: Los artistas que tienen ``artist.set_in_layout(False)`` no están incluidos en el cuadro.

source: **renderer** : `.RendererBase` subclass
es_es: **renderer** : subclase `.RendererBase`

source: RendererBase subclass
es_es: Subclase RendererBase
