Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.axes_grid1.parasite_axes.po
Languages: es_es

source: mpl\_toolkits.axes\_grid1.parasite\_axes
es_es: mpl\_toolkits.axes\_grid1.parasito\_ejes

source: Classes
es_es: Clases

source: alias of :py:class:`mpl_toolkits.axes_grid1.parasite_axes.AxesHostAxes`
es_es: alias de :py:class:`mpl_toolkits.axes_grid1.parasite_axes.AxesHostAxes`

source: alias of :py:class:`mpl_toolkits.axes_grid1.parasite_axes.AxesParasite`
es_es: alias de :py:class:`mpl_toolkits.axes_grid1.parasite_axes.AxesParasite`

source: alias of :py:class:`mpl_toolkits.axes_grid1.parasite_axes.AxesParasiteParasiteAuxTrans`
es_es: alias de :py:class:`mpl_toolkits.axes_grid1.parasite_axes.AxesParasiteParasiteAuxTrans`

source: :py:obj:`ParasiteAxesAuxTransBase <mpl_toolkits.axes_grid1.parasite_axes.ParasiteAxesAuxTransBase>`\ \(parent\_axes\, ...\[\, ...\]\)
es_es: :py:obj:`ParasiteAxesAuxesAuxTransBase <mpl_toolkits.axes_grid1.parasite_axes.ParasiteAxesAuxTransBase>`\ \(parent\_axes\, ...\[\, ...\]\)

source: Functions
es_es: Funciones

source: Create axes that can act as a hosts to parasitic axes.
es_es: Crea ejes que pueden actuar como anfitriones en los ejes parasíticos.

source: :py:obj:`host_axes_class_factory <mpl_toolkits.axes_grid1.parasite_axes.host_axes_class_factory>`\ \(axes\_class\)
es_es: :py:obj:`host_axes_class_factory <mpl_toolkits.axes_grid1.parasite_axes.host_axes_class_factory>`\ \(ejes\_class\)

source: :py:obj:`host_subplot <mpl_toolkits.axes_grid1.parasite_axes.host_subplot>`\ \(\*args\[\, axes\_class\, figure\]\)
es_es: :py:obj:`host_subplot <mpl_toolkits.axes_grid1.parasite_axes.host_subplot>`\ \(\*args\[\, ejes\_class\, figure\]\)

source: Create a subplot that can act as a host to parasitic axes.
es_es: Crea una subparcela que pueda actuar como anfitrión de los ejes parasíticos.

source: :py:obj:`host_subplot_class_factory <mpl_toolkits.axes_grid1.parasite_axes.host_subplot_class_factory>`\ \(axes\_class\)
es_es: :py:obj:`host_subplot_class_factory <mpl_toolkits.axes_grid1.parasite_axes.host_subplot_class_factory>`\ \(ejes\_class\)

source: :py:obj:`parasite_axes_auxtrans_class_factory <mpl_toolkits.axes_grid1.parasite_axes.parasite_axes_auxtrans_class_factory>`\ \(axes\_class\)
es_es: :py:obj:`parasite_axes_auxtrans_class_factory <mpl_toolkits.axes_grid1.parasite_axes.parasite_axes_auxtrans_class_factory>`\ \(ejes\_class\)

source: :py:obj:`parasite_axes_class_factory <mpl_toolkits.axes_grid1.parasite_axes.parasite_axes_class_factory>`\ \(axes\_class\)
es_es: :py:obj:`parasite_axes_class_factory <mpl_toolkits.axes_grid1.parasite_axes.parasite_axes_class_factory>`\ \(ejes\_class\)
