Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/_*_gen/mpl_toolkits.axes_grid1.axes_divider.AxesDivider.po
Languages: es_es

source: mpl\_toolkits.axes\_grid1.axes\_divider.AxesDivider
es_es: mpl\_toolkits.axes\_grid1.ejes\_divider.AxesDivider

source: Divider based on the pre-existing axes.
es_es: Divider basado en los ejes preexistentes.

source: Parameters
es_es: Parámetros

source: Axes
es_es: Ejes

source: Create an axes at the given *position* with the same height (or width) of the main axes.
es_es: Crea un eje en la *posición* dada con la misma altura (o ancho) de los ejes principales.

source: *position*
es_es: *posición*

source: ["left"|"right"|"bottom"|"top"]
es_es: ["izquierda"|"derecha"|"abajo"|"arriba"]

source: *size* and *pad* should be axes_grid.axes_size compatible.
es_es: *size* y *pad* deben ser compatibles con axes_grid.axes_size.

source: Return the anchor.
es_es: Devuelve el fondo.

source: Return aspect.
es_es: Retornar aspecto.

source: Return the position of the rectangle.
es_es: Devuelve la posición del rectángulo.

source: Add a new axes on the right (or left) side of the main axes.
es_es: Agrega nuevos ejes a la derecha (o a la izquierda) de los ejes principales.

source: **size** : :mod:`~mpl_toolkits.axes_grid1.axes_size` or float or str
es_es: **tamaño** : :mod:`~mpl_toolkits.axes_grid1.axes_size` o decimal o str

source: axes_size or float or str
es_es: ejes_tamaño o flotante o str

source: The axes width. float or str arguments are interpreted as ``axes_size.from_any(size, AxesX(<main_axes>))``.
es_es: El ancho de los ejes. Los argumentos float o str se interpretan como ``axes_size.from_any(size, AxesX(<main_axes>))``.

source: **pad** : :mod:`~mpl_toolkits.axes_grid1.axes_size` or float or str
es_es: **pad** : :mod:`~mpl_toolkits.axes_grid1.axes_size` o decimal o str

source: Padding between the axes. float or str arguments are interpreted as ``axes_size.from_any(size, AxesX(<main_axes>))``. Defaults to :rc:`figure.subplot.wspace` times the main axes width.
es_es: Rellenar entre los ejes. Los argumentos float o str se interpretan como ``axes_size.from_any(size, AxesX(<main_axes>)``. Por defecto :rc:`figure.subplot.wspace` veces el ancho de los ejes principales.

source: If False, the new axes is appended at the end of the list, i.e., it became the right-most axes. If True, it is inserted at the start of the list, and becomes the left-most axes.
es_es: Si False, los nuevos ejes se añaden al final de la lista, es decir, se convirtieron en los ejes más correctos. Si es cierto, se inserta al principio de la lista y se convierte en los ejes más de la izquierda.

source: All extra keywords arguments are passed to the created axes. If *axes_class* is given, the new axes will be created as an instance of the given class. Otherwise, the same class of the main axes will be used.
es_es: Todos los argumentos de palabras clave extra se pasan a los ejes creados. Si se da *axes_class*, los nuevos ejes se crearán como una instancia de la clase dada. De lo contrario, se utilizará la misma clase de ejes principales.

source: Add a new axes on the top (or bottom) side of the main axes.
es_es: Agrega un nuevo eje en la parte superior (o inferior) de los ejes principales.

source: The axes height. float or str arguments are interpreted as ``axes_size.from_any(size, AxesY(<main_axes>))``.
es_es: La altura de los ejes. Los argumentos float o str se interpretan como ``axes_size.from_any(size, AxesY(<main_axes>))``.

source: Padding between the axes. float or str arguments are interpreted as ``axes_size.from_any(size, AxesY(<main_axes>))``. Defaults to :rc:`figure.subplot.hspace` times the main axes height.
es_es: Rellenar entre los ejes. Los argumentos float o str se interpretan como ``axes_size.from_any(size, AxesY(<main_axes>)``. Por defecto :rc:`figure.subplot.hspace` veces la altura de los ejes principales.

source: Examples using ``mpl_toolkits.axes_grid1.axes_divider.AxesDivider``
es_es: Ejemplos usando ``mpl_toolkits.axes_grid1.axes_divider.AxesDivider``

source: Colorbar with `.AxesDivider`
es_es: Barra de colores con `.AxesDivider`

source: Make Room For Ylabel Using Axesgrid
es_es: Haz espacio para Ylabel usando Axesgrid

source: Scatter Histogram (Locatable Axes)
es_es: Histograma de dispersión (ejes localizables)

source: Simple Colorbar
es_es: Barra de color simple

source: Tight Layout guide
es_es: Guía de diseño ajustado
