Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/scales/asinh_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_scales_asinh_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_scales_asinh_demo.py>` para descargar el código de ejemplo completo

source: Asinh Demo
es_es: Demo Asinh

source: Illustration of the `asinh <.scale.AsinhScale>` axis scaling, which uses the transformation
es_es: Ilustración de la escala del eje `asinh <.scale.AsinhScale>`, que utiliza la transformación

source: For coordinate values close to zero (i.e. much smaller than the "linear width" :math:`a_0`), this leaves values essentially unchanged:
es_es: Para los valores de las coordenadas cercanos a cero (es decir, mucho más pequeños que el "ancho lineal" :math:`a_0`), esto deja los valores esencialmente sin cambios:

source: but for larger values (i.e. :math:`|a| \gg a_0`, this is asymptotically
es_es: pero para valores mayores (es decir, :math:`|a| \gg a_0`, esto es asintótico

source: As with the `symlog <.scale.SymmetricalLogScale>` scaling, this allows one to plot quantities that cover a very wide dynamic range that includes both positive and negative values. However, ``symlog`` involves a transformation that has discontinuities in its gradient because it is built from *separate* linear and logarithmic transformations. The ``asinh`` scaling uses a transformation that is smooth for all (finite) values, which is both mathematically cleaner and reduces visual artifacts associated with an abrupt transition between linear and logarithmic regions of the plot.
es_es: Al igual que con la escala `symlog <.scale.SymmetricalLogScale>`, esto permite graficar cantidades que cubren un rango dinámico muy amplio que incluye valores positivos y negativos. Sin embargo, ``symlog`` implica una transformación que tiene discontinuidades en su gradiente porque se construye a partir de transformaciones lineales y logarítmicas *separadas*. La escala ``asinh`` utiliza una transformación que es suave para todos los valores (finitos), lo que es más limpio desde el punto de vista matemático y reduce los artefactos visuales asociados a una transición abrupta entre las regiones lineales y logarítmicas del gráfico.

source: `.scale.AsinhScale` is experimental, and the API may change.
es_es: `.scale.AsinhScale` es experimental, y la API puede cambiar.

source: See `~.scale.AsinhScale`, `~.scale.SymmetricalLogScale`.
es_es: Ver `~.scale.AsinhScale`, `~.scale.SymmetricalLogScale`.

source: Compare "symlog" and "asinh" behaviour on sample y=x graph, where there is a discontinuous gradient in "symlog" near y=2:
es_es: Compare el comportamiento de "symlog" y "asinh" en la gráfica de muestra y=x, donde hay un gradiente discontinuo en "symlog" cerca de y=2:

source: Compare "asinh" graphs with different scale parameter "linear_width":
es_es: Compara los gráficos de "asinh" con diferentes parámetros de escala "linear_width":

source: Compare "symlog" and "asinh" scalings on 2D Cauchy-distributed random numbers, where one may be able to see more subtle artifacts near y=2 due to the gradient-discontinuity in "symlog":
es_es: Compara las escalas "symlog" y "asinh" en números aleatorios distribuidos en 2D Cauchy, donde se pueden ver artefactos más sutiles cerca de y=2 debido a la discontinuidad del gradiente en "symlog":

source: References
es_es: Referencias

source: :download:`Download Python source code: asinh_demo.py <asinh_demo.py>`
es_es: :download:`Descargar el código fuente de Python: asinh_demo.py <asinh_demo.py>`

source: :download:`Download Jupyter notebook: asinh_demo.ipynb <asinh_demo.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: asinh_demo.ipynb <asinh_demo.ipynb>`
