Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/userdemo/colormap_normalizations.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_userdemo_colormap_normalizations.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_userdemo_colormap_normalizations.py>` para descargar el código de ejemplo completo

source: Colormap Normalizations
es_es: Normalizaciones de mapas de colores

source: Demonstration of using norm to map colormaps onto data in non-linear ways.
es_es: Demostración de la utilización de la norma para asignar mapas de colores a los datos de forma no lineal.

source: Lognorm: Instead of pcolor log10(Z1) you can have colorbars that have the exponential labels using a norm.
es_es: Lognorm: En lugar de pcolor log10(Z1) puedes tener barras de color que tengan las etiquetas exponenciales usando una norma.

source: Out:
es_es: Salida:

source: PowerNorm: Here a power-law trend in X partially obscures a rectified sine wave in Y. We can remove the power law using a PowerNorm.
es_es: PowerNorm: Aquí una tendencia de ley de potencia en X oscurece parcialmente una onda sinusoidal rectificada en Y. Podemos eliminar la ley de potencia utilizando una PowerNorm.

source: SymLogNorm: two humps, one negative and one positive, The positive with 5-times the amplitude. Linearly, you cannot see detail in the negative hump. Here we logarithmically scale the positive and negative data separately.
es_es: SymLogNorm: dos ondas, una negativa y otra positiva, la positiva con una amplitud 5 veces mayor. Linealmente, no se puede ver el detalle en la onda negativa. Aquí escalamos logarítmicamente los datos positivos y negativos por separado.

source: Note that colorbar labels do not come out looking very good.
es_es: Ten en cuenta que las etiquetas de la barra de colores no salen muy bien.

source: Custom Norm: An example with a customized normalization. This one uses the example above, and normalizes the negative data differently from the positive.
es_es: Norma personalizada: Un ejemplo con una normalización personalizada. Este utiliza el ejemplo anterior, y normaliza los datos negativos de forma diferente a los positivos.

source: BoundaryNorm: For this one you provide the boundaries for your colors, and the Norm puts the first color in between the first pair, the second color between the second pair, etc.
es_es: BoundaryNorm: En este caso, tú proporcionas los límites para tus colores, y la Norma coloca el primer color entre el primer par, el segundo color entre el segundo par, etc.

source: **Total running time of the script:** ( 0 minutes 3.083 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 3.083 segundos)

source: :download:`Download Python source code: colormap_normalizations.py <colormap_normalizations.py>`
es_es: :download:`Descarga el código fuente de Python: colormap_normalizations.py <colormap_normalizations.py>`

source: :download:`Download Jupyter notebook: colormap_normalizations.ipynb <colormap_normalizations.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: colormap_normalizations.ipynb <colormap_normalizations.ipynb>`
