Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/userdemo/custom_boxstyle01.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_userdemo_custom_boxstyle01.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_userdemo_custom_boxstyle01.py>` para descargar el código de ejemplo completo

source: Custom box styles
es_es: Estilos de caja personalizados

source: This example demonstrates the implementation of a custom `.BoxStyle`. Custom `.ConnectionStyle`\s and `.ArrowStyle`\s can be similarly defined.
es_es: Este ejemplo muestra la implementación de un `.BoxStyle` personalizado. Los estilos personalizados `.ConnectionStyle` y `.ArrowStyle` pueden definirse de forma similar.

source: Custom box styles can be implemented as a function that takes arguments specifying both a rectangular box and the amount of "mutation", and returns the "mutated" path. The specific signature is the one of ``custom_box_style`` below.
es_es: Los estilos de caja personalizados pueden implementarse como una función que toma argumentos que especifican una caja rectangular y la cantidad de "mutación", y devuelve la ruta "mutada". La firma específica es la de ``custom_box_style`` a continuación.

source: Here, we return a new path which adds an "arrow" shape on the left of the box.
es_es: Aquí, devolvemos un nueva ruta que añade una forma de "flecha" a la izquierda de la caja.

source: The custom box style can then be used by passing ``bbox=dict(boxstyle=custom_box_style, ...)`` to `.Axes.text`.
es_es: El estilo de caja personalizado puede utilizarse pasando ``bbox=dict(boxstyle=custom_box_style, ...)`` a `.Axes.text`.

source: Out:
es_es: Salida:

source: Likewise, custom box styles can be implemented as classes that implement ``__call__``.
es_es: Del mismo modo, los estilos de caja personalizados pueden implementarse como clases que implementan ``__call__``.

source: The classes can then be registered into the ``BoxStyle._style_list`` dict, which allows specifying the box style as a string, ``bbox=dict(boxstyle="registered_name,param=value,...", ...)``. Note that this registration relies on internal APIs and is therefore not officially supported.
es_es: Las clases pueden registrarse en el dict de ``BoxStyle._style_list``, que permite especificar el estilo de caja como una cadena, ``bbox=dict(boxstyle="registered_name,param=value,...", ...)``. Ten en cuenta que este registro depende de APIs internas y, por tanto, no está soportado oficialmente.

source: :download:`Download Python source code: custom_boxstyle01.py <custom_boxstyle01.py>`
es_es: :download:`Descargar código fuente de Python: custom_boxstyle01.py <custom_boxstyle01.py>`

source: :download:`Download Jupyter notebook: custom_boxstyle01.ipynb <custom_boxstyle01.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: custom_boxstyle01.ipynb <custom_boxstyle01.ipynb>`
