Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/user_interfaces/embedding_*_wx3_sgskip.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_user_interfaces_embedding_in_wx3_sgskip.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_user_interfaces_embedding_in_wx3_sgskip.py>` para descargar el código de ejemplo completo

source: Embedding in wx #3
es_es: Embedding en wx #3

source: Copyright (C) 2003-2004 Andrew Straw, Jeremy O'Donoghue and others
es_es: Copyright (C) 2003-2004 Andrew Straw, Jeremy O'Donoghue y otros

source: License: This work is licensed under the PSF. A copy should be included with this source code, and is also available at https://docs.python.org/3/license.html
es_es: Licencia: Este trabajo está licenciado bajo el PSF. Se debe incluir una copia con este código fuente, y también está disponible en https://docs.python.org/3/license.html

source: This is yet another example of using matplotlib with wx. Hopefully this is pretty full-featured:
es_es: Este es otro ejemplo de uso de matplotlib con wx. Espero que esto sea bastante completo:

source: both matplotlib toolbar and WX buttons manipulate plot
es_es: tanto la barra de herramientas de matplotlib como los botones de WX manipulan el gráfico

source: full wxApp framework, including widget interaction
es_es: todo el framework wxApp, incluyendo interacción de widgets

source: XRC (XML wxWidgets resource) file to create GUI (made with XRCed)
es_es: Archivo XRC (XML wxWidgets resource) para crear la IGU (hecho con XRCed)

source: This was derived from embedding_in_wx and dynamic_image_wxagg.
es_es: Esto se derivó de embedding_in_wx y dynamic_image_wxagg.

source: Thanks to matplotlib and wx teams for creating such great software!
es_es: ¡Gracias a los equipos de matplotlib y wx por crear un software tan bueno!

source: :download:`Download Python source code: embedding_in_wx3_sgskip.py <embedding_in_wx3_sgskip.py>`
es_es: :download:`Descargar código fuente de Python: embedding_in_wx3_sgskip.py <embedding_in_wx3_sgskip.py>`

source: :download:`Download Jupyter notebook: embedding_in_wx3_sgskip.ipynb <embedding_in_wx3_sgskip.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: embedding_in_wx3_sgskip.ipynb <embedding_in_wx3_sgskip.ipynb>`
