Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/user_interfaces/svg_histogram_sgskip.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_user_interfaces_svg_histogram_sgskip.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_user_interfaces_svg_histogram_sgskip.py>` para descargar el código de ejemplo completo

source: SVG Histogram
es_es: Histograma SVG

source: Demonstrate how to create an interactive histogram, in which bars are hidden or shown by clicking on legend markers.
es_es: Demostrar cómo crear un histograma interactivo, en el que las barras se ocultan o se muestran haciendo clic en los marcadores de la leyenda.

source: The interactivity is encoded in ecmascript (javascript) and inserted in the SVG code in a post-processing step. To render the image, open it in a web browser. SVG is supported in most web browsers used by Linux and OSX users. Windows IE9 supports SVG, but earlier versions do not.
es_es: La interactividad se codifica en ecmascript (javascript) y se inserta en el código SVG en un paso posterior al procesamiento. Para renderizar la imagen, abre la imagen en un navegador web. SVG es compatible con la mayoría de los navegadores web utilizados por los usuarios de Linux y OSX. Windows IE9 soporta SVG, pero las versiones anteriores no.

source: Notes
es_es: Notas

source: The matplotlib backend lets us assign ids to each object. This is the mechanism used here to relate matplotlib objects created in python and the corresponding SVG constructs that are parsed in the second step. While flexible, ids are cumbersome to use for large collection of objects. Two mechanisms could be used to simplify things:
es_es: El backend de matplotlib nos permite asignar ids a cada objeto. Este es el mecanismo utilizado aquí para relacionar los objetos matplotlib creados en python y las correspondientes construcciones SVG que se analizan en el segundo paso. Aunque son flexibles, los ids son engorrosos de usar para una gran colección de objetos. Se podrían utilizar dos mecanismos para simplificar las cosas:

source: systematic grouping of objects into SVG <g> tags,
es_es: agrupación sistemática de objetos en etiquetas SVG <g>,

source: assigning classes to each SVG object according to its origin.
es_es: asignar clases a cada objeto SVG según su origen.

source: For example, instead of modifying the properties of each individual bar, the bars from the `~.pyplot.hist` function could either be grouped in a PatchCollection, or be assigned a class="hist_##" attribute.
es_es: Por ejemplo, en lugar de modificar las propiedades de cada barra individual, las barras de la función `~.pyplot.hist` podrían agruparse en una PatchCollection, o asignarles un atributo class="hist_##".

source: CSS could also be used more extensively to replace repetitive markup throughout the generated SVG.
es_es: También se podría utilizar CSS de forma más amplia para sustituir las marcas repetitivas en todo el SVG generado.

source: Author: david.huard@gmail.com
es_es: Autor: david.huard@gmail.com

source: :download:`Download Python source code: svg_histogram_sgskip.py <svg_histogram_sgskip.py>`
es_es: :download:`Descargar código fuente de Python: svg_histogram_sgskip.py <svg_histogram_sgskip.py>`

source: :download:`Download Jupyter notebook: svg_histogram_sgskip.ipynb <svg_histogram_sgskip.ipynb>`
es_es: :download:`Descargar cuadernos de Jupyter: svg_histogram_sgskip.ipynb <svg_histogram_sgskip.ipynb>`
