Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/user_interfaces/toolmanager_sgskip.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_user_interfaces_toolmanager_sgskip.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_user_interfaces_toolmanager_sgskip.py>` para descargar el código de ejemplo completo

source: Tool Manager
es_es: Administrador de herramientas

source: This example demonstrates how to:
es_es: Este ejemplo demuestra cómo:

source: Modify the Toolbar
es_es: Modificar la barra de herramientas

source: Create tools
es_es: Crear herramientas

source: Add tools
es_es: Añadir herramientas

source: Remove tools
es_es: Quitar las herramientas

source: Using `matplotlib.backend_managers.ToolManager`
es_es: Usar `matplotlib.backend_managers.ToolManager`

source: :download:`Download Python source code: toolmanager_sgskip.py <toolmanager_sgskip.py>`
es_es: :download:`Descargar código fuente de Python: toolmanager_sgskip.py <toolmanager_sgskip.py>`

source: :download:`Download Jupyter notebook: toolmanager_sgskip.ipynb <toolmanager_sgskip.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: toolmanager_sgskip.ipynb <toolmanager_sgskip.ipynb>`
