Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/user_interfaces/web_application_server_sgskip.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_user_interfaces_web_application_server_sgskip.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_user_interfaces_web_application_server_sgskip.py>` para descargar el código de ejemplo completo

source: Embedding in a web application server (Flask)
es_es: Embedding en un servidor de aplicaciones web (Flask)

source: When using Matplotlib in a web server it is strongly recommended to not use pyplot (pyplot maintains references to the opened figures to make `~.matplotlib.pyplot.show` work, but this will cause memory leaks unless the figures are properly closed).
es_es: Cuando se utiliza Matplotlib en un servidor web se recomienda encarecidamente no utilizar pyplot (pyplot mantiene referencias a las figuras abiertas para que funcione `~.matplotlib.pyplot.show`, pero esto provocará fugas de memoria a menos que las figuras se cierren adecuadamente).

source: Since Matplotlib 3.1, one can directly create figures using the `.Figure` constructor and save them to in-memory buffers. In older versions, it was necessary to explicitly instantiate an Agg canvas (see e.g. :doc:`/gallery/user_interfaces/canvasagg`).
es_es: Desde Matplotlib 3.1, se pueden crear figuras directamente utilizando el constructor `.Figure` y guardarlas en buffers en memoria. En versiones anteriores, era necesario instanciar explícitamente un lienzo Agg (véase, por ejemplo, :doc:`/gallery/user_interfaces/canvasagg`).

source: The following example uses Flask_, but other frameworks work similarly:
es_es: El siguiente ejemplo utiliza Flask_, pero otros frameworks funcionan de forma similar:

source: Since the above code is a Flask application, it should be run using the `flask command-line tool <https://flask.palletsprojects.com/en/master/cli/>`_ Assuming that the working directory contains this script:
es_es: Dado que el código anterior es una aplicación Flask, debe ejecutarse utilizando la herramienta de línea de comandos `flask <https://flask.palletsprojects.com/en/master/cli/>`_ Asumiendo que el directorio de trabajo contiene este script:

source: Unix-like systems
es_es: Sistemas tipo Unix

source: Clickable images for HTML
es_es: Imágenes clicables para HTML

source: Andrew Dalke of `Dalke Scientific <http://www.dalkescientific.com>`_ has written a nice `article <http://www.dalkescientific.com/writings/diary/archive/2005/04/24/interactive_html.html>`_ on how to make html click maps with Matplotlib agg PNGs. We would also like to add this functionality to SVG. If you are interested in contributing to these efforts that would be great.
es_es: Andrew Dalke de `Dalke Scientific <http://www.dalkescientific.com>`_ ha escrito un buen `artículo <http://www.dalkescientific.com/writings/diary/archive/2005/04/24/interactive_html.html>`_ sobre cómo hacer mapas html de clic con Matplotlib agg PNGs. También nos gustaría añadir esta funcionalidad a SVG. Si estás interesado en contribuir a estos esfuerzos sería genial.

source: :download:`Download Python source code: web_application_server_sgskip.py <web_application_server_sgskip.py>`
es_es: :download:`Descargar código fuente de Python: web_application_server_sgskip.py <web_application_server_sgskip.py>`

source: :download:`Download Jupyter notebook: web_application_server_sgskip.ipynb <web_application_server_sgskip.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: web_application_server_sgskip.ipynb <web_application_server_sgskip.ipynb>`
