Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/axes_margins.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_axes_margins.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_axes_margins.py>` para descargar el código de ejemplo completo

source: Controlling view limits using margins and sticky_edges
es_es: Control de los límites de la vista mediante márgenes y sticky_edges

source: The first figure in this example shows how to zoom in and out of a plot using `~.Axes.margins` instead of `~.Axes.set_xlim` and `~.Axes.set_ylim`. The second figure demonstrates the concept of edge "stickiness" introduced by certain methods and artists and how to effectively work around that.
es_es: La primera figura de este ejemplo muestra cómo acercarse y alejarse de un gráfico utilizando `~.Axes.margins` en lugar de `~.Axes.set_xlim` y `~.Axes.set_ylim`. La segunda figura demuestra el concepto de "pegajosidad" de los bordes introducido por ciertos métodos y artistas y cómo trabajar eficazmente alrededor de eso.

source: On the "stickiness" of certain plotting methods
es_es: Sobre la "pegajosidad" de ciertos métodos de trazado

source: Some plotting functions make the axis limits "sticky" or immune to the will of the `~.Axes.margins` methods. For instance, `~.Axes.imshow` and `~.Axes.pcolor` expect the user to want the limits to be tight around the pixels shown in the plot. If this behavior is not desired, you need to set `~.Axes.use_sticky_edges` to `False`. Consider the following example:
es_es: Algunas funciones de trazado hacen que los límites de los ejes sean "pegajosos" o inmunes a la voluntad de los métodos `~.Axes.margins`. Por ejemplo, `~.Axes.imshow` y `~.Axes.pcolor` esperan que el usuario quiera que los límites sean ajustados alrededor de los píxeles mostrados en el gráfico. Si no se deseas este comportamiento, es necesario establecer `~.Axes.use_sticky_edges` a `False`. Considera el siguiente ejemplo:

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: axes_margins.py <axes_margins.py>`
es_es: :download:`Descargar el código fuente de Python: axes_margins.py <axes_margins.py>`

source: :download:`Download Jupyter notebook: axes_margins.ipynb <axes_margins.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: axes_margins.ipynb <axes_margins.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
