Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/axes_box_aspect.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_axes_box_aspect.py>` to download the full example code
es_es: Has clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_axes_box_aspect.py>` para descargar el código de ejemplo completo

source: Axes box aspect
es_es: Aspecto de la caja de los ejes

source: This demo shows how to set the aspect of an axes box directly via `~.Axes.set_box_aspect`. The box aspect is the ratio between axes height and axes width in physical units, independent of the data limits. This is useful to e.g. produce a square plot, independent of the data it contains, or to have a usual plot with the same axes dimensions next to an image plot with fixed (data-)aspect.
es_es: Este demo muestra cómo establecer el aspecto de una caja de ejes directamente a través de `~.Axes.set_box_aspect`. El aspecto de la caja es la relación entre la altura y la anchura de los ejes en unidades físicas, independientemente de los límites de los datos. Esto es útil para, por ejemplo, generar un gráfico cuadrado, independiente de los datos que contiene, o para tener un gráfico habitual con las mismas dimensiones de los ejes junto a un gráfico de imagen con aspecto (de datos) fijo.

source: The following lists a few use cases for `~.Axes.set_box_aspect`.
es_es: A continuación se enumeran algunos casos de uso de `~.Axes.set_box_aspect`.

source: A square axes, independent of data
es_es: Un eje cuadrado, independiente de los datos

source: Produce a square axes, no matter what the data limits are.
es_es: Genera un eje cuadrado, sin importar los límites de los datos.

source: Shared square axes
es_es: Ejes cuadrados compartidos

source: Produce shared subplots that are squared in size.
es_es: Generar subtramas compartidas de tamaño cuadrado.

source: Square twin axes
es_es: Ejes gemelos cuadrados

source: Produce a square axes, with a twin axes. The twinned axes takes over the box aspect of the parent.
es_es: Genera un eje cuadrado, con un eje gemelo. Los ejes gemelos toman el aspecto de caja del padre.

source: Normal plot next to image
es_es: Gráfico normal junto a la imagen

source: When creating an image plot with fixed data aspect and the default ``adjustable="box"`` next to a normal plot, the axes would be unequal in height. `~.Axes.set_box_aspect` provides an easy solution to that by allowing to have the normal plot's axes use the images dimensions as box aspect.
es_es: Al crear un gráfico de imagen con aspecto de datos arreglado y el valor por defecto ``ajustable="box"`` junto a un gráfico normal, los ejes serían desiguales en altura. `~.Axes.set_box_aspect` proporciona una solución fácil para esto, permitiendo que los ejes del gráfico normal utilicen las dimensiones de las imágenes como aspecto de la caja.

source: This example also shows that ``constrained_layout`` interplays nicely with a fixed box aspect.
es_es: Este ejemplo también muestra que ``constrained_layout`` interactúa muy bien con un aspecto de caja arreglado.

source: Square joint/marginal plot
es_es: Gráfico de unión cuadrada/marginal

source: It may be desirable to show marginal distributions next to a plot of joint data. The following creates a square plot with the box aspect of the marginal axes being equal to the width- and height-ratios of the gridspec. This ensures that all axes align perfectly, independent on the size of the figure.
es_es: Puede ser deseable mostrar las distribuciones marginales junto a un gráfico de datos conjuntos. Lo siguiente crea un gráfico cuadrado con el aspecto de la caja de los ejes marginales siendo igual a las relaciones de anchura y altura de la gridspec. Esto asegura que todos los ejes se alinean perfectamente, independientemente del tamaño de la figura.

source: When setting the box aspect, one may still set the data aspect as well. Here we create an axes with a box twice as long as tall and use an "equal" data aspect for its contents, i.e. the circle actually stays circular.
es_es: Al establecer el aspecto de la caja, se puede seguir estableciendo el aspecto de los datos también. Aquí creamos un eje con una caja el doble de larga que de alta y utilizamos un aspecto de datos "igual" para su contenido, es decir, el círculo en realidad sigue siendo circular.

source: Box aspect for many subplots
es_es: Aspecto de la caja para muchos subplots

source: It is possible to pass the box aspect to an axes at initialization. The following creates a 2 by 3 subplot grid with all square axes.
es_es: Es posible pasar el aspecto de la caja a un eje en la inicialización. Lo siguiente crea una Cuadrícula de 2 por 3 con todos los ejes cuadrados.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 3.001 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 3,001 segundos)

source: :download:`Download Python source code: axes_box_aspect.py <axes_box_aspect.py>`
es_es: :download:`Descargar el código fuente de Python: axes_box_aspect.py <axes_box_aspect.py>`

source: :download:`Download Jupyter notebook: axes_box_aspect.ipynb <axes_box_aspect.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: axes_box_aspect.ipynb <axes_box_aspect.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
