Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/colorbar_placement.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_colorbar_placement.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_colorbar_placement.py>` para descargar el código de ejemplo completo

source: Placing Colorbars
es_es: Colocación de las barras de color

source: Colorbars indicate the quantitative extent of image data. Placing in a figure is non-trivial because room needs to be made for them.
es_es: Las barras de color indican la extensión cuantitativa de los datos de la imagen. La colocación en una figura no es trivial porque hay que hacerles sitio.

source: The simplest case is just attaching a colorbar to each axes:
es_es: El caso más sencillo es simplemente adjuntar una barra de color a cada eje:

source: The first column has the same type of data in both rows, so it may be desirable to combine the colorbar which we do by calling `.Figure.colorbar` with a list of axes instead of a single axes.
es_es: La primera columna tiene el mismo tipo de datos en ambas filas, por lo que puede ser conveniente combinar la barra de colores que hacemos llamando a `.Figure.colorbar` con una lista de ejes en lugar de un solo eje.

source: Relatively complicated colorbar layouts are possible using this paradigm. Note that this example works far better with ``constrained_layout=True``
es_es: Es posible realizar disposiciones de barras de color relativamente complicadas utilizando este paradigma. Ten en cuenta que este ejemplo funciona mucho mejor con ``constrained_layout=True``

source: Colorbars with fixed-aspect-ratio axes
es_es: Barras de color con ejes de relación de aspecto fijo

source: Placing colorbars for axes with a fixed aspect ratio pose a particular challenge as the parent axes changes size depending on the data view.
es_es: La colocación de las barras de color para los ejes con una relación de aspecto fija plantean un reto particular, ya que los ejes padres cambian de tamaño dependiendo de la vista de los datos.

source: One way around this issue is to use an `.Axes.inset_axes` to locate the axes in axes coordinates. Note that if you zoom in on the axes, and change the shape of the axes, the colorbar will also change position.
es_es: Una forma de evitar este problema es utilizar un `.Axes.inset_axes` para localizar los ejes en coordenadas de ejes. Ten en cuenta que si haces zoom en los ejes, y cambias la forma de los ejes, la barra de color también cambiará de posición.

source: **Total running time of the script:** ( 0 minutes 4.125 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 4,125 segundos)

source: :download:`Download Python source code: colorbar_placement.py <colorbar_placement.py>`
es_es: :download:`Descarga el código fuente de Python: colorbar_placement.py <colorbar_placement.py>`

source: :download:`Download Jupyter notebook: colorbar_placement.ipynb <colorbar_placement.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: colorbar_placement.ipynb <colorbar_placement.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
