Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/custom_figure_class.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_custom_figure_class.py>` to download the full example code
es_es: Has clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_custom_figure_class.py>` para descargar el código de ejemplo completo

source: Custom Figure subclasses
es_es: Subclases de figuras personalizadas

source: You can pass a `.Figure` subclass to `.pyplot.figure` if you want to change the default behavior of the figure.
es_es: Puedes pasar una subclase `.Figure` a `.pyplot.figure` si quieres cambiar el comportamiento por defecto de la figura.

source: This example defines a `.Figure` subclass ``WatermarkFigure`` that accepts an additional parameter ``watermark`` to display a custom watermark text. The figure is created using the ``FigureClass`` parameter of `.pyplot.figure`. The additional ``watermark`` parameter is passed on to the subclass constructor.
es_es: Este ejemplo define una subclase `.Figure` ``WatermarkFigure`` que acepta un parámetro adicional ``watermark`` para mostrar un texto de marca de agua personalizado. La figura se crea utilizando el parámetro ``FigureClass`` de `.pyplot.figure`. El parámetro adicional ``watermark`` se pasa al constructor de la subclase.

source: Out:
es_es: Salida:

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: custom_figure_class.py <custom_figure_class.py>`
es_es: :download:`Descarga el código fuente de Python: custom_figure_class.py <custom_figure_class.py>`

source: :download:`Download Jupyter notebook: custom_figure_class.ipynb <custom_figure_class.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: custom_figure_class.ipynb <custom_figure_class.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
