Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/demo_constrained_layout.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_demo_constrained_layout.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_demo_constrained_layout.py>` para descargar el código de ejemplo completo

source: Resizing axes with constrained layout
es_es: Cambiar el tamaño de los ejes con el diseño restringido

source: Constrained layout attempts to resize subplots in a figure so that there are no overlaps between axes objects and labels on the axes.
es_es: El diseño restringido intenta redimensionar las subtramas de una figura para que no haya solapamientos entre los objetos de los ejes y las etiquetas de los mismos.

source: See :doc:`/tutorials/intermediate/constrainedlayout_guide` for more details and :doc:`/tutorials/intermediate/tight_layout_guide` for an alternative.
es_es: Ver :doc:`/tutorials/intermediate/constrainedlayout_guide` para más detalles y :doc:`/tutorials/intermediate/tight_layout_guide` para una alternativa.

source: If we don't use constrained_layout, then labels overlap the axes
es_es: Si no usamos constrained_layout, las etiquetas se superponen a los ejes

source: adding ``constrained_layout=True`` automatically adjusts.
es_es: añadir ``constrained_layout=True`` ajusta automáticamente.

source: Below is a more complicated example using nested gridspecs.
es_es: A continuación se muestra un ejemplo más complicado utilizando gridspecs anidados.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 2.250 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2.250 segundos)

source: :download:`Download Python source code: demo_constrained_layout.py <demo_constrained_layout.py>`
es_es: :download:`Descarga el código fuente de Python: demo_constrained_layout.py <demo_constrained_layout.py>`

source: :download:`Download Jupyter notebook: demo_constrained_layout.ipynb <demo_constrained_layout.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: demo_constrained_layout.ipynb <demo_constrained_layout.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
