Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/demo_tight_layout.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_demo_tight_layout.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_demo_tight_layout.py>` para descargar el código completo del ejemplo

source: Resizing axes with tight layout
es_es: Cambiar el tamaño de los ejes con el diseño ajustado

source: `~.figure.Figure.tight_layout` attempts to resize subplots in a figure so that there are no overlaps between axes objects and labels on the axes.
es_es: `~.figure.Figure.tight_layout` intenta redimensionar las subtramas de una figura para que no haya solapamientos entre los objetos de los ejes y las etiquetas de los mismos.

source: See :doc:`/tutorials/intermediate/tight_layout_guide` for more details and :doc:`/tutorials/intermediate/constrainedlayout_guide` for an alternative.
es_es: Ver :doc:`/tutorials/intermediate/tight_layout_guide` para más detalles y :doc:`/tutorials/intermediate/constrainedlayout_guide` para una alternativa.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 4.088 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 4.088 segundos)

source: :download:`Download Python source code: demo_tight_layout.py <demo_tight_layout.py>`
es_es: :download:`Descarga el código fuente de Python: demo_tight_layout.py <demo_tight_layout.py>`

source: :download:`Download Jupyter notebook: demo_tight_layout.ipynb <demo_tight_layout.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: demo_tight_layout.ipynb <demo_tight_layout.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
