Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/figure_title.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_figure_title.py>` to download the full example code
es_es: Haga clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_figure_title.py>` para descargar el código de ejemplo completo

source: Figure labels: suptitle, supxlabel, supylabel
es_es: Etiquetas de las figuras: suptitle, supxlabel, supylabel

source: Each axes can have a title (or actually three - one each with *loc* "left", "center", and "right"), but is sometimes desirable to give a whole figure (or `.SubFigure`) an overall title, using `.FigureBase.suptitle`.
es_es: Cada eje puede tener un título (o en realidad tres - uno con *loc* "izquierda", "centro" y "derecha"), pero a veces es deseable dar a toda una figura (o `.SubFigure`) un título general, usando `.FigureBase.suptitle`.

source: We can also add figure-level x- and y-labels using `.FigureBase.supxlabel` and `.FigureBase.supylabel`.
es_es: También podemos añadir etiquetas x e y a nivel de figura utilizando `.FigureBase.supxlabel` y `.FigureBase.supylabel`.

source: Out:
es_es: Salida:

source: A global x- or y-label can be set using the `.FigureBase.supxlabel` and `.FigureBase.supylabel` methods.
es_es: Se puede establecer una etiqueta global x o y utilizando los métodos `.FigureBase.supxlabel` y `.FigureBase.supylabel`.

source: **Total running time of the script:** ( 0 minutes 2.640 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2.640 segundos)

source: :download:`Download Python source code: figure_title.py <figure_title.py>`
es_es: :download:`Descarga el código fuente de Python: figure_title.py <figure_title.py>`

source: :download:`Download Jupyter notebook: figure_title.ipynb <figure_title.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: figure_title.ipynb <figure_title.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
