Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/figure_size_units.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_figure_size_units.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_figure_size_units.py>` para descargar el código de ejemplo completo

source: Figure size in different units
es_es: Tamaño de la figura en diferentes unidades

source: The native figure size unit in Matplotlib is inches, deriving from print industry standards. However, users may need to specify their figures in other units like centimeters or pixels. This example illustrates how to do this efficiently.
es_es: La unidad de tamaño de figura nativa en Matplotlib es pulgadas, derivada de los estándares de la industria de la impresión. Sin embargo, los usuarios pueden necesitar especificar sus figuras en otras unidades como centímetros o píxeles. Este ejemplo ilustra cómo hacer esto de manera eficiente.

source: Figure size in inches (default)
es_es: Tamaño de la figura en pulgadas (por defecto)

source: Figure size in centimeter
es_es: Tamaño de la figura en centímetros

source: Multiplying centimeter-based numbers with a conversion factor from cm to inches, gives the right numbers. Naming the conversion factor ``cm`` makes the conversion almost look like appending a unit to the number, which is nicely readable.
es_es: Multiplicando los números basados en centímetros con un factor de conversión de cm a pulgadas, se obtienen los números correctos. Nombrar el factor de conversión ``cm`` hace que la conversión parezca casi como añadir una unidad al número, lo cual es muy legible.

source: Figure size in pixel
es_es: Tamaño de la figura en píxeles

source: Similarly, one can use a conversion from pixels.
es_es: Asimismo, se puede utilizar una conversión a partir de píxeles.

source: Note that you could break this if you use `~.pyplot.savefig` with a different explicit dpi value.
es_es: Ten en cuenta que podrías romper esto si utilizas `~.pyplot.savefig` con un valor explícito de ppp diferente.

source: Quick interactive work is usually rendered to the screen, making pixels a good size of unit. But defining the conversion factor may feel a little tedious for quick iterations.
es_es: El trabajo interactivo rápido normalmente se renderiza en la pantalla, lo que hace que los píxeles sean un buen tamaño de unidad. Pero definir el factor de conversión puede parecer un poco tedioso para las iteraciones rápidas.

source: Because of the default ``rcParams['figure.dpi'] = 100``, one can mentally divide the needed pixel value by 100 [#]_:
es_es: Debido a que por defecto ``rcParams['figure.dpi'] = 100``, se puede dividir mentalmente el valor de píxeles necesario por 100 [#]_:

source: Unfortunately, this does not work well for the ``matplotlib inline`` backend in Jupyter because that backend uses a different default of ``rcParams['figure.dpi'] = 72``. Additionally, it saves the figure with ``bbox_inches='tight'``, which crops the figure and makes the actual size unpredictable.
es_es: Desafortunadamente, esto no funciona bien para el backend ``matplotlib inline`` en Jupyter porque ese backend utiliza un valor por defecto diferente de ``rcParams['figure.dpi'] = 72``. Además, guarda la figura con ``bbox_inches='tight'``, que recorta la figura y hace que el tamaño real sea impredecible.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: figure_size_units.py <figure_size_units.py>`
es_es: :download:`Descarga el código fuente de Python: figure_size_units.py <figure_size_units.py>`

source: :download:`Download Jupyter notebook: figure_size_units.ipynb <figure_size_units.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: figure_size_units.ipynb <figure_size_units.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
