Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/multiple_figs_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_multiple_figs_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_multiple_figs_demo.py>` para descargar el código de ejemplo completo

source: Managing multiple figures in pyplot
es_es: Gestión de múltiples figuras en pyplot

source: `matplotlib.pyplot` uses the concept of a *current figure* and *current axes*. Figures are identified via a figure number that is passed to `~.pyplot.figure`. The figure with the given number is set as *current figure*. Additionally, if no figure with the number exists, a new one is created.
es_es: `matplotlib.pyplot` utiliza el concepto de *figura actual* y *ejes actuales*. Las figuras se identifican mediante un número de figura que se pasa a `~.pyplot.figure`. La figura con el número dado se establece como *figura actual*. Además, si no existe ninguna figura con el número, se crea una nueva.

source: We discourage working with multiple figures in pyplot because managing the *current figure* is cumbersome and error-prone. Instead, we recommend to use the object-oriented approach and call methods on Figure and Axes instances.
es_es: Desaconsejamos trabajar con múltiples figuras en pyplot porque la gestión de la *figura actual* es engorrosa y propensa a errores. En su lugar, recomendamos utilizar el enfoque orientado a objetos y llamar a los métodos en las instancias de Figura y Ejes.

source: Create figure 1
es_es: Crear figura 1

source: Out:
es_es: Salida:

source: Create figure 2
es_es: Crear figura 2

source: Now switch back to figure 1 and make some changes
es_es: Ahora vuelve a la figura 1 y realiza algunos cambios

source: :download:`Download Python source code: multiple_figs_demo.py <multiple_figs_demo.py>`
es_es: :download:`Descarga el código fuente de Python: multiple_figs_demo.py <multiple_figs_demo.py>`

source: :download:`Download Jupyter notebook: multiple_figs_demo.ipynb <multiple_figs_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: multiple_figs_demo.ipynb <multiple_figs_demo.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
