Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/secondary_axis.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_secondary_axis.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_secondary_axis.py>` para descargar el código de ejemplo completo

source: Secondary Axis
es_es: Eje secundario

source: Sometimes we want a secondary axis on a plot, for instance to convert radians to degrees on the same plot. We can do this by making a child axes with only one axis visible via `.axes.Axes.secondary_xaxis` and `.axes.Axes.secondary_yaxis`. This secondary axis can have a different scale than the main axis by providing both a forward and an inverse conversion function in a tuple to the *functions* keyword argument:
es_es: A veces queremos un eje secundario en un gráfico, por ejemplo para convertir radianes en grados en el mismo gráfico. Podemos hacerlo haciendo un eje hijo con un solo eje visible a través de `.ejes.ejes.secundarios_eje` y `.ejes.secundarios_eje`. Este eje secundario puede tener una escala diferente a la del eje principal proporcionando una función de conversión directa e inversa en una tupla al argumento de la palabra clave *functions*:

source: Here is the case of converting from wavenumber to wavelength in a log-log scale.
es_es: Este es el caso de la conversión de número de onda a longitud de onda en una escala log-log.

source: In this case, the xscale of the parent is logarithmic, so the child is made logarithmic as well.
es_es: En este caso, la escala x del padre es logarítmica, por lo que el hijo se hace logarítmico también.

source: Sometime we want to relate the axes in a transform that is ad-hoc from the data, and is derived empirically. In that case we can set the forward and inverse transforms functions to be linear interpolations from the one data set to the other.
es_es: A veces queremos relacionar los ejes en una transformación que es ad-hoc de los datos, y se deriva empíricamente. En ese caso podemos establecer que las funciones de transformación directa e inversa sean interpolaciones lineales de un conjunto de datos al otro.

source: In order to properly handle the data margins, the mapping functions (``forward`` and ``inverse`` in this example) need to be defined beyond the nominal plot limits.
es_es: Para manejar adecuadamente los márgenes de los datos, las funciones de mapeo (``forward`` e ``inverse`` en este ejemplo) necesitan ser definidas más allá de los límites nominales del gráfico.

source: In the specific case of the numpy linear interpolation, `numpy.interp`, this condition can be arbitrarily enforced by providing optional keyword arguments *left*, *right* such that values outside the data range are mapped well outside the plot limits.
es_es: En el caso específico de la interpolación lineal de numpy, `numpy.interp`, esta condición puede ser aplicada arbitrariamente proporcionando argumentos opcionales de palabra clave *izquierda*, *derecha* de tal manera que los valores fuera del rango de datos sean mapeados bien fuera de los límites del gráfico.

source: A final example translates np.datetime64 to yearday on the x axis and from Celsius to Fahrenheit on the y axis. Note the addition of a third y axis, and that it can be placed using a float for the location argument
es_es: Un último ejemplo traduce np.datetime64 a yearday en el eje x y de Celsius a Fahrenheit en el eje y. Observa la adición de un tercer eje y, que puede ser colocado usando un flotador para el argumento de ubicación

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 6.275 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 6,275 segundos)

source: :download:`Download Python source code: secondary_axis.py <secondary_axis.py>`
es_es: :download:`Descarga el código fuente de Python: eje_secundario.py <eje_secundario.py>`

source: :download:`Download Jupyter notebook: secondary_axis.ipynb <secondary_axis.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: eje_secundario.ipynb <eje_secundario.ipynb>`.

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
