Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/shared_axis_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_shared_axis_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_shared_axis_demo.py>` para descargar el código de ejemplo completo

source: Shared Axis
es_es: Eje compartido

source: You can share the x or y axis limits for one axis with another by passing an axes instance as a *sharex* or *sharey* keyword argument.
es_es: Puedes compartir los límites de los ejes x o y de un eje con otro pasando una instancia de ejes como argumento de la palabra clave *sharex* o *sharey*.

source: Changing the axis limits on one axes will be reflected automatically in the other, and vice-versa, so when you navigate with the toolbar the axes will follow each other on their shared axes. Ditto for changes in the axis scaling (e.g., log vs. linear). However, it is possible to have differences in tick labeling, e.g., you can selectively turn off the tick labels on one axes.
es_es: El cambio de los límites de los ejes en uno de ellos se reflejará automáticamente en el otro, y viceversa, por lo que al navegar con la barra de herramientas los ejes se seguirán en sus ejes compartidos. Lo mismo ocurre con los cambios en la escala de los ejes (por ejemplo, log vs. lineal). Sin embargo, es posible tener diferencias en el etiquetado de los marcadores, por ejemplo, puede desactivar selectivamente las etiquetas de los marcadores en uno de los ejes.

source: The example below shows how to customize the tick labels on the various axes. Shared axes share the tick locator, tick formatter, view limits, and transformation (e.g., log, linear). But the ticklabels themselves do not share properties. This is a feature and not a bug, because you may want to make the tick labels smaller on the upper axes, e.g., in the example below.
es_es: El siguiente ejemplo muestra cómo personalizar las etiquetas de los marcadores en los distintos ejes. Los ejes comunes comparten el localizador de marcadores, el formateador de marcadores, los límites de la vista y la transformación (por ejemplo, log, lineal). Sin embargo, las etiquetas de los puntos no comparten propiedades. Esto es una característica y no un error, porque es posible que desees hacer más pequeñas las etiquetas de los marcadores en los ejes superiores, por ejemplo, en el caso siguiente.

source: If you want to turn off the ticklabels for a given axes (e.g., on subplot(211) or subplot(212), you cannot do the standard trick::
es_es: Si quieres desactivar las etiquetas de los ejes (por ejemplo, en subplot(211) o subplot(212)), no puedes hacer el truco estándar::

source: because this changes the tick Formatter, which is shared among all axes. But you can alter the visibility of the labels, which is a property::
es_es: porque esto cambia el formateador de marcadores, que se comparte entre todos los ejes. Pero se puede alterar la visibilidad de las etiquetas, que es una propiedad::

source: :download:`Download Python source code: shared_axis_demo.py <shared_axis_demo.py>`
es_es: :download:`Descarga el código fuente de Python: shared_axis_demo.py <shared_axis_demo.py>`

source: :download:`Download Jupyter notebook: shared_axis_demo.ipynb <shared_axis_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: shared_axis_demo.ipynb <shared_axis_demo.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
