Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/subfigures.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_subfigures.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_subfigures.py>` para descargar el código de ejemplo completo

source: Figure subfigures
es_es: Figura subfiguras

source: Sometimes it is desirable to have a figure with two different layouts in it. This can be achieved with :doc:`nested gridspecs</gallery/subplots_axes_and_figures/gridspec_nested>`, but having a virtual figure with its own artists is helpful, so Matplotlib also has "subfigures", accessed by calling `matplotlib.figure.Figure.add_subfigure` in a way that is analogous to `matplotlib.figure.Figure.add_subplot`, or `matplotlib.figure.Figure.subfigures` to make an array of subfigures. Note that subfigures can also have their own child subfigures.
es_es: A veces es deseable tener una figura con dos disposiciones diferentes en ella. Esto se puede conseguir con :doc:`nested gridspecs</gallery/subplots_axes_and_figures/gridspec_nested>`, pero tener una figura virtual con sus propios artistas es útil, así que Matplotlib también tiene "subfiguras", a las que se accede llamando a `matplotlib. figure.Figure.add_subfigure` de forma análoga a `matplotlib.figure.Figure.add_subplot`, o `matplotlib.figure.Figure.subfigures` para hacer un arreglo de subfiguras. Ten en cuenta que las subfiguras también pueden tener sus propias subfiguras hijas.

source: ``subfigure`` is new in v3.4, and the API is still provisional.
es_es: ``subfigure`` es nuevo en la v3.4, y la API es todavía provisional.

source: It is possible to mix subplots and subfigures using `matplotlib.figure.Figure.add_subfigure`. This requires getting the gridspec that the subplots are laid out on.
es_es: Es posible mezclar subplots y subfiguras utilizando `matplotlib.figure.Figure.add_subfigure`. Para ello es necesario obtener la gridspec sobre la que se disponen las subtramas.

source: Subfigures can have different widths and heights. This is exactly the same example as the first example, but *width_ratios* has been changed:
es_es: Las subfiguras pueden tener diferentes anchuras y alturas. Este es exactamente el mismo ejemplo que el primero, pero se ha cambiado *width_ratios*:

source: Subfigures can be also be nested:
es_es: Las subfiguras también se pueden anidar:

source: **Total running time of the script:** ( 0 minutes 5.449 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 5.449 segundos)

source: :download:`Download Python source code: subfigures.py <subfigures.py>`
es_es: ::download:`Descarga el código fuente de Python: subfigures.py <subfigures.py>`

source: :download:`Download Jupyter notebook: subfigures.ipynb <subfigures.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: subfigures.ipynb <subfigures.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
