Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/subplots_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_subplots_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_subplots_demo.py>` para descargar el código de ejemplo completo

source: Creating multiple subplots using ``plt.subplots``
es_es: Creando múltiples subplots usando ``plt.subplots``

source: `.pyplot.subplots` creates a figure and a grid of subplots with a single call, while providing reasonable control over how the individual plots are created. For more advanced use cases you can use `.GridSpec` for a more general subplot layout or `.Figure.add_subplot` for adding subplots at arbitrary locations within the figure.
es_es: `.pyplot.subplots` crea una figura y una Cuadrícula de subplots con una sola llamada, a la vez que proporciona un control razonable sobre cómo se crean las parcelas individuales. Para casos de uso más avanzados se puede utilizar `.GridSpec` para una disposición más general de las subparcelas o `.Figure.add_subplot` para añadir subparcelas en lugares arbitrarios dentro de la figura.

source: A figure with just one subplot
es_es: Una figura con un solo subplot

source: ``subplots()`` without arguments returns a `.Figure` and a single `~.axes.Axes`.
es_es: ``subplots()`` sin argumentos devuelve un `.Figure` y un único `~.axes.Axes``.

source: This is actually the simplest and recommended way of creating a single Figure and Axes.
es_es: Esta es en realidad la forma más sencilla y recomendada de crear una sola Figura y Ejes.

source: Out:
es_es: Salida:

source: Stacking subplots in one direction
es_es: Apilamiento de subplots en una dirección

source: The first two optional arguments of `.pyplot.subplots` define the number of rows and columns of the subplot grid.
es_es: Los dos primeros argumentos opcionales de `.pyplot.subplots` definen el número de filas y columnas de la Cuadrícula del subplot.

source: When stacking in one direction only, the returned ``axs`` is a 1D numpy array containing the list of created Axes.
es_es: Cuando se apila en una sola dirección, el ``axs`` devuelto es un arreglo numpy 1D que contiene la lista de Ejes creados.

source: If you are creating just a few Axes, it's handy to unpack them immediately to dedicated variables for each Axes. That way, we can use ``ax1`` instead of the more verbose ``axs[0]``.
es_es: Si estamos creando sólo unos pocos Ejes, es práctico desempaquetarlos inmediatamente en variables dedicadas para cada Eje. De esta manera, podemos usar ``ax1`` en lugar del más verboso ``axs[0]``.

source: To obtain side-by-side subplots, pass parameters ``1, 2`` for one row and two columns.
es_es: Para obtener subplots de lado a lado, pasa los parámetros ``1, 2`` para una fila y dos columnas.

source: Stacking subplots in two directions
es_es: Apilamiento de subplots en dos direcciones

source: When stacking in two directions, the returned ``axs`` is a 2D NumPy array.
es_es: Cuando se apila en dos direcciones, el ``eje`` devuelto es un arreglo 2D de NumPy.

source: If you have to set parameters for each subplot it's handy to iterate over all subplots in a 2D grid using ``for ax in axs.flat:``.
es_es: Si tienes que parametrizar cada subplot es práctico iterar sobre todos los subplots en una Cuadrícula 2D usando ``for ax in axs.flat:``.

source: You can use tuple-unpacking also in 2D to assign all subplots to dedicated variables:
es_es: Puedes usar el desempacado de tuplas también en 2D para asignar todos los subplots a variables dedicadas:

source: Sharing axes
es_es: Compartir ejes

source: By default, each Axes is scaled individually. Thus, if the ranges are different the tick values of the subplots do not align.
es_es: Por defecto, cada eje se escala individualmente. Por lo tanto, si los rangos son diferentes, los valores de los marcadores de los subplots no se alinean.

source: You can use *sharex* or *sharey* to align the horizontal or vertical axis.
es_es: Puedes usar *sharex* o *sharey* para alinear el eje horizontal o vertical.

source: Setting *sharex* or *sharey* to ``True`` enables global sharing across the whole grid, i.e. also the y-axes of vertically stacked subplots have the same scale when using ``sharey=True``.
es_es: Establecer *sharex* o *sharey* a ``True`` permite compartir globalmente toda la Cuadrícula, es decir, también los ejes y de los subplots apilados verticalmente tienen la misma escala cuando se utiliza ``sharey=True``.

source: For subplots that are sharing axes one set of tick labels is enough. Tick labels of inner Axes are automatically removed by *sharex* and *sharey*. Still there remains an unused empty space between the subplots.
es_es: Para los subplots que comparten ejes es suficiente un conjunto de etiquetas de marcador. Los marcadores de los ejes interiores se eliminan automáticamente con *sharex* y *sharey*. Todavía queda un espacio vacío sin usar entre los subplots.

source: To precisely control the positioning of the subplots, one can explicitly create a `.GridSpec` with `.Figure.add_gridspec`, and then call its `~.GridSpecBase.subplots` method. For example, we can reduce the height between vertical subplots using ``add_gridspec(hspace=0)``.
es_es: Para controlar con precisión el posicionamiento de los subplots, se puede crear explícitamente un `.GridSpec` con `.Figure.add_gridspec`, y luego llamar a su método `~.GridSpecBase.subplots`. Por ejemplo, podemos reducir la altura entre subplots verticales utilizando ``add_gridspec(hspace=0)``.

source: `.label_outer` is a handy method to remove labels and ticks from subplots that are not at the edge of the grid.
es_es: `.label_outer` es un método práctico para eliminar las etiquetas y los marcadores de los subplots que no están en el borde de la Cuadrícula.

source: Apart from ``True`` and ``False``, both *sharex* and *sharey* accept the values 'row' and 'col' to share the values only per row or column.
es_es: Además de ``True`` y ``False``, tanto *sharex* como *sharey* aceptan los valores 'row' y 'col' para compartir los valores sólo por fila o columna.

source: If you want a more complex sharing structure, you can first create the grid of axes with no sharing, and then call `.axes.Axes.sharex` or `.axes.Axes.sharey` to add sharing info a posteriori.
es_es: Si quieres una estructura de compartición más compleja, puedes crear primero la Cuadrícula de ejes sin compartición, y luego llamar a `.axes.Axes.sharex` o `.axes.Axes.sharey` para añadir información de compartición a posteriori.

source: Polar axes
es_es: Ejes polares

source: The parameter *subplot_kw* of `.pyplot.subplots` controls the subplot properties (see also `.Figure.add_subplot`). In particular, this can be used to create a grid of polar Axes.
es_es: El parámetro *subplot_kw* de `.pyplot.subplots` controla las propiedades de los subplots (ver también `.Figure.add_subplot`). En particular, se puede utilizar para crear una Cuadrícula de Ejes polares.

source: **Total running time of the script:** ( 0 minutes 5.737 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 5.737 segundos)

source: :download:`Download Python source code: subplots_demo.py <subplots_demo.py>`
es_es: :download:`Descarga el código fuente de Python: subplots_demo.py <subplots_demo.py>`

source: :download:`Download Jupyter notebook: subplots_demo.ipynb <subplots_demo.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: subplots_demo.ipynb <subplots_demo.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
