Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/subplots_axes_and_figures/two_scales.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_subplots_axes_and_figures_two_scales.py>` to download the full example code
es_es: Haga clic en :ref:`aquí <sphx_glr_download_gallery_subplots_axes_and_figures_two_scales.py>` para descargar el código completo del ejemplo

source: Plots with different scales
es_es: Parcelas con diferentes escalas

source: Two plots on the same axes with different left and right scales.
es_es: Dos gráficos en los mismos ejes con diferentes escalas izquierda y derecha.

source: The trick is to use *two different axes* that share the same *x* axis. You can use separate `matplotlib.ticker` formatters and locators as desired since the two axes are independent.
es_es: El truco consiste en utilizar *dos ejes diferentes* que comparten el mismo eje *x*. Puedes utilizar formateadores y localizadores `matplotlib.ticker` separados como desee ya que los dos ejes son independientes.

source: Such axes are generated by calling the `.Axes.twinx` method. Likewise, `.Axes.twiny` is available to generate axes that share a *y* axis but have different top and bottom scales.
es_es: Estos ejes se generan llamando al método `.Axes.twinx`. Igualmente, `.Axes.twiny` está disponible para generar ejes que comparten un eje *y* pero tienen diferentes escalas superior e inferior.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: two_scales.py <two_scales.py>`
es_es: :download:`Descarga el código fuente de Python: two_scales.py <two_scales.py>`

source: :download:`Download Jupyter notebook: two_scales.ipynb <two_scales.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: two_scales.ipynb <two_scales.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
