Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/statistics/boxplot.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_statistics_boxplot.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_statistics_boxplot.py>` para descargar el código de ejemplo completo

source: Artist customization in box plots
es_es: Personalización del artist en los gráficos de caja

source: This example demonstrates how to use the various keyword arguments to fully customize box plots. The first figure demonstrates how to remove and add individual components (note that the mean is the only value not shown by default). The second figure demonstrates how the styles of the artists can be customized. It also demonstrates how to set the limit of the whiskers to specific percentiles (lower right axes)
es_es: Este ejemplo muestra cómo utilizar los distintos argumentos de las palabras clave para personalizar completamente los gráficos de caja. La primera figura demuestra cómo eliminar y añadir componentes individuales (observe que la media es el único valor que no se muestra por defecto). La segunda figura demuestra cómo se pueden personalizar los estilos de los artists. También demuestra cómo establecer el límite de los bigotes a percentiles específicos (ejes inferiores derechos)

source: A good general reference on boxplots and their history can be found here: https://vita.had.co.nz/papers/boxplots.pdf
es_es: Una buena referencia general sobre los gráfico de caja y su historia puede encontrarse aquí: https://vita.had.co.nz/papers/boxplots.pdf

source: Demonstrate how to toggle the display of different elements:
es_es: Demostrar cómo alternar la visualización de diferentes elementos:

source: Demonstrate how to customize the display different elements:
es_es: Demostrar cómo personalizar los diferentes elementos de la pantalla:

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 2.789 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 2.789 segundos)

source: :download:`Download Python source code: boxplot.py <boxplot.py>`
es_es: :download:`Descargar el código fuente de Python: boxplot.py <boxplot.py>`

source: :download:`Download Jupyter notebook: boxplot.ipynb <boxplot.ipynb>`
es_es: :download:`Descargar notebook de Jupyter: boxplot.ipynb <boxplot.ipynb>`
