Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/statistics/boxplot_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_statistics_boxplot_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_statistics_boxplot_demo.py>` para descargar el código de ejemplo completo

source: Visualizing boxplots with matplotlib.
es_es: Visualización de boxplots con matplotlib.

source: The following examples show off how to visualize boxplots with Matplotlib. There are many options to control their appearance and the statistics that they use to summarize the data.
es_es: Los siguientes ejemplos muestran cómo visualizar boxplots con Matplotlib. Hay muchas opciones para controlar su apariencia y las estadísticas que utilizan para resumir los datos.

source: Below we'll generate data from five different probability distributions, each with different characteristics. We want to play with how an IID bootstrap resample of the data preserves the distributional properties of the original sample, and a boxplot is one visual tool to make this assessment
es_es: A continuación generaremos datos de cinco distribuciones de probabilidad diferentes, cada una con características distintas. Queremos jugar con la forma en que una remuestra bootstrap IID de los datos preserva las propiedades distributivas de la muestra original, y un boxplot es una herramienta visual para hacer esta valoración

source: Here we write a custom function to bootstrap confidence intervals. We can then use the boxplot along with this function to show these intervals.
es_es: Aquí escribimos una función personalizada para hacer un bootstrap de los intervalos de confianza. Luego podemos usar el boxplot junto con esta función para mostrar estos intervalos.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.736 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.736 segundos)

source: :download:`Download Python source code: boxplot_demo.py <boxplot_demo.py>`
es_es: :download:`Descargar el código fuente de Python: boxplot_demo.py <boxplot_demo.py>`

source: :download:`Download Jupyter notebook: boxplot_demo.ipynb <boxplot_demo.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: boxplot_demo.ipynb <boxplot_demo.ipynb>`
