Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/statistics/boxplot_vs_violin.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_statistics_boxplot_vs_violin.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_statistics_boxplot_vs_violin.py>` para descargar el código de ejemplo completo

source: Box plot vs. violin plot comparison
es_es: Comparación del gráfico de cajas con el gráfico de violines

source: Note that although violin plots are closely related to Tukey's (1977) box plots, they add useful information such as the distribution of the sample data (density trace).
es_es: Tenga en cuenta que, aunque los gráficos de violín están estrechamente relacionados con los gráficos de caja de Tukey (1977), añaden información útil como la distribución de los datos de la muestra (trazo de densidad).

source: By default, box plots show data points outside 1.5 * the inter-quartile range as outliers above or below the whiskers whereas violin plots show the whole range of the data.
es_es: Por defecto, los gráficos de caja muestran los puntos de datos fuera de 1,5 * el rango intercuartil como valores atípicos por encima o por debajo de los bigotes, mientras que los gráficos de violín muestran todo el rango de los datos.

source: A good general reference on boxplots and their history can be found here: http://vita.had.co.nz/papers/boxplots.pdf
es_es: Una buena referencia general sobre los boxplots y su historia puede encontrarse aquí: http://vita.had.co.nz/papers/boxplots.pdf

source: Violin plots require matplotlib >= 1.4.
es_es: Los gráficos de Violín requieren matplotlib >= 1.4.

source: For more information on violin plots, the scikit-learn docs have a great section: https://scikit-learn.org/stable/modules/density.html
es_es: Para más información sobre los gráficos de violín, los documentos de scikit-learn tienen una gran sección: https://scikit-learn.org/stable/modules/density.html

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: boxplot_vs_violin.py <boxplot_vs_violin.py>`
es_es: :download:`Descargar el código fuente de Python: boxplot_vs_violin.py <boxplot_vs_violin.py>`

source: :download:`Download Jupyter notebook: boxplot_vs_violin.ipynb <boxplot_vs_violin.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: boxplot_vs_violin.ipynb <boxplot_vs_violin.ipynb>`
