Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/statistics/bxp.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_statistics_bxp.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_statistics_bxp.py>` para descargar el código de ejemplo completo

source: Boxplot drawer function
es_es: Función de cajón Boxplot

source: This example demonstrates how to pass pre-computed box plot statistics to the box plot drawer. The first figure demonstrates how to remove and add individual components (note that the mean is the only value not shown by default). The second figure demonstrates how the styles of the artists can be customized.
es_es: Este ejemplo demuestra cómo pasar las estadísticas precalculadas de los gráficos de caja al cajón de los gráficos de caja. La primera figura demuestra cómo eliminar y añadir componentes individuales (observe que la media es el único valor que no se muestra por defecto). La segunda figura demuestra cómo se pueden personalizar los estilos de los artists.

source: A good general reference on boxplots and their history can be found here: http://vita.had.co.nz/papers/boxplots.pdf
es_es: Una buena referencia general sobre los boxplots y su historia puede encontrarse aquí: http://vita.had.co.nz/papers/boxplots.pdf

source: After we've computed the stats, we can go through and change anything. Just to prove it, I'll set the median of each set to the median of all the data, and double the means
es_es: Una vez que hayamos calculado las estadísticas, podemos revisar y cambiar cualquier cosa. Sólo para probarlo, estableceré la mediana de cada conjunto a la mediana de todos los datos, y duplicaré las medias

source: Out:
es_es: Salida:

source: Demonstrate how to toggle the display of different elements:
es_es: Demostrar cómo alternar la visualización de diferentes elementos:

source: Demonstrate how to customize the display different elements:
es_es: Demostrar cómo personalizar los diferentes elementos de la pantalla:

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 2.029 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2.029 segundos)

source: :download:`Download Python source code: bxp.py <bxp.py>`
es_es: :download:`Descargar el código fuente de Python: bxp.py <bxp.py>`

source: :download:`Download Jupyter notebook: bxp.ipynb <bxp.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: bxp.ipynb <bxp.ipynb>`
