Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/statistics/confidence_ellipse.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_statistics_confidence_ellipse.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_statistics_confidence_ellipse.py>` para descargar el código de ejemplo completo

source: Plot a confidence ellipse of a two-dimensional dataset
es_es: Graficar una elipse de confianza de un conjunto de datos bidimensional

source: This example shows how to plot a confidence ellipse of a two-dimensional dataset, using its pearson correlation coefficient.
es_es: Este ejemplo muestra cómo graficar una elipse de confianza de un conjunto de datos bidimensional, utilizando su coeficiente de correlación de Pearson.

source: The approach that is used to obtain the correct geometry is explained and proved here:
es_es: El enfoque que se utiliza para obtener la geometría correcta se explica y demuestra aquí:

source: The method avoids the use of an iterative eigen decomposition algorithm and makes use of the fact that a normalized covariance matrix (composed of pearson correlation coefficients and ones) is particularly easy to handle.
es_es: El método evita el uso de un algoritmo iterativo de descomposición eigen y aprovecha el hecho de que una matriz de covarianza normalizada (compuesta por coeficientes de correlación de Pearson y unos) es particularmente fácil de manejar.

source: The plotting function itself
es_es: La propia función de gráfico

source: This function plots the confidence ellipse of the covariance of the given array-like variables x and y. The ellipse is plotted into the given axes-object ax.
es_es: Esta función traza la elipse de confianza de la covarianza de las variables array-like dadas x e y. La elipse se grafica en el objeto-eje dado.

source: The radiuses of the ellipse can be controlled by n_std which is the number of standard deviations. The default value is 3 which makes the ellipse enclose 98.9% of the points if the data is normally distributed like in these examples (3 standard deviations in 1-D contain 99.7% of the data, which is 98.9% of the data in 2-D).
es_es: Los radios de la elipse pueden ser controlados por n_std que es el número de desviaciones estándar. El valor por defecto es 3, lo que hace que la elipse encierre el 98,9% de los puntos si los datos se normalmente distribuidos como en estos ejemplos (3 desviaciones estándar en 1-D contienen el 99,7% de los datos, que es el 98,9% de los datos en 2-D).

source: A helper function to create a correlated dataset
es_es: Una función helper para crear un conjunto de datos correlacionados

source: Creates a random two-dimesional dataset with the specified two-dimensional mean (mu) and dimensions (scale). The correlation can be controlled by the param 'dependency', a 2x2 matrix.
es_es: Crea un conjunto de datos bidimensionales aleatorios con la media bidimensional (mu) y las dimensiones (escala) especificadas. La correlación puede ser controlada por el parámetro 'dependencia', una matriz de 2x2.

source: Positive, negative and weak correlation
es_es: Correlación positiva, negativa y débil

source: Note that the shape for the weak correlation (right) is an ellipse, not a circle because x and y are differently scaled. However, the fact that x and y are uncorrelated is shown by the axes of the ellipse being aligned with the x- and y-axis of the coordinate system.
es_es: Nota que la forma de la correlación débil (derecha) es una elipse, no un círculo porque x e y están escalados de forma diferente. Sin embargo, el hecho de que x e y no estén correlacionadas se muestra por los ejes de la elipse que están alineados con los ejes x e y del sistema de coordenadas.

source: Different number of standard deviations
es_es: Diferente número de desviaciones estándar

source: A plot with n_std = 3 (blue), 2 (purple) and 1 (red)
es_es: Un gráfico con n_std = 3 (azul), 2 (púrpura) y 1 (rojo)

source: Using the keyword arguments
es_es: Uso de los argumentos de la palabra clave

source: Use the keyword arguments specified for `matplotlib.patches.Patch` in order to have the ellipse rendered in different ways.
es_es: Utilice los argumentos de la palabra clave especificada para `matplotlib.patches.Patch` para que la elipse se represente de diferentes maneras.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.424 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.424 segundos)

source: :download:`Download Python source code: confidence_ellipse.py <confidence_ellipse.py>`
es_es: :download:`Descargar el código fuente de Python: confidence_ellipse.py <confidence_ellipse.py>`

source: :download:`Download Jupyter notebook: confidence_ellipse.ipynb <confidence_ellipse.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: confidence_ellipse.ipynb <confidence_ellipse.ipynb>`
