Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/statistics/errorbars_and_boxes.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_statistics_errorbars_and_boxes.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_statistics_errorbars_and_boxes.py>` para descargar el código de ejemplo completo

source: Creating boxes from error bars using PatchCollection
es_es: Crear cajas a partir de barras de error utilizando PatchCollection

source: In this example, we snazz up a pretty standard error bar plot by adding a rectangle patch defined by the limits of the bars in both the x- and y- directions. To do this, we have to write our own custom function called ``make_error_boxes``. Close inspection of this function will reveal the preferred pattern in writing functions for matplotlib:
es_es: En este ejemplo, se ha añadido un gráfico de barras de error estándar mediante la adición de un rectángulo definido por los límites de las barras en las direcciones x e y. Para ello, tenemos que escribir nuestra propia función personalizada llamada ``make_error_boxes``. Una inspección detallada de esta función revelará el patrón preferido en la escritura de funciones para matplotlib:

source: an `~.axes.Axes` object is passed directly to the function
es_es: un objeto `~.axes.Axes` es pasado directamente a la función

source: the function operates on the ``Axes`` methods directly, not through the ``pyplot`` interface
es_es: la función opera con los métodos ``Axes`` directamente, no a través de la interfaz ``pyplot``

source: plotting keyword arguments that could be abbreviated are spelled out for better code readability in the future (for example we use *facecolor* instead of *fc*)
es_es: los argumentos de las palabras clave de graficación que podrían abreviarse se deletrean para una mejor legibilidad del código en el futuro (por ejemplo, usamos *facecolor* en lugar de *fc*)

source: the artists returned by the ``Axes`` plotting methods are then returned by the function so that, if desired, their styles can be modified later outside of the function (they are not modified in this example).
es_es: los artists devueltos por los métodos de trazado ``Axes`` son devueltos por la función para que, si se desea, sus estilos puedan ser modificados posteriormente fuera de la función (no se modifican en este ejemplo).

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: errorbars_and_boxes.py <errorbars_and_boxes.py>`
es_es: :download:`Descargar el código fuente de Python: errorbars_and_boxes.py <errorbars_and_boxes.py>`

source: :download:`Download Jupyter notebook: errorbars_and_boxes.ipynb <errorbars_and_boxes.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: errorbars_and_boxes.ipynb <errorbars_and_boxes.ipynb>`
