Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/statistics/errorbar_features.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_statistics_errorbar_features.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_statistics_errorbar_features.py>` para descargar el código de ejemplo completo

source: Different ways of specifying error bars
es_es: Diferentes formas de especificar barras de error

source: Errors can be specified as a constant value (as shown in :doc:`/gallery/statistics/errorbar`). However, this example demonstrates how they vary by specifying arrays of error values.
es_es: Los errores pueden especificarse como un valor constante (como se muestra en :doc:`/gallery/statistics/errorbar`). Sin embargo, este ejemplo demuestra cómo varían al especificar arreglos de valores de error.

source: If the raw ``x`` and ``y`` data have length N, there are two options:
es_es: Si los datos brutos ``x`` e ``y`` tienen una longitud N, hay dos opciones:

source: Array of shape (N,):
es_es: Ndarray de forma (N,):

source: Error varies for each point, but the error values are symmetric (i.e. the lower and upper values are equal).
es_es: El error varía para cada punto, pero los valores del error son simétricos (es decir, los valores inferior y superior son iguales).

source: Array of shape (2, N):
es_es: Arreglo de forma (2, N):

source: Error varies for each point, and the lower and upper limits (in that order) are different (asymmetric case)
es_es: El error varía para cada punto, y los límites inferior y superior (en ese orden) son diferentes (caso asimétrico)

source: In addition, this example demonstrates how to use log scale with error bars.
es_es: Además, este ejemplo demuestra cómo utilizar la escala logarítmica con barras de error.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: errorbar_features.py <errorbar_features.py>`
es_es: :download:`Descargar el código fuente de Python: errorbar_features.py <errorbar_features.py>`

source: :download:`Download Jupyter notebook: errorbar_features.ipynb <errorbar_features.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: errorbar_features.ipynb <errorbar_features.ipynb>`
