Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/statistics/histogram_cumulative.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_statistics_histogram_cumulative.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_statistics_histogram_cumulative.py>` para descargar el código de ejemplo completo

source: Using histograms to plot a cumulative distribution
es_es: Uso de histogramas para graficar una distribución acumulativa

source: This shows how to plot a cumulative, normalized histogram as a step function in order to visualize the empirical cumulative distribution function (CDF) of a sample. We also show the theoretical CDF.
es_es: Se muestra cómo graficar un histograma acumulativo normalizado como una función escalonada para visualizar la función de distribución acumulativa empírica (FCD) de una muestra. También se muestra la FCD teórica.

source: A couple of other options to the ``hist`` function are demonstrated. Namely, we use the *normed* parameter to normalize the histogram and a couple of different options to the *cumulative* parameter. The *normed* parameter takes a boolean value. When ``True``, the bin heights are scaled such that the total area of the histogram is 1. The *cumulative* keyword argument is a little more nuanced. Like *normed*, you can pass it True or False, but you can also pass it -1 to reverse the distribution.
es_es: Se muestran un par de opciones más de la función ``hist``. En concreto, utilizamos el parámetro *normed* para normalizar el histograma y un par de opciones diferentes del parámetro *cumulative*. El parámetro *normed* toma un valor booleano. Cuando es ``Verdadero``, las alturas de las casillas se escalan de forma que el área total del histograma es 1. El argumento de la palabra clave *acumulativa* es un poco más matizado. Al igual que *normed*, puede pasarle True o False, pero también puede pasarle -1 para invertir la distribución.

source: Since we're showing a normalized and cumulative histogram, these curves are effectively the cumulative distribution functions (CDFs) of the samples. In engineering, empirical CDFs are sometimes called "non-exceedance" curves. In other words, you can look at the y-value for a given-x-value to get the probability of and observation from the sample not exceeding that x-value. For example, the value of 225 on the x-axis corresponds to about 0.85 on the y-axis, so there's an 85% chance that an observation in the sample does not exceed 225. Conversely, setting, ``cumulative`` to -1 as is done in the last series for this example, creates a "exceedance" curve.
es_es: Como estamos mostrando un histograma normalizado y acumulativo, estas curvas son efectivamente las funciones de distribución acumulativa (CDF) de las muestras. En ingeniería, las FDC empíricas se denominan a veces curvas de "no superación". En otras palabras, se puede observar el valor y para un valor x dado para obtener la probabilidad de que una observación de la muestra no supere ese valor x. Por ejemplo, el valor de 225 en el eje x corresponde a aproximadamente 0,85 en el eje y, por lo que hay un 85% de probabilidades de que una observación de la muestra no supere los 225. Por el contrario, si se establece, ``acumulativo`` a -1 como se hace en la última serie de este ejemplo, se crea una curva de "superación".

source: Selecting different bin counts and sizes can significantly affect the shape of a histogram. The Astropy docs have a great section on how to select these parameters: http://docs.astropy.org/en/stable/visualization/histogram.html
es_es: La selección de diferentes recuentos y tamaños de intervalos puede afectar significativamente a la forma de un histograma. Los documentos de Astropy tienen una gran sección sobre cómo seleccionar estos parámetros: http://docs.astropy.org/en/stable/visualization/histogram.html

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: histogram_cumulative.py <histogram_cumulative.py>`
es_es: :download:`Descargar el código fuente de Python: histogram_cumulative.py <histogram_cumulative.py>`

source: :download:`Download Jupyter notebook: histogram_cumulative.ipynb <histogram_cumulative.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: histogram_cumulative.ipynb <histogram_cumulative.ipynb>`
