Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/statistics/histogram_features.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_statistics_histogram_features.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_statistics_histogram_features.py>` para descargar el código de ejemplo completo

source: Some features of the histogram (hist) function
es_es: Algunas características de la función histograma (hist)

source: In addition to the basic histogram, this demo shows a few optional features:
es_es: Además del histograma básico, esta demostración muestra algunas características opcionales:

source: Setting the number of data bins.
es_es: Establecer el número de intervalos de datos.

source: The *density* parameter, which normalizes bin heights so that the integral of the histogram is 1. The resulting histogram is an approximation of the probability density function.
es_es: El parámetro *densidad*, que normaliza las alturas de las casillas para que la integral del histograma sea 1. El histograma resultante es una aproximación de la función de densidad de probabilidad.

source: Selecting different bin counts and sizes can significantly affect the shape of a histogram. The Astropy docs have a great section_ on how to select these parameters.
es_es: La selección de diferentes intervalos y tamaños de contenedores puede afectar significativamente a la forma de un histograma. Los documentos de Astropy tienen una gran sección_ sobre cómo seleccionar estos parámetros.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: histogram_features.py <histogram_features.py>`
es_es: :download:`Descargar el código fuente de Python: histogram_features.py <histogram_features.py>`

source: :download:`Download Jupyter notebook: histogram_features.ipynb <histogram_features.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: histogram_features.ipynb <histogram_features.ipynb>`
