Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/statistics/histogram_histtypes.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_statistics_histogram_histtypes.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_statistics_histogram_histtypes.py>` para descargar el código de ejemplo completo

source: Demo of the histogram function's different ``histtype`` settings
es_es: Demo de los diferentes ajustes de la función de histograma ``histtype``

source: Histogram with step curve that has a color fill.
es_es: Histograma con curva escalonada que tiene un relleno de color.

source: Histogram with step curve with no fill.
es_es: Histograma con curva escalonada sin relleno.

source: Histogram with custom and unequal bin widths.
es_es: Histograma con intervalo personalizados y desiguales.

source: Two histograms with stacked bars.
es_es: Dos histogramas con barras apiladas.

source: Selecting different bin counts and sizes can significantly affect the shape of a histogram. The Astropy docs have a great section on how to select these parameters: http://docs.astropy.org/en/stable/visualization/histogram.html
es_es: La selección de diferentes tamaños y recuentos de intervalos puede afectar significativamente a la forma de un histograma. Los documentos de Astropy tienen una gran sección sobre cómo seleccionar estos parámetros: http://docs.astropy.org/en/stable/visualization/histogram.html

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: histogram_histtypes.py <histogram_histtypes.py>`
es_es: :download:`Descargar el código fuente de Python: histogram_histtypes.py <histogram_histtypes.py>`

source: :download:`Download Jupyter notebook: histogram_histtypes.ipynb <histogram_histtypes.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: histogram_histtypes.ipynb <histogram_histtypes.ipynb>`
