Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/statistics/hist.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_statistics_hist.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_statistics_hist.py>` para descargar el código de ejemplo completo

source: Histograms
es_es: Histogramas

source: How to plot histograms with Matplotlib.
es_es: Cómo graficar histogramas con Matplotlib.

source: Generate data and plot a simple histogram
es_es: Generar datos y graficar un histograma simple

source: To generate a 1D histogram we only need a single vector of numbers. For a 2D histogram we'll need a second vector. We'll generate both below, and show the histogram for each vector.
es_es: Para generar un histograma 1D sólo necesitamos un único vector de números. Para un histograma 2D necesitaremos un segundo vector. Generaremos ambos a continuación, y mostraremos el histograma para cada vector.

source: Out:
es_es: Salida:

source: Updating histogram colors
es_es: Actualización de los colores del histograma

source: The histogram method returns (among other things) a ``patches`` object. This gives us access to the properties of the objects drawn. Using this, we can edit the histogram to our liking. Let's change the color of each bar based on its y value.
es_es: El método del histograma devuelve (entre otras cosas) un objeto ``patches``. Esto nos da acceso a las propiedades de los objetos dibujados. Usando esto, podemos editar el histograma a nuestro gusto. Vamos a cambiar el color de cada barra en función de su valor y.

source: Plot a 2D histogram
es_es: Graficar un histograma 2D

source: To plot a 2D histogram, one only needs two vectors of the same length, corresponding to each axis of the histogram.
es_es: Para graficar un histograma 2D, sólo se necesitan dos vectores de la misma longitud, correspondientes a cada eje del histograma.

source: Customizing your histogram
es_es: Personalizar tu histograma

source: Customizing a 2D histogram is similar to the 1D case, you can control visual components such as the bin size or color normalization.
es_es: La personalización de un histograma 2D es similar al caso 1D, puede controlar los componentes visuales como el tamaño del intervalo o la normalización del color.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.660 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.660 segundos)

source: :download:`Download Python source code: hist.py <hist.py>`
es_es: :download:`Descargar el código fuente de Python: hist.py <hist.py>`

source: :download:`Download Jupyter notebook: hist.ipynb <hist.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: hist.ipynb <hist.ipynb>`
