Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/statistics/histogram_multihist.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_statistics_histogram_multihist.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_statistics_histogram_multihist.py>` para descargar el código de ejemplo completo

source: The histogram (hist) function with multiple data sets
es_es: La función histograma (hist) con múltiples conjuntos de datos

source: Plot histogram with multiple sample sets and demonstrate:
es_es: Graficar el histograma con múltiples conjuntos de muestras y demostrarlo:

source: Use of legend with multiple sample sets
es_es: Uso de la leyenda con conjuntos de muestras múltiples

source: Stacked bars
es_es: Barras apiladas

source: Step curve with no fill
es_es: Curva escalonada sin relleno

source: Data sets of different sample sizes
es_es: Conjuntos de datos de diferentes tamaños de muestra

source: Selecting different bin counts and sizes can significantly affect the shape of a histogram. The Astropy docs have a great section on how to select these parameters: http://docs.astropy.org/en/stable/visualization/histogram.html
es_es: La selección de diferentes recuentos y tamaños de intervalos puede afectar significativamente a la forma de un histograma. Los documentos de Astropy tienen una gran sección sobre cómo seleccionar estos parámetros: http://docs.astropy.org/en/stable/visualization/histogram.html

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: histogram_multihist.py <histogram_multihist.py>`
es_es: :download:`Descargar el código fuente de Python: histogram_multihist.py <histogram_multihist.py>`

source: :download:`Download Jupyter notebook: histogram_multihist.ipynb <histogram_multihist.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: histogram_multihist.ipynb <histogram_multihist.ipynb>`
