Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/statistics/time_series_histogram.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_statistics_time_series_histogram.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_statistics_time_series_histogram.py>` para descargar el código de ejemplo completo

source: Time Series Histogram
es_es: Histograma de la serie de tiempo

source: This example demonstrates how to efficiently visualize large numbers of time series in a way that could potentially reveal hidden substructure and patterns that are not immediately obvious, and display them in a visually appealing way.
es_es: Este ejemplo demuestra cómo visualizar eficazmente un gran número de series temporales de forma que puedan revelarse subestructuras y patrones ocultos que no son inmediatamente obvios, y mostrarlos de forma visualmente atractiva.

source: In this example, we generate multiple sinusoidal "signal" series that are buried under a larger number of random walk "noise/background" series. For an unbiased Gaussian random walk with standard deviation of σ, the RMS deviation from the origin after n steps is σ*sqrt(n). So in order to keep the sinusoids visible on the same scale as the random walks, we scale the amplitude by the random walk RMS. In addition, we also introduce a small random offset ``phi`` to shift the sines left/right, and some additive random noise to shift individual data points up/down to make the signal a bit more "realistic" (you wouldn't expect a perfect sine wave to appear in your data).
es_es: En este ejemplo, generamos múltiples series de "señales" sinusoidales que quedan enterradas bajo un mayor número de series de "ruido/fondo" de paseo aleatorio. Para un paseo aleatorio gaussiano insesgado con una desviación estándar de σ, la desviación RMS del origen después de n pasos es σ*sqrt(n). Por lo tanto, para mantener la visibilidad de los sinusoides en la misma escala que los paseos aleatorios, escalamos la amplitud por la RMS del paseo aleatorio. Además, también introducimos un pequeño desplazamiento aleatorio ``phi`` para desplazar los sinusoides a la izquierda/derecha, y algo de ruido aleatorio aditivo para desplazar puntos de datos individuales hacia arriba/abajo para hacer la señal un poco más "realista" (no esperarías que apareciera una onda sinusoidal perfecta en tus datos).

source: The first plot shows the typical way of visualizing multiple time series by overlaying them on top of each other with ``plt.plot`` and a small value of ``alpha``. The second and third plots show how to reinterpret the data as a 2d histogram, with optional interpolation between data points, by using ``np.histogram2d`` and ``plt.pcolormesh``.
es_es: El primer gráfico muestra la forma típica de visualizar múltiples series temporales superponiéndolas con ``plt.plot`` y un valor pequeño de ``alpha``. El segundo y tercer gráfico muestran cómo reinterpretar los datos como un histograma 2d, con interpolación opcional entre los puntos de datos, utilizando ``np.histogram2d`` y ``plt.pcolormesh``.

source: Out:
es_es: Salida:

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 2.983 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 2.983 segundos)

source: :download:`Download Python source code: time_series_histogram.py <time_series_histogram.py>`
es_es: :download:`Descarga el código fuente de Python: time_series_histogram.py <time_series_histogram.py>`

source: :download:`Download Jupyter notebook: time_series_histogram.ipynb <time_series_histogram.ipynb>`
es_es: :download:`Descargar notebook de Jupyter: time_series_histogram.ipynb <time_series_histogram.ipynb>`
