Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/shapes_and_collections/arrow_guide.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_shapes_and_collections_arrow_guide.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_shapes_and_collections_arrow_guide.py>` para descargar el código de ejemplo completo

source: Arrow guide
es_es: Guía de la flecha

source: Adding arrow patches to plots.
es_es: Añadir parches de flechas a los gráficos.

source: Arrows are often used to annotate plots. This tutorial shows how to plot arrows that behave differently when the data limits on a plot are changed. In general, points on a plot can either be fixed in "data space" or "display space". Something plotted in data space moves when the data limits are altered - an example would be the points in a scatter plot. Something plotted in display space stays static when data limits are altered - an example would be a figure title or the axis labels.
es_es: Las flechas se utilizan a menudo para anotar gráficos. Este tutorial muestra cómo graficar flechas que se comportan de forma diferente cuando se cambian los límites de los datos en un gráfico. En general, los puntos de un gráfico pueden estar arreglados en el "espacio de datos" o en el "espacio de visualización". Algo graficado en el espacio de datos se mueve cuando los límites de los datos son alterados - un ejemplo sería los puntos en un gráfico de dispersión. Algo graficado en el espacio de visualización permanece estático cuando se alteran los límites de los datos - un ejemplo sería el título de una figura o las etiquetas de los ejes.

source: Arrows consist of a head (and possibly a tail) and a stem drawn between a start point and end point, called 'anchor points' from now on. Here we show three use cases for plotting arrows, depending on whether the head or anchor points need to be fixed in data or display space:
es_es: Las flechas están formadas por una cabeza (y posiblemente una cola) y un tallo dibujado entre un punto inicial y un punto final, llamados 'puntos de anclaje' a partir de ahora. Aquí mostramos tres casos de uso para el graficado de flechas, dependiendo de si la cabeza o los puntos de anclaje necesitan ser fijados en el espacio de datos o de visualización:

source: Head shape fixed in display space, anchor points fixed in data space
es_es: La forma de la cabeza se arregla en el espacio de visualización, los puntos de anclaje se arreglan en el espacio de datos

source: Head shape and anchor points fixed in display space
es_es: Forma de la cabeza y puntos de anclaje fijados en el espacio de visualización

source: Entire patch fixed in data space
es_es: Parche entero arreglado en el espacio de datos

source: Below each use case is presented in turn.
es_es: A continuación se presenta cada caso de uso.

source: Head shape fixed in display space and anchor points fixed in data space
es_es: La forma de la cabeza se arregla en el espacio de visualización y los puntos de anclaje se arreglan en el espacio de datos

source: This is useful if you are annotating a plot, and don't want the arrow to to change shape or position if you pan or scale the plot.
es_es: Esto es útil si estás anotando un gráfico, y no quieres que la flecha cambie de forma o posición si te desplazas o escalas el gráfico.

source: In this case we use `.patches.FancyArrowPatch`.
es_es: En este caso utilizamos `.patches.FancyArrowPatch`.

source: Note that when the axis limits are changed, the arrow shape stays the same, but the anchor points move.
es_es: Observa que cuando se cambian los límites del eje, la forma de la flecha permanece igual, pero los puntos de anclaje se mueven.

source: Out:
es_es: Salida:

source: This is useful if you are annotating a plot, and don't want the arrow to change shape or position if you pan or scale the plot.
es_es: Esto es útil si estás anotando un gráfico, y no quieres que la flecha cambie de forma o posición si te desplazas o escalas el gráfico.

source: In this case we use `.patches.FancyArrowPatch`, and pass the keyword argument ``transform=ax.transAxes`` where ``ax`` is the axes we are adding the patch to.
es_es: En este caso utilizamos `.patches.FancyArrowPatch`, y pasamos el argumento de la palabra clave ``transform=ax.transAxes`` donde ``ax`` es el eje al que estamos añadiendo el parche.

source: Note that when the axis limits are changed, the arrow shape and location stay the same.
es_es: Ten en cuenta que cuando se cambian los límites del eje, la forma y la ubicación de la flecha permanecen igual.

source: Head shape and anchor points fixed in data space
es_es: Forma de la cabeza y puntos de anclaje arreglados en el espacio de datos

source: In this case we use `.patches.Arrow`, or `.patches.FancyArrow` (the latter is in orange).
es_es: En este caso usamos `.patches.Arrow`, o `.patches.FancyArrow` (el último está en naranja).

source: Note that when the axis limits are changed, the arrow shape and location change.
es_es: Ten en cuenta que cuando se cambian los límites del eje, la forma y la ubicación de la flecha cambian.

source: `.FancyArrow`'s API is relatively awkward, and requires in particular passing ``length_includes_head=True`` so that the arrow *tip* is ``(dx, dy)`` away from the arrow start. It is only included in this reference because it is the arrow class returned by `.Axes.arrow` (in green).
es_es: La API de `.FancyArrow` es relativamente complicada, y requiere en particular pasar ``length_includes_head=True`` para que la *punta* de la flecha esté ``(dx, dy)`` lejos del inicio de la flecha. Sólo se incluye en esta referencia porque es la clase de flecha devuelta por `.Axes.arrow` (en verde).

source: **Total running time of the script:** ( 0 minutes 1.273 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.273 segundos)

source: :download:`Download Python source code: arrow_guide.py <arrow_guide.py>`
es_es: :download:`Descargar el código fuente de Python: arrow_guide.py <arrow_guide.py>`

source: :download:`Download Jupyter notebook: arrow_guide.ipynb <arrow_guide.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: flecha_guía.ipynb <arrow_guide.ipynb>`
