Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/shapes_and_collections/hatch_style_reference.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_shapes_and_collections_hatch_style_reference.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_shapes_and_collections_hatch_style_reference.py>` para descargar el código de ejemplo completo

source: Hatch style reference
es_es: Referencia del estilo de sombreado

source: Hatches can be added to most polygons in Matplotlib, including `~.Axes.bar`, `~.Axes.fill_between`, `~.Axes.contourf`, and children of `~.patches.Polygon`. They are currently supported in the PS, PDF, SVG, OSX, and Agg backends. The WX and Cairo backends do not currently support hatching.
es_es: Las sombras se pueden añadir a la mayoría de los polígonos en Matplotlib, incluyendo `~.Axes.bar`, `~.Axes.fill_between`, `~.Axes.contourf`, y los hijos de `~.patches.Polygon`. Actualmente son compatibles con los backends PS, PDF, SVG, OSX y Agg. Los backends WX y Cairo no soportan actualmente el sombreado.

source: See also :doc:`/gallery/images_contours_and_fields/contourf_hatching` for an example using `~.Axes.contourf`, and :doc:`/gallery/shapes_and_collections/hatch_demo` for more usage examples.
es_es: Ver también :doc:`/gallery/images_contours_and_fields/contourf_hatching` para un ejemplo usando `~.Axes.contourf`, y :doc:`/gallery/shapes_and_collections/hatch_demo` para más ejemplos de uso.

source: Hatching patterns can be repeated to increase the density.
es_es: Los patrones de sombreado pueden repetirse para aumentar la densidad.

source: Hatching patterns can be combined to create additional patterns.
es_es: Los patrones de sombreado pueden combinarse para crear patrones adicionales.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.455 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.455 segundos)

source: :download:`Download Python source code: hatch_style_reference.py <hatch_style_reference.py>`
es_es: :download:`Descargar el código fuente de Python: hatch_style_reference.py <hatch_style_reference.py>`

source: :download:`Download Jupyter notebook: hatch_style_reference.ipynb <hatch_style_reference.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: hatch_style_reference.ipynb <hatch_style_reference.ipynb>`
