Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/toolkits/mplot3d/faq.po
Languages: es_es

source: How is mplot3d different from Mayavi?
es_es: ¿En qué se diferencia mplot3d de Mayavi?

source: `Mayavi <https://docs.enthought.com/mayavi/mayavi/>`_ is a very powerful and featureful 3D graphing library. For advanced 3D scenes and excellent rendering capabilities, it is highly recommended to use Mayavi.
es_es: `Mayavi <https://docs.enthought.com/mayavi/mayavi/>`_ es una librería de gráficos 3D muy potente y con muchas funciones. Para escenas 3D avanzadas y excelentes capacidades de renderizado, es muy recomendable utilizar Mayavi.

source: mplot3d was intended to allow users to create simple 3D graphs with the same "look-and-feel" as matplotlib's 2D plots. Furthermore, users can use the same toolkit that they are already familiar with to generate both their 2D and 3D plots.
es_es: mplot3d fue concebido para permitir a los usuarios crear grafos 3D simples con el mismo "look-and-feel" que los gráficos 2D de matplotlib. Además, los usuarios pueden utilizar el mismo conjunto de herramientas con el que ya están familiarizados para generar sus gráficos 2D y 3D.

source: My 3D plot doesn't look right at certain viewing angles
es_es: Mi gráfico 3D no parece correcto en ciertos ángulos de visualización

source: This is probably the most commonly reported issue with mplot3d. The problem is that -- from some viewing angles -- a 3D object would appear in front of another object, even though it is physically behind it. This can result in plots that do not look "physically correct."
es_es: Este es probablemente el problema más comúnmente reportado con mplot3d. El problema es que -desde algunos ángulos de visión- un objeto 3D aparece delante de otro objeto, aunque esté físicamente detrás de él. Esto puede resultar en gráficos que no se ven "físicamente correctos."

source: Unfortunately, while some work is being done to reduce the occurrence of this artifact, it is currently an intractable problem, and can not be fully solved until matplotlib supports 3D graphics rendering at its core.
es_es: Desafortunadamente, aunque se está trabajando para reducir la ocurrencia de este artefacto, actualmente es un problema intratable, y no podrá ser resuelto completamente hasta que matplotlib soporte el renderizado de gráficos 3D en su núcleo.

source: The problem occurs due to the reduction of 3D data down to 2D + z-order scalar. A single value represents the 3rd dimension for all parts of 3D objects in a collection. Therefore, when the bounding boxes of two collections intersect, it becomes possible for this artifact to occur. Furthermore, the intersection of two 3D objects (such as polygons or patches) can not be rendered properly in matplotlib's 2D rendering engine.
es_es: El problema se debe a la reducción de los datos 3D a 2D + escalar de orden z. Un único valor representa la tercera dimensión para todas las partes de los objetos 3D de una colección. Por lo tanto, cuando las cajas delimitadoras de dos colecciones se cruzan, es posible que se produzca este artefacto. Además, la intersección de dos objetos 3D (como polígonos o parches) no se puede renderizar correctamente en el motor de renderizado 2D de matplotlib.

source: This problem will likely not be solved until OpenGL support is added to all of the backends (patches are greatly welcomed). Until then, if you need complex 3D scenes, we recommend using `MayaVi <https://docs.enthought.com/mayavi/mayavi/>`_.
es_es: Este problema probablemente no se resolverá hasta que se añada el soporte de OpenGL a todos los backends (los parches son muy bienvenidos). Hasta entonces, si necesita escenas 3D complejas, le recomendamos que utilice `MayaVi <https://docs.enthought.com/mayavi/mayavi/>`_.

source: I don't like how the 3D plot is laid out, how do I change that?
es_es: No me gusta cómo está dispuesto el gráfico 3D, ¿cómo puedo cambiarlo?

source: Historically, mplot3d has suffered from a hard-coding of parameters used to control visuals such as label spacing, tick length, and grid line width. Work is being done to eliminate this issue. For matplotlib v1.1.0, there is a semi-official manner to modify these parameters. See the note in the :mod:`.mplot3d.axis3d` section of the mplot3d API documentation for more information.
es_es: Históricamente, mplot3d ha sufrido de una codificación dura de los parámetros utilizados para controlar los visuales, como el espaciado de las etiquetas, la longitud de tick y el ancho de las líneas de la malla. Se está trabajando para eliminar esta incidencias. Para matplotlib v1.1.0, hay una manera semioficial de modificar estos parámetros. Ver la nota en la sección :mod:`.mplot3d.axis3d` de la documentación de la API de mplot3d para más información.
