Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/specialty_plots/sankey_basics.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_specialty_plots_sankey_basics.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_specialty_plots_sankey_basics.py>` para descargar el código de ejemplo completo

source: The Sankey class
es_es: La clase Sankey

source: Demonstrate the Sankey class by producing three basic diagrams.
es_es: Demuestra la clase Sankey produciendo tres diagramas básicos.

source: Example 1 -- Mostly defaults
es_es: Ejemplo 1 -- La mayoría de las veces por defecto

source: This demonstrates how to create a simple diagram by implicitly calling the Sankey.add() method and by appending finish() to the call to the class.
es_es: Esto demuestra cómo crear un diagrama simple llamando implícitamente al método Sankey.add() y añadiendo finish() a la invocación de la clase.

source: Out:
es_es: Salida:

source: Notice:
es_es: Nota:

source: Axes weren't provided when Sankey() was instantiated, so they were created automatically.
es_es: Los ejes no se proporcionaron al instanciar Sankey(), por lo que se crearon automáticamente.

source: The scale argument wasn't necessary since the data was already normalized.
es_es: El argumento de la escala no era necesario porque los datos ya estaban normalizados.

source: By default, the lengths of the paths are justified.
es_es: Por defecto, las longitudes de las rutas están justificadas.

source: Example 2
es_es: Ejemplo 2

source: This demonstrates:
es_es: Esto lo demuestra:

source: Setting one path longer than the others
es_es: Establecer una ruta más larga que las otras

source: Placing a label in the middle of the diagram
es_es: Colocar una etiqueta en el centro del diagrama

source: Using the scale argument to normalize the flows
es_es: Utilizar el argumento de la escala para normalizar los flujos

source: Implicitly passing keyword arguments to PathPatch()
es_es: Pasar implícitamente argumentos de palabras clave a PathPatch()

source: Changing the angle of the arrow heads
es_es: Cambiar el ángulo de las puntas de flecha

source: Changing the offset between the tips of the paths and their labels
es_es: Cambiar el desplazamiento entre las puntas de los recorridos y sus etiquetas

source: Formatting the numbers in the path labels and the associated unit
es_es: Formato de los números en las etiquetas de ruta y la unidad asociada

source: Changing the appearance of the patch and the labels after the figure is created
es_es: Cambiar la apariencia del parche y las etiquetas después de crear la figura

source: Since the sum of the flows is nonzero, the width of the trunk isn't uniform. The matplotlib logging system logs this at the DEBUG level.
es_es: Como la suma de los flujos es distinta de cero, el ancho del tronco no es uniforme. El sistema de registro de matplotlib registra esto en el nivel DEBUG.

source: The second flow doesn't appear because its value is zero. Again, this is logged at the DEBUG level.
es_es: El segundo flujo no aparece porque su valor es cero. De nuevo, esto se registra en el nivel DEBUG.

source: Example 3
es_es: Ejemplo 3

source: Connecting two systems
es_es: Conectar dos sistemas

source: Turning off the labels of the quantities
es_es: Desactivar las etiquetas de las cantidades

source: Adding a legend
es_es: Agregar una leyenda

source: Notice that only one connection is specified, but the systems form a circuit since: (1) the lengths of the paths are justified and (2) the orientation and ordering of the flows is mirrored.
es_es: Observa que sólo se especifica una conexión, pero los sistemas forman un circuito ya que: (1) las longitudes de los recorridos están justificadas y (2) la orientación y el orden de los flujos se reflejan.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: sankey_basics.py <sankey_basics.py>`
es_es: :download:`Descarga el código fuente de Python: sankey_basics.py <sankey_basics.py>`

source: :download:`Download Jupyter notebook: sankey_basics.ipynb <sankey_basics.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: sankey_basics.ipynb <sankey_basics.ipynb>`
