Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/colors/colormap-manipulation.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_colors_colormap-manipulation.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_tutorials_colors_colormap-manipulation.py>` para descargar el código de ejemplo completo

source: Creating Colormaps in Matplotlib
es_es: Creación de mapas de colores en Matplotlib

source: Matplotlib has a number of built-in colormaps accessible via `.matplotlib.cm.get_cmap`. There are also external libraries like palettable_ that have many extra colormaps.
es_es: Matplotlib tiene un número de mapas de colores incorporados accesibles a través de `.matplotlib.cm.get_cmap`. También hay bibliotecas externas como palettable_ que tienen muchos mapas de colores adicionales.

source: However, we often want to create or manipulate colormaps in Matplotlib. This can be done using the class `.ListedColormap` or `.LinearSegmentedColormap`. Seen from the outside, both colormap classes map values between 0 and 1 to a bunch of colors. There are, however, slight differences, some of which are shown in the following.
es_es: Sin embargo, a menudo queremos crear o manipular mapas de colores en Matplotlib. Esto se puede hacer utilizando la clase `.ListedColormap` o `.LinearSegmentedColormap`. Visto desde fuera, ambas clases de mapas de colores asignan valores entre 0 y 1 a un montón de colores. Sin embargo, existen ligeras diferencias, algunas de las cuales se muestran a continuación.

source: Before manually creating or manipulating colormaps, let us first see how we can obtain colormaps and their colors from existing colormap classes.
es_es: Antes de crear o manipular manualmente los mapas de colores, veamos primero cómo podemos obtener los mapas de colores y sus colores a partir de las clases de mapas de colores existentes.

source: Getting colormaps and accessing their values
es_es: Obtener mapas de colores y acceder a sus valores

source: First, getting a named colormap, most of which are listed in :doc:`/tutorials/colors/colormaps`, may be done using `.matplotlib.cm.get_cmap`, which returns a colormap object. The second argument gives the size of the list of colors used to define the colormap, and below we use a modest value of 8 so there are not a lot of values to look at.
es_es: En primer lugar, la obtención de un mapa de colores con nombre, la mayoría de los cuales están listados en :doc:`/tutorials/colors/colormaps`, puede hacerse utilizando `.matplotlib.cm.get_cmap`, que devuelve un objeto colormap. El segundo argumento da el tamaño de la lista de colores utilizada para definir el mapa de colores, y a continuación utilizamos un valor modesto de 8 para que no haya muchos valores que mirar.

source: The object ``viridis`` is a callable, that when passed a float between 0 and 1 returns an RGBA value from the colormap:
es_es: El objeto ``viridis`` es un invocable, que cuando se le pasa un punto flotante entre 0 y 1 devuelve un valor RGBA del mapa de colores:

source: `.ListedColormap`\s store their color values in a ``.colors`` attribute. The list of colors that comprise the colormap can be directly accessed using the ``colors`` property, or it can be accessed indirectly by calling ``viridis`` with an array of values matching the length of the colormap. Note that the returned list is in the form of an RGBA Nx4 array, where N is the length of the colormap.
es_es: `.ListedColormap` almacenan sus valores de color en un atributo ``.colors``. Se puede acceder directamente a la lista de colores que componen el mapa de colores utilizando la propiedad ``colors``, o se puede acceder indirectamente invocando ``viridis`` con un arreglo de valores que coincida con la longitud del mapa de colores. Toma en cuenta que la lista devuelta está en la forma de un arreglo RGBA Nx4, donde N es la longitud del mapa de colores.

source: The colormap is a lookup table, so "oversampling" the colormap returns nearest-neighbor interpolation (note the repeated colors in the list below)
es_es: El mapa de colores es una tabla de búsqueda, por lo que el "sobremuestreo" del mapa de colores devuelve la interpolación del vecino más cercano (observe los colores repetidos en la lista de abajo)

source: `.LinearSegmentedColormap`\s do not have a ``.colors`` attribute. However, one may still call the colormap with an integer array, or with a float array between 0 and 1.
es_es: `.LinearSegmentedColormap` no tienen un atributo ``.colors``. Sin embargo, se puede llamar al mapa de colores con un arreglo de enteros, o con un arreglo de puntos flotantes entre 0 y 1.

source: Creating listed colormaps
es_es: Creación de mapas de colores listados

source: Creating a colormap is essentially the inverse operation of the above where we supply a list or array of color specifications to `.ListedColormap` to make a new colormap.
es_es: La creación de un mapa de colores es esencialmente la operación inversa a la anterior, en la que suministramos una lista o arreglo de especificaciones de color a `.ListedColormap` para hacer un nuevo mapa de colores.

source: Before continuing with the tutorial, let us define a helper function that takes one of more colormaps as input, creates some random data and applies the colormap(s) to an image plot of that dataset.
es_es: Antes de continuar con el tutorial, definamos una función de ayuda que tome uno o más mapas de colores como entrada, cree algunos datos aleatorios y aplique el/los mapa(s) de colores a un gráfico de imagen de ese conjunto de datos.

source: In the simplest case we might type in a list of color names to create a colormap from those.
es_es: En el caso más sencillo, podríamos introducir una lista de nombres de colores para crear un mapa de colores a partir de ellos.

source: In fact, that list may contain any valid :doc:`Matplotlib color specification </tutorials/colors/colors>`. Particularly useful for creating custom colormaps are Nx4 numpy arrays. Because with the variety of numpy operations that we can do on a such an array, carpentry of new colormaps from existing colormaps become quite straight forward.
es_es: De hecho, esa lista puede contener cualquier especificación de color válida de :doc:`Matplotlib </tutorials/colors/colors>`. Especialmente útiles para crear mapas de color personalizados son los arreglos numpy Nx4. Porque con la variedad de operaciones de numpy que podemos hacer en un arreglo de este tipo, la carpintería de nuevos colormaps a partir de colormaps existentes se vuelve bastante sencilla.

source: For example, suppose we want to make the first 25 entries of a 256-length "viridis" colormap pink for some reason:
es_es: Por ejemplo, supongamos que queremos que las 25 primeras entradas de un mapa de colores "viridis" de 256 caracteres sean de color rosa por alguna razón:

source: We can reduce the dynamic range of a colormap; here we choose the middle half of the colormap. Note, however, that because viridis is a listed colormap, we will end up with 128 discrete values instead of the 256 values that were in the original colormap. This method does not interpolate in color-space to add new colors.
es_es: Podemos reducir el rango dinámico de un mapa de colores; aquí elegimos la mitad del mapa de colores. Sin embargo, ten en cuenta que como viridis es un mapa de color listado, acabaremos con 128 valores discretos en lugar de los 256 valores que había en el mapa de color original. Este método no interpola en el espacio de color para añadir nuevos colores.

source: and we can easily concatenate two colormaps:
es_es: y podemos concatenar fácilmente dos mapas de color:

source: Of course we need not start from a named colormap, we just need to create the Nx4 array to pass to `.ListedColormap`. Here we create a colormap that goes from brown (RGB: 90, 40, 40) to white (RGB: 255, 255, 255).
es_es: Por supuesto que no necesitamos comenzar desde un mapa de colores con nombre, sólo necesitamos crear un arreglo Nx4 para pasar a `. istedColormap`. Aquí creamos un mapa de colores que va desde el marrón (RGB: 90, 40, 40) hasta blanco (RGB: 255, 255, 255).

source: Creating linear segmented colormaps
es_es: Creación de mapas de colores segmentados lineales

source: The `.LinearSegmentedColormap` class specifies colormaps using anchor points between which RGB(A) values are interpolated.
es_es: La clase `.LinearSegmentedColormap` especifica mapas de color utilizando puntos de anclaje entre los que se interpolan los valores RGB(A).

source: The format to specify these colormaps allows discontinuities at the anchor points. Each anchor point is specified as a row in a matrix of the form ``[x[i] yleft[i] yright[i]]``, where ``x[i]`` is the anchor, and ``yleft[i]`` and ``yright[i]`` are the values of the color on either side of the anchor point.
es_es: El formato para especificar estos mapas de colores permite discontinuidades en los puntos de anclaje. Cada punto de anclaje se especifica como una fila en una matriz de la forma ``[x[i] yleft[i] yright[i]]``, donde ``x[i]`` es el ancla, y ``yleft[i]`` y ``yright[i]`` son los valores del color a cada lado del punto de anclaje.

source: If there are no discontinuities, then ``yleft[i] == yright[i]``:
es_es: Si no hay discontinuidades, entonces ``yleft[i] == yright[i]``:

source: In order to make a discontinuity at an anchor point, the third column is different than the second. The matrix for each of "red", "green", "blue", and optionally "alpha" is set up as::
es_es: Para hacer una discontinuidad en un punto de anclaje, la tercera columna es diferente a la segunda. La matriz para cada uno de los colores "rojo", "verde", "azul" y, opcionalmente, "alfa" se configura como::

source: and for values passed to the colormap between ``x[i]`` and ``x[i+1]``, the interpolation is between ``yright[i]`` and ``yleft[i+1]``.
es_es: y para los valores pasados al mapa de colores entre ``x[i]`` y ``x[i+1]``, la interpolación es entre ``yright[i]`` y ``yleft[i+1]``.

source: In the example below there is a discontinuity in red at 0.5. The interpolation between 0 and 0.5 goes from 0.3 to 1, and between 0.5 and 1 it goes from 0.9 to 1. Note that ``red[0, 1]``, and ``red[2, 2]`` are both superfluous to the interpolation because ``red[0, 1]`` (i.e., ``yleft[0]``) is the value to the left of 0, and ``red[2, 2]`` (i.e., ``yright[2]``) is the value to the right of 1, which are outside the color mapping domain.
es_es: En el ejemplo siguiente hay una discontinuidad en rojo en 0,5. La interpolación entre 0 y 0,5 va de 0,3 a 1, y entre 0,5 y 1 va de 0,9 a 1. Observe que ``rojo[0, 1]``, y ``rojo[2, 2]`` son superfluos para la interpolación porque ``rojo[0, 1]`` (es decir, ``left[0]``) es el valor a la izquierda de 0, y ``rojo[2, 2]`` (es decir, ``yright[2]``) es el valor a la derecha de 1, que están fuera del dominio de mapeo de color.

source: Directly creating a segmented colormap from a list
es_es: Crear directamente un mapa de colores segmentado desde una lista

source: The approach described above is very versatile, but admittedly a bit cumbersome to implement. For some basic cases, the use of `.LinearSegmentedColormap.from_list` may be easier. This creates a segmented colormap with equal spacings from a supplied list of colors.
es_es: El enfoque descrito anteriormente es muy versátil, pero hay que reconocer que es un poco engorroso de implementar. Para algunos casos básicos, el uso de `.LinearSegmentedColormap.from_list` puede ser más fácil. Esto crea un mapa de colores segmentado con espacios iguales a partir de una lista de colores suministrada.

source: If desired, the nodes of the colormap can be given as numbers between 0 and 1. For example, one could have the reddish part take more space in the colormap.
es_es: Si se desea, los nodos del mapa de colores se pueden dar como números entre 0 y 1. Por ejemplo, se puede hacer que la parte rojiza ocupe más espacio en el mapa de colores.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 4.607 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 4.607 segundos)
