Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/colors/colormaps.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_colors_colormaps.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_tutorials_colors_colormaps.py>` para descargar el código de ejemplo completo

source: Choosing Colormaps in Matplotlib
es_es: Elección de mapas de colores en Matplotlib

source: Matplotlib has a number of built-in colormaps accessible via `.matplotlib.cm.get_cmap`. There are also external libraries that have many extra colormaps, which can be viewed in the `Third-party colormaps`_ section of the Matplotlib documentation. Here we briefly discuss how to choose between the many options. For help on creating your own colormaps, see :doc:`/tutorials/colors/colormap-manipulation`.
es_es: Matplotlib tiene un número de mapas de colores incorporados accesibles a través de `.matplotlib.cm.get_cmap`. También hay bibliotecas externas que tienen muchos mapas de colores adicionales, que se pueden ver en la sección `Third-party colormaps`_ de la documentación de Matplotlib. Aquí discutimos brevemente cómo elegir entre las muchas opciones. Para obtener ayuda en la creación de sus propios mapas de colores, consulta :doc:`/tutorials/colors/colormap-manipulation`.

source: Overview
es_es: Resumen

source: The idea behind choosing a good colormap is to find a good representation in 3D colorspace for your data set. The best colormap for any given data set depends on many things including:
es_es: La idea de elegir un buen mapa de color es encontrar una buena representación en el espacio de color 3D para su conjunto de datos. El mejor mapa de colores para cualquier conjunto de datos depende de muchas cosas, entre ellas:

source: Whether representing form or metric data ([Ware]_)
es_es: Si representa datos de forma o métricos ([Ware]_)

source: Your knowledge of the data set (*e.g.*, is there a critical value from which the other values deviate?)
es_es: Su conocimiento del conjunto de datos (*por ejemplo*, ¿hay un valor crítico del que se desvían los demás valores?)

source: If there is an intuitive color scheme for the parameter you are plotting
es_es: Si existe un esquema de colores intuitivo para el parámetro que está trazando

source: If there is a standard in the field the audience may be expecting
es_es: Si existe una norma en la materia, el público puede esperar

source: For many applications, a perceptually uniform colormap is the best choice; i.e. a colormap in which equal steps in data are perceived as equal steps in the color space. Researchers have found that the human brain perceives changes in the lightness parameter as changes in the data much better than, for example, changes in hue. Therefore, colormaps which have monotonically increasing lightness through the colormap will be better interpreted by the viewer. Wonderful examples of perceptually uniform colormaps can be found in the `Third-party colormaps`_ section as well.
es_es: Para muchas aplicaciones, un mapa de colores perceptualmente uniforme es la mejor opción; es decir, un mapa de colores en el que pasos iguales en los datos se perciben como pasos iguales en el espacio de color. Los investigadores han descubierto que el cerebro humano percibe los cambios en el parámetro de luminosidad como cambios en los datos mucho mejor que, por ejemplo, los cambios en el tono. Por lo tanto, los mapas de color que tienen una luminosidad monótonamente creciente a través del mapa de color serán mejor interpretados por el espectador. En la sección `Third-party colormaps`_ también se pueden encontrar magníficos ejemplos de mapas de color perceptualmente uniformes.

source: Color can be represented in 3D space in various ways. One way to represent color is using CIELAB. In CIELAB, color space is represented by lightness, :math:`L^*`; red-green, :math:`a^*`; and yellow-blue, :math:`b^*`. The lightness parameter :math:`L^*` can then be used to learn more about how the matplotlib colormaps will be perceived by viewers.
es_es: El color puede representarse en el espacio 3D de varias maneras. Una forma de representar el color es utilizando CIELAB. En CIELAB, el espacio de color se representa por la luminosidad, :math:`L^*`; rojo-verde, :math:`a^*`; y amarillo-azul, :math:`b^*`. El parámetro de luminosidad :math:`L^*` puede utilizarse para saber más sobre cómo percibirán los espectadores los mapas de color de matplotlib.

source: An excellent starting resource for learning about human perception of colormaps is from [IBM]_.
es_es: Un excelente recurso de partida para aprender sobre la percepción humana de los mapas de colores es el de [IBM]_.

source: Classes of colormaps
es_es: Clases de mapas de colores

source: Colormaps are often split into several categories based on their function (see, *e.g.*, [Moreland]_):
es_es: Los mapas de colores suelen dividirse en varias categorías según su función ( ver, *por ejemplo*, [Moreland]_):

source: Sequential: change in lightness and often saturation of color incrementally, often using a single hue; should be used for representing information that has ordering.
es_es: Secuencial: cambio en la luminosidad y, a menudo, en la saturación del color de forma incremental, a menudo utilizando un único tono; debe utilizarse para representar información que tenga orden.

source: Diverging: change in lightness and possibly saturation of two different colors that meet in the middle at an unsaturated color; should be used when the information being plotted has a critical middle value, such as topography or when the data deviates around zero.
es_es: Divergente: cambio en la luminosidad y posiblemente en la saturación de dos colores diferentes que se encuentran en el medio en un color no saturado; debe utilizarse cuando la información que se grafica tiene un valor medio crítico, como la topografía o cuando los datos se desvían alrededor de cero.

source: Cyclic: change in lightness of two different colors that meet in the middle and beginning/end at an unsaturated color; should be used for values that wrap around at the endpoints, such as phase angle, wind direction, or time of day.
es_es: Cíclico: cambio en la luminosidad de dos colores diferentes que se encuentran en el medio y comienzan/terminan en un color no saturado; debe utilizarse para valores que se envuelven en los puntos finales, como el ángulo de fase, la dirección del viento o la hora del día.

source: Qualitative: often are miscellaneous colors; should be used to represent information which does not have ordering or relationships.
es_es: Cualitativos: suelen ser colores diversos; deben utilizarse para representar información que no tiene orden ni relación.

source: First, we'll show the range of each colormap. Note that some seem to change more "quickly" than others.
es_es: En primer lugar, mostraremos la gama de cada mapa de colores. Observa que algunos parecen cambiar más "rápidamente" que otros.

source: Sequential
es_es: Secuencial

source: For the Sequential plots, the lightness value increases monotonically through the colormaps. This is good. Some of the :math:`L^*` values in the colormaps span from 0 to 100 (binary and the other grayscale), and others start around :math:`L^*=20`. Those that have a smaller range of :math:`L^*` will accordingly have a smaller perceptual range. Note also that the :math:`L^*` function varies amongst the colormaps: some are approximately linear in :math:`L^*` and others are more curved.
es_es: En los gráficos secuenciales, el valor de luminosidad aumenta monotónicamente a través de los mapas de colores. Esto es bueno. Algunos de los valores de :math:`L^*` en los mapas de colores van de 0 a 100 (binario y el otro en escala de grises), y otros comienzan alrededor de :math:`L^*=20`. Los que tienen un rango menor de :math:`L^*` tendrán, en consecuencia, un rango perceptivo menor. Tenga en cuenta también que la función :math:`L^*` varía entre los mapas de colores: algunos son aproximadamente lineales en :math:`L^*` y otros son más curvos.

source: Sequential2
es_es: Secuencial2

source: Many of the :math:`L^*` values from the Sequential2 plots are monotonically increasing, but some (autumn, cool, spring, and winter) plateau or even go both up and down in :math:`L^*` space. Others (afmhot, copper, gist_heat, and hot) have kinks in the :math:`L^*` functions. Data that is being represented in a region of the colormap that is at a plateau or kink will lead to a perception of banding of the data in those values in the colormap (see [mycarta-banding]_ for an excellent example of this).
es_es: Muchos de los valores de :math:`L^*` de los gráficos de Sequential2 son monótonos, pero algunos (otoño, frío, primavera e invierno) se estabilizan o incluso suben y bajan en el espacio de :math:`L^*`. Otros (afmhot, copper, gist_heat, y hot) tienen pliegues en las funciones :math:`L^*`. Los datos que se representan en una región del mapa de colores que se encuentra en una zona o en un pliegue provocarán una percepción de banda de los datos en esos valores del mapa de colores (ver [mycarta-banding]_ para un excelente ejemplo de esto).

source: Diverging
es_es: Divergencia

source: For the Diverging maps, we want to have monotonically increasing :math:`L^*` values up to a maximum, which should be close to :math:`L^*=100`, followed by monotonically decreasing :math:`L^*` values. We are looking for approximately equal minimum :math:`L^*` values at opposite ends of the colormap. By these measures, BrBG and RdBu are good options. coolwarm is a good option, but it doesn't span a wide range of :math:`L^*` values (see grayscale section below).
es_es: En el caso de los mapas divergentes, queremos que los valores de :math:`L^*` sean monótonamente crecientes hasta un máximo, que debería ser cercano a :math:`L^*=100`, seguido de valores de :math:`L^*` monótonamente decrecientes. Buscamos valores mínimos de :math:`L^*` aproximadamente iguales en los extremos opuestos del mapa de colores. Según estas medidas, BrBG y RdBu son buenas opciones. coolwarm es una buena opción, pero no abarca un amplio rango de valores :math:`L^*` ( ver sección de escala de grises más adelante).

source: Cyclic
es_es: Cíclico

source: For Cyclic maps, we want to start and end on the same color, and meet a symmetric center point in the middle. :math:`L^*` should change monotonically from start to middle, and inversely from middle to end. It should be symmetric on the increasing and decreasing side, and only differ in hue. At the ends and middle, :math:`L^*` will reverse direction, which should be smoothed in :math:`L^*` space to reduce artifacts. See [kovesi-colormaps]_ for more information on the design of cyclic maps.
es_es: Para los mapas cíclicos, queremos empezar y terminar en el mismo color, y encontrar un punto central simétrico en el medio. :math:`L^*` debe cambiar monotónicamente desde el principio hasta el medio, e inversamente desde el medio hasta el final. Debe ser simétrico en el lado creciente y decreciente, y sólo diferir en el tono. En los extremos y en el medio, :math:`L^*` invertirá la dirección, lo que debería ser suavizado en el espacio :math:`L^*` para reducir los artefactos. Ver [kovesi-colormaps]_ para más información sobre el diseño de mapas cíclicos.

source: The often-used HSV colormap is included in this set of colormaps, although it is not symmetric to a center point. Additionally, the :math:`L^*` values vary widely throughout the colormap, making it a poor choice for representing data for viewers to see perceptually. See an extension on this idea at [mycarta-jet]_.
es_es: El mapa de colores HSV, muy utilizado, está incluido en este conjunto de mapas de colores, aunque no es simétrico con respecto a un punto central. Además, los valores de :math:`L^*` varían mucho a lo largo del mapa de colores, lo que lo convierte en una mala elección para representar datos para que los espectadores los vean perceptualmente. Ver una extensión de esta idea en [mycarta-jet]_.

source: Qualitative
es_es: Cualitativa

source: Qualitative colormaps are not aimed at being perceptual maps, but looking at the lightness parameter can verify that for us. The :math:`L^*` values move all over the place throughout the colormap, and are clearly not monotonically increasing. These would not be good options for use as perceptual colormaps.
es_es: Los mapas de colores cualitativos no pretenden ser mapas perceptivos, pero si observamos el parámetro de luminosidad podemos comprobarlo. Los valores de :math:`L^*` se mueven por todo el mapa de colores, y claramente no son monótonos. Estas no serían buenas opciones para usar como mapas de colores perceptivos.

source: Miscellaneous
es_es: Varios

source: Some of the miscellaneous colormaps have particular uses for which they have been created. For example, gist_earth, ocean, and terrain all seem to be created for plotting topography (green/brown) and water depths (blue) together. We would expect to see a divergence in these colormaps, then, but multiple kinks may not be ideal, such as in gist_earth and terrain. CMRmap was created to convert well to grayscale, though it does appear to have some small kinks in :math:`L^*`. cubehelix was created to vary smoothly in both lightness and hue, but appears to have a small hump in the green hue area. turbo was created to display depth and disparity data.
es_es: Algunos de los mapas de colores diversos tienen usos particulares para los que han sido creados. Por ejemplo, gist_earth, ocean y terrain parecen haber sido creados para trazar juntos la topografía (verde/marrón) y la profundidad del agua (azul). Por lo tanto, es de esperar que se produzca una divergencia en estos mapas de colores, pero es posible que la existencia de múltiples torceduras no sea lo ideal, como en gist_earth y terrain. CMRmap se creó para convertir bien a escala de grises, aunque parece tener algunos pequeños pliegues en :math:`L^*`. cubehelix se creó para variar suavemente tanto la luminosidad como el tono, pero parece tener una pequeña joroba en la zona del tono verde. turbo se creó para mostrar datos de profundidad y disparidad.

source: The often-used jet colormap is included in this set of colormaps. We can see that the :math:`L^*` values vary widely throughout the colormap, making it a poor choice for representing data for viewers to see perceptually. See an extension on this idea at [mycarta-jet]_ and [turbo]_.
es_es: En este conjunto de mapas de colores se incluye el mapa de colores del jet, que se utiliza a menudo. Podemos ver que los valores de :math:`L^*` varían mucho a lo largo del mapa de colores, lo que lo convierte en una mala elección para representar datos para que los espectadores los vean perceptualmente. Ver una extensión de esta idea en [mycarta-jet]_ y [turbo]_.

source: Lightness of Matplotlib colormaps
es_es: Luminosidad de los mapas de colores de Matplotlib

source: Here we examine the lightness values of the matplotlib colormaps. Note that some documentation on the colormaps is available ([list-colormaps]_).
es_es: Aquí examinamos los valores de luminosidad de los colormaps de matplotlib. Ten en cuenta que hay documentación disponible sobre los mapas de colores ([list-colormaps]_).

source: Grayscale conversion
es_es: Conversión de la escala de grises

source: It is important to pay attention to conversion to grayscale for color plots, since they may be printed on black and white printers. If not carefully considered, your readers may end up with indecipherable plots because the grayscale changes unpredictably through the colormap.
es_es: Es importante prestar atención a la conversión a escala de grises de los gráficos en color, ya que pueden imprimirse en impresoras en blanco y negro. Si no se tiene cuidado, los lectores pueden acabar con gráficos indescifrables porque la escala de grises cambia de forma imprevisible a través del mapa de colores.

source: Conversion to grayscale is done in many different ways [bw]_. Some of the better ones use a linear combination of the rgb values of a pixel, but weighted according to how we perceive color intensity. A nonlinear method of conversion to grayscale is to use the :math:`L^*` values of the pixels. In general, similar principles apply for this question as they do for presenting one's information perceptually; that is, if a colormap is chosen that is monotonically increasing in :math:`L^*` values, it will print in a reasonable manner to grayscale.
es_es: La conversión a escala de grises se hace de muchas maneras diferentes [bw]_. Algunas de las mejores utilizan una combinación lineal de los valores rgb de un píxel, pero ponderada según la forma en que percibimos la intensidad del color. Un método no lineal de conversión a escala de grises es utilizar los valores :math:`L^*` de los píxeles. En general, para esta cuestión se aplican principios similares a los que se aplican para presentar la información de forma perceptiva; es decir, si se elige un mapa de colores que sea monotónicamente creciente en valores :math:`L^*`, se imprimirá de forma razonable a escala de grises.

source: With this in mind, we see that the Sequential colormaps have reasonable representations in grayscale. Some of the Sequential2 colormaps have decent enough grayscale representations, though some (autumn, spring, summer, winter) have very little grayscale change. If a colormap like this was used in a plot and then the plot was printed to grayscale, a lot of the information may map to the same gray values. The Diverging colormaps mostly vary from darker gray on the outer edges to white in the middle. Some (PuOr and seismic) have noticeably darker gray on one side than the other and therefore are not very symmetric. coolwarm has little range of gray scale and would print to a more uniform plot, losing a lot of detail. Note that overlaid, labeled contours could help differentiate between one side of the colormap vs. the other since color cannot be used once a plot is printed to grayscale. Many of the Qualitative and Miscellaneous colormaps, such as Accent, hsv, jet and turbo, change from darker to lighter and back to darker grey throughout the colormap. This would make it impossible for a viewer to interpret the information in a plot once it is printed in grayscale.
es_es: Teniendo esto en cuenta, vemos que los mapas de colores secuenciales tienen representaciones razonables en escala de grises. Algunos de los mapas de colores de Sequential2 tienen representaciones en escala de grises bastante decentes, aunque algunos (otoño, primavera, verano, invierno) tienen muy poco cambio de escala de grises. Si un mapa de colores como éste se utilizara en un gráfico y luego se imprimiera en escala de grises, gran parte de la información podría asignarse a los mismos valores de gris. Los mapas de colores divergentes varían en su mayoría desde el gris más oscuro en los bordes exteriores hasta el blanco en el centro. Algunos (PuOr y seismic) tienen un gris notablemente más oscuro en un lado que en el otro y, por lo tanto, no son muy simétricos. coolwarm tiene poco rango de escala de grises y se imprimiría a un gráfico más uniforme, perdiendo mucho detalle. Ten en cuenta que la superposición de contornos etiquetados podría ayudar a diferenciar entre un lado del mapa de colores y el otro, ya que el color no se puede utilizar una vez que el gráfico se imprime en escala de grises. Muchos de los mapas de colores cualitativos y misceláneos, como Accent, hsv, jet y turbo, cambian de gris más oscuro a más claro y de nuevo a gris más oscuro a lo largo del mapa de colores. Esto haría imposible que un espectador interpretara la información de un gráfico una vez impreso en escala de grises.

source: Color vision deficiencies
es_es: Deficiencias en la visión del color

source: There is a lot of information available about color blindness (*e.g.*, [colorblindness]_). Additionally, there are tools available to convert images to how they look for different types of color vision deficiencies.
es_es: Hay mucha información disponible sobre el daltonismo (*e.*, [colorblindness]_). Además, hay herramientas disponibles para convertir las imágenes en cómo se ven los diferentes tipos de deficiencias de la visión del color.

source: The most common form of color vision deficiency involves differentiating between red and green. Thus, avoiding colormaps with both red and green will avoid many problems in general.
es_es: La forma más común de deficiencia en la visión del color consiste en diferenciar entre el rojo y el verde. Por lo tanto, evitar los mapas de colores con el rojo y el verde evitará muchos problemas en general.

source: References
es_es: Referencias

source: **Total running time of the script:** ( 0 minutes 14.316 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 14.316 segundos)
