Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/colors/colors.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_colors_colors.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_tutorials_colors_colors.py>` para descargar el código de ejemplo completo

source: Specifying Colors
es_es: Especificación de colores

source: Matplotlib recognizes the following formats to specify a color.
es_es: Matplotlib reconoce los siguientes formatos para especificar un color.

source: Format
es_es: Formato

source: Example
es_es: Ejemplo

source: RGB or RGBA (red, green, blue, alpha) tuple of float values in a closed interval [0, 1].
es_es: RGB o RGBA (rojo, verde, azul, alfa) tupla de valores flotantes en un intervalo cerrado [0, 1].

source: Case-insensitive hex RGB or RGBA string.
es_es: Cadena RGB o RGBA hexadecimal que no distingue entre mayúsculas y minúsculas.

source: Case-insensitive RGB or RGBA string equivalent hex shorthand of duplicated characters.
es_es: Cadena RGB o RGBA insensible a mayúsculas y minúsculas, equivalente a la taquigrafía hexadecimal de los caracteres duplicados.

source: ``'#abc'`` as ``'#aabbcc'``
es_es: ``'#abc'`` como ``'#aabbcc'``

source: ``'#fb1'`` as ``'#ffbb11'``
es_es: ``'#fb1'` como ``'#ffbb11'``

source: String representation of float value in closed interval ``[0, 1]`` for grayscale values.
es_es: Representación en forma de cadena del valor del flotador en el intervalo cerrado ``[0, 1]`` para los valores de la escala de grises.

source: ``'0'`` as black
es_es: ``'0'`` como negro

source: ``'1'`` as white
es_es: ``'1'`` como blanco

source: ``'0.8'`` as light gray
es_es: ``'0.8'`` como gris claro

source: Single character shorthand notation for some basic colors.
es_es: Notación abreviada de un solo carácter para algunos colores básicos.

source: The colors green, cyan, magenta, and yellow do not coincide with X11/CSS4 colors. Their particular shades were chosen for better visibility of colored lines against typical backgrounds.
es_es: Los colores verde, cian, magenta y amarillo no coinciden con los colores X11/CSS4. Sus tonos particulares se eligieron para mejorar la visibilidad de las líneas de color contra los fondos típicos.

source: ``'b'`` as blue
es_es: ``'b'`` como azul

source: ``'g'`` as green
es_es: ``'g'`` como verde

source: ``'r'`` as red
es_es: ``'r'`` como rojo

source: ``'c'`` as cyan
es_es: ``'c'`` como cian

source: ``'m'`` as magenta
es_es: ``'m'`` como magenta

source: ``'y'`` as yellow
es_es: ``'y'`` como amarillo

source: ``'k'`` as black
es_es: ``'k'`` como negro

source: ``'w'`` as white
es_es: ``'w'`` como blanco

source: Case-insensitive X11/CSS4 color name with no spaces.
es_es: Nombre de color X11/CSS4 que no distingue entre mayúsculas y minúsculas, sin espacios.

source: Case-insensitive color name from `xkcd color survey`_ with ``'xkcd:'`` prefix.
es_es: Nombre de color insensible a mayúsculas y minúsculas de `xkcd color survey`_ con el prefijo ``'xkcd:'``.

source: Case-insensitive Tableau Colors from 'T10' categorical palette.
es_es: Colores de Tableau insensibles a mayúsculas y minúsculas de la paleta categórica 'T10'.

source: This is the default color cycle.
es_es: Este es el ciclo de color por defecto.

source: "CN" color spec where ``'C'`` precedes a number acting as an index into the default property cycle.
es_es: "CN" color spec donde ``'C'`` precede a un número que actúa como un índice en el ciclo de la propiedad por defecto.

source: Matplotlib indexes color at draw time and defaults to black if cycle does not include color.
es_es: Matplotlib indexa el color en el momento de dibujar y por defecto lo hace en negro si el ciclo no incluye el color.

source: The following links provide more information on colors in Matplotlib.
es_es: Los siguientes enlaces proporcionan más información sobre los colores en Matplotlib.

source: :doc:`/gallery/color/color_demo` Example
es_es: :doc:`/gallery/color/color_demo` Ejemplo

source: :doc:`/gallery/color/named_colors` Example
es_es: :doc:`/gallery/color/named_colors` Ejemplo

source: "Red", "Green", and "Blue" are the intensities of those colors. In combination, they represent the colorspace.
es_es: "Rojo", "Verde" y "Azul" son las intensidades de esos colores. En combinación, representan el espacio de color.

source: Matplotlib draws Artists based on the ``zorder`` parameter. If there are no specified values, Matplotlib defaults to the order of the Artists added to the Axes.
es_es: Matplotlib dibuja los Artists basándose en el parámetro ``zorder``. Si no hay valores especificados, Matplotlib utiliza por defecto el orden de los Artists añadidos a los Ejes.

source: The alpha for an Artist controls opacity. It indicates how the RGB color of the new Artist combines with RGB colors already on the Axes.
es_es: El alfa de un Artist controla la opacidad. Indica cómo el color RGB del nuevo Artist se combina con los colores RGB que ya están en los Ejes.

source: The two Artists combine with alpha compositing. Matplotlib uses the equation below to compute the result of blending a new Artist.
es_es: Los dos Artists se combinan con la composición alfa. Matplotlib utiliza la siguiente ecuación para calcular el resultado de la mezcla de un nuevo Artist.

source: Alpha of 1 indicates the new Artist completely covers the previous color. Alpha of 0 for top color is not visible; however, it contributes to blending for intermediate values as the cumulative result of all previous Artists. The following table contains examples.
es_es: El alfa de 1 indica que el nuevo Artist cubre completamente el color anterior. El alfa de 0 para el color superior no es visible; sin embargo, contribuye a la mezcla para los valores intermedios como el resultado acumulado de todos los Artists anteriores. La siguiente tabla contiene ejemplos.

source: Alpha value
es_es: Valor alfa

source: Re-ordering Artists is not commutative in Matplotlib.
es_es: La reordenación de Artists no es conmutativa en Matplotlib.

source: "CN" color selection
es_es: Selección de color "CN"

source: Matplotlib converts "CN" colors to RGBA when drawing Artists. The :doc:`/tutorials/intermediate/color_cycle` section contains additional information about controlling colors and style properties.
es_es: Matplotlib convierte los colores "CN" a RGBA cuando dibuja Artists. La sección :doc:`/tutorials/intermediate/color_cycle` contiene información adicional sobre el control de los colores y las propiedades de estilo.

source: The first color ``'C0'`` is the title. Each plot uses the second and third colors of each style's :rc:`axes.prop_cycle`. They are ``'C1'`` and ``'C2'``, respectively.
es_es: El primer color ``'C0`` es el título. Cada gráfico utiliza el segundo y tercer color de cada estilo :rc:`axes.prop_cycle`. Son ``'C1`` y ``'C2``, respectivamente.

source: Comparison between X11/CSS4 and xkcd colors
es_es: Comparación entre los colores de X11/CSS4 y xkcd

source: The xkcd colors come from a `user survey conducted by the webcomic xkcd <https://blog.xkcd.com/2010/05/03/color-survey-results/>`__.
es_es: Los colores de xkcd provienen de una `encuesta de usuarios realizada por el webcomic xkcd <https://blog.xkcd.com/2010/05/03/color-survey-results/>`__.

source: 95 out of the 148 X11/CSS4 color names also appear in the xkcd color survey. Almost all of them map to different color values in the X11/CSS4 and in the xkcd palette. Only 'black', 'white' and 'cyan' are identical.
es_es: 95 de los 148 nombres de colores de X11/CSS4 también aparecen en la encuesta de colores de xkcd. Casi todos ellos corresponden a diferentes valores de color en el X11/CSS4 y en la paleta de xkcd. Sólo "negro", "blanco" y "cian" son idénticos.

source: For example, ``'blue'`` maps to ``'#0000FF'`` whereas ``'xkcd:blue'`` maps to ``'#0343DF'``. Due to these name collisions, all xkcd colors have the ``'xkcd:'`` prefix.
es_es: Por ejemplo, ``'blue'`` corresponde a ``'#0000FF'`` mientras que ``'xkcd:blue'`` corresponde a ``'#0343DF'``. Debido a estas colisiones de nombres, todos los colores de xkcd tienen el prefijo ``'xkcd:'``.

source: The visual below shows name collisions. Color names where color values agree are in bold.
es_es: El siguiente gráfico muestra las colisiones de nombres. Los nombres de colores en los que coinciden los valores de color están en negrita.

source: **Total running time of the script:** ( 0 minutes 1.208 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.208 segundos)
