Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/gitwash/configure_git.po
Languages: es_es

source: Configure git
es_es: Configurar git

source: Overview
es_es: Resumen

source: Your personal git configurations are saved in the ``.gitconfig`` file in your home directory.
es_es: Tus configuraciones personales de git se guardan en el archivo ``.gitconfig`` en tu directorio personal.

source: Here is an example ``.gitconfig`` file:
es_es: Este es un ejemplo de archivo ``.gitconfig``:

source: You can check what is already in your config file using the ``git config --list`` command. You can edit the ``.gitconfig`` file directly or you can use the ``git config --global`` command.::
es_es: Puedes comprobar lo que ya está en tu archivo de configuración utilizando el comando ``git config --list``. Puedes editar el archivo ``.gitconfig`` directamente o puedes utilizar el comando ``git config --global``.::

source: To set up on another computer, you can copy your ``~/.gitconfig`` file, or run the commands above.
es_es: Para configurarlo en otro ordenador, puedes copiar tu archivo ``~/.gitconfig``, o ejecutar los comandos anteriores.

source: In detail
es_es: En detalle

source: user.name and user.email
es_es: user.name y user.email

source: It is good practice to tell git_ who you are, for labeling any changes you make to the code. The simplest way to do this is from the command line::
es_es: Es una buena práctica decirle a git_ quién eres, para etiquetar cualquier cambio que hagas en el código. La forma más sencilla de hacerlo es desde la línea de comandos::

source: This will write the settings into your git configuration file, which should now contain a user section with your name and email:
es_es: Esto escribirá los ajustes en tu archivo de configuración de git, que ahora debería contener una sección de usuario con tu nombre y correo electrónico:

source: You'll need to replace ``Your Name`` and ``you@yourdomain.example.com`` with your actual name and email address.
es_es: Tendrás que sustituir ``Tu nombre`` y ``you@yourdomain.example.com`` por tu nombre y dirección de correo electrónico reales.

source: You might well benefit from some aliases to common commands.
es_es: Es posible que te beneficies de algunos alias de comandos comunes.

source: For example, you might well want to be able to shorten ``git checkout`` to ``git co``. Or you may want to alias ``git diff --color-words`` (which gives a nicely formatted output of the diff) to ``git wdiff``
es_es: Por ejemplo, es posible que quieras acortar ``git checkout`` a ``git co``. O tal vez quieras cambiar el alias de ``git diff --color-words`` (que da una salida bien formateada del diff) por ``git wdiff``

source: The following ``git config --global`` commands::
es_es: Los siguientes comandos ``git config --global``::

source: will create an ``alias`` section in your ``.gitconfig`` file with contents like this:
es_es: creará una sección ``alias`` en tu archivo ``.gitconfig`` con un contenido como este:

source: You may also want to make sure that your editor of choice is used ::
es_es: También es posible que desee asegurarse de que su editor de elección se utiliza ::

source: Merging
es_es: Fusionando

source: To enforce summaries when doing merges (``~/.gitconfig`` file again):
es_es: Para reforzar los resúmenes al hacer fusiones (archivo ``~/.gitconfig`` de nuevo):

source: Or from the command line::
es_es: O desde la línea de comandos::

source: Fancy log output
es_es: Salida de registro de fantasía

source: This is a very nice alias to get a fancy log output; it should go in the ``alias`` section of your ``.gitconfig`` file:
es_es: Este es un alias muy bonito para obtener una salida de registro elegante; debería ir en la sección ``alias`` de tu archivo ``.gitconfig``:

source: You use the alias with::
es_es: Se utiliza el alias con::

source: and it gives graph / text output something like this (but with color!):
es_es: y da una salida de gráfico / texto algo así (¡pero con color!):

source: Thanks to Yury V. Zaytsev for posting it.
es_es: Gracias a Yury V. Zaytsev por publicarlo.
