Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/gitwash/development_workflow.po
Languages: es_es

source: Development workflow
es_es: Flujo de trabajo de desarrollo

source: You already have your own forked copy of the `Matplotlib`_ repository, by following :ref:`forking`. You have :ref:`set-up-fork`. You have configured git by following :ref:`configure-git`. Now you are ready for some real work.
es_es: Ya tienes tu propia copia forked del repositorio `Matplotlib`_, siguiendo :ref:`forking`. Tienes :ref:`set-up-fork`. Has configurado git siguiendo :ref:`configure-git`. Ahora estás listo para trabajar de verdad.

source: Workflow summary
es_es: Resumen del flujo de trabajo

source: In what follows we'll refer to the upstream Matplotlib ``master`` branch, as "trunk".
es_es: En lo que sigue nos referiremos a la rama ``master`` de Matplotlib, como "trunk".

source: Don't use your ``master`` branch for anything. Consider deleting it.
es_es: No uses tu rama ``master`` para nada. Considera borrarla.

source: When you are starting a new set of changes, fetch any changes from trunk, and start a new *feature branch* from that.
es_es: Cuando se inicia un nuevo conjunto de cambios, obtener cualquier cambio de tronco, y comenzar una nueva rama *figura * de eso.

source: Make a new branch for each separable set of changes |emdash| "one task, one branch" (`ipython git workflow`_).
es_es: Hacer una nueva rama para cada conjunto separable de cambios |emdash| "una tarea, una rama" (`ipython git workflow`_).

source: Name your branch for the purpose of the changes - e.g. ``bugfix-for-issue-14`` or ``refactor-database-code``.
es_es: Nombra tu rama según el propósito de los cambios - por ejemplo, ``bugfix-for-issue-14`` o ``refactor-database-code``.

source: If you can possibly avoid it, avoid merging trunk or any other branches into your feature branch while you are working.
es_es: Si puedes evitarlo, evita fusionar el tronco o cualquier otra rama en tu rama de características mientras estás trabajando.

source: If you do find yourself merging from trunk, consider :ref:`rebase-on-trunk`
es_es: Si te encuentras fusionando desde el tronco, considera :ref:`rebase-on-trunk`

source: Ask on the `Matplotlib mailing list`_ if you get stuck.
es_es: Pregunta en la lista de correo `Matplotlib`_ si te quedas atascado.

source: Ask for code review!
es_es: ¡Pide la revisión del código!

source: This way of working helps to keep work well organized, with readable history. This in turn makes it easier for project maintainers (that might be you) to see what you've done, and why you did it.
es_es: Esta forma de trabajar ayuda a mantener el trabajo bien organizado, con un historial legible. Esto a su vez hace más fácil para los mantenedores del proyecto (que podría ser usted) para ver lo que has hecho, y por qué lo hiciste.

source: See `linux git workflow`_ and `ipython git workflow`_ for some explanation.
es_es: Ver `linux git workflow`_ y `ipython git workflow`_ para alguna explicación.

source: Consider deleting your master branch
es_es: Considere la posibilidad de eliminar su rama maestra

source: It may sound strange, but deleting your own ``master`` branch can help reduce confusion about which branch you are on. See `deleting master on github`_ for details.
es_es: Puede sonar extraño, pero borrar tu propia rama ``master`` puede ayudar a reducir la confusión sobre en qué rama estás. Ver `borrar master en github`_ para más detalles.

source: Update the mirror of trunk
es_es: Actualizar el espejo del tronco

source: First make sure you have done :ref:`linking-to-upstream`.
es_es: Primero asegúrate de haber hecho :ref:`linking-to-upstream`.

source: From time to time you should fetch the upstream (trunk) changes from github::
es_es: De vez en cuando debes obtener los cambios del upstream (trunk) desde github::

source: This will pull down any commits you don't have, and set the remote branches to point to the right commit. For example, 'trunk' is the branch referred to by (remote/branchname) ``upstream/master`` - and if there have been commits since you last checked, ``upstream/master`` will change after you do the fetch.
es_es: Esto sacará cualquier commit que no tengas, y establecerá las ramas remotas para que apunten al commit correcto. Por ejemplo, 'trunk' es la rama a la que se refiere (nombre de la rama remota) ``upstream/master`` - y si ha habido confirmaciones desde la última vez que lo comprobaste, ``upstream/master`` cambiará después de que hagas la obtención.

source: Make a new feature branch
es_es: Hacer una nueva rama de características

source: When you are ready to make some changes to the code, you should start a new branch. Branches that are for a collection of related edits are often called 'feature branches'.
es_es: Cuando estés listo para hacer algunos cambios en el código, debe iniciar una nueva rama. Las ramas que son para una colección de ediciones relacionadas suelen llamarse "ramas de características".

source: Making an new branch for each set of related changes will make it easier for someone reviewing your branch to see what you are doing.
es_es: Hacer una nueva rama para cada conjunto de cambios relacionados hará que sea más fácil para alguien que revise su rama ver lo que está haciendo.

source: Choose an informative name for the branch to remind yourself and the rest of us what the changes in the branch are for. For example ``add-ability-to-fly``, or ``buxfix-for-issue-42``.
es_es: Elige un nombre informativo para la rama para recordarte a ti mismo y al resto de nosotros para qué son los cambios en la rama. Por ejemplo ``add-ability-to-fly``, o ``buxfix-for-issue-42``.

source: Generally, you will want to keep your feature branches on your public github_ fork of `Matplotlib`_. To do this, you `git push`_ this new branch up to your github repo. Generally (if you followed the instructions in these pages, and by default), git will have a link to your github repo, called ``origin``. You push up to your own repo on github with::
es_es: Generalmente, querrás mantener tus ramas de características en tu fork público de github de `Matplotlib`_. Para hacer esto, haces `git push`_ para trasladar esta nueva rama hasta tu repo de github. Generalmente (si has seguido las instrucciones de estas páginas, y por defecto), git tendrá un enlace a tu repo de github, llamado ``origin``. Para hacer push hasta tu propio repo en github utilizas::

source: In git >= 1.7 you can ensure that the link is correctly set by using the ``--set-upstream`` option::
es_es: En git >= 1.7 puedes asegurarte de que el enlace está correctamente configurado utilizando la opción ``--set-upstream``::

source: From now on git will know that ``my-new-feature`` is related to the ``my-new-feature`` branch in the github repo.
es_es: A partir de ahora git sabrá que ``mi-nueva-característica`` está relacionada con la rama ``mi-nueva-característica`` en el repo de github.

source: The editing workflow
es_es: El flujo de trabajo de edición

source: Overview
es_es: Resumen

source: In more detail
es_es: Con más detalle

source: Make some changes
es_es: Haz algunos cambios

source: See which files have changed with ``git status`` (see `git status`_). You'll see a listing like this one:
es_es: Mira qué archivos han cambiado con ``git status`` (ver `git status`_). Verás un listado como este:

source: Check what the actual changes are with ``git diff`` (`git diff`_).
es_es: Comprueba cuáles son los cambios reales con ``git diff`` (`git diff`_).

source: Add any new files to version control ``git add new_file_name`` (see `git add`_).
es_es: Añade cualquier archivo nuevo al control de versiones ``git add new_file_name`` (ver `git add`_).

source: To commit all modified files into the local copy of your repo,, do ``git commit -am 'A commit message'``. Note the ``-am`` options to ``commit``. The ``m`` flag just signals that you're going to type a message on the command line. The ``a`` flag |emdash| you can just take on faith |emdash| or see `why the -a flag?`_ |emdash| and the helpful use-case description in the `tangled working copy problem`_. The `git commit`_ manual page might also be useful.
es_es: Para confirmar todos los archivos modificados en la copia local de su repo, utiliza ``git commit -am 'Un mensaje de confirmación``. Ten en cuenta las opciones ``-am`` para ``commit``. La bandera ``m`` sólo indica que vas a escribir un mensaje en la línea de comandos. La bandera ``a`` puede ser tomada por fe |emdash| o ver `¿Por qué la bandera -a?`_ |emdash| y la útil descripción del caso de uso en el `problema de la copia de trabajo enredada`_. La página del manual de `git commit`_ también puede ser útil.

source: To push the changes up to your forked repo on github, do a ``git push`` (see `git push`_).
es_es: Para subir los cambios a tu repo en github, haz un ``git push`` (ver `git push`_).

source: Ask for your changes to be reviewed or merged
es_es: Pide que tus cambios sean revisados o fusionados

source: When you are ready to ask for someone to review your code and consider a merge:
es_es: Cuando estés listo para pedir que alguien revise tu código y considere una fusión:

source: Go to the URL of your forked repo, say ``https://github.com/your-user-name/matplotlib``.
es_es: Ve a la URL de tu repo forked, por ejemplo ``https://github.com/your-user-name/matplotlib``.

source: Use the 'Switch Branches' dropdown menu near the top left of the page to select the branch with your changes:
es_es: Utiliza el menú desplegable "Cambiar de rama" situado en la parte superior izquierda de la página para seleccionar la rama con tus cambios:

source: Click on the 'Pull request' button:
es_es: Haz clic en el botón 'Pull request':

source: Enter a title for the set of changes, and some explanation of what you've done. Say if there is anything you'd like particular attention for - like a complicated change or some code you are not happy with.
es_es: Introduce un título para el conjunto de cambios, y alguna explicación de lo que has hecho. Indica si hay algo a lo que te gustaría prestar especial atención, como un cambio complicado o algún código con el que no estés satisfecho.

source: If you don't think your request is ready to be merged, just say so in your pull request message. This is still a good way of getting some preliminary code review.
es_es: Si crees que tu solicitud no está lista para ser fusionada, sólo tienes que decirlo en tu mensaje de pull request. Esta sigue siendo una buena manera de conseguir una revisión preliminar del código.

source: Some other things you might want to do
es_es: Algunas otras cosas que podrías querer hacer

source: Delete a branch on github
es_es: Eliminar una rama en github

source: Note the colon ``:`` before ``my-unwanted-branch``. See also: https://help.github.com/articles/pushing-to-a-remote/#deleting-a-remote-branch-or-tag
es_es: Observa los dos puntos ``:`` antes de ``mi-rama-no-deseada``. Revisa también: https://help.github.com/articles/pushing-to-a-remote/#deleting-a-remote-branch-or-tag

source: Several people sharing a single repository
es_es: Varias personas compartiendo un mismo repositorio

source: If you want to work on some stuff with other people, where you are all committing into the same repository, or even the same branch, then just share it via github.
es_es: Si quieres trabajar en algunas cosas con otras personas, donde todos están confirmando en el mismo repositorio, o incluso la misma rama, a continuación, sólo compartirlo a través de github.

source: First fork Matplotlib into your account, as from :ref:`forking`.
es_es: Primero haz un fork de Matplotlib en tu cuenta, como en :ref:`forking`.

source: Then, go to your forked repository github page, say ``https://github.com/your-user-name/matplotlib``
es_es: A continuación, ve a tu página de github del repositorio bifurcado, indica ``https://github.com/your-user-name/matplotlib``

source: Click on the 'Admin' button, and add anyone else to the repo as a collaborator:
es_es: Haz clic en el botón 'Admin', y añade a cualquier otra persona al repo como colaborador:

source: Now all those people can do::
es_es: Ahora toda esa gente puede hacer::

source: Remember that links starting with ``https`` or ``git@`` are read-write, and that ``git@`` uses the ssh protocol; links starting with ``git://`` are read-only.
es_es: Recuerda que los enlaces que empiezan por ``https`` o ``git@`` son de lectura-escritura, y que ``git@`` utiliza el protocolo ssh; los enlaces que empiezan por ``git://`` son de sólo lectura.

source: Your collaborators can then commit directly into that repo with the usual::
es_es: Tus colaboradores pueden entonces confirmar directamente en ese repo con el habitual::

source: Explore your repository
es_es: Explora tu repositorio

source: To see a graphical representation of the repository branches and commits::
es_es: Para ver una representación gráfica de las ramas y commits del repositorio::

source: To see a linear list of commits for this branch::
es_es: Para ver una lista lineal de commits para esta rama::

source: You can also look at the `network graph visualizer`_ for your github repo.
es_es: También puedes mirar el `network graph visualizer`_ para tu repo de github.

source: Finally the :ref:`fancy-log` ``lg`` alias will give you a reasonable text-based graph of the repository.
es_es: Finalmente, el alias :ref:`fancy-log` ``lg`` te dará un gráfico razonable basado en texto del repositorio.

source: Rebasing on trunk
es_es: Rebase en el tronco

source: Let's say you thought of some work you'd like to do. You :ref:`update-mirror-trunk` and :ref:`make-feature-branch` called ``cool-feature``. At this stage trunk is at some commit, let's call it E. Now you make some new commits on your ``cool-feature`` branch, let's call them A, B, C. Maybe your changes take a while, or you come back to them after a while. In the meantime, trunk has progressed from commit E to commit (say) G:
es_es: Digamos que has pensado en un trabajo que te gustaría hacer. Tu :ref:`update-mirror-trunk` y :ref:`make-feature-branch` llamado ``fresco-característica``. En esta etapa el tronco está en algún commit, llamémoslo E. Ahora haces algunos nuevos commits en tu rama ``cool-feature``, llamémoslos A, B, C. Puede que tus cambios lleven un tiempo, o que vuelvas a ellos después de un tiempo. Mientras tanto, el tronco ha progresado desde el commit E hasta el commit (digamos) G:

source: At this stage you consider merging trunk into your feature branch, and you remember that this here page sternly advises you not to do that, because the history will get messy. Most of the time you can just ask for a review, and not worry that trunk has got a little ahead. But sometimes, the changes in trunk might affect your changes, and you need to harmonize them. In this situation you may prefer to do a rebase.
es_es: En esta etapa consideras la posibilidad de fusionar el tronco en tu rama de características, y recuerdas que esta página te aconseja insistentemente que no lo hagas, porque el historial se desordena. La mayoría de las veces puedes simplemente pedir una revisión, y no preocuparte de que el tronco se haya adelantado un poco. Pero a veces, los cambios en trunk pueden afectar a tus cambios, y necesitas armonizarlos. En esta situación puedes preferir hacer un rebase.

source: rebase takes your changes (A, B, C) and replays them as if they had been made to the current state of ``trunk``. In other words, in this case, it takes the changes represented by A, B, C and replays them on top of G. After the rebase, your history will look like this:
es_es: rebase toma tus cambios (A, B, C) y los reproduce como si se hubieran hecho en el estado actual de ``trunk``. En otras palabras, en este caso, toma los cambios representados por A, B, C y los replica sobre G. Después del rebase, tu historia se verá así:

source: See `rebase without tears`_ for more detail.
es_es: Ver `rebase without tears`_ para más detalles.

source: To do a rebase on trunk::
es_es: Para hacer un rebase en trunk::

source: In this situation, where you are already on branch ``cool-feature``, the last command can be written more succinctly as::
es_es: En esta situación, en la que ya está en la rama ``cool-feature``, el último comando se puede escribir más sucintamente como::

source: When all looks good you can delete your backup branch::
es_es: Cuando todo se ve bien puedes eliminar tu rama de copia de seguridad::

source: If it doesn't look good you may need to have a look at :ref:`recovering-from-mess-up`.
es_es: Si no se ve bien puede ser necesario echar un vistazo a :ref:`recovering-from-mess-up`.

source: If you have made changes to files that have also changed in trunk, this may generate merge conflicts that you need to resolve - see the `git rebase`_ man page for some instructions at the end of the "Description" section. There is some related help on merging in the git user manual - see `resolving a merge`_.
es_es: Si has hecho cambios en archivos que también han cambiado en el tronco, esto puede generar conflictos de fusión que necesitas resolver - vea la página man `git rebase`_ para algunas instrucciones al final de la sección "Descripción". Hay alguna ayuda relacionada con la fusión en el manual de usuario de git - ver `resolver una fusión`_.

source: Recovering from mess-ups
es_es: Recuperación de errores

source: Sometimes, you mess up merges or rebases. Luckily, in git it is relatively straightforward to recover from such mistakes.
es_es: A veces, se estropean los merges o rebases. Por suerte, en git es relativamente sencillo recuperarse de esos errores.

source: If you mess up during a rebase::
es_es: Si te equivocas durante un rebase::

source: If you notice you messed up after the rebase::
es_es: Si te das cuenta de que has metido la pata después del rebase::

source: If you forgot to make a backup branch::
es_es: Si te olvidaste de hacer una rama de copia de seguridad::

source: Rewriting commit history
es_es: Reescribiendo el historial de confirmaciones

source: Do this only for your own feature branches.
es_es: Haz esto sólo para tus propias ramas de características.

source: There's an embarrassing typo in a commit you made? Or perhaps the you made several false starts you would like the posterity not to see.
es_es: ¿Hay un error tipográfico embarazoso en un commit que hiciste? O tal vez el hiciste varias salidas falsas que te gustaría que la posteridad no viera.

source: This can be done via *interactive rebasing*.
es_es: Esto se puede hacer mediante *rebasado interactivo*.

source: Suppose that the commit history looks like this::
es_es: Supongamos que el historial de confirmaciones tiene el siguiente aspecto::

source: and ``6ad92e5`` is the last commit in the ``cool-feature`` branch. Suppose we want to make the following changes:
es_es: y ``6ad92e5`` es el último commit en la rama ``cool-feature``. Supongamos que queremos hacer los siguientes cambios:

source: Rewrite the commit message for ``13d7934`` to something more sensible.
es_es: Reescribir el mensaje de confirmación para ``13d7934`` a algo más sensible.

source: Combine the commits ``2dec1ac``, ``a815645``, ``eadc391`` into a single one.
es_es: Combinar los commits ``2dec1ac``, ``a815645``, ``eadc391`` en uno solo.

source: We do as follows::
es_es: Hacemos lo siguiente::

source: This will open an editor with the following text in it::
es_es: Esto abrirá un editor con el siguiente texto en él::

source: To achieve what we want, we will make the following changes to it::
es_es: Para conseguir lo que queremos, le haremos los siguientes cambios::

source: This means that (i) we want to edit the commit message for ``13d7934``, and (ii) collapse the last three commits into one. Now we save and quit the editor.
es_es: Esto significa que (i) queremos editar el mensaje de confirmación para ``13d7934``, y (ii) colapsar las tres últimas confirmaciones en una. Ahora guardamos y salimos del editor.

source: Git will then immediately bring up an editor for editing the commit message. After revising it, we get the output::
es_es: Git mostrará inmediatamente un editor para editar el mensaje de confirmación. Después de revisarlo, obtenemos la salida::

source: and the history looks now like this::
es_es: y el historial se ve ahora así::

source: If it went wrong, recovery is again possible as explained :ref:`above <recovering-from-mess-up>`.
es_es: Si salió mal, la recuperación es de nuevo posible como se explica :ref:`arriba <recovering-from-mess-up>`.
