Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/gitwash/following_latest.po
Languages: es_es

source: Following the latest source
es_es: Siguiendo el último código fuente

source: These are the instructions if you just want to follow the latest *Matplotlib* source, but you don't need to do any development for now.
es_es: Estas son las instrucciones si sólo quieres seguir la última fuente de *Matplotlib*, pero no necesitas hacer ningún desarrollo por ahora.

source: The steps are:
es_es: Los pasos son:

source: get local copy of the `Matplotlib github`_ git repository
es_es: obtener copia local del repositorio git de `Matplotlib github`_

source: update local copy from time to time
es_es: actualizar la copia local de vez en cuando

source: Get the local copy of the code
es_es: Obtener la copia local del código

source: From the command line::
es_es: Desde la línea de comandos::

source: You now have a copy of the code tree in the new ``matplotlib`` directory.
es_es: Ahora tienes una copia del árbol de código en el nuevo directorio ``matplotlib``.

source: Updating the code
es_es: Actualizando el código

source: From time to time you may want to pull down the latest code. Do this with::
es_es: De vez en cuando puede querer bajar el último código. Hazlo con::

source: The tree in ``matplotlib`` will now have the latest changes from the initial repository.
es_es: El árbol en ``matplotlib`` tendrá ahora los últimos cambios del repositorio inicial.
