Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/gitwash/forking_hell.po
Languages: es_es

source: Making your own copy (fork) of Matplotlib
es_es: Haciendo tu propia copia (fork) de Matplotlib

source: You need to do this only once. The instructions here are very similar to the instructions at https://help.github.com/forking/ |emdash| please see that page for more detail. We're repeating some of it here just to give the specifics for the `Matplotlib`_ project, and to suggest some default names.
es_es: Sólo hay que hacer esto una vez. Las instrucciones aquí son muy similares a las instrucciones en https://help.github.com/forking/ |emdash| por favor revisa esa página para más detalles. Estamos repitiendo algunas de ellas aquí sólo para dar los detalles para el proyecto `Matplotlib`_, y para sugerir algunos nombres por defecto.

source: Set up and configure a github account
es_es: Establecer y configurar una cuenta de github

source: If you don't have a github account, go to the github page, and make one.
es_es: Si no tienes una cuenta de github, ve a la página de github y crea una.

source: You then need to configure your account to allow write access |emdash| see the ``Generating SSH keys`` help on `github help`_.
es_es: A continuación, tienes que configurar tu cuenta para permitir el acceso de escritura |emdash| ver la ayuda ``Generating SSH keys`` en `github help`_.

source: Create your own forked copy of `Matplotlib`_
es_es: Crea tu propia copia de `Matplotlib`_

source: Log into your github account.
es_es: Entra en tu cuenta de github.

source: Go to the `Matplotlib`_ github home at `Matplotlib github`_.
es_es: Ve a la página de inicio de github de `Matplotlib`_ en `Matplotlib github`_.

source: Click on the *fork* button:
es_es: Haz clic en el botón *fork*:

source: Now, after a short pause, you should find yourself at the home page for your own forked copy of `Matplotlib`_.
es_es: Ahora, tras una breve pausa, deberías encontrarte en la página de inicio de tu propia copia bifurcada de `Matplotlib`_.
