Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/gitwash/git_resources.po
Languages: es_es

source: git resources
es_es: recursos git

source: Tutorials and summaries
es_es: Tutoriales y resúmenes

source: `github help`_ has an excellent series of how-to guides.
es_es: `github help`_ tiene una excelente serie de guías de cómo hacerlo.

source: The `pro git book`_ is a good in-depth book on git.
es_es: El `pro git book`_ es un buen libro en profundidad sobre git.

source: A `git cheat sheet`_ is a page giving summaries of common commands.
es_es: Una `git cheat sheet`_ es una página que da resúmenes de comandos comunes.

source: The `git user manual`_
es_es: El `git user manual`_

source: The `git tutorial`_
es_es: El `git tutorial`_

source: The `git community book`_
es_es: El `git community book`_

source: `git ready`_ |emdash| a nice series of tutorials
es_es: `git ready`_ |emdash| una bonita serie de tutoriales

source: `git magic`_ |emdash| extended introduction with intermediate detail
es_es: `git magic`_ |emdash| introducción ampliada con detalle intermedio

source: The `git parable`_ is an easy read explaining the concepts behind git.
es_es: La `git parable`_ es una lectura fácil que explica los conceptos detrás de git.

source: `git foundation`_ expands on the `git parable`_.
es_es: La `git foundation`_ se expande sobre la `parábola de git`_.

source: Fernando Perez' git page |emdash| `Fernando's git page`_ |emdash| many links and tips
es_es: Página git de Fernando Pérez |emdash| `Página git de Fernando`_ |emdash| muchos enlaces y consejos

source: A good but technical page on `git concepts`_
es_es: Una página buena pero técnica sobre `git concepts`_

source: `git svn crash course`_: git for those of us used to subversion_
es_es: `git svn crash course`_: git para los que estamos acostumbrados a subversión_

source: Advanced git workflow
es_es: Flujo de trabajo avanzado de git

source: There are many ways of working with git; here are some posts on the rules of thumb that other projects have come up with:
es_es: Hay muchas maneras de trabajar con git; aquí hay algunos posts sobre las reglas generales que otros proyectos han ideado:

source: Linus Torvalds on `git management`_
es_es: Linus Torvalds sobre la `git management`_

source: Linus Torvalds on `linux git workflow`_ . Summary; use the git tools to make the history of your edits as clean as possible; merge from upstream edits as little as possible in branches where you are doing active development.
es_es: Linus Torvalds en `linux git workflow`_ . Resumen; utiliza las herramientas de git para que el historial de tus ediciones sea lo más limpio posible; fusiona a partir de las ediciones del upstream lo menos posible en las ramas en las que estés haciendo un desarrollo activo.

source: Manual pages online
es_es: Páginas del manual en línea

source: You can get these on your own machine with (e.g) ``git help push`` or (same thing) ``git push --help``, but, for convenience, here are the online manual pages for some common commands:
es_es: Puedes obtenerlos en tu propia máquina con (por ejemplo) ``git help push`` o (lo mismo) ``git push --help``, pero, por comodidad, aquí están las páginas de manual online de algunos comandos comunes:
