Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/gitwash/patching.po
Languages: es_es

source: Making a patch
es_es: Haciendo un parche

source: You've discovered a bug or something else you want to change in `Matplotlib`_ .. |emdash| excellent!
es_es: Has descubierto un error o algo que quieres cambiar en `Matplotlib`_ .. |emdash| ¡excelente!

source: You've worked out a way to fix it |emdash| even better!
es_es: Has encontrado la manera de arreglarlo |emdash| ¡aún mejor!

source: You want to tell us about it |emdash| best of all!
es_es: Quieres contárnoslo |emdash| ¡mejor aún!

source: The easiest way is to make a *patch* or set of patches. Here we explain how. Making a patch is the simplest and quickest, but if you're going to be doing anything more than simple quick things, please consider following the :ref:`git-development` model instead.
es_es: La forma más fácil es hacer un *parche* o conjunto de parches. Aquí explicamos cómo. Hacer un parche es lo más sencillo y rápido, pero si vas a hacer algo más que simples cosas rápidas, por favor considera seguir el modelo :ref:`git-development` en su lugar.

source: Making patches
es_es: Haciendo parches

source: Overview
es_es: Resumen

source: Then, send the generated patch files to the `Matplotlib mailing list`_ |emdash| where we will thank you warmly.
es_es: A continuación, envía los archivos de parche generados a la `Lista de correo de Matplotlib`_ |emdash| donde te lo agradeceremos calurosamente.

source: In detail
es_es: En detalle

source: Tell git who you are so it can label the commits you've made::
es_es: Dile a git quién eres para que pueda etiquetar los commits que has hecho::

source: If you don't already have one, clone a copy of the `Matplotlib`_ repository::
es_es: Si aún no tienes uno, clona una copia del repositorio `Matplotlib`_::

source: Make a 'feature branch'. This will be where you work on your bug fix. It's nice and safe and leaves you with access to an unmodified copy of the code in the main branch::
es_es: Has una 'rama de características'. Aquí será donde trabajes en tu corrección de errores. Es agradable y seguro y te deja acceso a una copia no modificada del código en la rama principal::

source: Do some edits, and commit them as you go::
es_es: Realiza algunas ediciones, y confírmalas a medida que avanzas::

source: Note the ``-am`` options to ``commit``. The ``m`` flag just signals that you're going to type a message on the command line. The ``a`` flag |emdash| you can just take on faith |emdash| or see `why the -a flag?`_.
es_es: Observa las opciones ``-am`` para ``commit``. La bandera ``m`` sólo indica que vas a escribir un mensaje en la línea de comandos. La bandera ``a`` |emdash| puedes tomarla por fe |emdash| o ver `why the -a flag?`_.

source: When you have finished, check you have committed all your changes::
es_es: Cuando hayas terminado, comprueba que has confirmado todos los cambios::

source: Finally, make your commits into patches. You want all the commits since you branched from the ``master`` branch::
es_es: Finalmente, convierte sus confirmaciones en parches. Quieres todos los commits desde que te ramificaste de la rama ``master``::

source: You will now have several files named for the commits:
es_es: Ahora tendrás varios archivos con los nombres de los commits:

source: Send these files to the `Matplotlib mailing list`_.
es_es: Envía estos archivos a la `Lista de correo de Matplotlib`_.

source: When you are done, to switch back to the main copy of the code, just return to the ``master`` branch::
es_es: Cuando hayas terminado, para volver a la copia principal del código, simplemente vuelve a la rama ``master``::

source: Moving from patching to development
es_es: Pasando de parcheo a desarrollo

source: If you find you have done some patches, and you have one or more feature branches, you will probably want to switch to development mode. You can do this with the repository you have.
es_es: Si encuentras que has hecho algunos parches, y tienes una o más ramas de características, probablemente querrás cambiar al modo de desarrollo. Puedes hacer esto con el repositorio que tienes.

source: Fork the `Matplotlib`_ repository on github |emdash| :ref:`forking`. Then::
es_es: Fork del repositorio `Matplotlib`_ en github |emdash| :ref:`forking`. Entonces::

source: Then you can, if you want, follow the :ref:`development-workflow`.
es_es: Entonces puedes, si quieres, seguir la :ref:`development-workflow`.
