Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/devel/gitwash/set_up_fork.po
Languages: es_es

source: Set up your fork
es_es: Configura tu fork

source: First you follow the instructions for :ref:`forking`.
es_es: Primero sigue las instrucciones de :ref:`forking`.

source: Overview
es_es: Resumen

source: In detail
es_es: En detalle

source: Clone your fork
es_es: Clona tu fork

source: Clone your fork to the local computer with ``git clone https://github.com/your-user-name/matplotlib.git``
es_es: Clona tu fork en el ordenador local con ``git clone https://github.com/your-user-name/matplotlib.git``

source: Investigate. Change directory to your new repo: ``cd matplotlib``. Then ``git branch -a`` to show you all branches. You'll get something like:
es_es: Investiga. Cambia el directorio a tu nuevo repo: ``cd matplotlib``. Luego ``git branch -a`` para mostrarte todas las ramas. Obtendrás algo como:

source: This tells you that you are currently on the ``master`` branch, and that you also have a ``remote`` connection to ``origin/master``. What remote repository is ``remote/origin``? Try ``git remote -v`` to see the URLs for the remote. They will point to your github fork.
es_es: Esto te dice que estás actualmente en la rama ``master``, y que también tienes una conexión ``remota`` a ``origin/master``. ¿Qué repositorio remoto es ``remote/origin``? Prueba ``git remote -v`` para ver las URLs del remoto. Apuntarán a tu fork de github.

source: Now you want to connect to the upstream `Matplotlib github`_ repository, so you can merge in changes from trunk.
es_es: Ahora quieres conectarte al repositorio `Matplotlib github`_, para poder fusionar los cambios del tronco.

source: Linking your repository to the upstream repo
es_es: Enlazando su repositorio con el repo de aguas arriba

source: ``upstream`` here is just the arbitrary name we're using to refer to the main `Matplotlib`_ repository at `Matplotlib github`_.
es_es: ``upstream`` aquí es sólo el nombre arbitrario que estamos usando para referirnos al repositorio principal de `Matplotlib`_ en `Matplotlib github`_.

source: Note that we've used ``git://`` for the URL rather than ``https://`` or ``git@``. The ``git://`` URL is read only. This means that we can't accidentally (or deliberately) write to the upstream repo, and we are only going to use it to merge into our own code.
es_es: Observa que hemos utilizado ``git://`` para la URL en lugar de ``https://`` o ``git@``. La URL ``git://`` es de sólo lectura. Esto significa que no podemos escribir accidentalmente (o deliberadamente) en el repo de aguas arriba, y que sólo lo vamos a utilizar para fusionar en nuestro propio código.

source: Just for your own satisfaction, show yourself that you now have a new 'remote', with ``git remote -v show``, giving you something like:
es_es: Sólo para tu propia satisfacción, muéstrate a ti mismo que ahora tienes un nuevo "remoto", con ``git remote -v show``, dándote algo como:
