Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.4.0.po
Languages: es_es

source: Setting :rc:`text.hinting` to `False` or `True` is no longer valid; set it to ``"auto"`` or ``"none"`` respectively.
es_es: Establecer :rc:`text.hinting` a `False` o `True` ya no es válido; establécelo a ``"auto"`` o ``"ninguno "`` respectivamente.

source: sample_data removals
es_es: sample_data removedores

source: The sample datasets listed below have been removed. Suggested replacements for demonstration purposes are listed in parentheses.
es_es: Los conjuntos de datos de muestra que se enumeran a continuación se han eliminado. Entre paréntesis se sugieren sustitutos para fines de demostración.

source: ``damodata.csv`` (use ``msft.csv``).
es_es: ``damodata.csv`` (usa ``msft.csv``).

source: Development changes
es_es: Cambios en el desarrollo

source: Increase to minimum supported versions of Python and dependencies
es_es: Aumento de las versiones mínimas soportadas de Python y sus dependencias

source: For Maptlotlib 3.4, the :ref:`minimum supported versions <dependencies>` are being bumped:
es_es: Para Maptlotlib 3.4, las :ref:`versiones mínimas soportadas <dependencies>` están siendo modificadas:

source: Dependency
es_es: Dependencia

source: This is consistent with our :ref:`min_deps_policy` and `NEP29 <https://numpy.org/neps/nep-0029-deprecation_policy.html>`__
es_es: Esto es coherente con nuestra :ref:`min_deps_policy` y `NEP29 <https://numpy.org/neps/nep-0029-deprecation_policy.html>`__

source: Qhull downloaded at build-or-sdist time
es_es: Qhull descargado en tiempo build-or sdist

source: Much like FreeType, Qhull is now downloaded at build time, or upon creation of the sdist. To link against system Qhull, set the ``system_qhull`` option to `True` in the :file:`setup.cfg` file. Note that Matplotlib now requires the re-entrant version of Qhull (``qhull_r``).
es_es: Al igual que FreeType, Qhull se descarga ahora en el momento de la construcción, o al crear el sdist. Para enlazar con el sistema Qhull, establezca la opción ``system_qhull`` a `True` en el archivo :file:`setup.cfg`. Ten en cuenta que Matplotlib ahora requiere la versión reentrante de Qhull (``qhull_r``).

source: ``FigureBase`` class added, and ``Figure`` class made a child
es_es: Se ha añadido la clase ``FigureBase`` y la clase ``Figure`` se ha convertido en un hijo

source: The new subfigure feature motivated some re-organization of the `.figure.Figure` class, so that the new `.figure.SubFigure` class could have all the capabilities of a figure.
es_es: La nueva característica de subfigura motivó una reorganización de la clase `.figure.Figure`, para que la nueva clase `.figure.SubFigure` pudiera tener todas las capacidades de una figura.

source: The `.figure.Figure` class is now a subclass of `.figure.FigureBase`, where `.figure.FigureBase` contains figure-level artist addition routines, and the `.figure.Figure` subclass just contains features that are unique to the outer figure.
es_es: La clase `.figure.Figure` es ahora una subclase de `.figure.FigureBase`, donde `.figure.FigureBase` contiene rutinas de adición de artist a nivel de figura, y la subclase `.figure.Figure` sólo contiene características que son únicas para la figura exterior.

source: Note that there is a new *transSubfigure* transform associated with the subfigure. This transform also exists for a `.Figure` instance, and is equal to *transFigure* in that case, so code that uses the transform stack that wants to place objects on either the parent figure or one of the subfigures should use *transSubfigure*.
es_es: Ten en cuenta que hay una nueva transformación *transSubfigure* asociada a la subfigura. Esta transformación también existe para una instancia `.Figure`, y es igual a *transFigure* en ese caso, por lo que el código que utiliza la pila de transformaciones que quiere colocar objetos en la figura padre o en una de las subfiguras debe utilizar *transSubfigure*.
