Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_1.5.0.po
Languages: es_es

source: API Changes in 1.5.0
es_es: Cambios de API en 1.5.0

source: Code Changes
es_es: Cambios de código

source: Reversed `matplotlib.cbook.ls_mapper`, added `.ls_mapper_r`
es_es: Estimado `matplotlib.cbook.ls_mapper`, añadido `.ls_mapper_r`

source: Formerly, `matplotlib.cbook.ls_mapper` was a dictionary with the long-form line-style names (``"solid"``) as keys and the short forms (``"-"``) as values. This long-to-short mapping is now done by `.ls_mapper_r`, and the short-to-long mapping is done by the `.ls_mapper`.
es_es: Anteriormente, `matplotlib.cbook.ls_mapper` era un diccionario con los nombres de estilo de línea de forma larga (``"sólid"``) como claves y las formas cortas (``"-"``) como valores. Este mapeo long-to-short es realizado ahora por `.ls_mapper_r`, y el mapeo de corto a largo es realizado por el `.ls_mapper`.

source: Prevent moving artists between Axes, Property-ify Artist.axes, deprecate Artist.{get,set}_axes
es_es: Impedir que los artistas se muevan entre Ejes, Propiedad de Artist.axes, Artista desaprobado.{get,set}_axes

source: This was done to prevent an Artist that is already associated with an Axes from being moved/added to a different Axes. This was never supported as it causes havoc with the transform stack. The apparent support for this (as it did not raise an exception) was the source of multiple bug reports and questions on SO.
es_es: Esto se hizo para evitar que un artista que ya está asociado con un hacha fuera movido/agregado a un hacha diferente. Esto nunca fue soportado ya que causa estragos con la pila de transformación. El soporte aparente para esto (ya que no planteaba una excepción) fue el origen de múltiples informes de errores y preguntas sobre SO.

source: For almost all use-cases, the assignment of the axes to an artist should be taken care of by the axes as part of the ``Axes.add_*`` method, hence the deprecation of {get,set}_axes.
es_es: Para casi todos los casos de uso, la asignación de los ejes a un artista debe ser realizada por los ejes como parte de los ``ejes''. Método dd_*``, de ahí la desaprobación de {get,set}_axes.

source: Removing the ``set_axes`` method will also remove the 'axes' line from the ACCEPTS kwarg tables (assuming that the removal date gets here before that gets overhauled).
es_es: Eliminar el método ``set_axes`` también eliminará la línea 'axes' de las tablas kwarg ACCEPTS (asumiendo que la fecha de eliminación llegue hasta aquí antes de que sea revisada).

source: Tightened input validation on 'pivot' kwarg to quiver
es_es: Validación de entrada mejorada en 'pivot' kwarg a quiver

source: Tightened validation so that only {'tip', 'tail', 'mid', and 'middle'} (but any capitalization) are valid values for the *pivot* keyword argument in the `.Quiver` class (and hence `.axes.Axes.quiver` and `.pyplot.quiver` which both fully delegate to `.Quiver`). Previously any input matching 'mid.*' would be interpreted as 'middle', 'tip.*' as 'tip' and any string not matching one of those patterns as 'tail'.
es_es: Validación reforzada para que sólo {'tip', 'tail', 'mid' y 'middle'} (pero cualquier mayúscula) sean valores válidos para el argumento de palabra clave *pivot* en el `. clase uiver` (y por lo tanto `.axes.Axes.quiver` y `. yplot.quiver` que ambos delegan plenamente en `.Quiver`). Anteriormente cualquier entrada que coincida con 'mid. ' sería interpretado como 'middle', 'tip.*' como 'tip' y cualquier cadena que no coincida con uno de esos patrones como 'tail'.

source: The value of `.Quiver.pivot` is normalized to be in the set {'tip', 'tail', 'middle'} in `.Quiver`.
es_es: El valor de `.Quiver.pivot` está normalizado para estar en el conjunto {'tip', 'tail', 'middle'} en `.Quiver`.

source: Reordered ``Axes.get_children``
es_es: Reordenó ``Ejes.get_children``

source: The artist order returned by `.axes.Axes.get_children` did not match the one used by `.axes.Axes.draw`. They now use the same order, as `.axes.Axes.draw` now calls `.axes.Axes.get_children`.
es_es: El orden del artista devuelto por `.axes.Axes.get_children` no coincide con el utilizado por `.axes.Axes.draw`. Ahora usan el mismo orden, como `.axes.Axes.draw` ahora llama `.axes.Axes.get_children`.

source: Changed behaviour of contour plots
es_es: Comportamiento modificado de las parcelas de contorno

source: The default behaviour of :func:`~matplotlib.pyplot.contour` and :func:`~matplotlib.pyplot.contourf` when using a masked array is now determined by the new keyword argument *corner_mask*, or if this is not specified then the new :rc:`contour.corner_mask` instead. The new default behaviour is equivalent to using ``corner_mask=True``; the previous behaviour can be obtained using ``corner_mask=False`` or by changing the rcParam. The example https://matplotlib.org/examples/pylab_examples/contour_corner_mask.html demonstrates the difference. Use of the old contouring algorithm, which is obtained with ``corner_mask='legacy'``, is now deprecated.
es_es: El comportamiento predeterminado de :func:`~matplotlib.pyplot.contour` y :func:`~matplotlib.pyplot. ontourf` al usar una matriz enmascarada ahora está determinado por el nuevo argumento de palabra clave *corner_mask*, o si esto no se especifica, entonces el nuevo :rc:`contour. orner_mask` en su lugar. El nuevo comportamiento por defecto es equivalente al uso de ``corner_mask=True``; el comportamiento anterior se puede obtener usando ``corner_mask=False`` o cambiando el rcParam. El ejemplo https://matplotlib. rg/examples/pylab_examples/contour_corner_mask.html demuestra la diferencia.

source: Contour labels may now appear in different places than in earlier versions of Matplotlib.
es_es: Las etiquetas de contorno pueden aparecer ahora en diferentes lugares que en versiones anteriores de Matplotlib.

source: In addition, the keyword argument *nchunk* now applies to :func:`~matplotlib.pyplot.contour` as well as :func:`~matplotlib.pyplot.contourf`, and it subdivides the domain into subdomains of exactly *nchunk* by *nchunk* quads, whereas previously it was only roughly *nchunk* by *nchunk* quads.
es_es: Además, el argumento de palabra clave *nchunk* ahora se aplica a :func:`~matplotlib.pyplot.contour` así como :func:`~matplotlib.pyplot. ontourf`, y subdivide el dominio en subdominios de exactamente *nchunk* por quads *nchunk*, mientras que anteriormente sólo era aproximadamente *nchunk* por quads *nchunk*.

source: The C/C++ object that performs contour calculations used to be stored in the public attribute ``QuadContourSet.Cntr``, but is now stored in a private attribute and should not be accessed by end users.
es_es: El objeto C/C++ que realiza cálculos de contorno utilizados para ser almacenados en el atributo público ``QuadContourSet. ntr``, pero ahora se almacena en un atributo privado y los usuarios finales no deberían acceder a él.

source: Added set_params function to all Locator types
es_es: Se añadió la función set_params a todos los tipos de localizador

source: This was a bug fix targeted at making the api for Locators more consistent.
es_es: Esta era una corrección de errores dirigida a hacer más consistente la api para localizadores.

source: In the old behavior, only locators of type MaxNLocator have set_params() defined, causing its use on any other Locator to raise an AttributeError *( aside: set_params(args) is a function that sets the parameters of a Locator instance to be as specified within args)*. The fix involves moving set_params() to the Locator class such that all subtypes will have this function defined.
es_es: En el comportamiento antiguo, sólo los localizadores del tipo MaxNLocator tienen definidos set_params(), causando su uso en cualquier otro Locator para generar un AttributeError *( así: set_params(args) es una función que establece que los parámetros de una instancia de Locator serán especificados dentro de los args)*. La corrección implica mover set_params() a la clase Localizador de tal forma que todos los subtipos tengan definida esta función.

source: Since each of the Locator subtypes have their own modifiable parameters, a universal set_params() in Locator isn't ideal. Instead, a default no-operation function that raises a warning is implemented in Locator. Subtypes extending Locator will then override with their own implementations. Subtypes that do not have a need for set_params() will fall back onto their parent's implementation, which raises a warning as intended.
es_es: Dado que cada uno de los subtipos Locator tiene sus propios parámetros modificables, un set_params() universal en Locator no es ideal. En su lugar, una función de no-operación por defecto que levanta una advertencia está implementada en Locator. Los subtipos que extienden el Locator entonces anularán con sus propias implementaciones. Los subtipos que no tengan necesidad de set_params() caerán en la implementación de su padre, lo que plantea una advertencia como se pretende.

source: In the new behavior, Locator instances will not raise an AttributeError when set_params() is called. For Locators that do not implement set_params(), the default implementation in Locator is used.
es_es: En el nuevo comportamiento, las instancias Localizador no generarán un AttributeError cuando set_params() sea llamado. Para Locators que no implementan set_params(), se utiliza la implementación por defecto en Locator.

source: Disallow ``None`` as x or y value in ax.plot
es_es: Rechaza el valor de «x» o «y» en ax.plot

source: Do not allow ``None`` as a valid input for the ``x`` or ``y`` args in `.axes.Axes.plot`. This may break some user code, but this was never officially supported (ex documented) and allowing ``None`` objects through can lead to confusing exceptions downstream.
es_es: No permita ``Ninguno`` como una entrada válida para los argumentos ``x`` o ``y`` en `.axes.Axes.plot`. Esto puede romper algún código de usuario, pero esto nunca fue soportado oficialmente (ex documentado) y permitir a través de los objetos ``Ning`` puede llevar a confusas excepciones aguas abajo.

source: To create an empty line use ::
es_es: Para crear una línea vacía use ::

source: In either case to update the data in the `.Line2D` object you must update both the ``x`` and ``y`` data.
es_es: En cualquier caso para actualizar los datos en el objeto `.Line2D` debe actualizar tanto los datos ``x`` como ``y``.

source: Removed *args* and *kwargs* from `.MicrosecondLocator.__call__`
es_es: Se han eliminado *args* y *kwargs* de `.MicrosecondLocator.__call__`

source: The call signature of :meth:`~matplotlib.dates.MicrosecondLocator.__call__` has changed from ``__call__(self, *args, **kwargs)`` to ``__call__(self)``. This is consistent with the superclass :class:`~matplotlib.ticker.Locator` and also all the other Locators derived from this superclass.
es_es: La firma de la llamada de :meth:`~matplotlib.dates.MicrosecondLocator.__call__` ha cambiado de ``__call__(yo, *args, **kwargs)`` a ``__call__(self)``. Esto es consistente con la superclase :class:`~matplotlib.ticker.Locator` y también con el resto de Locators derivados de esta superclase.

source: No `ValueError` for the MicrosecondLocator and YearLocator
es_es: No hay 'ValueError' para el MicrosecondLocator y el Localizador de Año

source: The :class:`~matplotlib.dates.MicrosecondLocator` and :class:`~matplotlib.dates.YearLocator` objects when called will return an empty list if the axes have no data or the view has no interval. Previously, they raised a `ValueError`. This is consistent with all the Date Locators.
es_es: El :class:`~matplotlib.dates.MicrosecondLocator` y :class:`~matplotlib.dates. los objetos earLocator` cuando son llamados devolverán una lista vacía si los ejes no tienen datos o la vista no tiene intervalo. Anteriormente, plantearon un `ValueError`. Esto es consistente con todos los Localizadores de fechas.

source: 'OffsetBox.DrawingArea' respects the 'clip' keyword argument
es_es: 'OffsetBox.DrawingArea' respeta el argumento de palabra clave 'clip'

source: The call signature was ``OffsetBox.DrawingArea(..., clip=True)`` but nothing was done with the *clip* argument. The object did not do any clipping regardless of that parameter. Now the object can and does clip the child `.Artist`\ s if they are set to be clipped.
es_es: La firma de llamada fue ``OffsetBox.DrawingArea(..., clip=True)`` pero no se hizo nada con el argumento *clip*. El objeto no hizo ningún recorte independientemente de ese parámetro. Ahora el objeto puede y hace clip al hijo `.Artist`\ s si están configurados para ser recortados.

source: You can turn off the clipping on a per-child basis using ``child.set_clip_on(False)``.
es_es: Puede desactivar el recorte por hijo usando ``child.set_clip_on(False)``.

source: Add salt to clipPath id
es_es: Añadir sal al id del clipPath

source: Add salt to the hash used to determine the id of the ``clipPath`` nodes. This is to avoid conflicts when two svg documents with the same clip path are included in the same document (see https://github.com/ipython/ipython/issues/8133 and https://github.com/matplotlib/matplotlib/issues/4349 ), however this means that the svg output is no longer deterministic if the same figure is saved twice. It is not expected that this will affect any users as the current ids are generated from an md5 hash of properties of the clip path and any user would have a very difficult time anticipating the value of the id.
es_es: Agrega sal al hash usado para determinar el id de los nodos ``clipPath``. Esto es para evitar conflictos cuando dos documentos svg con la misma ruta de clip son incluidos en el mismo documento (ver https://github.com/ipython/ipython/issues/8133 y https://github. om/matplotlib/matplotlib/issues/4349 ), sin embargo, esto significa que la salida svg ya no es determinista si la misma figura se guarda dos veces. No se espera que esto afecte a ningún usuario ya que los ids actuales se generan a partir de un hash md5 de propiedades de la ruta del clip y cualquier usuario tendría un tiempo muy difícil anticiparse el valor del id.

source: Changed snap threshold for circle markers to inf
es_es: Umbral de snap cambiado para marcadores circulares a inf

source: When drawing circle markers above some marker size (previously 6.0) the path used to generate the marker was snapped to pixel centers. However, this ends up distorting the marker away from a circle. By setting the snap threshold to inf snapping is never done on circles.
es_es: Al dibujar marcadores circulares por encima del tamaño de algunos marcadores (anteriormente 6.0) la ruta utilizada para generar el marcador se desplazó a los centros de píxeles. Sin embargo, esto acaba distorsionando el marcador lejos de un círculo. Al fijar el umbral del chorro a inf nunca se hace en círculos.

source: This change broke several tests, but is an improvement.
es_es: Este cambio rompió varias pruebas, pero es una mejora.

source: Preserve units with Text position
es_es: Conservar unidades con posición de texto

source: Previously the 'get_position' method on Text would strip away unit information even though the units were still present. There was no inherent need to do this, so it has been changed so that unit data (if present) will be preserved. Essentially a call to 'get_position' will return the exact value from a call to 'set_position'.
es_es: Anteriormente, el método 'get_position' en Text eliminaría la información de las unidades, aunque las unidades estuvieran todavía presentes. No había ninguna necesidad inherente de hacer esto, por lo que se ha modificado para que los datos unitarios (si están presentes) se conserven. Esencialmente una llamada a 'get_position' devolverá el valor exacto de una llamada a 'set_position'.

source: If you wish to get the old behaviour, then you can use the new method called 'get_unitless_position'.
es_es: Si desea obtener el comportamiento antiguo, entonces puede utilizar el nuevo método llamado 'get_unitless_position'.

source: New API for custom Axes view changes
es_es: Nueva API para cambios personalizados en la vista de ejes

source: Interactive pan and zoom were previously implemented using a Cartesian-specific algorithm that was not necessarily applicable to custom Axes. Three new private methods, ``matplotlib.axes._base._AxesBase._get_view``, ``matplotlib.axes._base._AxesBase._set_view``, and ``matplotlib.axes._base._AxesBase._set_view_from_bbox``, allow for custom *Axes* classes to override the pan and zoom algorithms. Implementors of custom *Axes* who override these methods may provide suitable behaviour for both pan and zoom as well as the view navigation buttons on the interactive toolbars.
es_es: Anteriormente se implementaron pan y zoom interactivo utilizando un algoritmo específico de Cartesia que no era necesariamente aplicable a ejes personalizados. Tres nuevos métodos privados, ``matplotlib.axes._base._AxesBase._get_view``, ``matplotlib.axes._base._AxesBase._set_view``, y ``matplotlib.axes. base._AxesBase._set_view_from_bbox``, permite que las clases personalizadas de *Ejes* sobreescriban los algoritmos de desplazamiento y zoom. Los implementadores de *Ejes* personalizados que sobreescriban estos métodos pueden proporcionar un comportamiento adecuado tanto para pan como para zoom, así como los botones de navegación de vista en las barras de herramientas interactivas.

source: MathTex visual changes
es_es: Cambios visuales de MathTex

source: The spacing commands in mathtext have been changed to more closely match vanilla TeX.
es_es: Los comandos de espaciado en el texto de matemáticas se han cambiado para coincidir más estrechamente con el TeX de la vainilla.

source: Improved spacing in mathtext
es_es: Espacio mejorado en matemáticas

source: The extra space that appeared after subscripts and superscripts has been removed.
es_es: Se ha eliminado el espacio extra que apareció después de los suscriptores y las supercifras.

source: No annotation coordinates wrap
es_es: No hay coordenadas de anotación

source: In #2351 for 1.4.0 the behavior of ['axes points', 'axes pixel', 'figure points', 'figure pixel'] as coordinates was change to no longer wrap for negative values. In 1.4.3 this change was reverted for 'axes points' and 'axes pixel' and in addition caused 'axes fraction' to wrap. For 1.5 the behavior has been reverted to as it was in 1.4.0-1.4.2, no wrapping for any type of coordinate.
es_es: En #2351 para 1.4. el comportamiento de ['puntos de ejes', 'píxeles de ejes', 'puntos de figura', 'píxel de figura'] ya que las coordenadas cambiaban a no volver a envolver para valores negativos. En 1.4. este cambio fue revertido para "puntos de ejes" y "píxeles de ejes" y además hizo que "fracción" de "ejes". Para 1.5 el comportamiento ha sido revertido a como lo fue en 1.4.0-1.4.2, sin envoltura para ningún tipo de coordenada.

source: Deprecation
es_es: Deprecación

source: Deprecated ``GraphicsContextBase.set_graylevel``
es_es: Obsoleto ``GraphicsContextBase.set_graylevel``

source: The ``GraphicsContextBase.set_graylevel`` function has been deprecated in 1.5 and will be removed in 1.6. It has been unused. The `.GraphicsContextBase.set_foreground` could be used instead.
es_es: La función ``GraphicsContextBase.set_graylevel`` ha sido obsoleta en 1.5 y será eliminada en 1.6. Ha sido inutilizada. El `.GraphicsContextBase.set_foreground` podría ser usado en su lugar.

source: deprecated idle_event
es_es: idle_event obsoleto

source: The ``idle_event`` was broken or missing in most backends and causes spurious warnings in some cases, and its use in creating animations is now obsolete due to the animations module. Therefore code involving it has been removed from all but the wx backend (where it partially works), and its use is deprecated. The `.animation` module may be used instead to create animations.
es_es: El ``idle_event`` se ha roto o faltado en la mayoría de los backends y causa advertencias espías en algunos casos, y su uso en la creación de animaciones es ahora obsoleto debido al módulo de animaciones. Por lo tanto, el código que lo involucra ha sido eliminado de todo excepto el backend wx (donde funciona parcialmente), y su uso está obsoleto. El módulo `.animation` puede utilizarse en su lugar para crear animaciones.

source: ``color_cycle`` deprecated
es_es: ``color_ciclo`` obsoleto

source: In light of the new property cycling feature, the Axes method ``set_color_cycle`` is now deprecated. Calling this method will replace the current property cycle with one that cycles just the given colors.
es_es: A la luz de la nueva característica de ciclo de propiedades, el método Axes ``set_color_cycle`` ahora está obsoleto. Llamar a este método reemplazará el ciclo de propiedad actual por uno que cicla sólo los colores dados.

source: Similarly, the rc parameter *axes.color_cycle* is also deprecated in lieu of the new :rc:`axes.prop_cycle` parameter. Having both parameters in the same rc file is not recommended as the result cannot be predicted. For compatibility, setting *axes.color_cycle* will replace the cycler in :rc:`axes.prop_cycle` with a color cycle. Accessing *axes.color_cycle* will return just the color portion of the property cycle, if it exists.
es_es: Del mismo modo, el parámetro rc *axes.color_cycle* también está obsoleto en lugar de los nuevos ejes :rc:`. parámetro rop_cycle`. Tener ambos parámetros en el mismo archivo rc no se recomienda como resultado no se puede predecir. Por compatibilidad, establecer *axes.color_cycle* reemplazará al ciclador en :rc:`axes.prop_cycle` con un ciclo de color. Acceder a *axes.color_cycle* devolverá sólo la porción de color del ciclo de propiedad, si existe.

source: Timeline for removal has not been set.
es_es: No se ha establecido la línea de tiempo para la eliminación.

source: Bundled jquery
es_es: Jquery empaquetado

source: The version of jquery bundled with the webagg backend has been upgraded from 1.7.1 to 1.11.3. If you are using the version of jquery bundled with webagg you will need to update your html files as such
es_es: La versión de jquery incluida con el backend de webagg se ha actualizado de 1.7.1 a 1.11.3. Si está utilizando la versión de jquery incluida con webagg necesitará actualizar sus archivos html como tal

source: Code Removed
es_es: Código eliminado

source: Removed ``Image`` from main namespace
es_es: Se ha eliminado el ``Imágenes`` del espacio de nombres principal

source: ``Image`` was imported from PIL/pillow to test if PIL is available, but there is no reason to keep ``Image`` in the namespace once the availability has been determined.
es_es: ``Imagen`` fue importado desde PIL/almohada para probar si PIL está disponible, pero no hay ninguna razón para mantener ``Image`` en el espacio de nombres una vez que se haya determinado la disponibilidad.

source: Removed ``lod`` from Artist
es_es: Se ha eliminado ``lod`` del Artista

source: Removed the method ``set_lod`` and all references to the attribute ``_lod`` as they are not used anywhere else in the code base. It appears to be a feature stub that was never built out.
es_es: Se ha eliminado el método ``set_lod`` y todas las referencias al atributo ``_lod`` ya que no se utilizan en ninguna otra parte en la base de código. Parece ser un stub de características que nunca fue construido.

source: Removed threading related classes from cbook
es_es: Eliminadas clases relacionadas con hilos de cbook

source: The classes ``Scheduler``, ``Timeout``, and ``Idle`` were in cbook, but are not used internally. They appear to be a prototype for the idle event system which was not working and has recently been pulled out.
es_es: Las clases ``Scheduler``, ``Timeout``, y ``Idle`` estaban en cbook, pero no se usan internamente. Parecen ser un prototipo para el sistema de eventos inactivos que no funcionaba y que recientemente se ha retirado.
