Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.4.0.po
Languages: es_es

source: WebAgg backend no longer reports a middle click as a right click
es_es: El backend de WebAgg ya no reporta un clic central como un clic derecho

source: Previously when using the WebAgg backend the event passed to a callback by ``fig.canvas.mpl_connect('mouse_button_event', callback)`` on a middle click would report `.MouseButton.RIGHT` instead of `.MouseButton.MIDDLE`.
es_es: Anteriormente, cuando se utilizaba el backend de WebAgg, el evento pasado a una llamada de retorno por ``fig.canvas.mpl_connect('mouse_button_event', callback)`` en un clic central informaba de `.MouseButton.RIGHT` en lugar de `.MouseButton.MIDDLE`.

source: ID attribute of XML tags in SVG files now based on SHA256 rather than MD5
es_es: El atributo ID de las etiquetas XML en los archivos SVG se basa ahora en SHA256 en lugar de MD5

source: Matplotlib generates unique ID attributes for various tags in SVG files. Matplotlib previously generated these unique IDs using the first 10 characters of an MD5 hash. The MD5 hashing algorithm is not available in Python on systems with Federal Information Processing Standards (FIPS) enabled. Matplotlib now uses the first 10 characters of an SHA256 hash instead. SVG files that would otherwise match those saved with earlier versions of matplotlib, will have different ID attributes.
es_es: Matplotlib genera atributos de ID únicos para varias etiquetas en archivos SVG. Matplotlib generaba anteriormente estos ID únicos utilizando los 10 primeros caracteres de un hash MD5. El algoritmo de hash MD5 no está disponible en Python en sistemas con los Estándares Federales de Procesamiento de Información (FIPS) habilitados. Ahora Matplotlib utiliza los 10 primeros caracteres de un hash SHA256. Los archivos SVG que, de otro modo, coincidirían con los guardados con versiones anteriores de matplotlib, tendrán atributos de identificación diferentes.

source: ``RendererPS.set_font`` is no longer a no-op in AFM mode
es_es: ``RendererPS.set_font`` ya no es un no-op Moda AFM

source: `.RendererPS.set_font` now sets the current PostScript font in all cases.
es_es: `.RendererPS.set_font` ahora establece la fuente PostScript actual en todos los casos.

source: Autoscaling in Axes3D
es_es: Autoescalado en Axes3D

source: In Matplotlib 3.2.0, autoscaling was made lazier for 2D Axes, i.e., limits would only be recomputed when actually rendering the canvas, or when the user queries the Axes limits. This performance improvement is now extended to `.Axes3D`. This also fixes some issues with autoscaling being triggered unexpectedly in Axes3D.
es_es: En Matplotlib 3.2.0, el autoescalado se hizo más perezoso para los Ejes 2D, es decir, los límites sólo se volverían a calcular cuando se renderizara el lienzo, o cuando el usuario consultara los límites de los Ejes. Esta mejora de rendimiento se extiende ahora a `.Axes3D`. También se han arreglado algunas incidencias con el autoescalado que se activaba inesperadamente en Axes3D.

source: Please see :ref:`the API change for 2D Axes <api-changes-3-2-0-autoscaling>` for further details.
es_es: Por favor, consulta :ref:`el cambio de la API para los ejes 2D <api-changes-3-2-0-autoscaling>` para más detalles.

source: Axes3D automatically adding itself to Figure is deprecated
es_es: Axes3D se agrega automáticamente a la Figura es obsoleto

source: New `.Axes3D` objects previously added themselves to figures when they were created, unlike all other Axes classes, which lead to them being added twice if ``fig.add_subplot(111, projection='3d')`` was called.
es_es: Los nuevos objetos `.Axes3D` se añadían previamente a las figuras cuando se creaban, a diferencia de las demás clases de Ejes, lo que hacía que se añadieran dos veces si se invocaba ``fig.add_subplot(111, projection='3d')``.

source: This behavior is now deprecated and will warn. The new keyword argument *auto_add_to_figure* controls the behavior and can be used to suppress the warning. The default value will change to *False* in Matplotlib 3.5, and any non-*False* value will be an error in Matplotlib 3.6.
es_es: Este comportamiento está ahora obsoleto y avisará. El nuevo argumento de palabra clave *auto_add_to_figure* controla el comportamiento y puede utilizarse para suprimir la advertencia. El valor por defecto cambiará a *False* en Matplotlib 3.5, y cualquier valor que no sea *False* será un error en Matplotlib 3.6.

source: In the future, `.Axes3D` will need to be explicitly added to the figure ::
es_es: En el futuro, habrá que añadir explícitamente `.Axes3D` a la figura ::

source: as needs to be done for other `.axes.Axes` sub-classes. Or, a 3D projection can be made via::
es_es: como hay que hacer para otras subclases `.axes.Axes`. O bien, se puede hacer una proyección 3D a través de::

source: ``mplot3d.art3d.get_dir_vector`` always returns NumPy arrays
es_es: ``mplot3d.art3d.get_dir_vector`` siempre devuelve arreglos NumPy

source: For consistency, `~.mplot3d.art3d.get_dir_vector` now always returns NumPy arrays, even if the input is a 3-element iterable.
es_es: Por consistencia, `~.mplot3d.art3d.get_dir_vector` ahora siempre devuelve arreglos NumPy, incluso si la entrada es un iterable de 3 elementos.

source: Changed cursive and fantasy font definitions
es_es: Modificación de las definiciones de las fuentes cursivas y de fantasía

source: The Comic Sans and Comic Neue fonts were moved from the default :rc:`font.fantasy` list to the default :rc:`font.cursive` setting, in accordance with the CSS font families example_ and in order to provide a cursive font present in Microsoft's Core Fonts set.
es_es: Las fuentes Comic Sans y Comic Neue se han movido de la lista por defecto :rc:`font.fantasy` a la configuración por defecto :rc:`font.cursive`, de acuerdo con el ejemplo de familias de fuentes CSS_ y con el fin de proporcionar una fuente cursiva presente en el conjunto de fuentes básicas de Microsoft.

source: docstring.Substitution now always dedents docstrings before string interpolation
es_es: docstring.Substitution ahora siempre deduce los docstrings antes de la interpolación de cadenas

source: Deprecations
es_es: Obsolescencias

source: Extra parameters to Axes constructor
es_es: Parámetros adicionales para el constructor de ejes

source: Parameters of the Axes constructor other than *fig* and *rect* will become keyword-only in a future version.
es_es: Los parámetros del constructor Axes que no sean *fig* y *rect* se convertirán en palabras clave en una futura versión.

source: ``pyplot.gca`` and ``Figure.gca`` keyword arguments
es_es: Argumentos de la palabra clave ``pyplot.gca`` y ``Figure.gca``

source: Passing keyword arguments to `.pyplot.gca` or `.figure.Figure.gca` will not be supported in a future release.
es_es: Pasar argumentos de palabras clave a `.pyplot.gca` o `.figure.Figure.gca` no será soportado en una futura versión.

source: ``Axis.cla``, ``RadialAxis.cla``, ``ThetaAxis.cla`` and ``Spine.cla``
es_es: ``Axis.cla``, ``RadialAxis.cla``, ``ThetaAxis.cla`` y ``Spine.cla``

source: These methods are deprecated in favor of the respective ``clear()`` methods.
es_es: Estos métodos están obsoletos en favor de los respectivos métodos ``clear()``.

source: Invalid hatch pattern characters are no longer ignored
es_es: Ya no se ignoran los caracteres inválidos del patrón de sombreado

source: When specifying hatching patterns, characters that are not recognized will raise a deprecation warning. In the future, this will become a hard error.
es_es: Cuando se especifican patrones de sombreado, los caracteres que no se reconocen generan una advertencia de obsolescencia. En el futuro, esto se convertirá en un error grave.

source: ``imread`` reading from URLs
es_es: ``imread`` lectura de URLs

source: Passing a URL to `~.pyplot.imread()` is deprecated. Please open the URL for reading and directly use the Pillow API (``PIL.Image.open(urllib.request.urlopen(url))``, or ``PIL.Image.open(io.BytesIO(requests.get(url).content))``) instead.
es_es: Pasar una URL a `~.pyplot.imread()` está obsoleto. Por favor, abra la URL para su lectura y utilice directamente la API de Pillow (``PIL.Image.open(urllib.request.urlopen(url))``, o ``PIL.Image.open(io.BytesIO(requests.get(url).content))``) en su lugar.

source: Subplot-related attributes and methods
es_es: Atributos y métodos relacionados con los subgráficos

source: Some ``SubplotBase`` methods and attributes have been deprecated and/or moved to `.SubplotSpec`:
es_es: Algunos métodos y atributos de ``SubplotBase`` han quedado obsoletos y/o se han trasladado a `.SubplotSpec`:

source: ``get_geometry`` (use `.SubplotBase.get_subplotspec` instead),
es_es: ``get_geometry`` (usa `.SubplotBase.get_subplotspec` en su lugar),

source: ``change_geometry`` (use `.SubplotBase.set_subplotspec` instead),
es_es: ``change_geometry`` (usa `.SubplotBase.set_subplotspec` en su lugar),

source: ``is_first_row``, ``is_last_row``, ``is_first_col``, ``is_last_col`` (use the corresponding methods on the `.SubplotSpec` instance instead),
es_es: ``is_first_row``, ``is_last_row``, ``is_first_col``, ``is_last_col`` (utiliza los métodos correspondientes en la instancia `.SubplotSpec`),

source: ``update_params`` (now a no-op),
es_es: ``update_params`` (ahora un no-op),

source: ``figbox`` (use ``ax.get_subplotspec().get_geometry(ax.figure)`` instead to recompute the geometry, or ``ax.get_position()`` to read its current value),
es_es: ``figbox`` (utiliza ``ax.get_subplotspec().get_geometry(ax.figure)`` para recalcular la geometría, o ``ax.get_position()`` para leer su valor actual),

source: ``numRows``, ``numCols`` (use the ``nrows`` and ``ncols`` attribute on the `.GridSpec` instead).
es_es: ``numRows``, ``numCols`` (utiliza el atributo ``nrows`` y ``ncols`` en el `.GridSpec`).

source: Likewise, the ``get_geometry``, ``change_geometry``, ``update_params``, and ``figbox`` methods/attributes of `.SubplotDivider` have been deprecated, with similar replacements.
es_es: Asimismo, los métodos/atributos ``get_geometry``, ``change_geometry``, ``update_params`` y ``figbox`` de `.SubplotDivider` han quedado obsoletos, con sustituciones similares.

source: ``is_url`` and ``URL_REGEX``
es_es: ``is_url`` y ``URL_REGEX``

source: ... are deprecated. (They were previously defined in the toplevel :mod:`matplotlib` module.)
es_es: ... están obsoletos. (Anteriormente se definían en el módulo toplevel :mod:`matplotlib`.)

source: ``matplotlib.style.core`` deprecations
es_es: ``matplotlib.style.core`` obsolescencias

source: ``STYLE_FILE_PATTERN``, ``load_base_library``, and ``iter_user_libraries`` are deprecated.
es_es: ``STYLE_FILE_PATTERN``, ``load_base_library`` y ``iter_user_libraries`` están obsoletos.

source: ``dpi_cor`` property of `.FancyArrowPatch`
es_es: propiedad ``dpi_cor`` de `.FancyArrowPatch`

source: This parameter is considered internal and deprecated.
es_es: Este parámetro se considera interno y está obsoleto.

source: Passing ``boxstyle="custom", bbox_transmuter=...`` to ``FancyBboxPatch``
es_es: Pasando ``boxstyle="custom", bbox_transmuter=...`` a ``FancyBboxPatch``

source: In order to use a custom boxstyle, directly pass it as the *boxstyle* argument to `.FancyBboxPatch`. This was previously already possible, and is consistent with custom arrow styles and connection styles.
es_es: Para utilizar un estilo de caja personalizado, pásalo directamente como argumento *boxstyle* a `.FancyBboxPatch`. Esto ya era posible anteriormente, y es coherente con los estilos de flecha y de conexión personalizados.

source: BoxStyles are now called without passing the *mutation_aspect* parameter
es_es: Los BoxStyles se llaman ahora sin pasar el parámetro *mutation_aspect*

source: Mutation aspect is now handled by the artist itself. Hence the *mutation_aspect* parameter of ``BoxStyle._Base.__call__`` is deprecated, and custom boxstyles should be implemented to not require this parameter (it can be left as a parameter defaulting to 1 for back-compatibility).
es_es: El aspecto de la mutación es ahora manejado por el propio artist. Por lo tanto, el parámetro *mutation_aspect* de ``BoxStyle._Base.__call__`` está obsoleto, y los estilos de caja personalizados deberían implementarse para no requerir este parámetro (puede dejarse como parámetro por defecto a 1 para la retrocompatibilidad).

source: ``ContourLabeler.get_label_coords`` is deprecated
es_es: ``ContourLabeler.get_label_coords`` está obsoleto

source: It is considered an internal helper.
es_es: Se considera una ayuda interna.

source: Line2D and Patch no longer duplicate ``validJoin`` and ``validCap``
es_es: Line2D y Patch ya no duplican ``validJoin`` y ``validCap``

source: Validation of joinstyle and capstyles is now centralized in ``rcsetup``.
es_es: La validación de joinstyle y capstyles está ahora centralizada en ``rcsetup``.

source: Setting a Line2D's pickradius via ``set_picker`` is undeprecated
es_es: Establecer el radio de la línea 2D a través de ``set_picker`` es obsoleto

source: This cancels the deprecation introduced in Matplotlib 3.3.0.
es_es: Esto anula la obsolescencia introducida en Matplotlib 3.3.0.

source: ``MarkerStyle`` is considered immutable
es_es: ``MarkerStyle`` se considera inmutable

source: ``MarkerStyle.set_fillstyle()`` and ``MarkerStyle.set_marker()`` are deprecated. Create a new ``MarkerStyle`` with the respective parameters instead.
es_es: ``MarkerStyle.set_fillstyle()`` y ``MarkerStyle.set_marker()`` están obsoletos. En su lugar, crea un nuevo ``MarkerStyle`` con los parámetros respectivos.

source: ``MovieWriter.cleanup`` is deprecated
es_es: ``MovieWriter.cleanup`` está obsoleto

source: Cleanup logic is now fully implemented in `.MovieWriter.finish`. Third-party movie writers should likewise move the relevant cleanup logic there, as overridden ``cleanup``\s will no longer be called in the future.
es_es: La lógica de limpieza está ahora completamente implementada en `.MovieWriter.finish`. Los escritores de películas de terceros también deberían trasladar la lógica de limpieza relevante allí, ya que las sobreescrituras de ``cleanup`` ya no se llamarán en el futuro.

source: *minimumdescent* parameter/property of ``TextArea``
es_es: parámetro/propiedad *minimumdescent* de ``TextArea``

source: `.offsetbox.TextArea` has behaved as if *minimumdescent* was always True (regardless of the value to which it was set) since Matplotlib 1.3, so the parameter/property is deprecated.
es_es: `.offsetbox.TextArea` se ha comportado como si el *descenso mínimo* fuera siempre Verdadero (independientemente del valor al que se establezca) desde Matplotlib 1.3, por lo que el parámetro/propiedad está obsoleto.

source: ``colorbar`` now warns when the mappable's Axes is different from the current Axes
es_es: ``colorbar`` ahora avisa cuando los Ejes del mapeable son diferentes de los Ejes actuales

source: Currently, `.Figure.colorbar` and `.pyplot.colorbar` steal space by default from the current Axes to place the colorbar. In a future version, they will steal space from the mappable's Axes instead. In preparation for this change, `.Figure.colorbar` and `.pyplot.colorbar` now emits a warning when the current Axes is not the same as the mappable's Axes.
es_es: Actualmente, `.Figure.colorbar` y `.pyplot.colorbar` roban espacio por defecto de los Ejes actuales para colocar la barra de colores. En una versión futura, robarán espacio de los ejes del mapeable. En preparación para este cambio, `.Figure.colorbar` y `.pyplot.colorbar` emiten ahora una advertencia cuando los Ejes actuales no son los mismos que los del mappable.

source: Colorbar docstrings
es_es: Cadena de documentación de la barra de colores

source: The following globals in :mod:`matplotlib.colorbar` are deprecated: ``colorbar_doc``, ``colormap_kw_doc``, ``make_axes_kw_doc``.
es_es: Los siguientes globales en :mod:`matplotlib.colorbar` son obsoletos: ``colorbar_doc``, ``colormap_kw_doc``, ``make_axes_kw_doc``.

source: ``ColorbarPatch`` and ``colorbar_factory`` are deprecated
es_es: ``ColorbarPatch`` y ``colorbar_factory`` están obsoletos

source: All the relevant functionality has been moved to the `~matplotlib.colorbar.Colorbar` class.
es_es: Toda la funcionalidad relevante ha sido trasladada a la clase `~matplotlib.colorbar.Colorbar`.

source: Backend deprecations
es_es: Obsolescencia del backend

source: ``FigureCanvasBase.get_window_title`` and ``FigureCanvasBase.set_window_title`` are deprecated. Use the corresponding methods on the FigureManager if using pyplot, or GUI-specific methods if embedding.
es_es: Los métodos ``FigureCanvasBase.get_window_title`` y ``FigureCanvasBase.set_window_title`` están obsoletos. Utiliza los métodos correspondientes en el FigureManager si usas pyplot, o los métodos específicos de la IGU si usas embedding.

source: The *resize_callback* parameter to ``FigureCanvasTk`` was never used internally and is deprecated. Tk-level custom event handlers for resize events can be added to a ``FigureCanvasTk`` using e.g. ``get_tk_widget().bind('<Configure>', ..., True)``.
es_es: El parámetro *resize_callback* de ``FigureCanvasTk`` nunca se ha utilizado internamente y está obsoleto. Se pueden añadir manejadores de eventos personalizados a nivel Tk para eventos de redimensionamiento a un ``FigureCanvasTk`` utilizando, por ejemplo, ``get_tk_widget().bind('<Configure>', ..., True)``.

source: The ``key_press`` and ``button_press`` methods of `.FigureManagerBase`, which incorrectly did nothing when using ``toolmanager``, are deprecated in favor of directly passing the event to the `.CallbackRegistry` via ``self.canvas.callbacks.process(event.name, event)``.
es_es: Los métodos ``key_press`` y ``button_press`` de `.FigureManagerBase`, que incorrectamente no hacían nada cuando se usaba ``toolmanager``, están obsoletos en favor de pasar directamente el evento a `.CallbackRegistry` vía ``self.canvas.callbacks.process(event.name, event)``.

source: ``RendererAgg.get_content_extents`` and ``RendererAgg.tostring_rgba_minimized`` are deprecated.
es_es: ``RendererAgg.get_content_extents`` y ``RendererAgg.tostring_rgba_minimized`` están obsoletos.

source: ``backend_pgf.TmpDirCleaner`` is deprecated, with no replacement.
es_es: ``backend_pgf.TmpDirCleaner`` está obsoleto, sin reemplazo.

source: ``GraphicsContextPS`` is deprecated. The PostScript backend now uses `.GraphicsContextBase`.
es_es: ``GraphicsContextPS`` está obsoleto. El backend PostScript utiliza ahora `.GraphicsContextBase`.

source: wx backend cleanups
es_es: limpieza del backend de wx

source: The *origin* parameter to ``_FigureCanvasWxBase.gui_repaint`` is deprecated with no replacement; ``gui_repaint`` now automatically detects the case where it is used with the wx renderer.
es_es: El parámetro *origin* de ``_FigureCanvasWxBase.gui_repaint`` está obsoleto y no tiene reemplazo; ``gui_repaint`` ahora detecta automáticamente el caso en que se usa con el renderizador wx.

source: The ``NavigationToolbar2Wx.get_canvas`` method is deprecated; directly instantiate a canvas (``FigureCanvasWxAgg(frame, -1, figure)``) if needed.
es_es: El método ``NavigationToolbar2Wx.get_canvas`` está obsoleto; instancie directamente un lienzo (``FigureCanvasWxAgg(frame, -1, figure)``) si lo necesita.

source: Unused positional parameters to ``print_<fmt>`` methods are deprecated
es_es: Los parámetros posicionales no utilizados en los métodos ``print_<fmt>`` están obsoletos

source: None of the ``print_<fmt>`` methods implemented by canvas subclasses used positional arguments other that the first (the output filename or file-like), so these extra parameters are deprecated.
es_es: Ninguno de los métodos ``print_<fmt>`` implementados por las subclases de canvas utilizaba argumentos posicionales distintos del primero (el filename de salida o file-like), por lo que estos parámetros extra están obsoletos.

source: The *dpi* parameter of ``FigureCanvas.print_foo`` printers is deprecated
es_es: El parámetro *dpi* de la impresora ``FigureCanvas.print_foo`` está obsoleto

source: The `~.Figure.savefig` machinery already took care of setting the figure DPI to the desired value, so ``print_foo`` can directly read it from there. Not passing *dpi* to ``print_foo`` allows clearer detection of unused parameters passed to `~.Figure.savefig`.
es_es: La maquinaria de `~.Figure.savefig` ya se encargó de establecer el DPI de la figura al valor deseado, por lo que ``print_foo`` puede leerlo directamente desde allí. No pasar *dpi* a ``print_foo`` permite una detección más clara de los parámetros no utilizados pasados a `~.Figure.savefig`.

source: Passing `bytes` to ``FT2Font.set_text``
es_es: Pasando `bytes` a ``FT2Font.set_text``

source: ... is deprecated, pass `str` instead.
es_es: ... está obsoleto, pasa `str` en su lugar.

source: ``ps.useafm`` deprecated for mathtext
es_es: ``ps.useafm`` obsoleto para mathtext

source: Outputting mathtext using only standard PostScript fonts has likely been broken for a while (issue `#18722 <https://github.com/matplotlib/matplotlib/issues/18722>`_). In Matplotlib 3.5, the setting :rc:`ps.useafm` will have no effect on mathtext.
es_es: La salida de mathtext usando sólo fuentes PostScript estándar probablemente ha estado rota durante un tiempo (incidencia `#18722 <https://github.com/matplotlib/matplotlib/issues/18722>`_). En Matplotlib 3.5, el ajuste :rc:`ps.useafm` no tendrá efecto en mathtext.

source: ``MathTextParser("bitmap")`` is deprecated
es_es: ``MathTextParser("bitmap")`` está obsoleto

source: The associated APIs ``MathtextBackendBitmap``, ``MathTextParser.to_mask``, ``MathTextParser.to_rgba``, ``MathTextParser.to_png``, and ``MathTextParser.get_depth`` are likewise deprecated.
es_es: Las APIs asociadas ``MathtextBackendBitmap``, ``MathTextParser.to_mask``, ``MathTextParser.to_rgba``, ``MathTextParser.to_png``, y ``MathTextParser.get_depth`` son igualmente obsoletas.

source: To convert a text string to an image, either directly draw the text to an empty `.Figure` and save the figure using a tight bbox, as demonstrated in :doc:`/gallery/text_labels_and_annotations/mathtext_asarray`, or use `.mathtext.math_to_image`.
es_es: Para convertir una cadena de texto en una imagen, dibuje directamente el texto en un `.Figure` vacío y guarde la figura utilizando un bbox ajustado, como se demuestra en :doc:`/gallery/text_labels_and_annotations/mathtext_asarray`, o utilice `.mathtext.math_to_image`.

source: When using `.math_to_image`, text color can be set with e.g.::
es_es: Cuando se utiliza `.math_to_image`, el color del texto se puede establecer, por ejemplo, con.::

source: and an RGBA array can be obtained with e.g.::
es_es: y un arreglo RGBA puede obtenerse, por ejemplo, con.::

source: Deprecation of mathtext internals
es_es: Obsolescencia de las funciones internas de mathtext

source: The following API elements previously exposed by the :mod:`.mathtext` module are considered to be implementation details and public access to them is deprecated:
es_es: Los siguientes elementos de la API expuestos anteriormente por el módulo :mod:`.mathtext` se consideran detalles de implementación y el acceso público a ellos queda obsoleto:

source: ``Fonts`` and all its subclasses,
es_es: ``Fonts`` y todas sus subclases,

source: ``FontConstantsBase`` and all its subclasses,
es_es: ``FontConstantsBase`` y todas sus subclases,

source: ``Node`` and all its subclasses,
es_es: ``Nodo`` y todas sus subclases,

source: Deprecation of various mathtext helpers
es_es: Obsolescencia de varios ayudantes de mathtext
