Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.1.0.po
Languages: es_es

source: Setting the same artist property multiple time via aliases is deprecated. Previously, code such as ::
es_es: Configurar la misma propiedad del artista múltiples veces a través de alias es obsoleto. Anteriormente, código como ::

source: would emit a warning indicating that ``c`` and ``color`` are aliases of one another, and only keep the ``color`` kwarg. This behavior has been deprecated; in a future version, this will raise a TypeError, similar to Python's behavior when a keyword argument is passed twice ::
es_es: emitiría una advertencia indicando que ``c`` y ``color`` son alias unos de otros, y sólo mantienen el kwarg` ``color``. Este comportamiento ha sido obsoleto; en una versión futura, esto creará un TypeError, similar al comportamiento de Python cuando un argumento de palabra clave se pasa dos veces ::

source: This warning is raised by `~.cbook.normalize_kwargs`.
es_es: Esta advertencia es planteada por `~.cbook.normalize_kwargs`.

source: Path code types
es_es: Tipos de código de ruta

source: Path code types like ``Path.MOVETO`` are now ``np.uint8`` instead of ``int`` ``Path.STOP``, ``Path.MOVETO``, ``Path.LINETO``, ``Path.CURVE3``, ``Path.CURVE4`` and ``Path.CLOSEPOLY`` are now of the type ``Path.code_type`` (``np.uint8`` by default) instead of plain ``int``. This makes their type match the array value type of the ``Path.codes`` array.
es_es: Tipos de código de ruta como ``Path.MOVETO`` ahora son ``np.uint8`` en lugar de ``int`` ``Path.STOP``, ``Path.MOVETO``, ``Path.LINETO``, ``Path.CURVE3``, ``Path.CURVE4`` y ``Path. LOSEPOLY`` ahora son del tipo ``Path.code_type`` (``np.uint8`` por defecto) en lugar de ``int``. Esto hace que su tipo coincida con el tipo de valor del array del array ``Path.codes``.

source: LaTeX code in matplotlibrc file
es_es: Código LaTeX en archivo matplotlibrc

source: Previously, the rc file keys ``pgf.preamble`` and ``text.latex.preamble`` were parsed using commmas as separators. This would break valid LaTeX code, such as::
es_es: Anteriormente, las claves de archivo rc ``pgf.preamble`` y ``text.latex.preamble`` fueron analizadas usando comas como separadores. Esto rompería el código válido de LaTeX, como::

source: The parsing has been modified to pass the complete line to the LaTeX system, keeping all commas. Passing a list of strings from within a Python script still works as it used to. Passing a list containing non-strings now fails, instead of coercing the results to strings.
es_es: El análisis ha sido modificado para pasar la línea completa al sistema LaTeX, manteniendo todas las comas. Pasar una lista de cadenas dentro de un script Python todavía funciona como solía. Pasar una lista que contiene no cadenas ahora falla, en lugar de coaccionar los resultados a cadenas.

source: `.Axes.spy`
es_es: `.Ejes.spy`

source: The method `.Axes.spy` now raises a `TypeError` for the keyword arguments *interpolation* and *linestyle* instead of silently ignoring them.
es_es: El método `.Axes.spy` ahora plantea un `TypeError` para los argumentos de la palabra clave *interpolación* y *linestyle* en lugar de ignorarlos silenciosamente.

source: Furthermore, `.Axes.spy` spy does now allow for an *extent* argument (was silently ignored so far).
es_es: Además, el espía `.Axes.spy` ahora permite un argumento de *extensión* (fue ignorado silenciosamente hasta ahora).

source: A bug with ``Axes.spy(..., origin='lower')`` is fixed. Previously this flipped the data but not the y-axis resulting in a mismatch between axes labels and actual data indices. Now, *origin='lower'* flips both the data and the y-axis labels.
es_es: Un error con ``Axes.spy(..., origin='lower')`` ha sido arreglado. Anteriormente, esto volcó los datos, pero no el eje Y resultando en una discordancia entre las etiquetas de los ejes y los índices de datos reales. Ahora, *origin='lower'* vierte tanto los datos como las etiquetas del eje y.

source: Boxplot tick methods
es_es: Métodos de tick de Boxplot

source: The *manage_xticks* parameter of `~.Axes.boxplot` and `~.Axes.bxp` has been renamed (with a deprecation period) to *manage_ticks*, to take into account the fact that it manages either x or y ticks depending on the *vert* parameter.
es_es: El parámetro *manage_xticks* de `~.Axes.boxplot` y `~.Axes. xp` ha sido renombrado (con un período de desaprobación) a *manage_ticks*, para tener en cuenta el hecho de que maneja ticks x o y dependiendo del parámetro *vert*.

source: When ``manage_ticks=True`` (the default), these methods now attempt to take previously drawn boxplots into account when setting the axis limits, ticks, and tick labels.
es_es: Cuando ``manage_ticks=True`` (el valor por defecto), estos métodos ahora intentan tener en cuenta los puntos de caja previamente dibujados al establecer los límites de ejes, ticks y etiquetas tick.

source: MouseEvents
es_es: Eventos de ratón

source: MouseEvents now include the event name in their ``str()``. Previously they contained the prefix "MPL MouseEvent".
es_es: MouseEvents ahora incluye el nombre del evento en su ``str()``. Anteriormente contenían el prefijo "MPL MouseEvent".

source: RGBA buffer return type
es_es: Tipo de retorno de búfer RGBA

source: `.FigureCanvasAgg.buffer_rgba` and `.RendererAgg.buffer_rgba` now return a memoryview The ``buffer_rgba`` method now allows direct access to the renderer's underlying buffer (as a ``(m, n, 4)``-shape memoryview) rather than copying the data to a new bytestring. This is consistent with the behavior on Py2, where a buffer object was returned.
es_es: `.FigureCanvasAgg.buffer_rgba` y `.RendererAgg. uffer_rgba` ahora devuelve una vista de memoria El método ``buffer_rgba`` ahora permite el acceso directo al buffer subyacente del renderizador (como un ``(m, n, 4)``-forma memoryview) en lugar de copiar los datos a un nuevo bytesting. Esto es consistente con el comportamiento en Py2, donde se devolvió un objeto de búfer.

source: `matplotlib.font_manager.win32InstalledFonts` return type
es_es: tipo de retorno `matplotlib.font_manager.win32InstalledFonts`

source: `matplotlib.font_manager.win32InstalledFonts` returns an empty list instead of None if no fonts are found.
es_es: `matplotlib.font_manager.win32InstalledFonts` devuelve una lista vacía en lugar de Ninguno si no se encuentran fuentes.

source: `.Axes.fmt_xdata` and `.Axes.fmt_ydata` error handling
es_es: `.Axes.fmt_xdata` y `.Axes.fmt_ydata` manejo de errores

source: Previously, if the user provided a `.Axes.fmt_xdata` or `.Axes.fmt_ydata` function that raised a `TypeError` (or set them to a non-callable), the exception would be silently ignored and the default formatter be used instead. This is no longer the case; the exception is now propagated out.
es_es: Anteriormente, si el usuario proporcionaba un `.Axes.fmt_xdata` o `.Axes. La función mt_ydata` que elevó un `TypeError` (o los establecería en un no-llamable), la excepción se ignoraría silenciosamente y el formateador predeterminado se usaría en su lugar. Ya no es así; la excepción se propaga.

source: Deprecation of redundant `.Tick` attributes
es_es: Deprecación de los atributos redundantes `.Tick`

source: The ``gridOn``, ``tick1On``, ``tick2On``, ``label1On``, and ``label2On`` `~.Tick` attributes have been deprecated. Directly get and set the visibility on the underlying artists, available as the ``gridline``, ``tick1line``, ``tick2line``, ``label1``, and ``label2`` attributes.
es_es: Los atributos ``gridOn``, ``tick1On``, ``tick2On``, ``label1On``, y ``label2On`` `~.Tick` han sido obsoletos. Consiga y establezca directamente la visibilidad de los artistas subyacentes, disponible como los atributos ``gridline``, ``tick1line``, ``tick2line``, ``label1``, y ``label2``.

source: The ``label`` attribute, which was an alias for ``label1``, has been deprecated.
es_es: El atributo ``label``, que era un alias para ``label1``, ha sido obsoleto.

source: Subclasses that relied on setting the above visibility attributes needs to be updated; see e.g. :file:`examples/api/skewt.py`.
es_es: Las subclases que se basaron en establecer los atributos de visibilidad anteriores necesitan ser actualizadas; por ejemplo, :file:`examples/api/skewt.py`.

source: Passing a Line2D's drawstyle together with the linestyle is deprecated
es_es: Pasar el estilo de dibujo de Line2D junto con el estilo de línea está obsoleto

source: Instead of ``plt.plot(..., linestyle="steps--")``, use ``plt.plot(..., linestyle="--", drawstyle="steps")``. ``ds`` is now an alias for ``drawstyle``.
es_es: En lugar de ``plt.plot(..., linestyle="steps--")``, use ``plt.plot(..., linestyle="--", drawstyle="steps")``. ``ds`` es ahora un alias para ``drawstyle``.

source: ``pgi`` support dropped
es_es: Soporte de ``pgi`` abandonado

source: Support for ``pgi`` in the GTK3 backends has been dropped. ``pgi`` is an alternative implementation to ``PyGObject``. ``PyGObject`` should be used instead.
es_es: Se ha eliminado el soporte para ``pgi`` en los backends de GTK3. ``pgi`` es una implementación alternativa a ``PyGObject``. ``PyGObject`` debe ser usada en su lugar.

source: rcParam changes
es_es: cambios de rcParam

source: Removed
es_es: Eliminado

source: The following deprecated rcParams have been removed:
es_es: Se han eliminado los siguientes rcParams obsoletos:

source: ``nbagg.transparent`` (use :rc:`figure.facecolor` instead)
es_es: ``Textagg.transparent`` (usa :rc:`figure.facecolor` en su lugar)

source: ``axes.hold``
es_es: ``ejes.hold``

source: ``backend.qt4`` and ``backend.qt5`` (set the :envvar:`QT_API` environment variable instead)
es_es: ``backend.qt4`` y ``backend.qt5`` (establece la variable de entorno :envvar:`QT_API` en su lugar)

source: Deprecated
es_es: Desaprobado

source: The associated validator functions ``rcsetup.validate_qt4`` and ``validate_qt5`` are deprecated.
es_es: Las funciones de validador asociadas ``rcsetup.validate_qt4`` y ``validate_qt5`` son obsoletas.

source: The ``verbose.fileo`` and ``verbose.level`` rcParams have been deprecated. These have had no effect since the switch from Matplotlib's old custom Verbose logging to the stdlib's `logging` module. In addition the ``rcsetup.validate_verbose`` function is deprecated.
es_es: Los rcParams ``verbose.fileo`` y ``verbose.level`` han sido obsoletos. Estos no han tenido ningún efecto desde el cambio desde el antiguo registro personalizado de Matplotlib's al módulo `logging` de stdlib. Además, la función ``rcsetup.validate_verbose`` está obsoleta.

source: The ``text.latex.unicode`` rcParam now defaults to ``True`` and is deprecated (i.e., in future versions of Matplotlib, unicode input will always be supported). Moreover, the underlying implementation now uses ``\usepackage[utf8]{inputenc}`` instead of ``\usepackage{ucs}\usepackage[utf8x]{inputenc}``.
es_es: El ``text.latex.unicode`` rcParam ahora es ``True`` y está obsoleto (es decir, en futuras versiones de Matplotlib, la entrada unicode siempre será soportada). Además, la implementación subyacente ahora usa ``\usepackage[utf8]{inputenc}`` en lugar de ``\usepackage{ucs}\usepackage[utf8x]{inputenc}``.

source: Exception changes
es_es: Cambios de excepción

source: `mpl_toolkits.axes_grid1.axes_size.GetExtentHelper` now raises `ValueError` for invalid directions instead of `KeyError`.
es_es: `mpl_toolkits.axes_grid1.axes_size.GetExtentHelper` ahora eleva `ValueError` para direcciones no válidas en lugar de `KeyError`.

source: Previously, subprocess failures in the animation framework would raise either in a `RuntimeError` or a `ValueError` depending on when the error occurred. They now raise a `subprocess.CalledProcessError` with attributes set as documented by the exception class.
es_es: Anteriormente, los fallos de subproceso en el entorno de animación aumentarían ya sea en un `RuntimeError` o un `ValueError` dependiendo de cuándo ocurrió el error. Ahora levantan un `subprocess.CalledProcessError` con atributos establecidos como documentados por la clase de excepción.

source: In certain cases, Axes methods (and pyplot functions) used to raise a `RuntimeError` if they were called with a ``data`` kwarg and otherwise mismatched arguments. They now raise a `TypeError` instead.
es_es: En ciertos casos, métodos de Axes (y funciones pyplot) usados para generar un `RuntimeError` si fueron llamados con un ``data`` kwarg y argumentos no coincidentes. Ahora levantan un `TypeError` en su lugar.

source: `.Axes.streamplot` does not support irregularly gridded ``x`` and ``y`` values. So far, it used to silently plot an incorrect result. This has been changed to raise a `ValueError` instead.
es_es: `.Axes.streamplot` no soporta valores ``x`` y ``y``. Hasta ahora, solía trazar silenciosamente un resultado incorrecto. Esto ha sido cambiado para aumentar un `ValueError` en su lugar.

source: The `.streamplot.Grid` class, which is internally used by streamplot code, also throws a `ValueError` when irregularly gridded values are passed in.
es_es: La clase `.streamplot.Grid`, que es internamente utilizada por el código streamplot, también arroja un `ValueError` cuando se pasan valores cuadrados irregulares.

source: Removals
es_es: Eliminar

source: The following deprecated APIs have been removed:
es_es: Se han eliminado las siguientes APIs obsoletas:

source: Classes and methods
es_es: Clases y métodos

source: ``Verbose`` (replaced by python logging library)
es_es: ``Verbose`` (reemplazado por la biblioteca de registro de python)

source: ``artist.Artist.hitlist`` (no replacement)
es_es: ``artist.Artist.hitlist`` (sin reemplazo)

source: ``artist.Artist.is_figure_set`` (use ``artist.figure is not None`` instead)
es_es: ``artist.Artist.is_figure_set`` (use ``artist.figure no es ninguno`` en su lugar)

source: ``axis.Axis.unit_data`` (use ``axis.Axis.units`` instead)
es_es: ``axis.Axis.unit_data`` (use ``axis.Axis.units`` en su lugar)

source: ``backend_bases.FigureCanvasBase.onRemove`` (no replacement) ``backend_bases.FigureManagerBase.show_popup`` (this never did anything)
es_es: ``backend_bases.FigureCanvasBase.onRemove`` (sin reemplazo) ``backend_bases.FigureManagerBase.show_popup`` (esto nunca hizo nada)

source: ``backend_wx.SubplotToolWx`` (no replacement)
es_es: ``backend_wx.SubplotToolWx`` (sin reemplazo)

source: ``backend_wx.Toolbar`` (use ``backend_wx.NavigationToolbar2Wx`` instead)
es_es: ``backend_wx.Toolbar`` (use ``backend_wx.NavigationToolbar2Wx`` en su lugar)

source: ``cbook.align_iterators`` (no replacement)
es_es: ``cbook.align_iterators`` (sin reemplazo)

source: ``contour.ContourLabeler.get_real_label_width`` (no replacement)
es_es: ``contour.ContourLabeler.get_real_label_width`` (sin reemplazo)

source: ``legend.Legend.draggable`` (use `legend.Legend.set_draggable()` instead)
es_es: ``legend.Legend.draggable`` (usa `legend.Legend.set_draggable()` en su lugar)

source: ``texmanager.TexManager.postscriptd``, ``texmanager.TexManager.pscnt``, ``texmanager.TexManager.make_ps``, ``texmanager.TexManager.get_ps_bbox`` (no replacements)
es_es: ``texmanager.TexManager.postscriptd``, ``texmanager.TexManager.pscnt``, ``texmanager.TexManager.make_ps``, ``texmanager.TexManager.get_ps_bbox`` (sin remplazos)

source: Arguments
es_es: Argumentos

source: The *fig* kwarg to `.GridSpec.get_subplot_params` and `.GridSpecFromSubplotSpec.get_subplot_params` (use the argument *figure* instead)
es_es: El kwarg *fig* a `.GridSpec.get_subplot_params` y `.GridSpecFromSubplotSpec.get_subplot_params` (use el argumento *figure* en su lugar)

source: Passing 'box-forced' to `.Axes.set_adjustable` (use 'box' instead)
es_es: Pasando 'box-forced' a `.Axes.set_adjusttable` (use 'box' en su lugar)

source: Support for the strings 'on'/'true'/'off'/'false' to mean `True` / `False` (directly use `True` / `False` instead). The following functions are affected:
es_es: Soporte para las cadenas 'on'/'true'/'off'/'false' para significar `True` / `False` (usar directamente `True` / `False`). Las siguientes funciones se ven afectadas:

source: `.axes.Axes.grid`
es_es: `.axes.Ejes.grid`

source: Using `.pyplot.axes` with an `.axes.Axes` type argument (use `.pyplot.sca` instead)
es_es: Usando `.pyplot.axes` con un argumento de tipo `.axes.Axes` (usa `.pyplot.sca` en su lugar)

source: Other
es_es: Otro

source: The following miscellaneous API elements have been removed
es_es: Se han eliminado los siguientes elementos de la API

source: svgfont support (in :rc:`svg.fonttype`)
es_es: soporte svgfont (en :rc:`svg.fonttype`)

source: Logging is now done with the standard python ``logging`` library. ``matplotlib.verbose`` and the command line switches ``--verbose-LEVEL`` have been removed.
es_es: El registro ahora se realiza con la librería estándar python ``logging``. ``matplotlib.verbose`` y los interruptores de línea de comandos ``--verbose-LEVEL`` han sido eliminados.

source: To control the logging output use::
es_es: Para controlar la salida de registro::

source: Lots of code inside the :mod:`matplotlib.mlab` module which was deprecated in Matplotlib 2.2 has been removed. See below for a list:
es_es: Mucho código dentro del módulo :mod:`matplotlib.mlab` que fue desaprobado en Matplotlib 2.2 ha sido eliminado. Vea a continuación una lista:

source: ``mlab.exp_safe`` (use `numpy.exp` instead)
es_es: ``mlab.exp_safe`` (usa `numpy.exp` en su lugar)

source: ``mlab.logspace`` (use `numpy.logspace` instead)
es_es: ``mlab.logspace`` (usa `numpy.logspace` en su lugar)

source: ``mlab.l1norm`` (use ``numpy.linalg.norm(a, ord=1)`` instead)
es_es: ``mlab.l1norm`` (use ``numpy.linalg.norm(a, ord=1)`` en su lugar)

source: ``mlab.l2norm`` (use ``numpy.linalg.norm(a, ord=2)`` instead)
es_es: ``mlab.l2norm`` (use ``numpy.linalg.norm(a, ord=2)`` en su lugar)

source: ``mlab.norm_flat`` (use ``numpy.linalg.norm(a.flat, ord=2)`` instead)
es_es: ``mlab.norm_flat`` (use ``numpy.linalg.norm(a.flat, ord=2)`` en su lugar)

source: ``mlab.frange`` (use `numpy.arange` instead)
es_es: ``mlab.frange`` (usa `numpy.arange` en su lugar)

source: ``mlab.identity`` (use `numpy.identity` instead)
es_es: ``mlab.identity`` (usa `numpy.identity` en su lugar)

source: ``mlab.log2`` (use `numpy.log2` instead)
es_es: ``mlab.log2`` (usa `numpy.log2` en su lugar)

source: ``mlab.safe_isinf`` (use `numpy.isinf` instead)
es_es: ``mlab.safe_isinf`` (usa `numpy.isinf` en su lugar)

source: ``mlab.safe_isnan`` (use `numpy.isnan` instead)
es_es: ``mlab.safe_isnan`` (usa `numpy.isnan` en su lugar)

source: ``mlab.cohere_pairs`` (use `scipy.signal.coherence` instead)
es_es: ``mlab.cohere_pairs`` (usa `scipy.signal.coherence` en su lugar)

source: ``mlab.entropy`` (use `scipy.stats.entropy` instead)
es_es: ``mlab.entropy`` (usa `scipy.stats.entropy` en su lugar)

source: ``mlab.normpdf`` (use `scipy.stats.norm.pdf` instead)
es_es: ``mlab.normpdf`` (utiliza `scipy.stats.norm.pdf` en su lugar)

source: ``mlab.find`` (use ``np.nonzero(np.ravel(condition))`` instead)
es_es: ``mlab.find`` (use ``np.nonzero(np.ravel(condition))`` en su lugar)

source: ``mlab.prctile`` (use `numpy.percentile` instead)
es_es: ``mlab.prctile`` (usa `numpy.percentile` en su lugar)

source: ``mlab.rk4`` (use `scipy.integrate.ode` instead)
es_es: ``mlab.rk4`` (usa `scipy.integrate.ode` en su lugar)

source: ``mlab.dist`` (use `numpy.hypot` instead)
es_es: ``mlab.dist`` (usa `numpy.hypot` en su lugar)

source: ``mlab.dist_point_to_segment``
es_es: ``mlab.dist_punto_a_segment``

source: ``mlab.griddata`` (use `scipy.interpolate.griddata`)
es_es: ``mlab.griddata`` (usa `scipy.interpolate.griddata`)

source: ``mlab.less_simple_linear_interpolation`` (use `numpy.interp`)
es_es: ``mlab.less_simple_linear_interpolation`` (usa `numpy.interp`)

source: ``mlab.segments_intersect``
es_es: ``mlab.segments_intersecto``

source: ``mlab.vector_lengths``
es_es: ``mlab.vector_longitud``

source: ``mlab.distances_along_curve``
es_es: ``mlab.distances_en_curva``

source: ``mlab.cross_from_above``
es_es: ``mlab.cross_de_arriba``

source: ``mlab.cross_from_below``
es_es: ``mlab.cross_de_debajo``

source: ``mlab.contiguous_regions`` (use `.cbook.contiguous_regions` instead)
es_es: ``mlab.contiguous_regions`` (utiliza `.cbook.contiguous_regions` en su lugar)

source: ``mlab.is_closed_polygon``
es_es: ``mlab.is_cerrado_polígono``

source: ``mlab.poly_between``
es_es: ``mlab.poly_entre``

source: ``mlab.poly_below``
es_es: ``mlab.poly_debajo``

source: ``mlab.rec2csv`` (use `numpy.recarray.tofile` instead)
es_es: ``mlab.rec2csv`` (usa `numpy.recarray.tofile` en su lugar)

source: ``mlab.rec2text`` (use `numpy.recarray.tofile` instead)
es_es: ``mlab.rec2text`` (usa `numpy.recarray.tofile` en su lugar)

source: ``mlab.rec_groupby``
es_es: ``mlab.rec_grupo``

source: ``mlab.rec_append_fields``
es_es: ``mlab.rec_append_campos``

source: ``mlab.FormatDatetime`` (use `datetime.datetime.strftime` instead)
es_es: ``mlab.FormatDatetime`` (usa `datetime.datetime.strftime` en su lugar)

source: ``mlab.FormatDate`` (use `datetime.date.strftime` instead)
es_es: ``mlab.FormatDate`` (usa `datetime.date.strftime` en su lugar)

source: ``mlab.FormatMillions``, ``mlab.FormatThousands``, ``mlab.FormatPercent``, ``mlab.FormatBool``, ``mlab.FormatInt``, ``mlab.FormatFloat``, ``mlab.FormatFormatStr``, ``mlab.FormatString``, ``mlab.FormatObj``
es_es: ``mlab.FormatMillions``, ``mlab.FormatThousands``, ``mlab.FormatPorcento``, ``mlab.FormatBool``, ``mlab.FormatInt``, ``mlab.FormatFloat``, ``mlab.FormatFormatStr``, ``mlab.FormatString``, ``mlab.FormatObj``

source: `pylab` removals
es_es: `pylab` eliminaciones

source: Lots of code inside the :mod:`matplotlib.mlab` module which was deprecated in Matplotlib 2.2 has been removed. This means the following functions are no longer available in the `pylab` module:
es_es: Mucho código dentro del módulo :mod:`matplotlib.mlab` que fue desaprobado en Matplotlib 2. ha sido eliminado. Esto significa que las siguientes funciones ya no están disponibles en el módulo `pylab`:

source: ``binary_repr``
es_es: ``binario_repr``

source: ``bivariate_normal``
es_es: ``bivariar_normal``

source: ``center_matrix``
es_es: ``centro_matrix``

source: ``csv2rec`` (use `numpy.recarray.tofile` instead)
es_es: ``csv2rec`` (usa `numpy.recarray.tofile` en su lugar)

source: ``dist`` (use `numpy.hypot` instead)
es_es: ``dist`` (usa `numpy.hypot` en su lugar)

source: ``dist_point_to_segment``
es_es: ``dist_punto_a_segment``

source: ``distances_along_curve``
es_es: ``distancias y curvas``

source: ``entropy`` (use `scipy.stats.entropy` instead)
es_es: ``entropy`` (usa `scipy.stats.entropy` en su lugar)

source: ``exp_safe`` (use `numpy.exp` instead)
es_es: ``exp_safe`` (usa `numpy.exp` en su lugar)

source: ``find`` (use ``np.nonzero(np.ravel(condition))`` instead)
es_es: ``find`` (use ``np.nonzero(np.ravel(condition))`` en su lugar)

source: ``frange`` (use `numpy.arange` instead)
es_es: ``frange`` (usa `numpy.arange` en su lugar)

source: ``get_sparse_matrix``
es_es: ``obtener_esparse_matrix``

source: ``get_xyz_where``
es_es: ``obtener_xyz_donde``

source: ``griddata`` (use `scipy.interpolate.griddata` instead)
es_es: ``griddata`` (use `scipy.interpolate.griddata` en su lugar)

source: ``identity`` (use `numpy.identity` instead)
es_es: ``identity`` (use `numpy.identity` en su lugar)

source: ``inside_poly``
es_es: ``interior_poly``

source: ``is_closed_polygon``
es_es: ``es_polígono_cerrado``

source: ``l1norm`` (use ``numpy.linalg.norm(a, ord=1)`` instead)
es_es: ``l1norm`` (use ``numpy.linalg.norm(a, ord=1)`` en su lugar)

source: ``l2norm`` (use ``numpy.linalg.norm(a, ord=2)`` instead)
es_es: ``l2norm`` (use ``numpy.linalg.norm(a, ord=2)`` en su lugar)

source: ``log2`` (use `numpy.log2` instead)
es_es: ``log2`` (usa `numpy.log2` en su lugar)

source: ``longest_ones``
es_es: ``más largo``
