Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.4.0.po
Languages: es_es

source: API Changes for 3.4.0
es_es: Cambios en la API para la versión 3.4.0

source: Behaviour changes
es_es: Cambios de comportamiento

source: Constrained layout rewrite
es_es: Reescritura restringida de layout

source: The layout manager ``constrained_layout`` was re-written with different outer constraints that should be more robust to complicated subplot layouts. User-facing changes are:
es_es: El gestor de layout ``constrained_layout`` ha sido reescrito con diferentes restricciones externas que deberían ser más robustas para los layouts complicados de los subgráficos. Los cambios orientados al usuario son:

source: some poorly constrained layouts will have different width/height plots than before.
es_es: algunos layouts mal restringidos tendrán gráficos de anchura/altura diferentes a los de antes.

source: colorbars now respect the ``anchor`` keyword argument of `matplotlib.colorbar.make_axes`
es_es: las barras de color ahora respetan el argumento de la palabra clave ``anchor`` de `matplotlib.colorbar.make_axes`

source: colorbars are wider.
es_es: las barras de color son más anchas.

source: colorbars in different rows or columns line up more robustly.
es_es: las barras de color en diferentes filas o columnas se alinean con mayor solidez.

source: *hspace* and *wspace* options to `.Figure.set_constrained_layout_pads` were twice as wide as the docs said they should be. So these now follow the docs.
es_es: Las opciones *hspace* y *wspace* de `.Figure.set_constrained_layout_pads` eran el doble de anchas de lo que indicaban los documentos. Así que ahora siguen los documentos.

source: This feature will remain "experimental" until the new changes have been used enough by users, so we anticipate version 3.5 or 3.6. On the other hand, ``constrained_layout`` is extensively tested and used in examples in the library, so using it should be safe, but layouts may not be exactly the same as more development takes place.
es_es: Esta característica seguirá siendo "experimental" hasta que los nuevos cambios hayan sido suficientemente utilizados por los usuarios, por lo que anticipamos la versión 3.5 o 3.6. Por otro lado, ``constrained_layout`` está ampliamente probado y se utiliza en los ejemplos de la biblioteca, por lo que su uso debería ser seguro, pero los layouts pueden no ser exactamente los mismos a medida que se desarrolla más.

source: Details of using ``constrained_layout``, and its algorithm are available at :doc:`/tutorials/intermediate/constrainedlayout_guide`
es_es: Los detalles del uso de ``constrained_layout``, y su algoritmo están disponibles en :doc:`/tutorials/intermediate/constrainedlayout_guide`

source: ``plt.subplot`` re-selection without keyword arguments
es_es: ``plt.subplot`` re-selección sin argumentos de palabras clave

source: The purpose of `.pyplot.subplot` is to facilitate creating and re-selecting Axes in a Figure when working strictly in the implicit pyplot API. When creating new Axes it is possible to select the projection (e.g. polar, 3D, or various cartographic projections) as well as to pass additional keyword arguments through to the Axes-subclass that is created.
es_es: El propósito de `.pyplot.subplot` es facilitar la creación y re-selección de Ejes en una Figura cuando se trabaja estrictamente en la API implícita de pyplot. Al crear nuevos Ejes es posible seleccionar la proyección (por ejemplo, polar, 3D, o varias proyecciones cartográficas), así como pasar argumentos de palabras clave adicionales a través de la subclase Axes que se crea.

source: The first time `.pyplot.subplot` is called for a given position in the Axes grid it always creates and returns a new Axes with the passed arguments and projection (defaulting to rectilinear). On subsequent calls to `.pyplot.subplot` we have to determine if an existing Axes has a) equivalent parameters, in which case it should be selected as the current Axes and returned, or b) different parameters, in which case a new Axes is created and the existing Axes is removed. This leaves the question of what is "equivalent parameters".
es_es: La primera vez que se invoca `.pyplot.subplot` para una posición dada en la malla de Ejes siempre crea y devuelve un nuevo Eje con los argumentos pasados y la proyección (por defecto rectilínea). En posteriores llamadas a `.pyplot.subplot` tenemos que determinar si un Eje existente tiene a) parámetros equivalentes, en cuyo caso debe ser seleccionado como el Eje actual y devuelto, o b) parámetros diferentes, en cuyo caso se crea un nuevo Eje y se elimina el Eje existente. Esto deja la cuestión de qué son "parámetros equivalentes".

source: Previously it was the case that an existing Axes subclass, except for Axes3D, would be considered equivalent to a 2D rectilinear Axes, despite having different projections, if the keyword arguments (other than *projection*) matched. Thus::
es_es: Anteriormente se daba el caso de que una subclase de Ejes existente, excepto Ejes3D, se consideraba equivalente a un Eje rectilíneo 2D, a pesar de tener diferentes proyecciones, si los argumentos de la palabra clave (aparte de *proyección*) correspondían. Así::

source: We are embracing this long standing behavior to ensure that in the case when no keyword arguments (of any sort) are passed to `.pyplot.subplot` any existing Axes is returned, without consideration for keywords or projection used to initially create it. This will cause a change in behavior when additional keywords were passed to the original Axes::
es_es: Estamos adoptando este comportamiento de larga data para garantizar que en el caso de que no se pasen argumentos de palabras clave (de ningún tipo) a `.pyplot.subplot` se devuelva cualquier Axes existente, sin tener en cuenta las palabras clave o la proyección utilizadas para crearlo inicialmente. Esto provocará un cambio en el comportamiento cuando se pasen palabras clave adicionales al Axes: original::

source: For the same reason, if there was an existing Axes that was not rectilinear, passing ``projection='rectilinear'`` would reuse the existing Axes ::
es_es: Por la misma razón, si hubiera un Eje existente que no fuera rectilíneo, pasar ``projection='rectilinear'`` reutilizaría el Eje existente ::

source: contrary to the user's request.
es_es: contrario a la solicitud del usuario.

source: Previously Axes3D could not be re-selected with `.pyplot.subplot` due to an unrelated bug (also fixed in Matplotlib 3.4). While Axes3D are now consistent with all other projections there is a change in behavior for ::
es_es: Anteriormente los Axes3D no podían ser re-seleccionados con `.pyplot.subplot` debido a un error no relacionado (también arregla en Matplotlib 3.4). Aunque los Axes3D son ahora consistentes con todas las demás proyecciones, hay un cambio en el comportamiento de ::

source: ``ioff`` and ``ion`` can be used as context managers
es_es: ``ioff`` y ``ion`` pueden utilizarse como gestores de contexto

source: `.pyplot.ion` and `.pyplot.ioff` may now be used as context managers to create a context with interactive mode on or off, respectively. The old behavior of calling these functions is maintained. To use the new functionality call as::
es_es: `.pyplot.ion` y `.pyplot.ioff` pueden utilizarse ahora como gestores de contexto para crear un contexto con el modo interactivo activado o desactivado, respectivamente. Se mantiene el antiguo comportamiento de llamar a estas funciones. Para utilizar la nueva funcionalidad llame como::

source: Locators and formatters must be in the class hierarchy
es_es: Los localizadores y formateadores deben estar en la jerarquía de clases

source: Axis locators and formatters must now be subclasses of `~matplotlib.ticker.Locator` and `~matplotlib.ticker.Formatter` respectively.
es_es: Los localizadores y formateadores de ejes deben ser ahora subclases de `~matplotlib.ticker.Locator` y `~matplotlib.ticker.Formatter` respectivamente.

source: Date locator for DAILY interval now returns middle of month
es_es: El localizador de fechas para el intervalo DIARIO ahora devuelve la mitad del mes

source: The `matplotlib.dates.AutoDateLocator` has a default of ``interval_multiples=True`` that attempts to align ticks with the start of meaningful intervals like the start of the month, or start of the day, etc. That lead to approximately 140-day intervals being mapped to the first and 22nd of the month. This has now been changed so that it chooses the first and 15th of the month, which is probably what most people want.
es_es: El `matplotlib.dates.AutoDateLocator` tiene un valor por defecto de ``interval_multiples=True`` que intenta alinear los ticks con el inicio de intervalos significativos como el inicio del mes, o el inicio del día, etc. Eso llevaba a que los intervalos de aproximadamente 140 días se asignaran al primero y al 22 del mes. Ahora se ha cambiado para que elija el primero y el 15 del mes, que es probablemente lo que la mayoría de la gente quiere.

source: ``ScalarFormatter`` *useLocale* option obeys grouping
es_es: La opción ``ScalarFormatter`` *useLocale* obedece a la agrupación

source: When the `~.ScalarFormatter` option *useLocale* is enabled (or :rc:`axes.formatter.use_locale` is *True*) and the configured locale uses grouping, a separator will be added as described in `locale.format_string`.
es_es: Cuando la opción de `~.ScalarFormatter` *useLocale* está activada (o :rc:`axes.formatter.use_locale` es *True*) y la localización configurada utiliza agrupación, se añadirá un separador como se describe en `locale.format_string`.

source: ``Axes.errorbar`` cycles non-color properties correctly
es_es: ``Axes.errorbar`` cicla correctamente las propiedades que no son de color

source: Formerly, `.Axes.errorbar` incorrectly skipped the Axes property cycle if a color was explicitly specified, even if the property cycler was for other properties (such as line style). Now, `.Axes.errorbar` will advance the Axes property cycle as done for `.Axes.plot`, i.e., as long as all properties in the cycler are not explicitly passed.
es_es: Anteriormente, `.Axes.errorbar` se saltaba incorrectamente el ciclo de propiedades de los ejes si se especificaba explícitamente un color, incluso si el ciclador de propiedades era para otras propiedades (como el estilo de línea). Ahora, `.Axes.errorbar` avanzará el ciclo de propiedades de los ejes como se hace con `.Axes.plot`, es decir, siempre que no se pasen explícitamente todas las propiedades del ciclador.

source: pyplot.specgram always uses origin='upper'
es_es: pyplot.specgram utiliza siempre origin='upper'

source: Previously if :rc:`image.origin` was set to something other than ``'upper'`` or if the *origin* keyword argument was passed with a value other than ``'upper'``, the spectrogram itself would flip, but the Axes would remain oriented for an origin value of ``'upper'``, so that the resulting plot was incorrectly labelled.
es_es: Anteriormente, si :rc:`image.origin` se establecía en un valor distinto de ``'upper'`` o si el argumento de la palabra clave *origin* se pasaba con un valor distinto de ``'upper'``, el espectrograma en sí mismo se volteaba, pero los ejes permanecían orientados para un valor de origen de ``'upper'``, por lo que el gráfico resultante se etiquetaba incorrectamente.

source: Now, the *origin* keyword argument is not supported and the ``image.origin`` rcParam is ignored. The function `matplotlib.pyplot.specgram` is forced to use ``origin='upper'``, so that the Axes are correct for the plotted spectrogram.
es_es: Ahora, el argumento de la palabra clave *origin* no es soportado y el rcParam ``image.origin`` es ignorado. La función `matplotlib.pyplot.specgram` es forzada a usar ``origin='upper'``, para que los Ejes sean correctos para el espectrograma graficado.

source: xunits=None and yunits=None passed as keyword arguments are treated as "no action"
es_es: xunits=None y yunits=None pasado como argumentos de palabra clave son tratados como "sin acción"

source: Many (but not all) of the methods on `~.axes.Axes` take the (undocumented) keyword arguments *xunits* and *yunits* that will update the units on the given Axis by calling `.Axis.set_units` and `.Axis.update_units`.
es_es: Muchos (pero no todos) de los métodos de `~.axes.Axes` toman los argumentos de palabra clave (no documentados) *xunits* y *yunits* que actualizarán las unidades en el Eje dado llamando a `.Axis.set_units` y `.Axis.update_units`.

source: Previously if *None* was passed it would clear the value stored in ``.Axis.units`` which will in turn break converters which rely on the value in ``.Axis.units`` to work properly (notably `.StrCategoryConverter`).
es_es: Anteriormente, si se pasaba *None* se borraba el valor almacenado en ``.Axis.units``, lo que a su vez rompería los convertidores que dependen del valor en ``.Axis.units`` para funcionar correctamente (especialmente `.StrCategoryConverter`).

source: This changes the semantics of ``ax.meth(..., xunits=None, yunits=None)`` from "please clear the units" to "do the default thing as if they had not been passed" which is consistent with the standard behavior of Matplotlib keyword arguments.
es_es: Esto cambia la semántica de ``ax.meth(..., xunits=None, yunits=None)`` de "por favor, borre las unidades" a "haga lo predeterminado como si no se hubieran pasado", lo cual es consistente con el comportamiento estándar de los argumentos de palabras clave de Matplotlib.

source: If you were relying on passing ``xunits=None`` to plotting methods to clear the ``.Axes.units`` attribute, directly call `.Axis.set_units` (and `.Axis.update_units` if you also require the converter to be updated).
es_es: Si confías en pasar ``xunits=None`` a los métodos de graficado para borrar el atributo ``.Axes.units``, llama directamente a `.Axis.set_units` (y a `.Axis.update_units` si también necesitas que se actualice el convertidor).

source: Annotations with ``annotation_clip`` no longer affect ``tight_layout``
es_es: Las anotaciones con ``annotation_clip`` ya no afectan a ``tight_layout``

source: Previously, `.text.Annotation.get_tightbbox` always returned the full `.text.Annotation.get_window_extent` of the object, independent of the value of ``annotation_clip``. `.text.Annotation.get_tightbbox` now correctly takes this extra clipping box into account, meaning that `~.text.Annotation`\s that are not drawn because of ``annotation_clip`` will not count towards the Axes bounding box calculations, such as those done by `~.pyplot.tight_layout`.
es_es: Anteriormente, `.text.Annotation.get_tightbbox` siempre devolvía la extensión completa de `.text.Annotation.get_window_extent` del objeto, independientemente del valor de ``annotation_clip``. Ahora, `.text.Annotation.get_tightbbox` tiene en cuenta correctamente esta caja de recorte adicional, lo que significa que las `~.text.Annotation` que no se dibujan debido a ``annotation_clip`` no contarán para los cálculos de la caja de delimitación de los ejes, como los realizados por `~.pyplot.tight_layout``.

source: This is now consistent with the API described in `~.artist.Artist`, which specifies that ``get_window_extent`` should return the full extents and ``get_tightbbox`` should "account for any clipping".
es_es: Esto es ahora consistente con la API descrita en `~.artist.Artist`, que especifica que ``get_window_extent`` debe devolver la extensión completa y ``get_tightbbox`` debe "tener en cuenta cualquier recorte".

source: Parasite Axes pcolor and pcolormesh now defaults to placing grid edges at integers, not half-integers
es_es: Los ejes parásitos pcolor y pcolormesh ahora colocan por defecto los bordes de la malla en aristas, no en medios enteros

source: This is consistent with `~.Axes.pcolor` and `~.Axes.pcolormesh`.
es_es: Esto es consistente con `~.Axes.pcolor` y `~.Axes.pcolormesh`.

source: ``Colorbar`` outline is now a ``Spine``
es_es: El contorno de la ``Colorbar`` es ahora ``Spine``

source: The outline of `~matplotlib.colorbar.Colorbar` is now a `.Spine` and drawn as one, instead of a `.Polygon` drawn as an artist. This ensures it will always be drawn after (i.e., on top of) all artists, consistent with Spines on normal Axes.
es_es: El contorno de `~matplotlib.colorbar.Colorbar` es ahora un `.Spine` y se dibuja como uno, en lugar de un `.Polygon` dibujado como un artist. Esto asegura que siempre se dibujará después (es decir, encima) de todos los artists, en consonancia con los Spines en los ejes normales.

source: ``Colorbar.dividers`` changes
es_es: Cambios de ``Colorbar.dividers``

source: This attribute is now always a `.LineCollection` -- an empty one if ``drawedges`` is *False*. Its default colors and linewidth (:rc:`axes.edgecolor`, :rc:`axes.linewidth`) are now resolved at instantiation time, not at draw time.
es_es: Este atributo es ahora siempre una `.LineCollection` -- una vacía si ``drawedges`` es *False*. Sus colores y anchura de línea por defecto (:rc:`axes.edgecolor`, :rc:`axes.linewidth`) se resuelven ahora en tiempo de instanciación, no en tiempo de dibujo.

source: Raise or warn on registering a colormap twice
es_es: Plantea o avisar al registrar un mapa de colores dos veces

source: When using `matplotlib.cm.register_cmap` to register a user provided or third-party colormap it will now raise a `ValueError` if trying to over-write one of the built in colormaps and warn if trying to over write a user registered colormap. This may raise for user-registered colormaps in the future.
es_es: Cuando se utiliza `matplotlib.cm.register_cmap` para registrar un mapa de colores proporcionado por el usuario o por terceros, ahora se produce un `ValueError` si se intenta sobrescribir uno de los mapas de colores incorporados y se advierte si se intenta sobrescribir un mapa de colores registrado por el usuario. En el futuro, esto puede aumentar los mapas de colores registrados por el usuario.

source: Consecutive rasterized draws now merged
es_es: Los dibujos rasterizados consecutivos ahora se fusionan

source: Tracking of depth of raster draws has moved from `.backend_mixed.MixedModeRenderer.start_rasterizing` and `.backend_mixed.MixedModeRenderer.stop_rasterizing` into `.artist.allow_rasterization`. This means the start and stop functions are only called when the rasterization actually needs to be started and stopped.
es_es: El seguimiento de la profundidad de los dibujos rasterizados se ha trasladado de `.backend_mixed.MixedModeRenderer.start_rasterizing` y `.backend_mixed.MixedModeRenderer.stop_rasterizing` a `.artist.allow_rasterization`. Esto significa que las funciones de inicio y parada sólo son invocadas cuando la rasterización realmente necesita ser iniciada y detenida.

source: The output of vector backends will change in the case that rasterized elements are merged. This should not change the appearance of outputs.
es_es: La salida de los backends vectoriales cambiará en el caso de que se fusionen elementos rasterizados. Esto no debería cambiar la apariencia de las salidas.

source: The renders in 3rd party backends are now expected to have ``self._raster_depth`` and ``self._rasterizing`` initialized to ``0`` and *False* respectively.
es_es: Ahora se espera que los renders en backends de terceros tengan ``self._raster_depth`` y ``self._rasterizing`` inicializados a ``0`` y *False* respectivamente.

source: Consistent behavior of ``draw_if_interactive()`` across backends
es_es: Comportamiento coherente de ``draw_if_interactive()`` en todos los backends

source: `.pyplot.draw_if_interactive` no longer shows the window (if it was previously unshown) on the Tk and nbAgg backends, consistently with all other backends.
es_es: `.pyplot.draw_if_interactive` ya no muestra la ventana (si antes no se mostraba) en los backends Tk y nbAgg, de forma consistente con el resto de backends.

source: The Artist property *rasterized* cannot be *None* anymore
es_es: La propiedad Artist *rasterized* ya no puede ser *None*

source: It is now a boolean only. Before the default was *None* and `.Artist.set_rasterized` was documented to accept *None*. However, *None* did not have a special meaning and was treated as *False*.
es_es: Ahora es sólo un booleano. Antes el valor por defecto era *None* y `.Artist.set_rasterized` estaba documentado para aceptar *None*. Sin embargo, *None* no tenía un significado especial y se trataba como *False*.

source: Canvas's callback registry now stored on Figure
es_es: El registro de invocación de Canvas ahora se almacena en la Figura

source: The canonical location of the `~.cbook.CallbackRegistry` used to handle Figure/Canvas events has been moved from the Canvas to the Figure. This change should be transparent to almost all users, however if you are swapping switching the Figure out from on top of a Canvas or visa versa you may see a change in behavior.
es_es: La ubicación canónica del `~.cbook.CallbackRegistry` utilizado para manejar los eventos de la Figura/Canvas se ha movido del Canvas a la Figura. Este cambio debería ser transparente para casi todos los usuarios, sin embargo, si usted está cambiando el cambio de la Figura de la parte superior de un Canvas o visa versa puede ver un cambio en el comportamiento.

source: Harmonized key event data across backends
es_es: Datos de eventos clave armonizados en todos los backends

source: The different backends with key translation support, now handle "Shift" as a sometimes modifier, where the ``'shift+'`` prefix won't be added if a key translation was made.
es_es: Los diferentes backends con soporte de traducción de teclas, ahora manejan "Shift" como un modificador a veces, donde el prefijo ``'shift+'`` no será añadido si se hizo una traducción de teclas.

source: In the Qt5 backend, the ``matplotlib.backends.backend_qt5.SPECIAL_KEYS`` dictionary contains keys that do *not* return their unicode name instead they have manually specified names. The name for ``QtCore.Qt.Key_Meta`` has changed to ``'meta'`` to be consistent with the other GUI backends.
es_es: En el backend Qt5, el diccionario ``matplotlib.backends.backend_qt5.SPECIAL_KEYS`` contiene claves que *no* devuelven su nombre unicode sino que tienen nombres especificados manualmente. El nombre de ``QtCore.Qt.Key_Meta`` ha cambiado a ``'meta'`` para ser consistente con los otros backends de IGU.

source: The WebAgg backend now handles key translations correctly on non-US keyboard layouts.
es_es: El backend de WebAgg ahora maneja correctamente las traducciones de las teclas en los layouts de teclado no estadounidenses.

source: In the GTK and Tk backends, the handling of non-ASCII keypresses (as reported in the KeyEvent passed to ``key_press_event``-handlers) now correctly reports Unicode characters (e.g., €), and better respects NumLock on the numpad.
es_es: En los backends GTK y Tk, el manejo de las pulsaciones de teclas no ASCII (como se informa en el KeyEvent pasado a los manejadores ``key_press_event``) ahora informa correctamente de los caracteres Unicode (por ejemplo, €), y respeta mejor NumLock en el teclado numérico.

source: In the GTK and Tk backends, the following key names have changed; the new names are consistent with those reported by the Qt backends:
es_es: En los backends GTK y Tk, los siguientes nombres de teclas han cambiado; los nuevos nombres son consistentes con los reportados por los backends Qt:

source: The "Break/Pause" key (keysym 0xff13) is now reported as ``"pause"`` instead of ``"break"`` (this is also consistent with the X key name).
es_es: La tecla "Break/Pause" (keysym 0xff13) se reporta ahora como ``"pause"`` en lugar de ``"break"`` (esto también es consistente con el nombre de la tecla X).

source: The numpad "delete" key is now reported as ``"delete"`` instead of ``"dec"``.
es_es: La tecla "delete" del teclado numérico se reporta ahora como ``"delete"`` en lugar de ``"dec"``.
