Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.1.0.po
Languages: es_es

source: ``norm_flat`` (use ``numpy.linalg.norm(a.flat, ord=2)`` instead)
es_es: ``norm_flat`` (use ``numpy.linalg.norm(a.flat, ord=2)`` en su lugar)

source: ``normpdf`` (use `scipy.stats.norm.pdf` instead)
es_es: ``normpdf`` (utiliza `scipy.stats.norm.pdf` en su lugar)

source: ``poly_below``
es_es: ``poly_debajo``

source: ``poly_between``
es_es: ``poly_entre``

source: ``prctile`` (use `numpy.percentile` instead)
es_es: ``prctile`` (usa `numpy.percentile` en su lugar)

source: ``rec2csv`` (use `numpy.recarray.tofile` instead)
es_es: ``rec2csv`` (usa `numpy.recarray.tofile` en su lugar)

source: ``rec_append_fields``
es_es: ``rec_append_campos``

source: ``rec_drop_fields``
es_es: ``rec_soltar_campos``

source: ``rec_join``
es_es: ``rec_unir``

source: ``rk4`` (use `scipy.integrate.ode` instead)
es_es: ``rk4`` (usa `scipy.integrate.ode` en su lugar)

source: ``segments_intersect``
es_es: ``segmentos_intersectos``

source: ``slopes``
es_es: ``pendiente``

source: ``vector_lengths``
es_es: ``vector_longitud``

source: mplot3d changes
es_es: cambios mplot3d

source: Voxel shading
es_es: Sombreado de vóxeles

source: `.Axes3D.voxels` now shades the resulting voxels; for more details see What's new. The previous behavior can be achieved by passing ::
es_es: `.Axes3D.voxels` ahora sombrea los voceles resultantes; para más detalles ver Novedades. El comportamiento anterior se puede lograr pasando ::

source: Equal aspect axes disabled
es_es: Ejes de aspecto ecual desactivados

source: Setting the aspect on 3D axes previously returned non-sensical results (e.g. see :ghissue:`1077`). Calling ``ax.set_aspect('equal')`` or ``ax.set_aspect(num)`` on a 3D axes now raises a `NotImplementedError`.
es_es: Configurando el aspecto en ejes 3D previamente devolvió resultados sin sentido (por ejemplo, véase :ghissue:`1077`). Llamando a ``ax.set_aspect('igual')`` o ``ax.set_aspect(num)`` en un eje 3D ahora levanta un `NotImplementedError`.

source: `.Poly3DCollection.set_zsort` no longer silently ignores invalid inputs, or `False` (which was always broken). Passing `True` to mean ``"average"`` is deprecated.
es_es: `.Poly3DCollection.set_zsort` ya no ignora silenciosamente las entradas no válidas, o `False` (que siempre estuvo roto). Pasar `True` para significar ``"promedio"`` está obsoleto.

source: Testing
es_es: Prueba

source: The ``--no-network`` flag to ``tests.py`` has been removed (no test requires internet access anymore). If it is desired to disable internet access both for old and new versions of Matplotlib, use ``tests.py -m 'not network'`` (which is now a no-op).
es_es: La bandera ``--no-network`` a ``tests.py`` ha sido eliminada (no se requiere acceso a internet más). Si se desea desactivar el acceso a Internet tanto para versiones antiguas como nuevas de Matplotlib, utilice ``tests. y -m 'not network'` (que ahora es un no-op).

source: The image comparison test decorators now skip (rather than xfail) the test for uncomparable formats. The affected decorators are `~.image_comparison` and `~.check_figures_equal`. The deprecated `~.ImageComparisonTest` class is likewise changed.
es_es: Los decoradores de pruebas de comparación de imagen ahora omiten (en lugar de xfail) la prueba de formatos incomparables. Los decoradores afectados son `~. mage_comparison` y `~.check_figures_equal`. La clase `~.ImageComparisonTest` obsoleta es igual que cambiada.

source: Dependency changes
es_es: Cambios de dependencias

source: Matplotlib 3.1 now requires NumPy>=1.11.
es_es: Matplotlib 3.1 ahora requiere NumPy>=1.11.

source: ghostscript
es_es: guión

source: Support for ghostscript 8.60 (released in 2007) has been removed. The oldest supported version of ghostscript is now 9.0 (released in 2010).
es_es: El soporte para ghostscript 8.60 (publicado en 2007) ha sido eliminado. La versión más antigua soportada de ghostscript es ahora 9.0 (publicado en 2010).

source: Mathtext changes
es_es: Cambios en Mathtext

source: In constructs such as ``"$1~2$"``, mathtext now interprets the tilde as a space, consistently with TeX (this was previously a parse error).
es_es: En construcciones como ``"$1~2$"``, mathtext ahora interpreta la tilde como un espacio, consistentemente con TeX (esto fue un error de análisis).

source: Deprecations
es_es: Obsolescencias

source: The ``\stackrel`` mathtext command has been deprecated (it behaved differently from LaTeX's ``\stackrel``. To stack two mathtext expressions, use ``\genfrac{left-delim}{right-delim}{fraction-bar-thickness}{}{top}{bottom}``.
es_es: El comando mathtext ``\stackrel`` ha sido obsoleto (se comportó de forma diferente al ``\stackrel'' de LaTeX. Para apilar dos expresiones matemáticas, usa ``\genfrac{left-delim}{right-delim}{fraction-bar-thickness}{}{top}{bottom}``.

source: The ``\mathcircled`` mathtext command (which is not a real TeX command) is deprecated. Directly use unicode characters (e.g. ``"\N{CIRCLED LATIN CAPITAL LETTER A}"`` or ``"\u24b6"``) instead.
es_es: El comando de mathtext ``\mathcircled`` (que no es un comando TeX real) está obsoleto. Utilice directamente caracteres unicode (por ejemplo, ``"\N{CIRCLED LATIN CAPITAL LETTER A}"`` o ``"\u24b6"``) en su lugar.

source: Support for setting :rc:`mathtext.default` to circled is deprecated.
es_es: El soporte para establecer :rc:`mathtext.default` a circled está desaprobado.

source: Signature deprecations
es_es: Desaprobaciones de firma

source: The following signature related behaviours are deprecated:
es_es: Los siguientes comportamientos relacionados con la firma están obsoletos:

source: The *withdash* keyword argument to `.Axes.text()`. Consider using `.Axes.annotate()` instead.
es_es: El argumento de palabra clave *withdash* a `.Axes.text()`. Considere usar `.Axes.annotate()` en su lugar.

source: Passing (n, 1)-shaped error arrays to `.Axes.errorbar()`, which was not documented and did not work for ``n = 2``. Pass a 1D array instead.
es_es: Pasando (n, 1)-forma de arreglos de error a `.Axes.errorbar()`, que no estaba documentado y no funcionaba para ``n = 2``. Pasar una matriz 1D en su lugar.

source: The *frameon* kwarg to `~.Figure.savefig` and the :rc:`savefig.frameon` rcParam. To emulate ``frameon = False``, set *facecolor* to fully transparent (``"none"``, or ``(0, 0, 0, 0)``).
es_es: El kwarg *frameon* a `~.Figure.savefig` y el rcParam :rc:`savefig.frameon`. Para emular ``frameon = False``, establezca *facecolor* a completamente transparente (``"None "``, o ``(0, 0, 0, 0)``).

source: Passing a non-1D (typically, (n, 1)-shaped) input to `.Axes.pie`. Pass a 1D array instead.
es_es: Pasando una entrada que no sea 1D (típicamente, (n, 1) a `.Axes.pie`. Pase una matriz 1D en su lugar.

source: The `.TextPath` constructor used to silently drop ignored arguments; this behavior is deprecated.
es_es: El constructor `.TextPath` usado para soltar silenciosamente los argumentos ignorados; este comportamiento está obsoleto.

source: The *usetex* parameter of `.TextToPath.get_text_path` is deprecated and folded into the *ismath* parameter, which can now take the values `False`, `True`, and ``"TeX"``, consistently with other low-level text processing functions.
es_es: El parámetro *usetex* de `.TextToPath. et_text_path` está obsoleto y doblado en el parámetro *ismath*, que ahora puede tomar los valores `False`, `True`, y ``"TeX"``, consistentemente con otras funciones de procesamiento de texto de bajo nivel.

source: Passing ``'normal'`` to `.axes.Axes.axis()` is deprecated, use ``ax.axis('auto')`` instead.
es_es: Pasar ``'normal'`` a `.axes.Axes.axis()` está obsoleto, utilice ``ax.axis('auto')`` en su lugar.

source: Passing the *block* argument of `.pyplot.show` positionally is deprecated; it should be passed by keyword.
es_es: Pasar el argumento *block* de `.pyplot.show` posicionalmente está obsoleto; debería ser pasado por palabra clave.

source: When using the nbagg backend, `.pyplot.show` used to silently accept and ignore all combinations of positional and keyword arguments. This behavior is deprecated.
es_es: Cuando se utiliza el backend Textagg, `.pyplot.show` se utiliza para aceptar e ignorar silenciosamente todas las combinaciones de argumentos posicionales y de palabras clave. Este comportamiento está obsoleto.

source: The unused *shape* and *imlim* parameters to `.Axes.imshow` are deprecated. To avoid triggering the deprecation warning, the *filternorm*, *filterrad*, *resample*, and *url* arguments should be passed by keyword.
es_es: Los parámetros no utilizados *shape* e *imlim* de `.Axes.imshow` son obsoletos. Para evitar activar la advertencia de desaprobación, los argumentos *filternorm*, *filterrad*, *resample*, y *url* deben ser pasados por palabra clave.

source: The *interp_at_native* parameter to `.BboxImage`, which has had no effect since Matplotlib 2.0, is deprecated.
es_es: El parámetro *interp_at_native* a `.BboxImage`, que no ha tenido ningún efecto desde Matplotlib 2.0, es obsoleto.

source: All arguments to the ``matplotlib.cbook.deprecation.deprecated`` decorator and ``matplotlib.cbook.deprecation.warn_deprecated`` function, except the first one (the version where the deprecation occurred), are now keyword-only. The goal is to avoid accidentally setting the "message" argument when the "name" (or "alternative") argument was intended, as this has repeatedly occurred in the past.
es_es: Todos los argumentos a la función ``matplotlib.cbook.deprecation.deprecated`` y a la función ``matplotlib.cbook.deprecation.warn_deprecated``, excepto la primera (la versión donde se produjo la desaprobación), ahora son sólo palabras clave. El objetivo es evitar establecer accidentalmente el argumento "mensaje" cuando el argumento "nombre" (o "alternativa") fue intencionado, ya que esto ha ocurrido repetidas veces en el pasado.

source: The arguments of `matplotlib.testing.compare.calculate_rms` have been renamed from ``expectedImage, actualImage``, to ``expected_image, actual_image``.
es_es: Los argumentos de `matplotlib.testing.compare.calculate_rms` han sido renombrados de ``expectedImage, actualImage``, a ``expected_image, actual_image``.

source: Passing positional arguments to `.Axis.set_ticklabels` beyond *ticklabels* itself has no effect, and support for them is deprecated.
es_es: Pasar argumentos posicionales a `.Axis.set_ticklabels` más allá de *ticklabels* en sí mismo no tiene efecto y el soporte para ellos está obsoleto.

source: Passing ``shade=None`` to `~.axes3d.Axes3D.plot_surface` is deprecated. This was an unintended implementation detail with the same semantics as ``shade=False``. Please use the latter code instead.
es_es: Pasando ``shade=Ninguno`` a `~.axes3d.Axes3D.plot_surface` está obsoleto. Este era un detalle de implementación no deseada con los mismos semánticos que ``shade=False``. Por favor, utilice el último código en su lugar.

source: `matplotlib.ticker.MaxNLocator` and its *set_params* method will issue a warning on unknown keyword arguments instead of silently ignoring them. Future versions will raise an error.
es_es: `matplotlib.ticker.MaxNLocator` y su método *set_params* emitirán una advertencia en argumentos de palabra clave desconocidos en lugar de ignorarlos silenciosamente. Las futuras versiones generarán un error.

source: Changes in parameter names
es_es: Cambios en nombres de parámetros

source: The *arg* parameter to `matplotlib.use` has been renamed to *backend*.
es_es: El parámetro *arg* a `matplotlib.use` ha sido renombrado a *backend*.

source: This will only affect cases where that parameter has been set as a keyword argument. The common usage pattern as a positional argument ``matplotlib.use('Qt5Agg')`` is not affected.
es_es: Esto sólo afectará los casos en los que ese parámetro se haya establecido como un argumento de palabra clave. El patrón de uso común como argumento posicional ``matplotlib.use('Qt5Agg')`` no se ve afectado.

source: The *normed* parameter to `.Axes.hist2d` has been renamed to *density*.
es_es: El parámetro *normed* a `.Axes.medium2d` ha sido renombrado a *densidad*.

source: The *s* parameter to `.Annotation` (and indirectly `.Axes.annotate`) has been renamed to *text*.
es_es: El parámetro *s* a `.Annotation` (y indirectamente `.Axes.annotate`) ha sido renombrado a *text*.

source: The *tolerence* parameter to `.bezier.find_bezier_t_intersecting_with_closedpath`, `.bezier.split_bezier_intersecting_with_closedpath`, ``bezier.find_r_to_boundary_of_closedpath``, `.bezier.split_path_inout` and `.bezier.check_if_parallel` has been renamed to *tolerance*.
es_es: El parámetro *tolerencia* a `.bezier.find_bezier_t_intersecting_with_closedpath`, `.bezier.split_bezier_intersecting_with_closedpath`, ``bezier.find_r_to_boundary_of_closedpath``, `.bezier.split_path_inout` y `.bezier.check_if_parallel` ha sido renombrado como *tolerancia*.

source: In each case, the old parameter name remains supported (it cannot be used simultaneously with the new name), but support for it will be dropped in Matplotlib 3.3.
es_es: En cada caso, el antiguo nombre del parámetro permanece soportado (no se puede utilizar simultáneamente con el nuevo nombre), pero el soporte se eliminará en Matplotlib 3.3.

source: Class/method/attribute deprecations
es_es: Clase/método/atributo obsoletos

source: Support for custom backends that do not provide a `.GraphicsContextBase.set_hatch_color` method is deprecated. We suggest that custom backends let their ``GraphicsContext`` class inherit from `.GraphicsContextBase`, to at least provide stubs for all required methods.
es_es: Soporte para backends personalizados que no proporcionan un método `.GraphicsContextBase.set_hatch_color` está obsoleto. Sugerimos que los backends personalizados dejen que su clase ``GraphicsContext`` hereda de `.GraphicsContextBase`, para al menos proporcionar stubs para todos los métodos requeridos.

source: This has not been used in the codebase since its addition in 2009.
es_es: Esto no ha sido utilizado en el código base desde su adición en 2009.

source: This has never been used internally, there is no equivalent method exists on the 2D Axis classes, and despite the similar name, it has a completely different behavior from the 2D Axis' `axis.Axis.get_ticks_position` method.
es_es: Esto nunca se ha utilizado internamente, no existe un método equivalente en las clases del eje 2D, y a pesar del nombre similar, tiene un comportamiento completamente diferente del eje `Eje 2D'. Método xis.get_ticks_position`.

source: ``mpl_toolkits.axisartist.axislines.SimpleChainedObjects``
es_es: ``mpl_toolkits.axisartist.axislines.SimpleChainedObject``

source: ``mpl_toolkits.Axes.AxisDict``
es_es: ``mpl_toolkits.Ejes.AxisDict``

source: Internal Helper Functions
es_es: Funciones internas de ayuda

source: Use the standard library's docstring manipulation tools instead, such as `inspect.cleandoc` and `inspect.getdoc`.
es_es: En su lugar, utilice las herramientas de manipulación docstring de la biblioteca estándar, como `inspect.cleandoc` y `inspect.getdoc`.

source: These are considered internal and will be removed from the public API in a future version.
es_es: Estos se consideran internos y se eliminarán de la API pública en una versión futura.

source: ``projections.process_projection_requirements``
es_es: ``projectections.process_projectection_requirements``

source: ``cbook.safezip`` Manually check the lengths of the inputs instead, or rely on NumPy to do it.
es_es: ``cbook.safezip`` Comprobar manualmente las longitudes de las entradas en su lugar, o confiar en NumPy para hacerlo.

source: ``cbook.is_hashable`` Use ``isinstance(..., collections.abc.Hashable)`` instead.
es_es: ``cbook.is_hashable`` Utilice ``isinstance(..., collections.abc.Hashable)`` en su lugar.

source: The ``.backend_bases.RendererBase.strip_math``. Use `.cbook.strip_math` instead.
es_es: El ``.backend_bases.RendererBase.strip_math``. Use `.cbook.strip_math` en su lugar.

source: Multiple internal functions that were exposed as part of the public API of `.mpl_toolkits.mplot3d` are deprecated,
es_es: Múltiples funciones internas que fueron expuestas como parte de la API pública de `.mpl_toolkits.mplot3d` están obsoletas,

source: ``mpl_toolkits.mplot3d.proj3d.proj_transform_vec``
es_es: ``mpl_toolkits.mplot3d.proj3d.proj3d_transform_vec``

source: If your project relies on these functions, consider vendoring them.
es_es: Si tu proyecto se basa en estas funciones, considera concederlas.

source: ``font_manager.OSXInstalledFonts``
es_es: ``font_manager.OSXXInstalledFonts``

source: ``.TextToPath.glyph_to_path`` (Instead call ``font.get_path()`` and manually transform the path.)
es_es: ``.TextToPath.glyph_to_path`` (en su lugar llama a ``font.get_path()`` y transforma manualmente la ruta.)

source: Date related functions
es_es: Funciones relacionadas con la fecha

source: These are brittle in the presence of locale changes. Use standard datetime parsers such as `time.strptime` or `dateutil.parser.parse`, and additionally call `matplotlib.dates.date2num` if you need to convert to Matplotlib's internal datetime representation; or use ``dates.datestr2num``.
es_es: Estos son ligeramente en presencia de cambios de locale. Usa parsers de fecha estándar como `time.strptime` o `dateutil.parser. arse`, y además llame a `matplotlib.dates.date2num` si necesita convertir a la representación interna de la fecha de Matplotlib; o use ``dates.datestr2num``.

source: Axes3D
es_es: Ejes3D

source: Use `.axes3d.Axes3D.xaxis`, `.axes3d.Axes3D.yaxis` and `.axes3d.Axes3D.zaxis` instead.
es_es: Usa `.axes3d.Axes3D.xaxis`, `.axes3d.Axes3D.yaxis` y `.axes3d.Axes3D.zaxis` en su lugar.

source: ``matplotlib.testing.decorators.switch_backend`` decorator
es_es: ``decorador matplotlib.testing.decorators.switch_backend``

source: Test functions should use ``pytest.mark.backend``, and the mark will be picked up by the `matplotlib.testing.conftest.mpl_test_settings` fixture.
es_es: Las funciones de prueba deben usar ``pytest.mark.backend``, y la marca será recogida por el fixture `matplotlib.testing.conftest.mpl_test_settings`.

source: ``.color`` attribute of `.Quiver` objects
es_es: atributo ``.color`` de los objetos `.Quiver`

source: Instead, use (as for any `.Collection`) the ``get_facecolor`` method. Note that setting to the ``.color`` attribute did not update the quiver artist, whereas calling ``set_facecolor`` does.
es_es: En su lugar, use (como para cualquier `.Collection`) el método ``get_facecolor``. Tenga en cuenta que configurando el ``. el atributo olor`` no actualizó el artista quiver, mientras que llamar a ``set_facecolor`` sí.

source: GUI / backend details
es_es: Detalles del GUI / backend

source: ``.NavigationToolbar2QT.adj_window`` attribute. This is unused and always ``None``.
es_es: Atributo ``.NavigationToolbar2QT.adj_window``. Esto no es usado y siempre ``Ninguno``.

source: ``.backend_wx.IDLE_DELAY`` global variable This is unused and only relevant to the now removed wx "idling" code (note that as it is a module-level global, no deprecation warning is emitted when accessing it).
es_es: ``.backend_wx. DLE_DELAY`` variable global Esta no es usada y sólo es relevante para el código wx "idling" ahora eliminado (ten en cuenta que ya que es un global de nivel de módulo, no se emite ninguna advertencia de desaprobación al acceder a ella).

source: ``matplotlib.backends.qt_editor.formlayout`` module
es_es: ``matplotlib.backends.qt_editor.formlayout`` módulo

source: This module is a vendored, modified version of the official formlayout_ module available on PyPI. Install that module separately if you need it.
es_es: Este módulo es una versión revisada y modificada del módulo oficial formlayout_ disponible en PyPI. Instala ese módulo por separado si lo necesitas.

source: Transforms / scales
es_es: Transformas/escalas

source: ``NaturalLogTransformLog``
es_es: ``NaturalLogTransformLogLog``

source: ``InvertedLog10Transform``
es_es: ``Transformación InvertedLog10``

source: ``InvertedLog2Transform``
es_es: ``Log2Transformación Invertada``

source: ``InvertedNaturalLogTransform``
es_es: ``NaturalLogTransform`` invertido

source: These classes defined in :mod:`matplotlib.scale` are deprecated. As a replacement, use the general `~.scale.LogTransform` and `~.scale.InvertedLogTransform` classes, whose constructors take a *base* argument.
es_es: Estas clases definidas en :mod:`matplotlib.scale` son desaprobadas. Como un reemplazo, usa las clases generales `~.scale.LogTransform` y `~.scale.InvertedLogTransform`, cuyos constructores toman un argumento *base*.

source: Locators / Formatters
es_es: Localizadores / Formatos

source: These are helper methods that do not have a consistent signature across formatter classes.
es_es: Estos son métodos de ayuda que no tienen una firma consistente entre las clases de formateo.

source: Path tools
es_es: Herramientas de ruta

source: Use `~.path.get_path_collection_extents` instead.
es_es: En su lugar, usa `~.path.get_path_collection_extents`.

source: ``.Path.has_nonfinite`` attribute
es_es: atributo ``.Path.has_nonfinite``

source: Use ``not np.isfinite(path.vertices).all()`` instead.
es_es: Utilice ``not np.isfinite(path.vertices).all()`` en su lugar.

source: ``.bezier.find_r_to_boundary_of_closedpath`` function is deprecated
es_es: ``.bezier.find_r_to_limundary_of_closedpath`` función está obsoleta

source: This has always returned None instead of the requested radius.
es_es: Esto siempre ha devuelto Ninguno en lugar del radio solicitado.

source: Text
es_es: Texto

source: ``Text.is_math_text``
es_es: ``Texto.is_math_text``

source: ``TextPath.text_get_vertices_codes`` (As an alternative, construct a new ``TextPath`` object.)
es_es: ``TextPath.text_get_vertices_codes`` (Como alternativa, construye un nuevo objeto ``TextPath``.)

source: Unused attributes
es_es: Atributos no usados

source: These are unused and never updated.
es_es: No se utilizan y nunca se actualizan.

source: Sphinx extensions
es_es: Extensiones de Sphinx

source: This is because the ``matplotlib.sphinxext.mathmpl`` and ``matplotlib.sphinxext.plot_directive`` interfaces have changed from the (Sphinx-)deprecated function-based interface to a class-based interface; this should not affect end users.
es_es: Esto se debe a que las interfaces ``matplotlib.sphinxext.mathmpl`` y ``matplotlib.sphinxext.plot_directive`` han cambiado de la interfaz basada en funciones (Sphinx-)desaprobada a una interfaz basada en clases; esto no debería afectar a los usuarios finales.

source: ``mpl_toolkits.axisartist.axis_artist.UnimplementedException``
es_es: ``mpl_toolkits.axisartist.axis_artist.Excepción``

source: Environmental Variables
es_es: Variables Ambientales

source: The ``MATPLOTLIBDATA`` environment variable
es_es: La variable de entorno ``MATPLOTLIBDATA``

source: Axis
es_es: Eje

source: ``Axis.iter_ticks``
es_es: ``Eje.iter_ticks``

source: This only served as a helper to the private `.Axis._update_ticks`
es_es: Esto sólo sirvió como un ayudante para el `.Axis._update_ticks` privado

source: Undeprecations
es_es: Sin desaprobación

source: The following API elements have been un-deprecated:
es_es: Los siguientes elementos API han sido desaprobados:

source: The *obj_type* keyword argument to the ``matplotlib.cbook.deprecation.deprecated`` decorator.
es_es: El argumento de palabra clave *obj_type* para el decorador ``matplotlib.cbook.deprecation.deprecated``.

source: *xmin*, *xmax* keyword arguments to `.Axes.set_xlim` and *ymin*, *ymax* keyword arguments to `.Axes.set_ylim`
es_es: *xmin*, argumentos de palabra clave *xmax* a `.Axes.set_xlim` y *ymin*, argumentos de palabra clave *ymax* a `.Axes.set_ylim`

source: New features
es_es: Nuevas características

source: `.Text` now has a ``c`` alias for the ``color`` property
es_es: `.Text` ahora tiene un alias ``c`` para la propiedad ``color``
