Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.5.0.po
Languages: es_es

source: The API for Selector widgets has been unified to use:
es_es: Se ha unificado el uso de la API para los widgets del selector:

source: *props* for the properties of the Artist representing the selection.
es_es: *props* para las propiedades del Artist que representa la selección.

source: *handle_props* for the Artists representing handles for modifying the selection.
es_es: *handle_props* para los Artists que representan las asas para modificar la selección.

source: *grab_range* for the maximal tolerance to grab a handle with the mouse.
es_es: *grab_range* para la tolerancia máxima para agarrar un asa con el ratón.

source: Additionally, several internal parameters and attribute have been deprecated with the intention of keeping them private.
es_es: Además, varios parámetros internos y atributos han sido obsoletos con la intención de mantenerlos privados.

source: RectangleSelector and EllipseSelector
es_es: RectangleSelector y EllipseSelector

source: The *drawtype* keyword argument to `~matplotlib.widgets.RectangleSelector` is deprecated. In the future the only behaviour will be the default behaviour of ``drawtype='box'``.
es_es: El argumento de la palabra clave *drawtype* para `~matplotlib.widgets.RectangleSelector` está obsoleto. En el futuro el único comportamiento será el predeterminado de ``drawtype='box'``.

source: Support for ``drawtype=line`` will be removed altogether as it is not clear which points are within and outside a selector that is just a line. As a result, the *lineprops* keyword argument to `~matplotlib.widgets.RectangleSelector` is also deprecated.
es_es: El soporte para ``drawtype=line`` será eliminado por completo ya que no está claro qué puntos están dentro y fuera de un selector que es sólo una línea. Como resultado, el argumento de la palabra clave *lineprops* para `~matplotlib.widgets.RectangleSelector` también queda obsoleto.

source: To retain the behaviour of ``drawtype='none'``, use ``rectprops={'visible': False}`` to make the drawn `~matplotlib.patches.Rectangle` invisible.
es_es: Para mantener el comportamiento de ``drawtype='none'``, utiliza ``rectprops={'visible': False}`` para hacer invisible el `~matplotlib.patches.Rectangle` dibujado.

source: Cleaned up attributes and arguments are:
es_es: Los atributos y argumentos limpiados son:

source: The ``active_handle`` attribute has been privatized and deprecated.
es_es: El atributo ``active_handle`` ha sido privatizado y obsoleto.

source: The ``drawtype`` attribute has been privatized and deprecated.
es_es: El atributo ``drawtype`` ha sido privatizado y obsoleto.

source: The ``eventpress`` attribute has been privatized and deprecated.
es_es: El atributo ``eventpress`` ha sido privatizado y obsoleto.

source: The ``eventrelease`` attribute has been privatized and deprecated.
es_es: El atributo ``eventrelease`` ha sido privatizado y obsoleto.

source: The ``interactive`` attribute has been privatized and deprecated.
es_es: El atributo ``interactive`` ha sido privatizado y obsoleto.

source: The *marker_props* argument is deprecated, use *handle_props* instead.
es_es: El argumento *marker_props* está obsoleto, usa *handle_props* en su lugar.

source: The *maxdist* argument is deprecated, use *grab_range* instead.
es_es: El argumento *maxdist* está obsoleto, usa *grab_range* en su lugar.

source: The *rectprops* argument is deprecated, use *props* instead.
es_es: El argumento *rectprops* está obsoleto, usa *props*.

source: The ``rectprops`` attribute has been privatized and deprecated.
es_es: El atributo ``rectprops`` ha sido privatizado y obsoleto.

source: The ``state`` attribute has been privatized and deprecated.
es_es: El atributo ``state`` ha sido privatizado y obsoleto.

source: The ``to_draw`` attribute has been privatized and deprecated.
es_es: El atributo ``to_draw`` ha sido privatizado y obsoleto.

source: The *line* attribute is deprecated. If you want to change the selector artist properties, use the ``set_props`` or ``set_handle_props`` methods.
es_es: El atributo *line* está obsoleto. Si quieres cambiar las propiedades del artist selector, utiliza los métodos ``set_props`` o ``set_handle_props``.

source: The *lineprops* argument is deprecated, use *props* instead.
es_es: El argumento de *props* está obsoleto, usa *props* en su lugar.

source: The *markerprops* argument is deprecated, use *handle_props* instead.
es_es: El argumento *markerprops* está obsoleto, utiliza en su lugar *handle_props*.

source: The *maxdist* argument and attribute is deprecated, use *grab_range* instead.
es_es: El argumento y atributo *maxdist* está obsoleto, utilice *grab_range* en su lugar.

source: The *vertex_select_radius* argument and attribute is deprecated, use *grab_range* instead.
es_es: El argumento y atributo *vertex_select_radius* está obsoleto, utiliza en su lugar *grab_range*.

source: The ``pressv`` attribute has been privatized and deprecated.
es_es: El atributo ``pressv`` ha sido privatizado y obsoleto.

source: The ``prev`` attribute has been privatized and deprecated.
es_es: El atributo ``prev`` ha sido privatizado y obsoleto.

source: The ``rect`` attribute has been privatized and deprecated.
es_es: El atributo ``rect`` ha sido privatizado y obsoleto.

source: The *span_stays* argument is deprecated, use the *interactive* argument instead.
es_es: El argumento *span_stays* está obsoleto, utiliza el argumento *interactivo* en su lugar.

source: The ``span_stays`` attribute has been privatized and deprecated.
es_es: El atributo ``span_stays`` ha sido privatizado y obsoleto.

source: The ``onpress`` and ``onrelease`` methods are deprecated. They are straight aliases for ``press`` and ``release``.
es_es: Los métodos ``onpress`` y ``onrelease`` están obsoletos. Son simples alias de ``press`` y ``release``.

source: ``ConversionInterface.convert`` no longer needs to accept unitless values
es_es: ``ConversionInterface.convert`` ya no necesita aceptar valores sin unidades

source: Previously, custom subclasses of `.units.ConversionInterface` needed to implement a ``convert`` method that not only accepted instances of the unit, but also unitless values (which are passed through as is). This is no longer the case (``convert`` is never called with a unitless value), and such support in `.StrCategoryConverter` is deprecated. Likewise, the `.ConversionInterface.is_numlike` helper is deprecated.
es_es: Anteriormente, las subclases personalizadas de `.units.ConversionInterface` necesitaban implementar un método ``convert`` que no sólo aceptara instancias de la unidad, sino también valores sin unidades (que se pasaban tal cual). Este ya no es el caso (``convert`` nunca se llama con un valor sin unidades), y este soporte en `.StrCategoryConverter` está obsoleto. Del mismo modo, el helper `.ConversionInterface.is_numlike` está obsoleto.

source: Consider calling `.Axis.convert_units` instead, which still supports unitless values.
es_es: Considere la posibilidad de invocar `.Axis.convert_units` en su lugar, que aún admite valores sin unidades.

source: Locator and Formatter wrapper methods
es_es: Métodos de envoltura del localizador y del formateador

source: The ``set_view_interval``, ``set_data_interval`` and ``set_bounds`` methods of `.Locator`\s and `.Formatter`\s (and their common base class, TickHelper) are deprecated. Directly manipulate the view and data intervals on the underlying axis instead.
es_es: Los métodos ``set_view_interval``, ``set_data_interval`` y ``set_bounds`` de `.Locator` y `.Formatter` (y su clase base común, TickHelper) están obsoletos. En su lugar, manipule directamente la vista y los intervalos de datos en el eje subyacente.

source: Unused positional parameters to ``print_<fmt>`` methods
es_es: Parámetros posicionales no utilizados en los métodos ``print_<fmt>``

source: None of the ``print_<fmt>`` methods implemented by canvas subclasses used positional arguments other that the first (the output filename or file-like), so these extra parameters are deprecated.
es_es: Ninguno de los métodos ``print_<fmt>`` implementados por las subclases de canvas utilizaba argumentos posicionales distintos del primero (el nombre del archivo de salida o similar al archivo), por lo que estos parámetros extra están obsoletos.

source: ``QuadMesh`` signature
es_es: Firma ``QuadMesh``

source: The `.QuadMesh` signature ::
es_es: La firma `.QuadMesh` ::

source: is deprecated and replaced by the new signature ::
es_es: está obsoleto y sustituido por la nueva firma ::

source: In particular:
es_es: En particular:

source: The *coordinates* argument must now be a (M, N, 2) array-like. Previously, the grid shape was separately specified as (*meshHeight* + 1, *meshWidth* + 1) and *coordinates* could be an array-like of any shape with M * N * 2 elements.
es_es: El argumento *coordenadas* debe ser ahora un array-like (M, N, 2). Anteriormente, la forma de la malla se especificaba por separado como (*meshHeight* + 1, *meshWidth* + 1) y *coordinates* podía ser un array-like de cualquier forma con M * N * 2 elementos.

source: All parameters except *coordinates* are keyword-only now.
es_es: Todos los parámetros excepto *coordenadas* son sólo palabras clave.

source: rcParams will no longer cast inputs to str
es_es: rcParams ya no convertirá entradas a str

source: After a deprecation period, rcParams that expect a (non-pathlike) str will no longer cast non-str inputs using `str`. This will avoid confusing errors in subsequent code if e.g. a list input gets implicitly cast to a str.
es_es: Después de un período de obsolescencia, los rcParams que esperan una cadena (no similar a un camino) ya no convertirán las entradas que no sean cadenas utilizando `str`. Esto evitará errores de confusión en el código posterior si, por ejemplo, una entrada de lista se convierte implícitamente en una cadena.

source: Case-insensitive scales
es_es: Escalas insensibles en mayúsculas

source: Previously, scales could be set case-insensitively (e.g., ``set_xscale("LoG")``). This is deprecated; all builtin scales use lowercase names.
es_es: Anteriormente, las escalas podían establecerse sin distinguir entre mayúsculas y minúsculas (por ejemplo, ``set_xscale("LoG")``). Esto está obsoleto; todas las escalas incorporadas utilizan nombres en minúsculas.

source: Interactive cursor details
es_es: Detalles del cursor interactivo

source: Setting a mouse cursor on a window has been moved from the toolbar to the canvas. Consequently, several implementation details on toolbars and within backends have been deprecated.
es_es: La fijación del cursor del ratón en una ventana se ha trasladado de la barra de herramientas al lienzo. En consecuencia, varios detalles de implementación en las barras de herramientas y dentro de los backends han quedado obsoletos.

source: ``NavigationToolbar2.set_cursor`` and ``backend_tools.SetCursorBase.set_cursor``
es_es: ``NavigationToolbar2.set_cursor`` y ``backend_tools.SetCursorBase.set_cursor``

source: Instead, use the `.FigureCanvasBase.set_cursor` method on the canvas (available as the ``canvas`` attribute on the toolbar or the Figure.)
es_es: En su lugar, utiliza el método `.FigureCanvasBase.set_cursor` en el canvas (disponible como el atributo ``canvas`` en la barra de herramientas o la figura.)

source: ``backend_tools.SetCursorBase`` and subclasses
es_es: ``backend_tools.SetCursorBase`` y subclases

source: ``backend_tools.SetCursorBase`` was subclassed to provide backend-specific implementations of ``set_cursor``. As that is now deprecated, the subclassing is no longer necessary. Consequently, the following subclasses are also deprecated:
es_es: ``backend_tools.SetCursorBase`` fue subclasificado para proporcionar implementaciones específicas del backend de ``set_cursor``. Como esto ya está obsoleto, la subclase ya no es necesaria. En consecuencia, las siguientes subclases también están obsoletas:

source: Instead, use the `.backend_tools.ToolSetCursor` class.
es_es: En su lugar, utiliza la clase `.backend_tools.ToolSetCursor`.

source: ``cursord`` in GTK, Qt, and wx backends
es_es: ``cursord`` en backends de GTK, Qt y wx

source: The ``backend_gtk3.cursord``, ``backend_qt.cursord``, and ``backend_wx.cursord`` dictionaries are deprecated. This makes the GTK module importable on headless environments.
es_es: Los diccionarios ``backend_gtk3.cursord``, ``backend_qt.cursord``, y ``backend_wx.cursord`` están obsoletos. Esto hace que el módulo GTK sea importable en entornos headless.

source: Miscellaneous deprecations
es_es: Varias obsoletas

source: ``is_url`` and ``URL_REGEX`` are deprecated. (They were previously defined in the toplevel :mod:`matplotlib` module.)
es_es: ``is_url`` y ``URL_REGEX`` están obsoletos. (Anteriormente se definían en el módulo toplevel :mod:`matplotlib`)

source: The ``ArrowStyle.beginarrow`` and ``ArrowStyle.endarrow`` attributes are deprecated; use the ``arrow`` attribute to define the desired heads and tails of the arrow.
es_es: Los atributos ``ArrowStyle.beginarrow`` y ``ArrowStyle.endarrow`` están obsoletos; utiliza el atributo ``arrow`` para definir las cabezas y colas de la flecha.

source: ``backend_pgf.LatexManager.str_cache`` is deprecated.
es_es: ``backend_pgf.LatexManager.str_cache`` está obsoleto.

source: ``backends.qt_compat.ETS`` and ``backends.qt_compat.QT_RC_MAJOR_VERSION`` are deprecated, with no replacement.
es_es: ``backends.qt_compat.ETS`` y ``backends.qt_compat.QT_RC_MAJOR_VERSION`` están obsoletos, sin reemplazo.

source: The ``blocking_input`` module has been deprecated. Instead, use ``canvas.start_event_loop()`` and ``canvas.stop_event_loop()`` while connecting event callbacks as needed.
es_es: El módulo ``blocking_input`` ha quedado obsoleto. En su lugar, utiliza ``canvas.start_event_loop()`` y ``canvas.stop_event_loop()`` mientras conectas las devoluciones de eventos según sea necesario.

source: ``cbook.report_memory`` is deprecated; use ``psutil.virtual_memory`` instead.
es_es: ``cbook.report_memory`` está obsoleto; usa ``psutil.virtual_memory`` en su lugar.

source: ``cm.LUTSIZE`` is deprecated. Use :rc:`image.lut` instead. This value only affects colormap quantization levels for default colormaps generated at module import time.
es_es: ``cm.LUTSIZE`` está obsoleto. Utiliza :rc:`image.lut` en su lugar. Este valor sólo afecta a los niveles de cuantificación de los mapas de color por defecto generados al importar el módulo.

source: ``Collection.__init__`` previously ignored *transOffset* without *offsets* also being specified. In the future, *transOffset* will begin having an effect regardless of *offsets*. In the meantime, if you wish to set *transOffset*, call `.Collection.set_offset_transform` explicitly.
es_es: Anteriormente, ``Collection.__init__`` ignoraba *transOffset* si no se especificaba también *offsets*. En el futuro, *transOffset* empezará a tener efecto independientemente de *offsets*. Mientras tanto, si desea establecer *transOffset*, llame a `.Collection.set_offset_transform` explícitamente.

source: ``Colorbar.patch`` is deprecated; this attribute is not correctly updated anymore.
es_es: ``Colorbar.patch`` está obsoleto; este atributo ya no se actualiza correctamente.

source: ``ContourLabeler.get_label_width`` is deprecated.
es_es: ``ContourLabeler.get_label_width`` está obsoleto.

source: ``dviread.PsfontsMap`` now raises LookupError instead of KeyError for missing fonts.
es_es: ``dviread.PsfontsMap`` ahora plantea LookupError en lugar de KeyError para fuentes faltantes.

source: ``Dvi.baseline`` is deprecated (with no replacement).
es_es: ``Dvi.baseline`` está obsoleto (sin reemplazo).

source: The *format* parameter of ``dviread.find_tex_file`` is deprecated (with no replacement).
es_es: El parámetro *format* de ``dviread.find_tex_file`` está obsoleto (sin reemplazo).

source: ``FancyArrowPatch.get_path_in_displaycoord`` and ``ConnectionPath.get_path_in_displaycoord`` are deprecated. The path in display coordinates can still be obtained, as for other patches, using ``patch.get_transform().transform_path(patch.get_path())``.
es_es: ``FancyArrowPatch.get_path_in_displaycoord`` y ``ConnectionPath.get_path_in_displaycoord`` están obsoletos. La ruta en coordenadas de visualización todavía puede obtenerse, como para otros parches, utilizando ``patch.get_transform().transform_path(patch.get_path())``.

source: The ``font_manager.win32InstalledFonts`` and ``font_manager.get_fontconfig_fonts`` helper functions have been deprecated.
es_es: Las funciones de ayuda ``font_manager.win32InstalledFonts`` y ``font_manager.get_fontconfig_fonts`` han sido obsoletas.

source: All parameters of ``imshow`` starting from *aspect* will become keyword-only.
es_es: Todos los parámetros de ``imshow`` a partir de *aspect* se convertirán en palabra clave.

source: ``QuadMesh.convert_mesh_to_paths`` and ``QuadMesh.convert_mesh_to_triangles`` are deprecated. ``QuadMesh.get_paths()`` can be used as an alternative for the former; there is no replacement for the latter.
es_es: ``QuadMesh.convert_mesh_to_paths`` y ``QuadMesh.convert_mesh_to_triangles`` están obsoletos. ``QuadMesh.get_paths()`` puede ser usado como una alternativa para la primera; no hay reemplazo para esta última.

source: ``ScalarMappable.callbacksSM`` is deprecated. Use ``ScalarMappable.callbacks`` instead.
es_es: ``ScalarMappable.callbacksSM`` está obsoleto. Utiliza ``ScalarMappable.callbacks`` en su lugar.

source: ``streamplot.get_integrator`` is deprecated.
es_es: ``streamplot.get_integrator`` está obsoleto.

source: ``style.core.STYLE_FILE_PATTERN``, ``style.core.load_base_library``, and ``style.core.iter_user_libraries`` are deprecated.
es_es: ``style.core.STYLE_FILE_PATTERN``, ``style.core.load_base_library``, y ``style.core.iter_user_libraries`` están obsoletas.

source: ``SubplotParams.validate`` is deprecated. Use `.SubplotParams.update` to change `.SubplotParams` while always keeping it in a valid state.
es_es: ``SubplotParams.validate`` está obsoleto. Usa `.SubplotParams.update` para cambiar `.SubplotParams` mientras siempre se mantiene en un estado válido.

source: The ``grey_arrayd``, ``font_family``, ``font_families``, and ``font_info`` attributes of `.TexManager` are deprecated.
es_es: Los atributos ``grey_arrayd``, ``font_family``, ``font_families``, y ``font_info`` de `.TexManager` están obsoletos.

source: ``Text.get_prop_tup`` is deprecated with no replacements (because the `.Text` class cannot know whether a backend needs to update cache e.g. when the text's color changes).
es_es: ``Text.get_prop_tup`` está obsoleto y no tiene sustituto (porque la clase `.Text` no puede saber si un backend necesita actualizar la caché, por ejemplo, cuando cambia el color del texto).

source: ``Tick.apply_tickdir`` didn't actually update the tick markers on the existing Line2D objects used to draw the ticks and is deprecated; use `.Axis.set_tick_params` instead.
es_es: ``Tick.apply_tickdir`` no actualizaba realmente los marcadores de ticks en los objetos Line2D existentes utilizados para dibujar los ticks y está obsoleto; utiliza `.Axis.set_tick_params` en su lugar.

source: ``tight_layout.auto_adjust_subplotpars`` is deprecated.
es_es: ``tight_layout.auto_adjust_subplotpars`` está obsoleto.

source: The ``grid_info`` attribute of ``axisartist`` classes has been deprecated.
es_es: El atributo ``grid_info`` de las clases ``axisartist`` ha sido obsoleto.

source: ``axisartist.clip_path`` is deprecated with no replacement.
es_es: ``axisartist.clip_path`` está obsoleto sin reemplazo.

source: ``axes_grid1.axes_grid.CbarAxes`` and ``axes_grid1.axisartist.CbarAxes`` are deprecated (they are now dynamically generated based on the owning axes class).
es_es: ``axes_grid1.axes_grid.CbarAxes`` y ``axes_grid1.axisartist.CbarAxes`` están obsoletos (ahora se generan dinámicamente basándose en la clase de ejes propia).

source: The ``axes_grid1.Divider.get_vsize_hsize`` and ``axes_grid1.Grid.get_vsize_hsize`` methods are deprecated. Copy their implementations if needed.
es_es: Los métodos ``axes_grid1.Divider.get_vsize_hsize`` y ``axes_grid1.Grid.get_vsize_hsize`` están obsoletos. Copia sus implementaciones si es necesario.

source: ``AxesDivider.append_axes(..., add_to_figure=False)`` is deprecated. Use ``ax.remove()`` to remove the Axes from the figure if needed.
es_es: ``AxesDivider.append_axes(..., add_to_figure=False)`` está obsoleto. Usa ``ax.remove()`` para eliminar los ejes de la figura si es necesario.

source: ``FixedAxisArtistHelper.change_tick_coord`` is deprecated with no replacement.
es_es: ``FixedAxisArtistHelper.change_tick_coord`` está obsoleto sin reemplazo.

source: ``floating_axes.GridHelperCurveLinear.get_boundary`` is deprecated, with no replacement.
es_es: ``floating_axes.GridHelperCurveLinear.get_boundary`` está obsoleto, sin reemplazo.

source: ``ParasiteAxesBase.get_images_artists`` has been deprecated.
es_es: ``ParasiteAxesBase.get_images_artists`` ha sido obsoleto.

source: The "units finalize" signal (previously emitted by Axis instances) is deprecated. Connect to "units" instead.
es_es: La señal "unidades finalizar" (previamente emitida por instancias de ejes) está obsoleta. Conecta a "unidades" en su lugar.

source: Passing formatting parameters positionally to ``stem()`` is deprecated
es_es: Pasar parámetros de formato posicionalmente a ``stem()`` está obsoleto

source: ``plot_directive`` deprecations
es_es: ``plot_directive`` obsoletas

source: The ``:encoding:`` option to ``.. plot`` directive has had no effect since Matplotlib 1.3.1, and is now deprecated.
es_es: La opción ``:encoding:`` a la directiva ``.. plot`` no ha tenido efecto desde Matplotlib 1.3.1, y ahora está obsoleta.

source: The following helpers in `matplotlib.sphinxext.plot_directive` are deprecated:
es_es: Los siguientes ayudantes en `matplotlib.sphinxext.plot_directive` son obsoletos:

source: ``unescape_doctest`` (use `doctest.script_from_examples` instead),
es_es: ``unescape_doctest`` (usa `doctest.script_from_examples` en su lugar),

source: Testing support
es_es: Pruebas de soporte

source: ``matplotlib.test()`` is deprecated
es_es: ``matplotlib.test()`` está obsoleto

source: Run tests using ``pytest`` from the commandline instead. The variable ``matplotlib.default_test_modules`` is only used for ``matplotlib.test()`` and is thus deprecated as well.
es_es: Ejecuta las pruebas utilizando ``pytest`` desde la línea de comandos. La variable ``matplotlib.default_test_modules`` sólo se utiliza para ``matplotlib.test()`` y, por tanto, también está obsoleta.

source: To test an installed copy, be sure to specify both ``matplotlib`` and ``mpl_toolkits`` with ``--pyargs``::
es_es: Para probar una copia instalada, asegúrate de especificar tanto ``matplotlib`` como ``mpl_toolkits`` con ``--pyargs``::

source: See :ref:`testing` for more details.
es_es: Ver :ref:`testing` for more details.

source: Unused pytest fixtures and markers
es_es: Índices y marcadores no usados de pytest

source: The fixture ``matplotlib.testing.conftest.mpl_image_comparison_parameters`` is not used internally by Matplotlib. If you use this please copy it into your code base.
es_es: El fixture ``matplotlib.testing.conftest.mpl_image_comparison_parameters`` no es utilizado internamente por Matplotlib. Si lo utiliza, por favor, cópialo en su código base.

source: The ``@pytest.mark.style`` marker is deprecated; use ``@mpl.style.context``, which has the same effect.
es_es: El marcador ``@pytest.mark.style`` está obsoleto; utilice ``@mpl.style.context``, que tiene el mismo efecto.

source: Support for ``nx1 = None`` or ``ny1 = None`` in ``AxesLocator`` and ``Divider.locate``
es_es: Soporte para ``nx1 = None`` o ``ny1 = None`` en ``AxesLocator`` y ``Divider.locate``
