Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_1.3.x.po
Languages: es_es

source: API Changes in 1.3.x
es_es: Cambios de API en 1.3.x

source: Changes in 1.3.1
es_es: Cambios en 1.3.1

source: It is rare that we make an API change in a bugfix release, however, for 1.3.1 since 1.3.0 the following change was made:
es_es: Es raro que hagamos un cambio de API en una versión de corrección, sin embargo, para 1.3.1 desde 1.3.0 se hizo el siguiente cambio:

source: ``text.Text.cached`` (used to cache font objects) has been made into a private variable. Among the obvious encapsulation benefit, this removes this confusing-looking member from the documentation.
es_es: ``text.Text.cached`` (usado para almacenar objetos de fuentes) se ha convertido en una variable privada. Entre los beneficios evidentes de la encapsulación, esto elimina a este miembro confuso de la documentación.

source: The method :meth:`~matplotlib.axes.Axes.hist` now always returns bin occupancies as an array of type `float`. Previously, it was sometimes an array of type `int`, depending on the call.
es_es: El método :meth:`~matplotlib.axes.Axes.is` ahora siempre devuelve ocupaciones de papelera como un array de tipo `float`. Anteriormente, a veces era un array de tipo `int`, dependiendo de la llamada.

source: Code removal
es_es: Eliminación de código

source: The following items that were deprecated in version 1.2 or earlier have now been removed completely.
es_es: Los siguientes elementos que estaban obsoletos en la versión 1.2 o anterior han sido eliminados completamente.

source: The Qt 3.x backends (``qt`` and ``qtagg``) have been removed in favor of the Qt 4.x backends (``qt4`` and ``qt4agg``).
es_es: Los backends Qt 3.x (``qt`` y ``qtagg``) se han eliminado a favor de los backends Qt 4.x (``qt4`` y ``qt4agg``).

source: The FltkAgg and Emf backends have been removed.
es_es: Los backends FltkAgg y Emf han sido eliminados.

source: The ``matplotlib.nxutils`` module has been removed. Use the functionality on `matplotlib.path.Path.contains_point` and friends instead.
es_es: El módulo ``matplotlib.nxutils`` ha sido eliminado. Utilice la funcionalidad en `matplotlib.path.Path.contains_point` y amigos en su lugar.

source: Instead of ``axes.Axes.get_frame``, use `.axes.Axes.patch`.
es_es: En lugar de ``axes.Axes.get_frame``, use `.axes.Axes.patch`.

source: The following keyword arguments to the `~.axes.Axes.legend` function have been renamed:
es_es: Los siguientes argumentos de palabra clave a la función `~.axes.Axes.legend` han sido renombrados:

source: *pad* -> *borderpad*
es_es: *pad* -> *borde*

source: Related to this, the following rcParams have been removed:
es_es: En relación con esto, se han eliminado los siguientes rcParams:

source: ``legend.handletextsep`` and
es_es: ``legend.handletextsep`` y

source: For the `~.axes.Axes.hist` function, instead of *width*, use *rwidth* (relative width).
es_es: Para la función `~.axes.Axes.✫ `, en lugar de *ancho*, use *rwidth* (ancho relativo).

source: On `.patches.Circle`, the *resolution* keyword argument has been removed. For a circle made up of line segments, use `.patches.CirclePolygon`.
es_es: En `.patches.Circle`, el argumento de palabra clave de *resolución* ha sido eliminado. Para un círculo compuesto de segmentos de línea, use `.patches.CirclePolygon`.

source: The printing functions in the Wx backend have been removed due to the burden of keeping them up-to-date.
es_es: Las funciones de impresión en el backend de Wx han sido eliminadas debido a la carga de mantenerlas actualizadas.

source: ``mlab.liaupunov`` has been removed.
es_es: ``mlab.liaupunov`` ha sido eliminado.

source: ``mlab.save``, ``mlab.load``, ``pylab.save`` and ``pylab.load`` have been removed. We recommend using `numpy.savetxt` and `numpy.loadtxt` instead.
es_es: ``mlab.save``, ``mlab.load``, ``pylab.save`` y ``pylab.load`` han sido eliminados. Recomendamos usar `numpy.savetxt` y `numpy.loadtxt` en su lugar.

source: ``widgets.HorizontalSpanSelector`` has been removed. Use `.widgets.SpanSelector` instead.
es_es: ``widgets.HorizontalSpanSelector`` ha sido eliminado. Use `.widgets.SpanSelector` en su lugar.

source: Code deprecation
es_es: Código obsoleto

source: The CocoaAgg backend has been deprecated, with the possibility for deletion or resurrection in a future release.
es_es: El backend de CocoaAgg ha quedado obsoleto, con la posibilidad de eliminar o resurrección en una futura versión.

source: The top-level functions in `matplotlib.path` that are implemented in C++ were never meant to be public. Instead, users should use the Pythonic wrappers for them in the `.path.Path` and `.collections.Collection` classes. Use the following mapping to update your code:
es_es: Las funciones de nivel superior en `matplotlib.path` que se implementan en C++ nunca estaban destinadas a ser públicas. En su lugar, los usuarios deben usar las envolturas Pythonic para ellas en las clases `.path.Path` y `.collections.Collection`. Usa el siguiente mapeo para actualizar tu código:

source: ``matplotlib.colors.normalize`` and ``matplotlib.colors.no_norm`` have been deprecated in favour of `matplotlib.colors.Normalize` and `matplotlib.colors.NoNorm` respectively.
es_es: ``matplotlib.colors.normalize`` y ``matplotlib.colors.no_norm`` han sido desaprobados en favor de `matplotlib.colors.Normalize` y `matplotlib.colors.NoNorm` respectivamente.

source: The `.ScalarMappable` class' ``set_colorbar`` method is now deprecated. Instead, the :attr:`matplotlib.cm.ScalarMappable.colorbar` attribute should be used. In previous Matplotlib versions this attribute was an undocumented tuple of ``(colorbar_instance, colorbar_axes)`` but is now just ``colorbar_instance``. To get the colorbar axes it is possible to just use the :attr:`~matplotlib.colorbar.ColorbarBase.ax` attribute on a colorbar instance.
es_es: El método ``set_colorbar`` de la clase `.ScalarMappable` ahora está desaprobado. En su lugar, el atributo :attr:`matplotlib.cm.ScalarMappable.colorbar` debe ser usado. En versiones anteriores de Matplotlib, este atributo era una tupla indocumentada de ``(colorbar_instance, colorbar_axes)`` pero ahora es sólo ``colorbar_instance``. Para obtener los ejes de la barra de colores es posible usar el atributo :attr:`~matplotlib.colorbar.ColorbarBase.ax` en una instancia de colorbar.

source: The ``matplotlib.mpl`` module is now deprecated. Those who relied on this module should transition to simply using ``import matplotlib as mpl``.
es_es: El módulo ``matplotlib.mpl`` ahora está obsoleto. Quienes confiaron en este módulo deberían pasar a usar simplemente ``import matplotlib como mpl``.

source: Code changes
es_es: Cambios de código

source: :class:`~matplotlib.patches.Patch` now fully supports using RGBA values for its ``facecolor`` and ``edgecolor`` attributes, which enables faces and edges to have different alpha values. If the :class:`~matplotlib.patches.Patch` object's ``alpha`` attribute is set to anything other than ``None``, that value will override any alpha-channel value in both the face and edge colors. Previously, if :class:`~matplotlib.patches.Patch` had ``alpha=None``, the alpha component of ``edgecolor`` would be applied to both the edge and face.
es_es: :class:`~matplotlib.patches.Patch` ahora soporta completamente el uso de valores RGBA para sus atributos ``facecolor`` y ``edgecolor``, lo que permite a las caras y bordes tener diferentes valores alfa. Si el :class:`~matplotlib.patches. atch` el atributo ``alpha`` del objeto está establecido en cualquier cosa que no sea ``Ninguno``, ese valor anulará cualquier valor alpha-canal tanto en la cara como en los colores del borde. Anteriormente, si :class:`~matplotlib.patches.Patch` tuviera ``alpha=delet``, el componente alfa de ``edgecolor`` se aplicaría tanto al borde como a la cara.

source: The optional ``isRGB`` argument to :meth:`~matplotlib.backend_bases.GraphicsContextBase.set_foreground` (and the other GraphicsContext classes that descend from it) has been renamed to ``isRGBA``, and should now only be set to ``True`` if the ``fg`` color argument is known to be an RGBA tuple.
es_es: El argumento opcional ``isRGB`` para :meth:`~matplotlib.backend_bases.GraphicsContextBase. et_foreground` (y las otras clases GraphicsContext que descienden de ella) han sido renombradas a ``isRGBA``, y ahora sólo debería establecerse a ``True`` si se sabe que el argumento de color ``fg`` es una tupla RGBA.

source: For :class:`~matplotlib.patches.Patch`, the ``capstyle`` used is now ``butt``, to be consistent with the default for most other objects, and to avoid problems with non-solid ``linestyle`` appearing solid when using a large ``linewidth``. Previously, :class:`~matplotlib.patches.Patch` used ``capstyle='projecting'``.
es_es: Para :class:`~matplotlib.patches. atch`, el ``capstyle`` usado ahora es ``butt``, para ser consistente con el predeterminado para la mayoría de los otros objetos, y para evitar problemas con un ``linestyle`` no sólido que aparezcan sólidos cuando se utiliza un gran ``linestyle``. Anteriormente, :class:`~matplotlib.patches.Patch` usó ``capstyle='projecting'``.

source: `.Path` objects can now be marked as *readonly* by passing ``readonly=True`` to its constructor. The built-in path singletons, obtained through ``Path.unit*`` class methods return readonly paths. If you have code that modified these, you will need to make a deepcopy first, using either::
es_es: Los objetos `.Path` ahora pueden ser marcados como *sólo lectura* pasando ``readonly=True`` a su constructor. Las singletas de ruta incorporadas, obtenidas a través de ``Path. los métodos de la clase nit*`` devuelven rutas de sólo lectura. Si tienes código que las modificó, necesitarás hacer primero una copia de profundidad, usando cualquiera de ellas::

source: Deep copying a `.Path` always creates an editable (i.e. non-readonly) `.Path`.
es_es: Copiar profundamente un `.Path` siempre crea un `.Path` editable (por ejemplo, non-readonly) `.Path`.

source: The list at ``Path.NUM_VERTICES`` was replaced by a dictionary mapping Path codes to the number of expected vertices at :attr:`~matplotlib.path.Path.NUM_VERTICES_FOR_CODE`.
es_es: La lista en ``Path.NUM_VERTICES`` fue reemplazada por un diccionario mapeando códigos de ruta al número de vértices esperados en :attr:`~matplotlib.path.Path.NUM_VERTICES_FOR_CODE`.

source: To support XKCD style plots, the ``matplotlib.path.cleanup_path`` method's signature was updated to require a sketch argument. Users of ``matplotlib.path.cleanup_path`` are encouraged to use the new :meth:`~matplotlib.path.Path.cleaned` Path method.
es_es: Para soportar gráficos de estilo XKCD, la firma del método ``matplotlib.path.cleanup_path`` fue actualizada para requerir un argumento de croquis. Se anima a los usuarios de ``matplotlib.path.cleanup_path`` a usar el nuevo método :meth:`~matplotlib.path.Path.cleaned`.

source: Data limits on a plot now start from a state of having "null" limits, rather than limits in the range (0, 1). This has an effect on artists that only control limits in one direction, such as `.axes.Axes.axvline` and `.axes.Axes.axhline`, since their limits will no longer also include the range (0, 1). This fixes some problems where the computed limits would be dependent on the order in which artists were added to the axes.
es_es: Los límites de datos en una parcela ahora comienzan de un estado de tener límites "nulos", en lugar de límites en el rango (0, 1). Esto tiene un efecto sobre artistas que sólo controlan límites en una dirección, como `.axes.axvline` y `. xes.Axes.axhline`, ya que sus límites ya no incluirán el rango (0, 1). Esto soluciona algunos problemas en los que los límites computados dependerían del orden en que los artistas fueron añadidos a los ejes.

source: Fixed a bug in setting the position for the right/top spine with data position type. Previously, it would draw the right or top spine at +1 data offset.
es_es: Se ha corregido un error al establecer la posición para el lomo derecha/superior con el tipo de posición de datos. Anteriormente, dibujaba el lomo derecho o superior al desplazamiento de datos +1.

source: In :class:`~matplotlib.patches.FancyArrow`, the default arrow head width, ``head_width``, has been made larger to produce a visible arrow head. The new value of this kwarg is ``head_width = 20 * width``.
es_es: En :class:`~matplotlib.patches.FancyArrow`, el ancho por defecto de la cabeza de flecha ``head_width``, se ha hecho más grande para producir una cabeza de flecha visible. El nuevo valor de este kwarg es ``head_width = 20 * ancho``.

source: It is now possible to provide ``number of levels + 1`` colors in the case of ``extend='both'`` for contourf (or just ``number of levels`` colors for an extend value ``min`` or ``max``) such that the resulting colormap's ``set_under`` and ``set_over`` are defined appropriately. Any other number of colors will continue to behave as before (if more colors are provided than levels, the colors will be unused). A similar change has been applied to contour, where ``extend='both'`` would expect ``number of levels + 2`` colors.
es_es: Ahora es posible proporcionar ``número de niveles + 1`` colores en el caso de ``extend='ambos'`` para el contorno (o simplemente ``número de niveles`` para un valor extenso ``min`` o ``max``) tal que el colormap resultante ``set_under`` y ``set_over`` se definen apropiadamente. Cualquier otro número de colores seguirá comportándose como antes (si se proporcionan más colores que los niveles, los colores no se utilizarán). Se ha aplicado un cambio similar al contorno, donde ``extend='ambos'`` esperaría ``número de niveles + 2``.

source: A new keyword *extendrect* in :meth:`~matplotlib.pyplot.colorbar` and :class:`~matplotlib.colorbar.ColorbarBase` allows one to control the shape of colorbar extensions.
es_es: Una nueva palabra clave *extendrect* en :meth:`~matplotlib.pyplot.colorbar` y :class:`~matplotlib.colorbar.ColorbarBase` permite a uno controlar la forma de las extensiones de la barra de colores.

source: The extension of :class:`~matplotlib.widgets.MultiCursor` to both vertical (default) and/or horizontal cursor implied that ``self.line`` is replaced by ``self.vline`` for vertical cursors lines and ``self.hline`` is added for the horizontal cursors lines.
es_es: La extensión de :class:`~matplotlib.widgets.MultiCursor` tanto vertical (por defecto) y/o cursor horizontal implicó ese ``yo mismo. ine`` es reemplazado por ``self.vline`` para las líneas verticales de cursores y ``self.hline`` es añadido para las líneas horizontales de cursores.

source: On POSIX platforms, the :func:`~matplotlib.cbook.report_memory` function raises :class:`NotImplementedError` instead of :class:`OSError` if the :command:`ps` command cannot be run.
es_es: En plataformas POSIX, la función :func:`~matplotlib.cbook.report_memory` levanta :class:`NotImplementedError` en lugar de :class:`OSError` si el comando :command:`ps` no se puede ejecutar.

source: The ``matplotlib.cbook.check_output`` function has been moved to ``matplotlib.compat.subprocess``.
es_es: La función ``matplotlib.cbook.check_output`` ha sido movida a ``matplotlib.compat.subprocess``.

source: Configuration and rcParams
es_es: Configuración y rcParams

source: On Linux, the user-specific :file:`matplotlibrc` configuration file is now located in :file:`~/.config/matplotlib/matplotlibrc` to conform to the `XDG Base Directory Specification <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>`_.
es_es: En Linux, el archivo de configuración :file:`matplotlibrc` específico por el usuario se encuentra ahora en :file:`~/.config/matplotlib/matplotlibrc` para cumplir con la `especificación del directorio XDG Base <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>`_.

source: The ``font.*`` rcParams now affect only text objects created after the rcParam has been set, and will not retroactively affect already existing text objects. This brings their behavior in line with most other rcParams.
es_es: Los rcParam ``font.*`` afectan ahora sólo a los objetos de texto creados después de que el rcParam haya sido establecido, y no afectarán retroactivamente a los objetos de texto ya existentes. Esto hace que su comportamiento esté en línea con la mayoría de los otros rcParam.

source: Removed call of :meth:`~matplotlib.axes.Axes.grid` in ``matplotlib.pyplot.plotfile``. To draw the axes grid, set the ``axes.grid`` rcParam to *True*, or explicitly call :meth:`~matplotlib.axes.Axes.grid`.
es_es: Llamada removida de :meth:`~matplotlib.axes.Axes.grid` en ``matplotlib.pyplot.plotfile``. Para dibujar la cuadrícula de ejes, establece el rcParam ``axes.grid`` a *True*, o explícitamente llama a :meth:`~matplotlib.axes.Axes.grid`.
