Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.2.0.po
Languages: es_es

source: The pgf backend's get_canvas_width_height now returns the canvas size in display units rather than in inches, which it previously did. The new behavior is the correct one given the uses of ``get_canvas_width_height`` in the rest of the codebase.
es_es: El get_canvas_width_height del backend de pgf ahora devuelve el tamaño del lienzo en unidades de visualización en lugar de en pulgadas, como lo hizo anteriormente. El nuevo comportamiento es el correcto dado el uso de ``get_canvas_width_height`` en el resto del código base.

source: The pgf backend now includes images using ``\includegraphics`` instead of ``\pgfimage`` if the version of ``graphicx`` is recent enough to support the ``interpolate`` option (this is detected automatically).
es_es: El backend de pgf ahora incluye imágenes usando ``\includegraphics`` en lugar de ``\pgfimage`` si la versión de ``graphicx`` es lo suficientemente reciente como para soportar la opción ``interpolate`` (esto se detecta automáticamente).

source: The default value of the "obj_type" parameter to ``cbook.warn_deprecated`` has been changed from "attribute" (a default that was never used internally) to the empty string.
es_es: El valor por defecto del parámetro "obj_type" a ``cbook.warn_deprecated`` ha sido cambiado de "attribute" (un valor por defecto que nunca fue usado internamente) a la cadena vacía.

source: Testing
es_es: Prueba

source: The test suite no longer turns on the Python fault handler by default. Set the standard ``PYTHONFAULTHANDLER`` environment variable to do so.
es_es: La suite de pruebas ya no enciende el manejador de fallas de Python por defecto. Establezca la variable de entorno estándar ``PYTHONFAULTHANDLER`` para hacerlo.

source: Backends do not need to explicitly define the flag ``supports_blit`` anymore. This is only relevant for backend developers. Backends had to define the flag ``supports_blit``. This is not needed anymore because the blitting capability is now automatically detected.
es_es: Los backends ya no necesitan definir explícitamente la bandera ``supports_blit``. Esto sólo es relevante para los desarrolladores del backend. Los backends tenían que definir la bandera ``supports_blit``. Esto ya no es necesario porque la capacidad de blitting ahora es detectada automáticamente.

source: Exception changes
es_es: Cambios de excepción

source: Various APIs that raised a `ValueError` for incorrectly typed inputs now raise `TypeError` instead: `.backend_bases.GraphicsContextBase.set_clip_path`, `.blocking_input.BlockingInput.__call__`, `.cm.register_cmap`, `.dviread.DviFont`, `.rcsetup.validate_hatch`, ``.rcsetup.validate_animation_writer_path``, `.spines.Spine`, many classes in the :mod:`matplotlib.transforms` module and :mod:`matplotlib.tri` package, and Axes methods that take a ``norm`` parameter.
es_es: Varias APIs que levantaron un `ValueError` para entradas escritas incorrectamente ahora aumentan `TypeError` en su lugar: `.backend_bases.GraphicsContextBase.set_clip_path`, `.blocking_input.BlockingInput.__call__`, `.cm.register_cmap`, `.dviread.DviFont`, `. csetup.validate_hatch`, ``.rcsetup.validate_animation_writer_path``, `.spines.Spine`, muchas clases en el módulo :mod:`matplotlib.transforms` y el paquete :mod:`matplotlib.tri` y métodos Axes que toman un parámetro ``norm``.

source: If extra kwargs are passed to `.LogScale`, `TypeError` will now be raised instead of `ValueError`.
es_es: Si se pasan kwargs extra a `.LogScale`, `TypeError` ahora se levantará en lugar de `ValueError`.

source: mplot3d auto-registration
es_es: auto-registro mplot3d

source: `mpl_toolkits.mplot3d` is always registered by default now. It is no longer necessary to import mplot3d to create 3d axes with ::
es_es: `mpl_toolkits.mplot3d` siempre está registrado por defecto ahora. Ya no es necesario importar mplot3d para crear ejes 3d con ::

source: `.SymLogNorm` now has a *base* parameter
es_es: `.SymLogNorm` ahora tiene un parámetro *base*

source: Previously, `.SymLogNorm` had no *base* keyword argument and the base was hard-coded to ``base=np.e``. This was inconsistent with the default behavior of `.SymmetricalLogScale` (which defaults to ``base=10``) and the use of the word "decade" in the documentation.
es_es: Anteriormente, `.SymLogNorm` no tenía ningún argumento de palabra clave *base* y la base estaba codificada duramente en ``base=np.e``. Esto era inconsistente con el comportamiento predeterminado de `. ymmetricalLogScale` (que es el valor predeterminado de ``base=10``) y el uso de la palabra "decade" en la documentación.

source: In preparation for changing the default base to 10, calling `.SymLogNorm` without the new *base* keyword argument emits a deprecation warning.
es_es: En preparación para cambiar la base predeterminada a 10, llamar a `.SymLogNorm` sin el nuevo argumento de palabra clave *base* emite una advertencia de desaprobación.

source: Deprecations
es_es: Obsolescencias

source: The ``warn`` parameter to `matplotlib.use()` is deprecated (catch the `ImportError` emitted on backend switch failure and reemit a warning yourself if so desired).
es_es: El parámetro ``warn`` a `matplotlib.use()` está obsoleto (atrapar el `ImportError` emitido en fallo de conmutación del backend y canjear una advertencia usted mismo si así lo desea).

source: ``.pyplot.plotfile`` is deprecated in favor of separately loading and plotting the data. Use pandas or NumPy to load data, and pandas or matplotlib to plot the resulting data.
es_es: ``.pyplot.plotfile`` está obsoleto a favor de cargar y trazar los datos por separado. Utilice pandas o NumPy para cargar datos, pandas o matplotlib para trazar los datos resultantes.

source: axes and axis
es_es: ejes y eje

source: Setting ``Axis.major.locator``, ``Axis.minor.locator``, ``Axis.major.formatter`` or ``Axis.minor.formatter`` to an object that is not a subclass of `.Locator` or `.Formatter` (respectively) is deprecated. Note that these attributes should usually be set using `.Axis.set_major_locator`, `.Axis.set_minor_locator`, etc. which already raise an exception when an object of the wrong class is passed.
es_es: Establecer ``Axis.major.locator``, ``Axis.minor.locator``, ``Axis.major.formatter`` o ``Axis.minor.formatter`` a un objeto que no es una subclase de `.Locator` o `.Formatter` (respectivamente) está obsoleto. Tenga en cuenta que estos atributos generalmente deben establecerse usando `.Axis.set_major_locator`, `.Axis. et_minor_locator`, etc. que ya plantean una excepción cuando se pasa un objeto de la clase incorrecta.

source: Passing more than one positional argument or unsupported keyword arguments to `~matplotlib.axes.Axes.axis()` is deprecated (such arguments used to be silently ignored).
es_es: Pasar más de un argumento posicional o argumentos de palabra clave no soportados a `~matplotlib.axes.Axes.axis()` está obsoleto (tales argumentos usados para ser ignorados silenciosamente).

source: ``minor`` argument will become keyword-only
es_es: El argumento ``menor`` se convertirá en palabra clave

source: Using the parameter ``minor`` to ``get_*ticks()`` / ``set_*ticks()`` as a positional parameter is deprecated. It will become keyword-only in future versions.
es_es: Usando el parámetro ``minor`` a ``get_*ticks()`` / ``set_*ticks()`` como un parámetro posicional está obsoleto. Se convertirá en palabra clave sólo en futuras versiones.

source: ``axes_grid1``
es_es: ``ejes_cuadrícula1``

source: The ``mpl_toolkits.axes_grid1.colorbar`` module and its colorbar implementation are deprecated in favor of :mod:`matplotlib.colorbar`, as the former is essentially abandoned and the latter is a more featureful replacement with a nearly compatible API (for example, the following additional keywords are supported: ``panchor``, ``extendfrac``, ``extendrect``).
es_es: El módulo ``mpl_toolkits.axes_grid1.colorbar`` y su implementación de la barra de colores están desaprobados a favor de :mod:`matplotlib. olorbar`, ya que la primera está esencialmente abandonada y la segunda es un reemplazo más característico por una API casi compatible (por ejemplo, las siguientes palabras clave adicionales son soportadas: ``panchor``, ``extendfrac``, ``extendrect``).

source: The main differences are:
es_es: Las principales diferencias son:

source: Setting the ticks on the colorbar is done by calling ``colorbar.set_ticks`` rather than ``colorbar.cbar_axis.set_xticks`` or ``colorbar.cbar_axis.set_yticks``; the ``locator`` parameter to ``colorbar()`` is deprecated in favor of its synonym ``ticks`` (which already existed previously, and is consistent with :mod:`matplotlib.colorbar`).
es_es: Establecer los ticks en la barra de colores se hace llamando ``colorbar.set_ticks`` en lugar de ``colorbar.cbar_axis.set_xticks`` o ``colorbar.cbar_axis. et_yticks``; el parámetro ``locator`` a ``colorbar()`` está obsoleto a favor de su sinónimo ``ticks`` (que ya existía anteriormente, y es consistente con :mod:`matplotlib.colorbar`).

source: The colorbar's long axis is accessed with ``colorbar.xaxis`` or ``colorbar.yaxis`` depending on the orientation, rather than ``colorbar.cbar_axis``.
es_es: El eje largo de la barra de color se accede con ``colorbar.xaxis`` o ``colorbar.yaxis`` dependiendo de la orientación, en lugar de ``colorbar.cbar_axis``.

source: The default ticker is no longer ``MaxNLocator(5)``, but a ``_ColorbarAutoLocator``.
es_es: El ticker predeterminado ya no es ``MaxNLocator(5)``, sino un ``_ColorbarAutoLocator``.

source: Overdrawing multiple colorbars on top of one another in a single Axes (e.g. when using the ``cax`` attribute of `~.axes_grid1.axes_grid.ImageGrid` elements) is not supported; if you previously relied on the second colorbar being drawn over the first, you can call ``cax.cla()`` to clear the axes before drawing the second colorbar.
es_es: Sobrescribir múltiples barras de color en la parte superior de un solo eje (por ejemplo, cuando se usa el atributo ``cax`` de `~.axes_grid1.axes_grid. Los elementos mageGrid` no están soportados; si anteriormente dependía de que la segunda barra de colores se dibujara sobre la primera, puede llamar a ``cax. la()`` para limpiar los ejes antes de dibujar la segunda barra de color.

source: During the deprecation period, the ``mpl_toolkits.legacy_colorbar`` rcParam can be set to True to use ``mpl_toolkits.axes_grid1.colorbar`` in :mod:`mpl_toolkits.axes_grid1` code with a deprecation warning (the default), or to False to use ``matplotlib.colorbar``.
es_es: Durante el período de desaprobación, el rcParam ``mpl_toolkits.legacy_colorbar`` puede establecerse en True para usar ``mpl_toolkits.axes_grid1. olorbar`` en el código :mod:`mpl_toolkits.axes_grid1` con una advertencia de desaprobación (el predeterminado), o a False para usar ``matplotlib.colorbar``.

source: Passing a ``pad`` size of ``None`` (the default) as a synonym for zero to the ``append_axes``, ``new_horizontal`` and ``new_vertical`` methods of `.axes_grid1.axes_divider.AxesDivider` is deprecated. In a future release, the default value of ``None`` will mean "use :rc:`figure.subplot.wspace` or :rc:`figure.subplot.hspace`" (depending on the orientation). Explicitly pass ``pad=0`` to keep the old behavior.
es_es: Pasando un tamaño de ``pad`` de ``None `` (el predeterminado) como sinónimo de cero a los ``append_axes``, ``new_horizontal`` y los métodos ``new_vertical`` de `.axes_grid1.axes_divider.AxesDivider` está obsoleto. En una versión futura, el valor predeterminado de ``Ning`` significará "usar :rc:`figure.subplot.wspace` o :rc:`figure. ubplot.hspace`" (dependiendo de la orientación). Pasar explícitamente ``pad=0`` para mantener el comportamiento antiguo.

source: Axes3D
es_es: Ejes3D

source: ``mplot3d.axis3d.get_flip_min_max`` is deprecated.
es_es: ``mplot3d.axis3d.get_flip_min_max`` está obsoleto.

source: ``axes3d.unit_bbox`` is deprecated (use ``Bbox.unit`` instead).
es_es: ``axes3d.unit_bbox`` está obsoleto (use ``Bbox.unit`` en su lugar).

source: ``axes3d.Axes3D.w_xaxis``, ``.w_yaxis``, and ``.w_zaxis`` are deprecated (use ``.xaxis``, ``.yaxis``, and ``.zaxis`` instead).
es_es: ``axes3d.Axes3D.w_xaxis``, ``.w_yaxis``, y ``.w_zaxis`` son obsoletos (use ``.xaxis``, ``.yaxis``, y ``.zaxis`` en su lugar).

source: ``cm.revcmap`` is deprecated. Use `.Colormap.reversed` to reverse a colormap.
es_es: ``cm.revcmap`` está obsoleto. Usa `.Colormap.reversed` para revertir un mapa de colores.

source: ``cm.datad`` no longer contains entries for reversed colormaps in their "unconverted" form.
es_es: ``cm.datad`` ya no contiene entradas para mapas de colores revertidos en su forma "sin conversión".

source: ``mpl_toolkits.axisartist.grid_finder.GridFinderBase`` is deprecated (its only use is to be inherited by the `.GridFinder` class which just provides more defaults in the constructor and directly sets the transforms, so ``GridFinderBase``'s methods were just moved to `.GridFinder`).
es_es: ``mpl_toolkits.axisartist.grid_finder.GridFinderBase`` está obsoleto (su único uso es heredado por el `. clase ridFinder` que sólo proporciona más valores predeterminados en el constructor y establece directamente las transformaciones, por lo que los métodos de ``GridFinderBase'' fueron movidos a `.GridFinder`).

source: ``axisartist.axis_artist.BezierPath`` is deprecated (use `.patches.PathPatch` to draw arbitrary Paths).
es_es: ``axisartist.axis_artist.BezierPath`` está obsoleto (usa `.patches.PathPatch` para dibujar rutas arbitrarias).

source: ``AxisArtist.line`` is now a `.patches.PathPatch` instance instead of a ``BezierPath`` instance.
es_es: ``AxisArtist.line`` es ahora una instancia de `.patches.PathPatch` en lugar de una instancia de ``BezierPath``.

source: Returning a factor equal to None from axisartist Locators (which are **not** the same as "standard" tick Locators), or passing a factor equal to None to axisartist Formatters (which are **not** the same as "standard" tick Formatters) is deprecated. Pass a factor equal to 1 instead.
es_es: Retornando un factor igual a Ninguno de los Localizadores del axisartista (que **no** son lo mismo que Localizadores de ticks "estándar"), o pasar un factor igual a None to axisartist Formatters (que **no** son los mismos que los Formatos de tick de "estándar") es obsoleto. Pasa un factor igual a 1 en su lugar.

source: For the `mpl_toolkits.axisartist.axis_artist.AttributeCopier` class, the constructor and the ``set_ref_artist`` method, and the *default_value* parameter of ``get_attribute_from_ref_artist``, are deprecated.
es_es: Para la clase `mpl_toolkits.axisartist.axis_artist.AttributeCopier`, el constructor y el método ``set_ref_artist`` y el parámetro *default_value* de ``get_attribute_from_ref_artist``, son obsoletos.

source: Deprecation of the constructor means that classes inheriting from `.AttributeCopier` should no longer call its constructor.
es_es: Deprecación del constructor significa que las clases heredadas de `.AttributeCopier` ya no deberían llamar a su constructor.

source: The unused ``Locator.autoscale`` method is deprecated (pass the axis limits to `.Locator.view_limits` instead).
es_es: El método no utilizado ``Locator.autoscale`` es obsoleto (pasa los límites del eje a `.Locator.view_limits` en su lugar).

source: Animation
es_es: Animación

source: The following methods and attributes of the `MovieWriterRegistry` class are deprecated: ``set_dirty``, ``ensure_not_dirty``, ``reset_available_writers``, ``avail``.
es_es: Los siguientes métodos y atributos de la clase `Mo)[video] WriterRegistry` están desaprobados: ``set_dirty``, ``ensure_not_dirty``, ``reset_available_writers``, ``avail``.

source: ``smart_bounds()``
es_es: ``smart_limunds()``

source: The "smart_bounds" functionality is deprecated. This includes ``Axis.set_smart_bounds()``, ``Axis.get_smart_bounds()``, ``Spine.set_smart_bounds()``, and ``Spine.get_smart_bounds()``.
es_es: La funcionalidad "smart_bounds" está obsoleta. Esto incluye ``Axis.set_smart_bounds()``, ``Axis.get_smart_bounds()``, ``Spine.set_smart_bounds()``, y ``Spine.get_smart_bounds()``.

source: Setting the ``whis`` parameter of `.Axes.boxplot` and `.cbook.boxplot_stats` to "range" to mean "the whole data range" is deprecated; set it to (0, 100) (which gets interpreted as percentiles) to achieve the same effect.
es_es: Estableciendo el parámetro ``whis`` de `.Axes.boxplot` y `.cbook. oxplot_stats` a "rango" para significar "todo el rango de datos"; póngalo a (0, 100) (que se interpreta como percentiles) para lograr el mismo efecto.

source: ``fill_between()``
es_es: ``rellenar_entre()``

source: Passing scalars to parameter *where* in ``fill_between()`` and ``fill_betweenx()`` is deprecated. While the documentation already states that *where* must be of the same size as *x* (or *y*), scalars were accepted and broadcasted to the size of *x*. Non-matching sizes will raise a ``ValueError`` in the future.
es_es: Pasar escalares al parámetro *donde* en ``fill_between()`` y ``fill_betweenx()`` está obsoleto. Mientras que la documentación ya indica que *donde* debe tener el mismo tamaño que *x* (o *y*), escalares fueron aceptados y transmitidos al tamaño de *x*. Tamaños no coincidentes generarán un ``ValueError`` en el futuro.

source: Passing the *verts* parameter to `.axes.Axes.scatter` is deprecated; use the *marker* parameter instead.
es_es: Pasar el parámetro *verts* a `.axes.Axes.scatter` está obsoleto; utilice el parámetro *marcador* en su lugar.

source: ``tight_layout()``
es_es: ``estilo()``

source: The ``renderer`` parameter to `.Figure.tight_layout` is deprecated; this method now always uses the renderer instance cached on the `.Figure`.
es_es: El parámetro ``renderer`` a `.Figure.tight_layout` está obsoleto; este método ahora siempre utiliza la caché de instancia de renderer en el `.Figure`.

source: The ``rcsetup.validate_animation_writer_path`` function is deprecated.
es_es: La función ``rcsetup.validate_animation_writer_path`` está obsoleta.

source: Setting :rc:`savefig.format` to "auto" is deprecated; use its synonym "png" instead.
es_es: Establecer :rc:`savefig.format` a "auto" está obsoleto; utilice su sinónimo "png" en su lugar.

source: Setting :rc:`text.hinting` to True or False is deprecated; use their synonyms "auto" or "none" instead.
es_es: Establecer :rc:`text.hinting` a True o False está desaprobado; utilice sus sinónimos "auto" o "none" en su lugar.

source: ``rcsetup.update_savefig_format`` is deprecated.
es_es: ``rcsetup.update_savefig_format`` está obsoleto.

source: ``rcsetup.validate_path_exists`` is deprecated (use ``os.path.exists`` to check whether a path exists).
es_es: ``rcsetup.validate_path_exists`` está obsoleto (use ``os.path.exists`` para comprobar si existe una ruta).

source: ``rcsetup.ValidateInterval`` is deprecated.
es_es: ``rcsetup.ValidateInterval`` está obsoleto.

source: Dates
es_es: Fechas

source: ``dates.mx2num`` is deprecated.
es_es: ``dates.mx2num`` está obsoleto.

source: ``NavigationToolbar2Tk.set_active`` is deprecated, as it has no (observable) effect.
es_es: ``NavigationToolbar2Tk.set_active`` está obsoleto, ya que no tiene efecto (observable).

source: ``FigureFrameWx.statusbar`` and ``NavigationToolbar2Wx.statbar`` are deprecated. The status bar can be retrieved by calling standard wx methods (``frame.GetStatusBar()`` and ``toolbar.GetTopLevelParent().GetStatusBar()``).
es_es: ``FigureFrameWx.statusbar`` y ``NavigationToolbar2Wx.statbar`` son obsoletos. La barra de estado puede recuperarse llamando a métodos wx estándar (``frame.GetStatusBar()`` y ``toolbar.GetTopLevelParent().GetStatusBar()``).

source: ``backend_wx.ConfigureSubplotsWx.configure_subplots`` and ``backend_wx.ConfigureSubplotsWx.get_canvas`` are deprecated.
es_es: ``backend_wx.ConfigureSubplotsWx.configure_subplots`` y ``backend_wx.ConfigureSubplotsWx.get_canvas`` están obsoletas.

source: ``backend_pgf.repl_escapetext`` and ``backend_pgf.repl_mathdefault`` are deprecated.
es_es: ``backend_pgf.repl_escapetext`` y ``backend_pgf.repl_mathdefault`` están obsoletos.

source: ``RendererPgf.latexManager`` is deprecated.
es_es: ``RendererPgf.latexManager`` está obsoleto.

source: FigureCanvas
es_es: Lienzo de figura

source: ``FigureCanvasBase.draw_cursor`` (which has never done anything and has never been overridden in any backend) is deprecated.
es_es: ``FigureCanvasBase.draw_cursor`` (que nunca ha hecho nada y nunca ha sido anulado en ningún backend) es obsoleto.

source: ``FigureCanvasMac.invalidate`` is deprecated in favor of its synonym, ``FigureCanvasMac.draw_idle``.
es_es: ``FigureCanvasMac.invalidate`` está obsoleto a favor de su sinónimo, ``FigureCanvasMac.draw_idle``.

source: The ``dryrun`` parameter to the various ``FigureCanvasFoo.print_foo`` methods is deprecated.
es_es: El parámetro ``dryrun`` de los varios métodos ``FigureCanvasFoo.print_foo`` está obsoleto.

source: QuiverKey doc
es_es: Documento QuiverKey

source: ``quiver.QuiverKey.quiverkey_doc`` is deprecated; use ``quiver.QuiverKey.__init__.__doc__`` instead.
es_es: ``quiver.QuiverKey.quiverkey_doc`` está desaprobado; use ``quiver.QuiverKey.__init__.__doc__`` en su lugar.

source: ``mlab.apply_window`` and ``mlab.stride_repeat`` are deprecated.
es_es: ``mlab.apply_window`` y ``mlab.stride_repetir`` están obsoletos.

source: ``font_manager.JSONEncoder`` is deprecated. Use `.font_manager.json_dump` to dump a `.FontManager` instance.
es_es: ``font_manager.JSONEncoder`` está obsoleto. Usa `.font_manager.json_dump` para volcar una instancia de `.FontManager`.

source: ``font_manager.createFontList`` is deprecated. `.font_manager.FontManager.addfont` is now available to register a font at a given path.
es_es: ``font_manager.createFontList`` está obsoleto. `.font_manager.FontManager.addfont` ahora está disponible para registrar una fuente en una ruta determinada.

source: The ``as_str``, ``as_rgba_str``, ``as_array``, ``get_width`` and ``get_height`` methods of ``matplotlib.ft2font.FT2Image`` are deprecated. Convert the ``FT2Image`` to a NumPy array with ``np.asarray`` before processing it.
es_es: Los métodos ``as_str``, ``as_rgba_str``, ``as_array``, ``get_width`` y ``get_height`` de los métodos ``matplotlib.ft2font.FT2Image`` son obsoletos. Convierte el ``FT2Image`` a un array NumPy con ``np.asarray`` antes de procesarlo.

source: Colors
es_es: Colores

source: The function ``matplotlib.colors.makeMappingArray`` is not considered part of the public API any longer. Thus, it's deprecated.
es_es: La función ``matplotlib.colors.makeMappingArray`` ya no es considerada parte de la API pública. Por lo tanto, está obsoleta.

source: Using a string of single-character colors as a color sequence (e.g. "rgb") is deprecated. Use an explicit list instead.
es_es: Usar una cadena de colores de un solo carácter como secuencia de colores (por ejemplo, "rgb") está obsoleto. Utilice una lista explícita en su lugar.

source: Scales
es_es: Escalas

source: Passing unsupported keyword arguments to `.ScaleBase`, and its subclasses `.LinearScale` and `.SymmetricalLogScale`, is deprecated and will raise a `TypeError` in 3.3.
es_es: Pasar argumentos de palabra clave no soportados a `.ScaleBase`, y sus subclases `.LinearScale` y `.SymmetricalLogScale`, está obsoleto y generará un `TypeError` en 3.3.

source: If extra keyword arguments are passed to `.LogScale`, `TypeError` will now be raised instead of `ValueError`.
es_es: Si se pasan argumentos de palabra clave extra a `.LogScale`, `TypeError` ahora se levantará en lugar de `ValueError`.

source: The ``matplotlib.testing.disable_internet`` module is deprecated. Use (for example) pytest-remotedata_ instead.
es_es: El módulo ``matplotlib.testing.disable_internet`` está obsoleto. Utilice (por ejemplo) pytest-remotedata_ en su lugar.
