Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.2.0.po
Languages: es_es

source: Support in `matplotlib.testing` for nose-based tests is deprecated (a deprecation is emitted if using e.g. the decorators from that module while both 1) matplotlib's conftests have not been called and 2) nose is in ``sys.modules``).
es_es: El soporte en `matplotlib.testing` para pruebas basadas en la nariz es obsoleto (una desaprobación es emitida si se usa p.ej. los decoradores de ese módulo, mientras que los dos 1) matplotlib's conftests no han sido llamados y 2) nose está en ``sys.modules``).

source: ``testing.is_called_from_pytest`` is deprecated.
es_es: ``testing.is_called_from_pytest`` está obsoleto.

source: During the deprecation period, to force the generation of nose base tests, import nose first.
es_es: Durante el período de desaprobación, para forzar la generación de pruebas base de nariz, importar nariz primero.

source: The *switch_backend_warn* parameter to ``matplotlib.test`` has no effect and is deprecated.
es_es: El parámetro *switch_backend_warn* a ``matplotlib.test`` no tiene efecto y está obsoleto.

source: ``testing.jpl_units.UnitDbl.UnitDbl.checkUnits`` is deprecated.
es_es: ``testing.jpl_units.UnitDbl.UnitDbl.checkUnits`` está obsoleto.

source: ``DivergingNorm`` renamed to ``TwoSlopeNorm``
es_es: ``DivergingNorm`` renombrado a ``TwoSlopeNorm``

source: ``DivergingNorm`` was a misleading name; although the norm was developed with the idea that it would likely be used with diverging colormaps, the word 'diverging' does not describe or evoke the norm's mapping function. Since that function is monotonic, continuous, and piece-wise linear with two segments, the norm has been renamed to `.TwoSlopeNorm`
es_es: ``DivergingNorm`` era un nombre engañoso; aunque la norma fue desarrollada con la idea de que probablemente se usaría con mapas de colores divergentes, la palabra 'diverging' no describe o evoca la función de mapeo de la norma. Dado que esa función es monotónica, continua y lineal en sentido pedazo con dos segmentos, la norma ha sido renombrada como `.TwoSlopeNorm`

source: ``matplotlib.get_home`` is deprecated (use e.g. ``os.path.expanduser("~")``) instead.
es_es: ``matplotlib.get_home`` está obsoleto (por ejemplo, ``os.path.expanded user("~")``) en su lugar.

source: ``matplotlib.compare_versions`` is deprecated (use comparison of ``distutils.version.LooseVersion``\s instead).
es_es: ``matplotlib.compare_versions`` está obsoleto (utilice la comparación de ``distutils.version.LooseVersion``\s en su lugar).

source: ``matplotlib.checkdep_ps_distiller`` is deprecated.
es_es: ``matplotlib.checkdep_ps_distiller`` está obsoleto.

source: ``matplotlib.figure.AxesStack`` is considered private API and will be removed from the public API in future versions.
es_es: ``matplotlib.figure.AxesStack`` es considerado API privada y será eliminado de la API pública en futuras versiones.

source: ``BboxBase.is_unit`` is deprecated (check the Bbox extents if needed).
es_es: ``BboxBase.is_unit`` está obsoleto (marque los extents de la casilla si es necesario).

source: ``Affine2DBase.matrix_from_values(...)`` is deprecated. Use (for example) ``Affine2D.from_values(...).get_matrix()`` instead.
es_es: ``Affine2DBase.matrix_from_values(...)`` está obsoleto. Utilice (por ejemplo) ``Affine2D.from_values(...).get_matrix()`` en su lugar.

source: ``style.core.is_style_file`` and ``style.core.iter_style_files`` are deprecated.
es_es: ``style.core.is_style_file`` y ``style.core.iter_style_files`` son obsoletos.

source: The ``datapath`` rcParam
es_es: El ``datapath`` rcParam

source: Use `.get_data_path` instead. (The rcParam is deprecated because it cannot be meaningfully set by an end user.) The rcParam had no effect from 3.2.0, but was deprecated only in 3.2.1. In 3.2.1+ if ``'datapath'`` is set in a ``matplotlibrc`` file it will be respected, but this behavior will be removed in 3.3.
es_es: En su lugar, use `.get_data_path`. (El rcParam está obsoleto porque no puede ser configurado de forma significativa por un usuario final. El rcParam no tuvo ningún efecto a partir de 3.2. , pero fue obsoleto sólo en 3.2.1. + si ``'datapath'`` está establecido en un archivo ``matplotlibrc`` será respetado, pero este comportamiento será eliminado en 3.3.

source: Removals
es_es: Eliminar

source: The ``matplotlib.testing.determinism`` module, which exposes no public API, has been deleted.
es_es: El módulo ``matplotlib.testing.determinism``, que no expone ninguna API pública, ha sido eliminado.

source: The following API elements have been removed:
es_es: Se han eliminado los siguientes elementos API:

source: the ``matplotlib.backends.tkagg``, ``matplotlib.backends.windowing``, ``matplotlib.backends.wx_compat``, and ``matplotlib.compat.subprocess`` modules
es_es: los módulos ``matplotlib.backends.tkagg``, ``matplotlib.backends.windowing``, ``matplotlib.backends.wx_compat``, y ``matplotlib.compat.subprocess``

source: ``afm.parse_afm`` (use ``afm.AFM instead``)
es_es: ``afm.parse_afm`` (use ``afm.AFM en su lugar``)

source: ``axes.Axes.mouseover_set``
es_es: ``ejes.Ejes.mouseover_set``

source: ``backend_gtk3.FileChooserDialog.sorted_filetypes`` (use ``sorted(self.filetypes.items())`` instead)
es_es: ``backend_gtk3.FileChooserDialog.sorted_filetypes`` (use ``sorted(self.filetypes.items())`` en su lugar)

source: ``backend_qt.FigureCanvasQt.keyAutoRepeat`` (use ``event.guiEvent.isAutoRepeat`` instead), ``backend_qt.error_msg_qt``, ``backend_qt.exception_handler``
es_es: ``backend_qt.FigureCanvasQt.keyAutoRepeat`` (use ``event.guiEvent.isAutoRepeat`` en su lugar), ``backend_qt.error_msg_qt``, ``backend_qt.exception_handler``

source: ``cbook.Bunch`` (use ``types.SimpleNamespace`` instead), ``cbook.Locked``, ``cbook.unicode_safe``, ``cbook.is_numlike`` (use ``isinstance(..., numbers.Number)`` instead), ``cbook.mkdirs`` (use ``os.makedirs(..., exist_ok=True)`` instead), ``cbook.GetRealpathAndStat`` (use ``cbook.get_realpath_and_stat`` instead), ``cbook.listFiles``
es_es: ``cbook.Bunch`` (use ``types.SimpleNamespace`` en su lugar), ``cbook.Locked``, ``cbook.unicode_safe``, ``cbook.is_numlike`` (use ``isinstance(..., numbers.Number)`` en su lugar), ``cbook.mkdirs`` (use ``os.makedirs(..., exist_ok=True)`` en su lugar), ``cbook.GetRealpathAndStat`` (usa ``cbook.get_realpath_and_stat`` en su lugar), ``cbook.listFiles``

source: ``contour.ContourLabeler.cl``, ``contour.ContourLabeler.cl_xy``, ``contour.ContourLabeler.cl_cvalues`` (use ``labelTexts``, ``labelXYs``, ``labelCValues`` instead)
es_es: ``contour.ContourLabeler.cl``, ``contour.ContourLabeler.cl_xy``, ``contour.ContourLabeler.cl_cvalues`` (use ``labelTexts``, ``labelXYs``, ``labelCValues`` en su lugar)

source: ``mathtext.unichr_safe`` (use ``chr`` instead)
es_es: ``mathtext.unichr_safe`` (use ``chr`` en su lugar)

source: ``patches.YAArrow`` (use ``patches.FancyArrowPatch`` instead)
es_es: ``patches.YAArrow`` (use ``patches.FancyArrowPatch`` en su lugar)

source: ``testing.compare.compare_float``, ``testing.decorators.CleanupTest``, ``testing.decorators.ImageComparisonTest``, ``testing.decorators.skip_if_command_unavailable``, support for nose-based tests
es_es: ``testing.compare.compare_float``, ``testing.decorators.CleanupTest``, ``testing.decorators.ImageComparisonTest``, ``testing.decorators.skip_if_command_unavailable``, soporte para pruebas basadas en la nariz

source: ``text.Annotation.arrow`` (use ``text.Annotation.arrow_patch`` instead)
es_es: ``text.Annotation.arrow`` (use ``text.Annotation.arrow_patch`` en su lugar)

source: ``axes_grid1.axes_divider.LocatableAxesBase``, ``axes_grid1.axes_divider.locatable_axes_factory``, ``axes_grid1.axes_divider.Axes`` (use ``axes_grid1.mpl_axes.Axes`` instead), ``axes_grid1.axes_divider.LocatableAxes`` (use ``axes_grid1.mpl_axes.Axes`` instead)
es_es: ``axes_grid1.axes_divider.LocatableAxesBase``, ``axes_grid1.axes_divider.locatable_axes_factory``, ``axes_grid1.axes_divider.Axes`` (use ``axes_grid1.mpl_axes.Axes`` en su lugar), ``axes_grid1.axes_divider.LocatableAxes`` (use ``axes_grid1.mpl_axes.Axes`` en su lugar)

source: ``axisartist.axes_divider.Axes``, ``axisartist.axes_divider.LocatableAxes`` (use ``axisartist.axislines.Axes`` instead)
es_es: ``axisartist.axes_divider.Exes``, ``axisartist.axes_divider.LocatableAxes`` (use ``axisartist.axislines.Ejes`` en su lugar)

source: the *normed* keyword argument to ``hist`` (use *density* instead)
es_es: el argumento de la palabra clave *normed* a `` ` ` (usar * densidad * en su lugar)

source: passing ``(verts, 0)`` or ``(..., 3)`` when specifying a marker to specify a path or a circle, respectively (instead, use ``verts`` or ``"o"``, respectively)
es_es: pasando ``(vértices, 0)`` o ``(..., 3)`` al especificar un marcador para especificar una ruta o un círculo, respectivamente (en su lugar, use ``verts`` o ``"o"``, respectivamente)

source: The following members of ``matplotlib.backends.backend_pdf.PdfFile`` were removed:
es_es: Los siguientes miembros de ``matplotlib.backends.backend_pdf.PdfFile`` fueron eliminados:

source: ``alphaStateObject``
es_es: ``alfa Objeto``

source: The ``required_interactive_framework`` attribute of backend modules introduced in Matplotlib 3.0 has been moved to the ``FigureCanvas`` class, in order to let it be inherited by third-party canvas subclasses and to make it easier to know what interactive framework is required by a canvas class.
es_es: El atributo ``required_interactive_framework`` de módulos del backend introducido en Matplotlib 3. ha sido movido a la clase ``FigureCanvas``, para que sea heredado por subclases de lienzo de terceros y para facilitar el conocimiento de qué marco interactivo es requerido por una clase lienzo.

source: ``backend_qt4.FigureCanvasQT5``, which is an alias for ``backend_qt5.FigureCanvasQT`` (but only exists under that name in ``backend_qt4``), has been removed.
es_es: ``backend_qt4.FigureCanvasQT5``, que es un alias para ``backend_qt5.FigureCanvasQT`` (pero sólo existe bajo ese nombre en ``backend_qt4``), ha sido eliminado.

source: Development changes
es_es: Cambios en el desarrollo

source: Windows build
es_es: Versión de Windows

source: Previously, when building the ``matplotlib._png`` extension, the build script would add "png" and "z" to the extensions ``.libraries`` attribute (if pkg-config information is not available, which is in particular the case on Windows).
es_es: Anteriormente, al compilar la extensión ``matplotlib._png``, el script de compilación añadiría "png" y "z" a las extensiones ``. atributo ibraries`` (si la información pkg-config no está disponible, que es en particular el caso en Windows).

source: In particular, this implies that the Windows build would look up files named ``png.lib`` and ``z.lib``; but neither libpng upstream nor zlib upstream provides these files by default. (On Linux, this would look up ``libpng.so`` and ``libz.so``, which are indeed standard names.)
es_es: En particular, esto implica que la construcción de Windows buscaría archivos llamados ``png.lib`` y ``z. ib``; pero ni libpng upstream ni zlib upstream proporcionan estos archivos por defecto. (En Linux, esto buscaría ``libpng.so`` y ``libz.so``, que son de hecho nombres estándar.)

source: Instead, on Windows, we now look up ``libpng16.lib`` and ``zlib.lib``, which *are* the upstream names for the shared libraries (as of libpng 1.6.x).
es_es: En cambio, en Windows, ahora buscamos ``libpng16.lib`` y ``zlib.lib``, los cuales *son* los nombres de las bibliotecas compartidas (como libpng 1.6.x).

source: For a statically-linked build, the upstream names are ``libpng16_static.lib`` and ``zlibstatic.lib``; one still needs to manually rename them if such a build is desired.
es_es: Para una compilación vinculada estáticamente, los nombres de los desarrolladores originales son ``libpng16_static.lib`` y ``zlibstatic.lib``; todavía se necesita renombrarlos manualmente si tal compilación es deseada.

source: Packaging DLLs
es_es: DLL de empaquetado

source: Previously, it was possible to package Windows DLLs into the Maptlotlib wheel (or sdist) by copying them into the source tree and setting the ``package_data.dlls`` entry in ``setup.cfg``.
es_es: Anteriormente, era posible empaquetar las DLL de Windows en la rueda Maptlotlib (o sdist) copiándolas en el árbol de fuentes y configurando el ``package_data. entrada lls`` en ``setup.cfg``.

source: DLLs copied in the source tree are now always packaged; the ``package_data.dlls`` entry has no effect anymore. If you do not want to include the DLLs, don't copy them into the source tree.
es_es: Las DLL copiadas en el árbol fuente ahora siempre están empaquetadas; la entrada ``package_data.dlls`` ya no tiene efecto. Si no quiere incluir las DLL, no las copie en el árbol de fuentes.
