Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.1.0.po
Languages: es_es

source: For consistency with `.Line2D`, the `~.text.Text` class has gained the ``c`` alias for the ``color`` property. For example, one can now write ::
es_es: Para la consistencia con `.Line2D`, la clase `~.text.Text` ha ganado el alias ``c`` para la propiedad ``color``. Por ejemplo, ahora uno puede escribir ::

source: ``Cn`` colors now support ``n>=10``
es_es: colores ``Cn`` ahora soportan ``n>=10``

source: It is now possible to go beyond the tenth color in the property cycle using ``Cn`` syntax, e.g. ::
es_es: Ahora es posible ir más allá del décimo color en el ciclo de la propiedad usando la sintaxis ``Cn```, p.ej. ::

source: now uses the 12th color in the cycle.
es_es: ahora usa el 12º color en el ciclo.

source: Note that previously, a construct such as::
es_es: Ten en cuenta que anteriormente, una construcción como::

source: would be interpreted as a request to use color ``C1`` and marker ``1`` (an "inverted Y"). To obtain such a plot, one should now use ::
es_es: sería interpretado como una solicitud para usar el color ``C1`` y el marcador ``1`` (un "Y" invertido"). Para obtener tal parcela, uno debe usar ahora ::

source: (so that the first "1" gets correctly interpreted as a marker specification), or, more explicitly::
es_es: (para que el primer "1" se interprete correctamente como una especificación de marcador), o, más explícitamente::

source: New `.Formatter.format_ticks` method
es_es: Nuevo método `.Formatter.format_ticks`

source: The `.Formatter` class gained a new `~.Formatter.format_ticks` method, which takes the list of all tick locations as a single argument and returns the list of all formatted values. It is called by the axis tick handling code and, by default, first calls `~.Formatter.set_locs` with all locations, then repeatedly calls `~.Formatter.__call__` for each location.
es_es: La clase `.Formatter` ha ganado un nuevo `~.Formatter. método ormat_ticks`, que toma la lista de todas las ubicaciones de ticks como un único argumento y devuelve la lista de todos los valores formateados. Es llamado por el código de manejo de ticks del eje y, de forma predeterminada, primero llama a `~.Formatter. et_locs` con todas las ubicaciones, luego llama repetidamente a `~.Formatter.__call__` para cada ubicación.

source: Tick-handling code in the codebase that previously performed this sequence (`~.Formatter.set_locs` followed by repeated `~.Formatter.__call__`) have been updated to use `~.Formatter.format_ticks`.
es_es: Código de manejo de tickets en el código base que previamente realizó esta secuencia (`~.Formatter.set_locs` seguido por `~.Formatter.__call__`) han sido actualizados para usar `~.Formatter.format_ticks`.

source: `~.Formatter.format_ticks` is intended to be overridden by `.Formatter` subclasses for which the formatting of a tick value depends on other tick values, such as `.ConciseDateFormatter`.
es_es: `~.Formatter.format_ticks` está destinado a ser anulado por subclases `.Formatter` para las cuales el formato de un valor de tick depende de otros valores de tick, tales como `.ConciseDateFormatter`.

source: Added support for RGB(A) images in pcolorfast
es_es: Se ha añadido soporte para imágenes RGB(A) en pcolorfast

source: pcolorfast now accepts 3D images (RGB or RGBA) arrays if the X and Y specifications allow image or pcolorimage rendering; they remain unsupported by the more general quadmesh rendering
es_es: pcolorfast ahora acepta imágenes 3D (RGB o RGBA) si las especificaciones X e Y permiten la representación de imágenes o pcolorimages; siguen sin estar soportados por el renderizado quadmesh más general

source: Passing invalid locations to `~.Axes.legend` and `~.Axes.table` used to fallback on a default location. This behavior is deprecated and will throw an exception in a future version.
es_es: Pasando ubicaciones no válidas a `~.Axes.legend` y `~.Axes.table` usados para fallar en una ubicación por defecto. Este comportamiento está obsoleto y lanzará una excepción en una versión futura.

source: `.offsetbox.AnchoredText` is unable to handle the *horizontalalignment* or *verticalalignment* kwargs, and used to ignore them with a warning. This behavior is deprecated and will throw an exception in a future version.
es_es: `.offsetbox.AnchoredText` es incapaz de manejar los kwargs *horizontalalignment* o *verticalalignment*, y usado para ignorarlos con una advertencia. Este comportamiento está obsoleto y lanzará una excepción en una versión futura.

source: Passing steps less than 1 or greater than 10 to `~.ticker.MaxNLocator` used to result in undefined behavior. It now throws a `ValueError`.
es_es: Pasando pasos menores a 1 o mayores a 10 a `~.ticker.MaxNLocator` usado para dar como resultado un comportamiento indefinido. Ahora arroja un `ValueError`.

source: The signature of the (private) ``Axis._update_ticks`` has been changed to not take the renderer as argument anymore (that argument is unused).
es_es: La firma del (privacidad) ``Axis._update_ticks`` ha sido cambiada para no tomar el renderizador como argumento (ese argumento está inutilizado).
