Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_2.0.0.po
Languages: es_es

source: API Changes in 2.0.0
es_es: Cambios de API en 2.0.0

source: Deprecation and removal
es_es: Deprecación y eliminación

source: Color of Axes
es_es: Color de los ejes

source: The ``axisbg`` and ``axis_bgcolor`` properties on *Axes* have been deprecated in favor of ``facecolor``.
es_es: Las propiedades ``axisbg`` y ``axis_bgcolor`` en *Ejes* han sido obsoletas a favor de ``facecolor``.

source: GTK and GDK backends deprecated
es_es: Los backends de GTK y GDK están obsoletos

source: The GDK and GTK backends have been deprecated. These obsolete backends allow figures to be rendered via the GDK API to files and GTK2 figures. They are untested and known to be broken, and their use has been discouraged for some time. Instead, use the ``GTKAgg`` and ``GTKCairo`` backends for rendering to GTK2 windows.
es_es: Los backends GDK y GTK han sido obsoletos. Estos backends obsoletos permiten que las figuras sean renderizadas a través de la API GDK a archivos y cifras GTK2. No se han probado y se sabe que se han roto, y su uso ha sido desalentado durante algún tiempo. En su lugar, utilice los backends ``GTKAgg`` y ``GTKCairo`` para renderizar a las ventanas GTK2.

source: WX backend deprecated
es_es: backend WX obsoleto

source: The WX backend has been deprecated. It is untested, and its use has been discouraged for some time. Instead, use the ``WXAgg`` backend for rendering figures to WX windows.
es_es: El backend WX ha sido obsoleto. No está probado, y su uso ha sido desaconsejado durante algún tiempo. En su lugar, utilice el backend ``WXAgg`` para renderizar figuras en ventanas WX.

source: CocoaAgg backend removed
es_es: backend de CocoaAgg eliminado

source: The deprecated and not fully functional CocoaAgg backend has been removed.
es_es: Se ha eliminado el backend de CocoaAgg obsoleto y no totalmente funcional.

source: `round` removed from TkAgg Backend
es_es: `round` eliminado del backend de TkAgg

source: The TkAgg backend had its own implementation of the `round` function. This was unused internally and has been removed. Instead, use either the `round` builtin function or `numpy.around`.
es_es: El backend de TkAgg tenía su propia implementación de la función 'ronda'. Esto no fue usado internamente y ha sido eliminado. En su lugar, usa la función incorporada `round` o `numpy.around`.

source: 'hold' functionality deprecated
es_es: funcionalidad 'mantener' obsoleta

source: The 'hold' keyword argument and all functions and methods related to it are deprecated, along with the ``axes.hold`` rcParams entry. The behavior will remain consistent with the default ``hold=True`` state that has long been in place. Instead of using a function or keyword argument (``hold=False``) to change that behavior, explicitly clear the axes or figure as needed prior to subsequent plotting commands.
es_es: El argumento de la palabra clave 'hold' y todas las funciones y métodos relacionados con ella están obsoletos, junto con los ``axes'. viejo`` entrada rcParams. El comportamiento permanecerá consistente con el estado predeterminado ``hold=True`` que ha estado en su lugar. En lugar de usar una función o argumento de palabra clave (``hold=False``) para cambiar ese comportamiento, limpiar explícitamente los ejes o figuras según sea necesario antes de los siguientes comandos de trazado.

source: `.Artist.update` has return value
es_es: `.Artist.update` tiene valor devuelto

source: The methods `matplotlib.artist.Artist.set`, `matplotlib.artist.Artist.update`, and the function `matplotlib.artist.setp` now use a common codepath to look up how to update the given artist properties (either using the setter methods or an attribute/property).
es_es: Los métodos `matplotlib.artist.Artist.set`, `matplotlib.artist.Artist.update`, y la función `matplotlib.artist. etp` ahora usa una ruta de código común para buscar cómo actualizar las propiedades del artista (ya sea usando los métodos setter o un atributo/propiedad).

source: The behavior of `matplotlib.artist.Artist.update` is slightly changed to return a list of the values returned from the setter methods to avoid changing the API of `matplotlib.artist.Artist.set` and `matplotlib.artist.setp`.
es_es: El comportamiento de `matplotlib.artist.Artist. pdate` se cambia ligeramente para devolver una lista de los valores devueltos de los métodos setter para evitar cambiar la API de `matplotlib. rtist.Artist.set` y `matplotlib.artist.setp`.

source: The keys passed into `matplotlib.artist.Artist.update` are now converted to lower case before being processed, to match the behavior of `matplotlib.artist.Artist.set` and `matplotlib.artist.setp`. This should not break any user code because there are no set methods with capitals in their names, but this puts a constraint on naming properties in the future.
es_es: Las claves pasadas a `matplotlib.artist.Artist.update` ahora se convierten a minúsculas antes de ser procesadas, para coincidir con el comportamiento de `matplotlib.artist.Artist.set` y `matplotlib. rtist.setp`. Esto no debería romper ningún código de usuario porque no hay métodos con mayúsculas en sus nombres, pero esto pone una restricción sobre las propiedades de nombre en el futuro.

source: `.Legend` initializers gain *edgecolor* and *facecolor* keyword arguments
es_es: `.Legend` inicializadores ganan argumentos de palabra clave *edgecolor* y *facecolor*

source: The :class:`~matplotlib.legend.Legend` background patch (or 'frame') can have its ``edgecolor`` and ``facecolor`` determined by the corresponding keyword arguments to the :class:`matplotlib.legend.Legend` initializer, or to any of the methods or functions that call that initializer. If left to their default values of `None`, their values will be taken from ``matplotlib.rcParams``. The previously-existing ``framealpha`` kwarg still controls the alpha transparency of the patch.
es_es: El parche de fondo :class:`~matplotlib.legend.Legend` (o 'frame') puede tener su ``edgecolor`` y ``facecolor`` determinados por los argumentos de la palabra clave correspondiente al :class:`matplotlib.legend. egend` inicializador, o a cualquiera de los métodos o funciones que llaman a ese inicializador. Si se deja a sus valores predeterminados de `Ninguno`, sus valores serán tomados de ``matplotlib. cParams``. El kwarg ``framealpha`` anterior todavía controla la transparencia alfa del parche.

source: Qualitative colormaps
es_es: Mapas cualitativos de colores

source: Colorbrewer's qualitative/discrete colormaps ("Accent", "Dark2", "Paired", "Pastel1", "Pastel2", "Set1", "Set2", "Set3") are now implemented as `.ListedColormap` instead of `.LinearSegmentedColormap`.
es_es: Los mapas de colores cualitativos/discretos ("Accent", "Dark2", "Paired", "Pastel1", "Pastel2", "Set1", "Set2", "Set3") ahora se implementan como `.ListedColormap` en lugar de `.LinearSegmentedColormap`.

source: To use these for images where categories are specified as integers, for instance, use::
es_es: Para usarlos para imágenes donde las categorías se especifican como enteros, por ejemplo, use::

source: Change in the ``draw_image`` backend API
es_es: Cambiar en la API de backend de ``draw_image``

source: The ``draw_image`` method implemented by backends has changed its interface.
es_es: El método ``draw_image`` implementado por los backends ha cambiado su interfaz.

source: This change is only relevant if the backend declares that it is able to transform images by returning ``True`` from ``option_scale_image``. See the ``draw_image`` docstring for more information.
es_es: Este cambio sólo es relevante si el backend declara que es capaz de transformar imágenes devolviendo ``True`` desde ``option_scale_image``. Vea la docstring ``draw_image`` para más información.

source: ``matplotlib.ticker.LinearLocator`` algorithm update
es_es: Actualizar algoritmo ``matplotlib.ticker.LinearLocator``

source: The `matplotlib.ticker.LinearLocator` is used to define the range and location of axis ticks when the user wants an exact number of ticks. ``LinearLocator`` thus differs from the default locator ``MaxNLocator``, for which the user specifies a maximum number of intervals rather than a precise number of ticks.
es_es: El `matplotlib.ticker.LinearLocator` se utiliza para definir el rango y la ubicación de ticks de ejes cuando el usuario quiere un número exacto de ticks. Por lo tanto, ``LinearLocator`` difiere del localizador predeterminado ``MaxNLocator``, para el cual el usuario especifica un número máximo de intervalos en lugar de un número preciso de ticks.

source: The view range algorithm in ``matplotlib.ticker.LinearLocator`` has been changed so that more convenient tick locations are chosen. The new algorithm returns a plot view range that is a multiple of the user-requested number of ticks. This ensures tick marks will be located at whole integers more consistently. For example, when both y-axes of a``twinx`` plot use ``matplotlib.ticker.LinearLocator`` with the same number of ticks, their y-tick locations and grid lines will coincide.
es_es: El algoritmo del rango de vistas en ``matplotlib.ticker.LinearLocator`` ha sido cambiado para que se elijan ubicaciones de ticks más convenientes. El nuevo algoritmo devuelve un rango de vista de parcela que es un múltiplo del número de ticks solicitado por el usuario. Esto asegura que las marcas de tick se ubicarán en enteros de forma más consistente. Por ejemplo, cuando ambos ejes de un trazo ``twinx`` usan ``matplotlib. icker.LinearLocator`` con el mismo número de ticks, coincidirán sus ubicaciones de y-tick y líneas de cuadrícula.

source: `matplotlib.ticker.LogLocator` gains numticks kwarg
es_es: `matplotlib.ticker.LogLocator` gana números kwarg

source: The maximum number of ticks generated by the `~matplotlib.ticker.LogLocator` can now be controlled explicitly via setting the new 'numticks' kwarg to an integer. By default the kwarg is None which internally sets it to the 'auto' string, triggering a new algorithm for adjusting the maximum according to the axis length relative to the ticklabel font size.
es_es: El número máximo de ticks generados por el `~matplotlib.ticker.LogLocator` ahora puede controlarse explícitamente estableciendo el nuevo kwarg 'numticks' a un entero. Por defecto el kwarg es Ninguno que internamente lo establece a la cadena 'auto', activando un nuevo algoritmo para ajustar el máximo de acuerdo con la longitud del eje relativa al tamaño de la fuente de la etiqueta ticklab.

source: `matplotlib.ticker.LogFormatter`: two new kwargs
es_es: `matplotlib.ticker.LogFormatter`: dos nuevos kwargs

source: Previously, minor ticks on log-scaled axes were not labeled by default. An algorithm has been added to the `~matplotlib.ticker.LogFormatter` to control the labeling of ticks between integer powers of the base. The algorithm uses two parameters supplied in a kwarg tuple named 'minor_thresholds'. See the docstring for further explanation.
es_es: Anteriormente, los ticks menores en los ejes escalados en el registro no fueron etiquetados por defecto. Un algoritmo ha sido añadido al `~matplotlib. icker.LogFormatter` para controlar el etiquetado de ticks entre potencias enteras de la base. El algoritmo usa dos parámetros suministrados en una tupla kwarg llamada 'minor_parallholds'.

source: To improve support for axes using `~matplotlib.ticker.SymmetricalLogLocator`, a *linthresh* keyword argument was added.
es_es: Para mejorar el soporte de ejes usando `~matplotlib.ticker.SymmetricalLogLocator`, se añadió un argumento de palabra clave *linuto*.

source: New defaults for 3D quiver function in mpl_toolkits.mplot3d.axes3d.py
es_es: Nuevo valor predeterminado para la función 3D quiver en mpl_toolkits.mplot3d.axes3d.py

source: Matplotlib has both a 2D and a 3D ``quiver`` function. These changes affect only the 3D function and make the default behavior of the 3D function match the 2D version. There are two changes:
es_es: Matplotlib tiene tanto una función 2D como una ``quiver`` 3D. Estos cambios afectan sólo a la función 3D y hacen que el comportamiento predeterminado de la función 3D coincida con la versión 2D. Hay dos cambios:

source: The 3D quiver function previously normalized the arrows to be the same length, which makes it unusable for situations where the arrows should be different lengths and does not match the behavior of the 2D function. This normalization behavior is now controlled with the ``normalize`` keyword, which defaults to False.
es_es: La función de carcaj 3D anteriormente normalizó las flechas para que tuvieran la misma longitud, lo que lo hace inutilizable para situaciones en las que las flechas deben tener diferentes longitudes y no coincide con el comportamiento de la función 2D. Este comportamiento de normalización ahora se controla con la palabra clave ``normalize``, que por defecto es False.

source: The ``pivot`` keyword now defaults to ``tail`` instead of ``tip``. This was done in order to match the default behavior of the 2D quiver function.
es_es: La palabra clave ``pivot`` ahora es ``tail`` en lugar de ``tip``. Esto se hizo para que coincida con el comportamiento predeterminado de la función quiver 2D.

source: To obtain the previous behavior with the 3D quiver function, one can call the function with ::
es_es: Para obtener el comportamiento anterior con la función 3D quiver, se puede llamar a la función con ::

source: where "ax" is an ``Axes3d`` object created with something like ::
es_es: donde "ej" es un objeto ``Ejes3d`` creado con algo como ::

source: Stale figure behavior
es_es: Comportamiento de figura obsoleto

source: Attempting to draw the figure will now mark it as not stale (independent if the draw succeeds). This change is to prevent repeatedly trying to re-draw a figure which is raising an error on draw. The previous behavior would only mark a figure as not stale after a full re-draw succeeded.
es_es: Intentar dibujar la figura ahora lo marcará como no obsoleto (independiente si el sorteo tiene éxito). Este cambio tiene por objeto evitar que se intente volver a dibujar una cifra que está provocando un error de dibujo. El comportamiento anterior sólo marcaría una figura como no obsoleta después de que un re-sorteo completo tuviera éxito.

source: The spectral colormap is now nipy_spectral
es_es: El mapa de colores espectral ahora es nipy_spectral

source: The colormaps formerly known as ``spectral`` and ``spectral_r`` have been replaced by ``nipy_spectral`` and ``nipy_spectral_r`` since Matplotlib 1.3.0. Even though the colormap was deprecated in Matplotlib 1.3.0, it never raised a warning. As of Matplotlib 2.0.0, using the old names raises a deprecation warning. In the future, using the old names will raise an error.
es_es: Los mapas de colores anteriormente conocidos como ``espectral`` y ``spectral_r`` han sido reemplazados por ``nipy_spectral`` y ``nipy_spectral_r`` desde Matplotlib 1. .0. Aunque el mapa de colores estaba obsoleto en Matplotlib 1. .0, nunca levantó una advertencia. A partir de Matplotlib 2.0.0, usar los nombres antiguos plantea una advertencia de desaprobación. En el futuro, el uso de los nombres antiguos provocará un error.

source: Default install no longer includes test images
es_es: La instalación por defecto ya no incluye imágenes de prueba

source: To reduce the size of wheels and source installs, the tests and baseline images are no longer included by default.
es_es: Para reducir el tamaño de las ruedas y la instalación de la fuente, las pruebas y las imágenes básicas ya no están incluidas por defecto.

source: To restore installing the tests and images, use a :file:`setup.cfg` with ::
es_es: Para restaurar la instalación de las pruebas e imágenes, usa un :file:`setup.cfg` con ::

source: in the source directory at build/install time.
es_es: en el directorio de origen al momento de compilar/instalar.
