Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.2.0.po
Languages: es_es

source: API Changes for 3.2.0
es_es: Cambios en la API para la versión 3.2.0

source: Behavior changes
es_es: Cambios de comportamiento

source: Reduced default value of :rc:`axes.formatter.limits`
es_es: Reducido el valor predeterminado de :rc:`axes.formatter.limits`

source: Changed the default value of :rc:`axes.formatter.limits` from -7, 7 to -5, 6 for better readability.
es_es: Cambiado el valor predeterminado de :rc:`axes.formatter.limits` de -7, 7 a -5, 6 para una mejor legibilidad.

source: (`Source code <../../api/prev_api_changes/api_changes_3-2-0-1.py>`__, `png <../../api/prev_api_changes/api_changes_3-2-0-1.png>`__, `pdf <../../api/prev_api_changes/api_changes_3-2-0-1.pdf>`__)
es_es: (`Código fuente <../../api/prev_api_changes/api_changes_3-2-0-1.py>`__, `png <../../api/prev_api_changes/api_changes_3-2-0-1.png>`__, `pdf <../../api/prev_api_changes/api_changes_3-2-0-1.pdf>`__)

source: `matplotlib.colorbar.Colorbar` uses un-normalized axes for all mappables
es_es: `matplotlib.colorbar.Colorbar` usa ejes no normalizados para todos los mapeables

source: Before 3.0, `matplotlib.colorbar.Colorbar` (`~.Figure.colorbar`) normalized all axes limits between 0 and 1 and had custom tickers to handle the labelling of the colorbar ticks. After 3.0, colorbars constructed from mappables that were *not* contours were constructed with axes that had limits between ``vmin`` and ``vmax`` of the mappable's norm, and the tickers were made children of the normal axes tickers.
es_es: Antes de 3.0, `matplotlib.colorbar.Colorbar` (`~.Figure. olorbar`) normalizó todos los límites de ejes entre 0 y 1 y tenía tickers personalizados para manejar el etiquetado de los ticks de la barra de color. , barras de colores construidas a partir de mapeables que *no* eran contornos se construyeron con ejes que tenían límites entre ``vmin`` y ``vmax`` de la norma del mapeo, y los tickers fueron hechos hijos de los hachas normales.

source: This version of Matplotlib extends that to mappables made by contours, and allows the axes to run between the lowest boundary in the contour and the highest.
es_es: Esta versión de Matplotlib se extiende a los mapeables hechos por contornos, y permite que los ejes corran entre el límite más bajo en el contorno y el más alto.

source: Code that worked around the normalization between 0 and 1 will need to be modified.
es_es: Es necesario modificar el código que ha funcionado alrededor de la normalización entre 0 y 1.

source: `MovieWriterRegistry`
es_es: `EscritorRegistry`

source: `MovieWriterRegistry` now always checks the availability of the writer classes before returning them. If one wishes, for example, to get the first available writer, without performing the availability check on subsequent writers, it is now possible to iterate over the registry, which will yield the names of the available classes.
es_es: `Mo)[video] WriterRegistry` ahora siempre comprueba la disponibilidad de las clases de escritor antes de devolverlas. Si uno desea, por ejemplo, obtener el primer escritor disponible, sin realizar la comprobación de disponibilidad de los escritores posteriores, ahora es posible iterar sobre el registro, que producirá los nombres de las clases disponibles.

source: Autoscaling
es_es: Autoescalado

source: Matplotlib used to recompute autoscaled limits after every plotting (``plot()``, ``bar()``, etc.) call. It now only does so when actually rendering the canvas, or when the user queries the Axes limits. This is a major performance improvement for plots with a large number of artists.
es_es: Matplotlib usado para recalcular límites autoescalados después de cada plotting (``plot()``, ``bar()``, etc.) llamada. Ahora sólo lo hace al procesar el lienzo, o cuando el usuario consulta los límites de los ejes. Se trata de una importante mejora en el rendimiento de parcelas con un gran número de artistas.

source: In particular, this means that artists added manually with `.Axes.add_line`, `.Axes.add_patch`, etc. will be taken into account by the autoscale, even without an explicit call to `.Axes.autoscale_view`.
es_es: En particular, esto significa que los artistas añadieron manualmente con `.Axes.add_line`, `.Axes.add_patch`, etc. será tomado en cuenta por la autoescala, incluso sin una llamada explícita a `.Axes.autoscale_view`.

source: In some cases, this can result in different limits being reported. If this is an issue, consider triggering a draw with ``fig.canvas.draw()``.
es_es: En algunos casos, esto puede resultar en que se reporten diferentes límites. Si este es un problema, considere activar un sorteo con ``fig.canvas.draw()``.

source: Autoscaling has also changed for artists that are based on the `.Collection` class. Previously, the method that calculates the automatic limits `.Collection.get_datalim` tried to take into account the size of objects in the collection and make the limits large enough to not clip any of the object, i.e., for `.Axes.scatter` it would make the limits large enough to not clip any markers in the scatter. This is problematic when the object size is specified in physical space, or figure-relative space, because the transform from physical units to data limits requires knowing the data limits, and becomes invalid when the new limits are applied. This is an inverse problem that is theoretically solvable (if the object is physically smaller than the axes), but the extra complexity was not deemed worth it, particularly as the most common use case is for markers in scatter that are usually small enough to be accommodated by the default data limit margins.
es_es: Autoscaling también ha cambiado para artistas basados en la clase `.Collection`. Anteriormente, el método que calcula los límites automáticos `.Collection. et_datalim` trató de tener en cuenta el tamaño de los objetos en la colección y hacer los límites lo suficientemente grandes como para no cortar ninguno de los objetos, i. ., para `.Axes.scatter` haría los límites lo suficientemente grandes como para no cortar ningún marcador en el scatter. Esto es problemático cuando el tamaño del objeto se especifica en espacio físico, o espacio relativo a la figura, porque la transformación de unidades físicas a límites de datos requiere conocer los límites de datos, y se convierte en inválida cuando se aplican los nuevos límites. Este es un problema inverso que es teóricamente soluble (si el objeto es físicamente más pequeño que los ejes), pero la complejidad extra no se consideró válida, particularmente como el caso de uso más común es para marcadores en scatter que suelen ser lo suficientemente pequeños como para ser acomodados por los márgenes de límite de datos por defecto.

source: While the new behavior is algorithmically simpler, it is conditional on properties of the `.Collection` object:
es_es: Aunque el nuevo comportamiento es algoritmicamente más simple, está condicionado a propiedades del objeto `.Collection`:

source: ``offsets = None``, ``transform`` is a child of `.Axes.transData`: use the paths for the automatic limits (i.e. for `.LineCollection` in `.Axes.streamplot`).
es_es: ``offsets = Ninguno``, ``transform`` es un hijo de `.Axes.transData`: utiliza las rutas para los límites automáticos (es decir, para `.LineCollection` en `.Axes.streamplot`).

source: ``offsets != None``, and ``offset_transform`` is child of `.Axes.transData`:
es_es: ``offsets != Ninguno``, y ``offset_transform`` es hijo de `.Axes.transData`:

source: ``transform`` is child of `.Axes.transData`: use the ``path + offset`` for
es_es: ``transform`` es hijo de `.Axes.transData`: usa el ``path + offset`` para

source: limits (i.e., for `.Axes.bar`).
es_es: límites (por ejemplo, para `.Axes.bar`).

source: ``transform`` is not a child of `.Axes.transData`: just use the offsets
es_es: ``transform`` no es un hijo de `.Axes.transData`: solo utiliza los desplazamientos

source: for the limits (i.e. for scatter)
es_es: para los límites (es decir, para scatter)

source: otherwise return a null `.Bbox`.
es_es: de lo contrario devuelve un null `.Bbox`.

source: While this seems complicated, the logic is simply to use the information from the object that are in data space for the limits, but not information that is in physical units.
es_es: Aunque esto parece complicado, la lógica es simplemente utilizar la información del objeto que está en el espacio de datos para los límites, pero no la información que está en unidades físicas.

source: log-scale bar() / hist() autolimits
es_es: barras de log-scale ()() autolimita

source: The autolimits computation in `~.Axes.bar` and `~.Axes.hist` when the axes already uses log-scale has changed to match the computation when the axes is switched to log-scale after the call to `~.Axes.bar` and `~.Axes.hist`, and when calling ``bar(..., log=True)`` / ``hist(..., log=True)``: if there are at least two different bar heights, add the normal axes margins to them (in log-scale); if there is only a single bar height, expand the axes limits by one order of magnitude around it and then apply axes margins.
es_es: El cálculo de autolimits en `~.Axes.bar` y `~.Axes. list` cuando los ejes ya usan escala de registro han cambiado para que coincida con el cálculo cuando los ejes se cambian a escala de registro después de la llamada a `~. xes.bar` y `~.Axes.s3.amazonaws.com/`, y al llamar a ``bar(... log=True)`` / ``Click(... log=True)``: si hay al menos dos alturas de barra diferentes, agregue los márgenes de ejes normales (en escala de registro); si sólo hay una altura de barra, expanda los ejes limitados en un orden de magnitud alrededor de él y luego aplique márgenes de ejes.

source: Axes labels spanning multiple rows/columns
es_es: Etiquetas de ejes que abarcan múltiples filas/columnas

source: ``Axes.label_outer`` now correctly keep the x labels and tick labels visible for Axes spanning multiple rows, as long as they cover the last row of the Axes grid. (This is consistent with keeping the y labels and tick labels visible for Axes spanning multiple columns as long as they cover the first column of the Axes grid.)
es_es: ``Ejes. abel_outer`` ahora mantiene correctamente las etiquetas x y etiquetas de marca visibles para ejes que abarcan múltiples filas, mientras cubran la última fila de la cuadrícula de ejes. (Esto es consistente con mantener visibles las etiquetas y etiquetas de marca para los ejes que abarcan múltiples columnas, siempre y cuando cubran la primera columna de la cuadrícula de ejes.)

source: The ``Axes.is_last_row`` and ``Axes.is_last_col`` methods now correctly return True for Axes spanning multiple rows, as long as they cover the last row or column respectively. Again this is consistent with the behavior for axes covering the first row or column.
es_es: Los métodos ``Axes.is_last_row`` y ``Axes.is_last_col`` ahora devuelven correctamente True for Axes que abarcan varias filas, siempre y cuando cubran la última fila o columna respectivamente. Una vez más, esto es coherente con el comportamiento de los ejes que cubren la primera fila o columna.

source: The ``Axes.rowNum`` and ``Axes.colNum`` attributes are deprecated, as they only refer to the first grid cell covered by the Axes. Instead, use the new ``ax.get_subplotspec().rowspan`` and ``ax.get_subplotspec().colspan`` properties, which are `range` objects indicating the whole span of rows and columns covered by the subplot.
es_es: Los ``Ejes.rowNum`` y ``Ejes. los atributos olNum`` son obsoletos, ya que solo se refieren a la primera célula de cuadrícula cubierta por los ejes. En su lugar, utilice el nuevo ``ax. et_subplotspec().rowspan`` y las propiedades ``ax.get_subplotspec().colspan``, que son objetos `range` que indican la gama completa de filas y columnas cubiertas por el subgráfico.

source: (Note that all methods and attributes mentioned here actually only exist on the ``Subplot`` subclass of `~.axes.Axes`, which is used for grid-positioned Axes but not for Axes positioned directly in absolute coordinates.)
es_es: (Tenga en cuenta que todos los métodos y atributos mencionados aquí realmente sólo existen en la subclase ``Subplot`` de `~.axes. xes`, que se utiliza para ejes posicionados en la cuadrícula pero no para ejes posicionados directamente en coordenadas absolutas.)

source: The `.GridSpec` class gained the ``nrows`` and ``ncols`` properties as more explicit synonyms for the parameters returned by ``GridSpec.get_geometry``.
es_es: La clase `.GridSpec` ganó las propiedades ``nrows`` y ``ncols`` como sinónimos más explícitos para los parámetros devueltos por ``GridSpec.get_geometry``.

source: Locators
es_es: Localizadores

source: When more than `.Locator.MAXTICKS` ticks are generated, the behavior of `.Locator.raise_if_exceeds` changed from raising a RuntimeError to emitting a log at WARNING level.
es_es: Cuando se generan más de ticks `.Locator.MAXTICKS`, el comportamiento de `.Locator.raise_if_excededs` cambió de elevar un RuntimeError a emitir un registro a nivel WARNING.

source: nonsingular Locators
es_es: localizadores no singulares

source: ``Locator.nonsingular`` (introduced in mpl 3.1), ``DateLocator.nonsingular``, and ``AutoDateLocator.nonsingular`` now returns a range ``v0, v1`` with ``v0 <= v1``. This behavior is consistent with the implementation of ``nonsingular`` by the ``LogLocator`` and ``LogitLocator`` subclasses.
es_es: ``Locator.nonsingular`` (introducido en mpl 3.1), ``DateLocator.nonsingular``, y ``AutoDateLocator.nonsingular`` ahora devuelve un rango ``v0, v1`` con ``v0 <= v1``. Este comportamiento es consistente con la implementación de ``no singular`` por las subclases ``LogLocator`` y ``LogitLocator``.

source: ``get_data_ratio``
es_es: ``obtener ratio de datos``

source: ``Axes.get_data_ratio`` now takes the axes scale into account (linear, log, logit, etc.) before computing the y-to-x ratio. This change allows fixed aspects to be applied to any combination of x and y scales.
es_es: ``Axes.get_data_ratio`` ahora tiene en cuenta la escala de los ejes (lineal, log, logit, etc. antes de calcular la relación y-a-x. Este cambio permite que los aspectos fijos se apliquen a cualquier combinación de escalas x e y.

source: Artist sticky edges
es_es: Aristas del artista

source: Previously, the ``sticky_edges`` attribute of artists was a list of values such that if an axis limit coincides with a sticky edge, it would not be expanded by the axes margins (this is the mechanism that e.g. prevents margins from being added around images).
es_es: Anteriormente, el atributo ``sticky_edges`` de los artistas era una lista de valores tal que si un límite de eje coincide con un borde pegado, no se ampliaría por los márgenes de los ejes (este es el mecanismo que e. evita que se añadan márgenes alrededor de imágenes).

source: ``sticky_edges`` now have an additional effect on margins application: even if an axis limit did not coincide with a sticky edge, it cannot *cross* a sticky edge through margin application -- instead, the margins will only expand the axis limit until it bumps against the sticky edge.
es_es: ``sticky_edges`` ahora tienen un efecto adicional en la aplicación de los márgenes: incluso si un límite de ejes no coincidía con un borde pegado, no puede *cruzar* un borde fijo a través de aplicación de margen -- en su lugar, los márgenes sólo ampliarán el límite de ejes hasta que se bumba contra el borde pegado.

source: This change improves the margins of axes displaying a `~.Axes.streamplot`:
es_es: Este cambio mejora los márgenes de los ejes mostrando un `~.Axes.streamplot`:

source: if the streamplot goes all the way to the edges of the vector field, then the axis limits are set to match exactly the vector field limits (whereas they would sometimes be off by a small floating point error previously).
es_es: si el streamplot va hasta los bordes del campo vectorial, entonces los límites del eje se ajustan exactamente a los límites del campo vectorial (mientras que a veces estarían apagados por un pequeño error de punto flotante anteriormente).

source: if the streamplot does not reach the edges of the vector field (e.g., due to the use of ``start_points`` and ``maxlength``), then margins expansion will not cross the vector field limits anymore.
es_es: si el streamplot no alcanza los bordes del campo vectorial (p. ej. debido al uso de ``start_points`` y ``maxlength``), entonces la expansión de los márgenes ya no cruzará los límites de los campos vectoriales.

source: This change is also used internally to ensure that polar plots don't display negative *r* values unless the user really passes in a negative value.
es_es: Este cambio también se utiliza internamente para asegurar que las gráficas polares no muestren valores negativos *r* a menos que el usuario realmente pase en un valor negativo.

source: ``gid`` in svg output
es_es: ``gid`` en la salida svg

source: Previously, if a figure, axis, legend or some other artists had a custom ``gid`` set (e.g. via ``.set_gid()``), this would not be reflected in the svg output. Instead a default gid, like ``figure_1`` would be shown. This is now fixed, such that e.g. ``fig.set_gid("myfigure")`` correctly shows up as ``<g id="myfigure">`` in the svg file. If you relied on the gid having the default format, you now need to make sure not to set the ``gid`` parameter of the artists.
es_es: Anteriormente, si una figura, eje, leyenda o algún otro artista tenía un conjunto de ``gid`` personalizado (por ejemplo, a través de ``. et_gid()``), esto no se reflejaría en la salida de svg. En su lugar, se mostraría un gid por defecto, como ``figure_1``. Esto ahora es arreglado, tal que por ejemplo ``fig.set_gid("myfigure")`` aparece correctamente como ``<g id="myfigure">`` en el archivo svg. Si usted confiaba en que el gid tuviera el formato predeterminado, ahora necesita asegurarse de no establecer el parámetro ``gid`` de los artistas.

source: Fonts
es_es: Fuentes

source: Font weight guessing now first checks for the presence of the FT_STYLE_BOLD_FLAG before trying to match substrings in the font name. In particular, this means that Times New Roman Bold is now correctly detected as bold, not normal weight.
es_es: El peso de la fuente ahora primero comprueba la presencia del FT_STYLE_BOLD_FLAG antes de intentar coincidir con las subcadenas en el nombre de la fuente. En particular, esto significa que Times New Roman Bold ahora se detecta correctamente como audaz, no como peso normal.

source: Color-like checking
es_es: Comprobación de color

source: `matplotlib.colors.is_color_like` used to return True for all string representations of floats. However, only those with values in 0-1 are valid colors (representing grayscale values). `.is_color_like` now returns False for string representations of floats outside 0-1.
es_es: `matplotlib.colors.is_color_like` usado para devolver True para todas las representaciones de cadenas de flotantes. Sin embargo, sólo aquellos con valores en 0-1 son colores válidos (que representan valores de escala de gris). `.is_color_like` ahora devuelve False para representaciones de cadenas de flotantes fuera de 0-1.

source: Default image interpolation
es_es: Interpolación por defecto de la imagen

source: Images displayed in Matplotlib previously used nearest-neighbor interpolation, leading to aliasing effects for downscaling and non-integer upscaling.
es_es: Imágenes mostradas en Matplotlib anteriormente usaban la interpolación más cercana al vecino, lo que condujo a efectos de aliasing para escalar la escala y la actualización sin enteros.

source: New default for :rc:`image.interpolation` is the new option "antialiased". ``imshow(A, interpolation='antialiased')`` will apply a Hanning filter when resampling the data in A for display (or saving to file) *if* the upsample rate is less than a factor of three, and not an integer; downsampled data is always smoothed at resampling.
es_es: Nuevo valor predeterminado para :rc:`image.interpolation` es la nueva opción "antialiased". ``imshow(A, interpolation='antialiased')`` aplicará un filtro de Hanning al volver a muestrear los datos en A para mostrar (o guardar archivo) *si* la tasa de upsample es menor que un factor de tres, y no un entero; los datos muestreados siempre se suavizan al volver a muestrear.

source: To get the old behavior, set :rc:`image.interpolation` to the old default "nearest" (or specify the ``interpolation`` kwarg of `.Axes.imshow`)
es_es: Para obtener el viejo comportamiento, establece :rc:`image.interpolation` al antiguo "más cercano" predeterminado (o especifica el `interpolation`` kwarg de `.Axes.imshow`)

source: To always get the anti-aliasing behavior, no matter what the up/down sample rate, set :rc:`image.interpolation` to "hanning" (or one of the other filters available).
es_es: Para obtener siempre el comportamiento antialiasing, sin importar la tasa de ejemplo de arriba/abajo, establezca :rc:`image.interpolation` a "hanning" (o uno de los otros filtros disponibles).

source: Note that the "hanning" filter was chosen because it has only a modest performance penalty. Anti-aliasing can be improved with other filters.
es_es: Tenga en cuenta que el filtro "hanning" fue elegido porque sólo tiene una modesta pena de rendimiento. El aliasing puede ser mejorado con otros filtros.

source: When using `.RendererSVG` with ``rcParams["svg.image_inline"] == True``, externally written images now use a single counter even if the ``renderer.basename`` attribute is overwritten, rather than a counter per basename.
es_es: Cuando se utiliza `.RenderererSVG` con ``rcParams["svg.image_inline"] == True``, las imágenes escritas externamente ahora usan un solo contador incluso si el ``renderizador. el atributo asename`` es sobrescrito, en lugar de un contador por nombre de base.

source: This change will only affect you if you used ``rcParams["svg.image_inline"] = True`` (the default is False) *and* manually modified ``renderer.basename``.
es_es: Este cambio sólo le afectará si utilizó ``rcParams["svg.image_inline"] = True`` (el valor por defecto es False) *y* modificado manualmente ``renderer.basename``.

source: ``add_subplot()``
es_es: ``añadir_subplot()``

source: `.Figure.add_subplot()` and `.pyplot.subplot()` do not accept a *figure* keyword argument anymore. It only used to work anyway if the passed figure was ``self`` or the current figure, respectively.
es_es: `.Figure.add_subplot()` y `.pyplot.subplot()` ya no aceptan un argumento de palabra clave *figure*. Sólo funcionaba si la figura pasada era ``self`` o la figura actual, respectivamente.

source: In <= 3.1.0, `~matplotlib.axes.Axes.indicate_inset` and `~matplotlib.axes.Axes.indicate_inset_zoom` were documented as returning a 4-tuple of `~matplotlib.patches.ConnectionPatch`, where in fact they returned a 4-length list.
es_es: En <= 3.1.0, `~matplotlib.axes.Axes.indicate_inset` y `~matplotlib.axes.Axes.indicate_inset_zoom` fueron documentados como devolviendo una 4-tuple de `~matplotlib.patches.ConnectionPatch`, donde devolvieron una lista de 4 longitud.

source: They now correctly return a 4-tuple. `~matplotlib.axes.Axes.indicate_inset` would previously raise an error if the optional *inset_ax* was not supplied; it now completes successfully, and returns *None* instead of the tuple of ``ConnectionPatch``.
es_es: Ahora devuelven correctamente un 4-tuple. `~matplotlib.axes.Axes. ndicate_inset` plantearía previamente un error si el *inset_ax* opcional no se suministraba; ahora se completa con éxito, y devuelve *nunca* en lugar de la tupla de ``ConnectionPatch``.

source: PGF backend
es_es: backend PGF
