Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.3.0.po
Languages: es_es

source: ``mplot3d.art3d.paths_to_3d_segments_with_codes()`` (no replacement)
es_es: ``mplot3d.art3d.paths_to_3d_segments_with_codes()`` (sin reemplazo)

source: ``mplot3d.art3d.get_patch_verts()`` (no replacement)
es_es: ``mplot3d.art3d.get_patch_verts()`` (sin reemplazo)

source: ``mplot3d.art3d.get_colors()`` (no replacement)
es_es: ``mplot3d.art3d.get_colors()`` (sin reemplazo)

source: ``mplot3d.art3d.zalpha()`` (no replacement)
es_es: ``mplot3d.art3d.zalpha()`` (sin reemplazo)

source: ``mplot3d.axis3d.get_flip_min_max()`` (no replacement)
es_es: ``mplot3d.axis3d.get_flip_min_max()`` (sin reemplazo)

source: ``mplot3d.axis3d.Axis.get_tick_positions()`` (no replacement)
es_es: ``mplot3d.axis3d.Axis.get_tick_positions()`` (sin reemplazo)

source: ``axisartist.axis_artist.UnimplementedException`` (no replacement)
es_es: ``axisartist.axis_artist.UnimplementedException`` (sin reemplazo)

source: ``axisartist.axislines.SimpleChainedObjects`` (use ``axis_grid1.mpl_axes.SimpleChainedObjects`` instead)
es_es: ``axisartist.axislines.SimpleChainedObjects`` (use ``axis_grid1.mpl_axes.SimpleChainedObjects`` en su lugar)

source: ``axisartist.axislines.Axes.AxisDict`` (use ``axis_grid1.mpl_axes.Axes.AxisDict`` instead)
es_es: ``axisartist.axislines.Ejes.AxisDict`` (use ``axis_grid1.mpl_axes.Axes.AxisDict`` en su lugar)

source: Arguments
es_es: Argumentos

source: ``Axes.text()`` / ``pyplot.text()`` do not support the parameter ``withdash`` anymore. Use ``Axes.annotate()`` and ``pyplot.annotate()`` instead.
es_es: ``Axes.text()`` / ``pyplot.text()`` ya no soporta el parámetro ``withdash``. Utilice ``Axes.annotate()`` y ``pyplot.annotate()`` en su lugar.

source: The first parameter of `matplotlib.use` has been renamed from ``arg`` to ``backend`` (only relevant if you pass by keyword).
es_es: El primer parámetro de `matplotlib.use` ha sido renombrado de ``arg`` a ``backend`` (sólo relevante si pasa por palabra clave).

source: The parameter ``warn`` of `matplotlib.use` has been removed. A failure to switch the backend will now always raise an ``ImportError`` if ``force`` is set; catch that error if necessary.
es_es: El parámetro ``warn`` de `matplotlib.use` ha sido eliminado. Una falta de cambio del backend siempre planteará un ``ImportError`` si ``force`` está activado; atrapar ese error si es necesario.

source: All parameters of `matplotlib.use` except the first one are now keyword-only.
es_es: Todos los parámetros de `matplotlib.use` excepto el primero son ahora palabra clave.

source: The unused parameters ``shape`` and ``imlim`` of `~.axes.Axes.imshow()` are now removed. All parameters beyond ``extent`` are now keyword-only.
es_es: Los parámetros no utilizados ``shape`` e ``imlim`` de `~.axes.Axes.imshow()` ahora se eliminan. Todos los parámetros más allá de ``extent`` ahora son palabras clave.

source: The unused parameter ``interp_at_native`` of `.BboxImage` has been removed.
es_es: El parámetro no utilizado ``interp_at_native`` de `.BboxImage` ha sido eliminado.

source: The parameter ``usetex`` of `.TextToPath.get_text_path` has been removed. Use ``ismath='TeX'`` instead.
es_es: El parámetro ``usetex`` de `.TextToPath.get_text_path` ha sido eliminado. Use ``ismath='TeX'`` en su lugar.

source: The parameter ``block`` of ``show()`` is now keyword-only, and arbitrary arguments or keyword arguments are no longer accepted.
es_es: El parámetro ``block`` de ``show()`` ahora es sólo palabra clave, y los argumentos arbitrarios o de palabras clave ya no son aceptados.

source: The parameter ``frameon`` of `.Figure.savefig` has been removed. Use ``facecolor="none"`` to get a transparent background.
es_es: El parámetro ``frameon`` de `.Figure.savefig` ha sido eliminado. Use ``facecolor="None "`` para obtener un fondo transparente.

source: Passing a ``wx.EvtHandler`` as the first argument to ``backend_wx.TimerWx`` is not supported anymore; the signature of ``TimerWx`` is now consistent with `.TimerBase`.
es_es: Pasar un ``wx.EvtHandler`` como el primer argumento a ``backend_wx.TimerWx`` ya no está soportado; la firma de ``TimerWx`` ahora es consistente con `.TimerBase`.

source: The ``manage_xticks`` parameter of `~.Axes.boxplot` and `~.Axes.bxp` has been renamed to ``manage_ticks``.
es_es: El parámetro ``manage_xticks`` de `~.Axes.boxplot` y `~.Axes.bxp` ha sido renombrado a ``manage_ticks``.

source: The ``normed`` parameter of `~.Axes.hist2d` has been renamed to ``density``.
es_es: El parámetro ``normed`` de `~.Axes.medium2d` ha sido renombrado a ``densidad``.

source: The ``s`` parameter of `.Annotation` has been renamed to ``text``.
es_es: El parámetro ``s`` de `.Annotation` ha sido renombrado a ``text``.

source: For all functions in `.bezier` that supported a ``tolerence`` parameter, this parameter has been renamed to ``tolerance``.
es_es: Para todas las funciones en `.bezier` que soportaban un parámetro ``tolerencia``, este parámetro ha sido renombrado a ``tolerancia``.

source: ``axis("normal")`` is not supported anymore. Use the equivalent ``axis("auto")`` instead.
es_es: El ``axis("normal")`` ya no está soportado. Utilice el equivalente ``axis("auto")`` en su lugar.

source: ``axis()`` does not accept arbitrary keyword arguments anymore.
es_es: ``axis()`` ya no acepta argumentos arbitrarios de palabras clave.

source: ``Axis.set_ticklabels()`` does not accept arbitrary positional arguments other than ``ticklabels``.
es_es: ``Axis.set_ticklabels()`` no acepta argumentos posicionales arbitrarios que no sean ``ticklabels``.

source: ``mpl_toolkits.mplot3d.art3d.Poly3DCollection.set_zsort`` does not accept the value ``True`` anymore. Pass the equivalent value 'average' instead.
es_es: ``mpl_toolkits.mplot3d.art3d.Poly3DCollection.set_zsort`` ya no acepta el valor ``True``. Pase el valor equivalente 'promedio'.

source: `.AnchoredText` no longer accepts ``horizontalalignment`` or ``verticalalignment`` keyword arguments.
es_es: `.AnchoredText` ya no acepta argumentos de palabra clave ``horizontalalignment`` o ``verticalignment``.

source: `.ConnectionPatch` no longer accepts the ``arrow_transmuter`` and ``connector`` keyword arguments, which did nothing since 3.0.
es_es: `.ConnectionPatch` ya no acepta los argumentos de palabra clave ``arrow_transmuter`` y ``connector``, que no hicieron nada desde 3.0.

source: `.FancyArrowPatch` no longer accepts the ``arrow_transmuter`` and ``connector`` keyword arguments, which did nothing since 3.0.
es_es: `.FancyArrowPatch` ya no acepta los argumentos de palabra clave ``arrow_transmuter`` y ``connector``, que no hicieron nada desde 3.0.

source: `.TextPath` no longer accepts arbitrary positional or keyword arguments.
es_es: `.TextPath` ya no acepta argumentos de posición o palabra clave.

source: `.MaxNLocator.set_params()` no longer accepts arbitrary keyword arguments.
es_es: `.MaxNLocator.set_params()` ya no acepta argumentos arbitrarios de palabras clave.

source: `~.Axes.pie` no longer accepts and squeezes non-1D inputs; pass 1D input to the ``x`` argument.
es_es: `~.Axes.pie` ya no acepta y exprime las entradas no 1D; pasa la entrada 1D al argumento ``x``.

source: Passing (n, 1)-shaped error arrays to `.Axes.errorbar()` is no longer supported; pass a 1D array instead.
es_es: Pasar arrays de error (n, 1) a `.Axes.errorbar()` ya no es compatible; pasar un array 1D en su lugar.

source: The ``text.latex.unicode`` rcParam has been removed, with no replacement. Matplotlib now always supports unicode in usetex.
es_es: El rcParam ``text.latex.unicode`` ha sido removido, sin reemplazo. Matplotlib ahora siempre soporta unicode en usetex.

source: The ``savefig.frameon`` rcParam has been removed. Set :rc:`savefig.facecolor` to "none" to get a transparent background.
es_es: El rcParam ``savefig.frameon`` ha sido eliminado. Establece :rc:`savefig.facecolor` a "none" para obtener un fondo transparente.

source: The ``pgf.debug``, ``verbose.fileo`` and ``verbose.verbose.level`` rcParams, which had no effect, have been removed.
es_es: El ``pgf.debug``, ``verbose.fileo`` y ``verbose.verbose.level`` rcParams, que no tuvo ningún efecto, han sido removidos.

source: Support for setting :rc:`mathtext.default` to "circled" has been removed.
es_es: El soporte para establecer :rc:`mathtext.default` a "circled" ha sido eliminado.

source: Environment variables
es_es: Variables de entorno

source: ``MATPLOTLIBDATA`` (no replacement).
es_es: ``MATPLOTLIBDATA`` (sin reemplazo).

source: The ``\stackrel`` command (which behaved differently from its LaTeX version) has been removed. Use ``\genfrac`` instead.
es_es: El comando ``\stackrel`` (que se comportó de forma diferente a su versión LaTeX) ha sido eliminado. Utilice ``\genfrac`` en su lugar.

source: The ``\mathcircled`` command has been removed. Directly use Unicode characters, such as ``'\N{CIRCLED LATIN CAPITAL LETTER A}'``, instead.
es_es: El comando ``\mathcircled`` ha sido eliminado. Utilice directamente caracteres Unicode, como ``'\N{CIRCLED LATIN CAPITAL LETTER A}'``, en su lugar.

source: Development changes
es_es: Cambios en el desarrollo

source: Matplotlib now requires numpy>=1.15
es_es: Matplotlib ahora requiere numpy>=1.15

source: Matplotlib now uses Pillow to save and read pngs
es_es: Matplotlib ahora usa Pillow para guardar y leer pngs

source: The builtin png encoder and decoder has been removed, and Pillow is now a dependency. Note that when reading 16-bit RGB(A) images, Pillow truncates them to 8-bit precision, whereas the old builtin decoder kept the full precision.
es_es: Se ha eliminado el codificador y decodificador png incorporado, y Pillow es ahora una dependencia. Tenga en cuenta que al leer imágenes RGB(A) de 16 bits, Pillow las trunca a una precisión de 8 bits, mientras que el antiguo decodificador incorporado mantuvo la máxima precisión.

source: The deprecated wx backend (not wxagg!) now always uses wx's builtin jpeg and tiff support rather than relying on Pillow for writing these formats; this behavior is consistent with wx's png output.
es_es: El backend wx obsoleto (no wxagg! ahora siempre utiliza jpeg incorporado de wx y soporte de tiff en lugar de depender de Pillow para escribir estos formatos; este comportamiento es consistente con la salida png de wx.
