Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.3.0.po
Languages: es_es

source: The ``add_checker`` and ``check_update`` methods and ``update_dict`` attribute of `.ScalarMappable` are deprecated.
es_es: Los métodos ``add_checker`` y ``check_update`` y el atributo ``update_dict`` de `.ScalarMappable` están obsoletos.

source: `.pyplot.tight_layout` and ``ColorbarBase`` parameters will become keyword-only
es_es: Los parámetros `.pyplot.tight_layout` y ``ColorbarBase`` se convertirán en palabras clave

source: All parameters of `.pyplot.tight_layout` and all parameters of ``ColorbarBase`` except for the first (*ax*) will become keyword-only, consistently with `.Figure.tight_layout` and ``Colorbar``, respectively.
es_es: Todos los parámetros de `.pyplot.tight_layout` y todos los parámetros de ``ColorbarBase`` excepto el primero (*ax*) se convertirán en palabras clave, consistentemente con `.Figure.tight_layout` y ``Colorbar``, respectivamente.

source: `.Axes.pie` radius and startangle
es_es: Radio y ángulo de inicio `.Axes.pie`

source: Passing ``None`` as either the ``radius`` or ``startangle`` of an `.Axes.pie` is deprecated; use the explicit defaults of 1 and 0, respectively, instead.
es_es: Pasar ``Ninguno`` como ``radius`` o ``startangle`` de un `.Axes.pie` está obsoleto; utilizar los valores por defecto explícitos de 1 y 0, respectivamente.

source: ... is deprecated. Scale ``Figure.dpi_scale_trans`` by 1/72 to achieve the same effect.
es_es: ... está obsoleto. Escala ``Figure.dpi_scale_trans`` por 1/72 para lograr el mismo efecto.

source: ``offset_position`` property of `.Collection`
es_es: propiedad ``offset_position`` de `.Collection`

source: The ``offset_position`` property of `.Collection` is deprecated. In the future, `.Collection`\s will always behave as if ``offset_position`` is set to "screen" (the default).
es_es: La propiedad ``offset_position`` de `.Collection` está obsoleta. En el futuro, `.Collection`\s siempre se comportará como si ``offset_position`` estuviera establecido en "pantalla" (el predeterminado).

source: Support for passing ``offset_position="data"`` to the ``draw_path_collection`` of all renderer classes is deprecated.
es_es: Soporte para pasar ``offset_position="data"`` a la ``draw_path_collection`` de todas las clases renderizadoras está obsoleta.

source: `.transforms.AffineDeltaTransform` can be used as a replacement. This API is experimental and may change in the future.
es_es: `.transforms.AffineDeltaTransform` puede ser usado como reemplazo. Esta API es experimental y puede cambiar en el futuro.

source: ... is deprecated.
es_es: ... está obsoleto.

source: `.epoch2num` and `.num2epoch` are deprecated
es_es: `.epoch2num` y `.num2epoch` están obsoletos

source: These are unused and can be easily reproduced by other date tools. `.get_epoch` will return Matplotlib's epoch.
es_es: Estos no son usados y pueden ser fácilmente reproducidos por otras herramientas de fecha. `.get_epoch` devolverá el epoch de Matplotlib.

source: ``axes_grid1.CbarAxes`` attributes
es_es: Atributos ``axes_grid1.CbarAxes``

source: The ``cbid`` and ``locator`` attribute are deprecated. Use ``mappable.colorbar_cid`` and ``colorbar.locator``, as for standard colorbars.
es_es: El atributo ``cbid`` y ``locator`` son obsoletos. Utilice ``mappable.colorbar_cid`` y ``colorbar.locator``, como para las barras de colores estándar.

source: This function is deprecated in prevision of the future release of PyQt6. The Qt version can be checked using ``QtCore.qVersion()``.
es_es: Esta función está obsoleta en la previsión de la futura versión de PyQt6. La versión Qt puede ser comprobada usando ``QtCore.qVersion()``.

source: Reordering of parameters by `.Artist.set`
es_es: Reordenación de parámetros por `.Artist.set`

source: In a future version, ``Artist.set`` will apply artist properties in the order in which they are given. This only affects the interaction between the *color*, *edgecolor*, *facecolor*, and, for `.Collection`\s, *alpha* properties: the *color* property now needs to be passed first in order not to override the other properties. This is consistent with e.g. `.Artist.update`, which did not reorder the properties passed to it.
es_es: En una versión futura, ``Artist.set`` aplicará las propiedades de los artistas en el orden en que se den. Esto sólo afecta a la interacción entre el *color*, *edgecolor*, *facecolor*, y, para `. ollection`\s, *alpha* propiedades: la propiedad *color* ahora necesita ser pasada primero para no sobreescribir las otras propiedades. Esto es consistente con por ejemplo `.Artist.update`, que no reordenó las propiedades que le fueron pasadas.

source: Passing multiple keys as a single comma-separated string or multiple arguments to `.ToolManager.update_keymap`
es_es: Pasando varias claves como una cadena separada por comas o múltiples argumentos a `.ToolManager.update_keymap`

source: This is deprecated; pass keys as a list of strings instead.
es_es: Esto está obsoleto; pasar las claves como una lista de cadenas en su lugar.

source: Statusbar classes and attributes
es_es: Clases y atributos de la barra de estado

source: The ``statusbar`` attribute of `.FigureManagerBase`, ``StatusbarBase`` and all its subclasses, and ``StatusBarWx``, are deprecated, as messages are now displayed in the toolbar instead.
es_es: El atributo ``statusbar`` de `.FigureManagerBase`, ``StatusbarBase`` y todas sus subclases, y ``StatusBarWx``, son obsoletas, ya que los mensajes ahora se muestran en la barra de herramientas en su lugar.

source: ``ismath`` parameter of ``draw_tex``
es_es: parámetro ``ismath`` de ``dibujar_tex``

source: The ``ismath`` parameter of the ``draw_tex`` method of all renderer classes is deprecated (as a call to ``draw_tex`` -- not to be confused with ``draw_text``! -- means that the entire string should be passed to the ``usetex`` machinery anyways). Likewise, the text machinery will no longer pass the ``ismath`` parameter when calling ``draw_tex`` (this should only matter for backend implementers).
es_es: El parámetro ``ismath`` del método ``draw_tex`` de todas las clases renderizadoras está obsoleto (como una llamada a ``draw_tex`` -- no confundirse con ``draw_text``! -- significa que toda la cadena debe pasarse a la maquinaria ``usetex`` de todos modos). De la misma manera, la maquinaria de texto ya no pasará el parámetro ``ismath`` al llamar a ``draw_tex`` (esto sólo debería importar para implementadores del backend).

source: Passing ``ismath="TeX!"`` to `.RendererAgg.get_text_width_height_descent` is deprecated. Pass ``ismath="TeX"`` instead, consistently with other low-level APIs which support the values True, False, and "TeX" for ``ismath``.
es_es: Pasando ``ismath="TeX!"`` a `.RendererAgg.get_text_width_height_descent` está obsoleto. Pasar ``ismath="TeX"`` en su lugar, consistentemente con otras APIs de bajo nivel que soportan los valores Verdadero, False y "TeX" para ``ismath``.

source: Stricter PDF metadata keys in PGF
es_es: Teclas de metadatos PDF más estrictas en PGF

source: Saving metadata in PDF with the PGF backend currently normalizes all keys to lowercase, unlike the PDF backend, which only accepts the canonical case. This is deprecated; in a future version, only the canonically cased keys listed in the PDF specification (and the `~.backend_pgf.PdfPages` documentation) will be accepted.
es_es: Guardar metadatos en PDF con el backend PGF actualmente normaliza todas las claves a minúsculas, a diferencia del backend PDF, que sólo acepta el caso canónico. Esto está obsoleto; en una versión futura, sólo se aceptarán las claves canónicamente caseadas listadas en la especificación PDF (y la documentación `~.backend_pgf.PdfPages`).

source: The ``MODIFIER_KEYS``, ``SUPER``, ``ALT``, ``CTRL``, and ``SHIFT`` global variables of the ``matplotlib.backends.backend_qt4agg``, ``matplotlib.backends.backend_qt4cairo``, :mod:`matplotlib.backends.backend_qt5agg` and :mod:`matplotlib.backends.backend_qt5cairo` modules are deprecated.
es_es: Los módulos ``MODIFIER_KEYS``, ``SUPER``, ``ALT``, ``CTRL``, y ``SHIFT`` variables globales de ``matplotlib.backends.backend_qt4agg``, ``matplotlib.backend_qt4cairo``, :mod:`matplotlib.backend_qt5agg` y :mod:`matplotlib.backend_qt5cairo` están desaprobados.

source: The ``TexManager.serif``, ``TexManager.sans_serif``, ``TexManager.cursive`` and ``TexManager.monospace`` attributes are deprecated.
es_es: Los atributos ``TexManager.serif``, ``TexManager.sans_serif``, ``TexManager.cursive`` y ``TexManager.monospace`` están desaprobados.

source: Removals
es_es: Eliminar

source: The following deprecated APIs have been removed:
es_es: Se han eliminado las siguientes APIs obsoletas:

source: Modules
es_es: Módulos

source: ``backends.qt_editor.formlayout`` (use the formlayout module available on PyPI instead).
es_es: ``backends.qt_editor.formlayout`` (utilice el módulo de formlayout disponible en PyPI en su lugar).

source: Classes, methods and attributes
es_es: Clases, métodos y atributos

source: ``artist.Artist.aname`` property (no replacement)
es_es: Propiedad ``artist.Artist.aname`` (sin reemplazo)

source: ``axis.Axis.iter_ticks`` (no replacement)
es_es: ``axis.Axis.iter_ticks`` (sin reemplazo)

source: Support for custom backends that do not provide a ``backend_bases.GraphicsContextBase.set_hatch_color`` method
es_es: Soporte para backends personalizados que no proporcionan un método ``backend_bases.GraphicsContextBase.set_hatch_color``

source: ``backend_bases.RendererBase.strip_math()`` (use ``cbook.strip_math()`` instead)
es_es: ``backend_bases.RenderBase.strip_math()`` (use ``cbook.strip_math()`` en su lugar)

source: ``backend_wx.debug_on_error()`` (no replacement)
es_es: ``backend_wx.debug_on_error()`` (sin reemplazo)

source: ``backend_wx.raise_msg_to_str()`` (no replacement)
es_es: ``backend_wx.raise_msg_to_str()`` (sin reemplazo)

source: ``backend_wx.fake_stderr`` (no replacement)
es_es: ``backend_wx.fake_stderr`` (sin reemplazo)

source: ``backend_wx.MenuButtonWx`` (no replacement)
es_es: ``backend_wx.MenuButtonWx`` (sin reemplazo)

source: ``backend_wx.PrintoutWx`` (no replacement)
es_es: ``backend_wx.PrintoutWx`` (sin reemplazo)

source: ``_backend_tk.NavigationToolbar2Tk.set_active()`` (no replacement)
es_es: ``_backend_tk.NavigationToolbar2Tk.set_active()`` (sin reemplazo)

source: ``backend_ps.PsBackendHelper.gs_exe`` property (no replacement)
es_es: Propiedad ``backend_ps.PsBackendHelper.gs_exe`` (sin reemplazo)

source: ``backend_ps.PsBackendHelper.gs_version`` property (no replacement)
es_es: Propiedad ``backend_ps.PsBackendHelper.gs_version`` (sin reemplazo)

source: ``backend_ps.PsBackendHelper.supports_ps2write`` property (no replacement)
es_es: Propiedad ``backend_ps.PsBackendHelper.supports_ps2write`` (sin reemplazo)

source: ``backend_ps.RendererPS.afmfontd`` property (no replacement)
es_es: Propiedad ``backend_ps.RendererPS.afmfontd`` (sin reemplazo)

source: ``backend_ps.GraphicsContextPS.shouldstroke`` property (no replacement)
es_es: ``backend_ps.GraphicsContextPS.shouldstroke`` propiedad (sin reemplazo)

source: ``backend_gtk3.FileChooserDialog`` (no replacement)
es_es: ``backend_gtk3.FileChooserDialog`` (sin reemplazo)

source: ``backend_gtk3.SaveFigureGTK3.get_filechooser()`` (no replacement)
es_es: ``backend_gtk3.SaveFigureGTK3.get_filechooser()`` (sin reemplazo)

source: ``backend_gtk3.NavigationToolbar2GTK3.get_filechooser()`` (no replacement)
es_es: ``backend_gtk3.NavigationToolbar2GTK3.get_filechooser()`` (sin reemplazo)

source: ``backend_gtk3cairo.FigureManagerGTK3Cairo`` (use ``backend_gtk3.FigureManagerGTK3`` instead)
es_es: ``backend_gtk3cairo.FigureManagerGTK3Cairo`` (use ``backend_gtk3.FigureManagerGTK3`` en su lugar)

source: ``backend_pdf.RendererPdf.afm_font_cache`` property (no replacement)
es_es: Propiedad ``backend_pdf.RenderererPdf.afm_font_cache`` (sin reemplazo)

source: ``backend_pgf.LatexManagerFactory`` (no replacement)
es_es: ``backend_pgf.LatexManagerFactory`` (sin reemplazo)

source: ``backend_qt5.NavigationToolbar2QT.buttons`` property (no replacement)
es_es: Propiedad ``backend_qt5.NavigationToolbar2QT.buttons`` (sin reemplazo)

source: ``backend_qt5.NavigationToolbar2QT.adj_window`` property (no replacement)
es_es: Propiedad ``backend_qt5.NavigationToolbar2QT.adj_window`` (sin reemplazo)

source: ``bezier.find_r_to_boundary_of_closedpath()`` (no replacement)
es_es: ``bezier.find_r_to_limundary_of_closedpath()`` (sin reemplazo)

source: ``cbook.dedent()`` (use `inspect.cleandoc` instead)
es_es: ``cbook.dedent()`` (usa `inspect.cleandoc` en su lugar)

source: ``cbook.get_label()`` (no replacement)
es_es: ``cbook.get_label()`` (sin reemplazo)

source: ``cbook.is_hashable()`` (use ``isinstance(..., collections.abc.Hashable)`` instead)
es_es: ``cbook.is_hashable()`` (use ``isinstance(..., collections.abc.Hashable)`` en su lugar)

source: ``cbook.iterable()`` (use ``numpy.iterable()`` instead)
es_es: ``cbook.iterable()`` (use ``numpy.iterable()`` en su lugar)

source: ``cbook.safezip()`` (no replacement)
es_es: ``cbook.safezip()`` (sin reemplazo)

source: ``colorbar.ColorbarBase.get_cmap`` (use ``ScalarMappable.get_cmap`` instead)
es_es: ``colorbar.ColorbarBase.get_cmap`` (use ``ScalarMappable.get_cmap`` en su lugar)

source: ``colorbar.ColorbarBase.set_cmap`` (use ``ScalarMappable.set_cmap`` instead)
es_es: ``colorbar.ColorbarBase.set_cmap`` (use ``ScalarMappable.set_cmap`` en su lugar)

source: ``colorbar.ColorbarBase.get_clim`` (use ``ScalarMappable.get_clim`` instead)
es_es: ``colorbar.ColorbarBase.get_clim`` (use ``ScalarMappable.get_clim`` en su lugar)

source: ``colorbar.ColorbarBase.set_clim`` (use ``ScalarMappable.set_clim`` instead)
es_es: ``colorbar.ColorbarBase.set_clim`` (use ``ScalarMappable.set_clim`` en su lugar)

source: ``colorbar.ColorbarBase.set_norm`` (use ``ScalarMappable.set_norm`` instead)
es_es: ``colorbar.ColorbarBase.set_norm`` (use ``ScalarMappable.set_norm`` en su lugar)

source: ``dates.seconds()`` (no replacement)
es_es: ``dates.seconds()`` (sin reemplazo)

source: ``dates.minutes()`` (no replacement)
es_es: ``dates.minutes()`` (sin reemplazo)

source: ``dates.hours()`` (no replacement)
es_es: ``dates.hours()`` (sin reemplazo)

source: ``dates.weeks()`` (no replacement)
es_es: ``dates.weeks()`` (sin reemplazo)

source: ``dates.strpdate2num`` and ``dates.bytespdate2num`` (use `time.strptime` or `dateutil.parser.parse` or `.dates.datestr2num` instead)
es_es: ``dates.strpdate2num`` y ``dates.bytespdate2num`` (utiliza `time.strptime` o `dateutil.parser.parse` o `.dates.datestr2num` en su lugar)

source: ``docstring.Appender`` (no replacement)
es_es: ``docstring.Appender`` (sin reemplazo)

source: ``docstring.dedent()`` (use `inspect.getdoc` instead)
es_es: ``docstring.dedent()`` (usa `inspect.getdoc` en su lugar)

source: ``docstring.copy_dedent()`` (use ``docstring.copy()`` and `inspect.getdoc` instead)
es_es: ``docstring.copy_dedent()`` (use ``docstring.copy()`` y `inspect.getdoc` en su lugar)

source: ``font_manager.OSXInstalledFonts()`` (no replacement)
es_es: ``font_manager.OSXInstalledFonts()`` (sin reemplazo)

source: ``image.BboxImage.interp_at_native`` property (no replacement)
es_es: Propiedad ``image.BboxImage.interp_at_native`` (sin reemplazo)

source: ``lines.Line2D.verticalOffset`` property (no replacement)
es_es: ``lines.Line2D.verticalOffset`` propiedad (sin reemplazo)

source: ``matplotlib.checkdep_dvipng`` (no replacement)
es_es: ``matplotlib.checkdep_dvipng`` (sin reemplazo)

source: ``matplotlib.checkdep_ghostscript`` (no replacement)
es_es: ``matplotlib.checkdep_ghostscript`` (sin reemplazo)

source: ``matplotlib.checkdep_pdftops`` (no replacement)
es_es: ``matplotlib.checkdep_pdftops`` (sin reemplazo)

source: ``matplotlib.checkdep_inkscape`` (no replacement)
es_es: ``matplotlib.checkdep_inkscape`` (sin reemplazo)

source: ``matplotlib.get_py2exe_datafiles`` (no replacement)
es_es: ``matplotlib.get_py2exe_datafiles`` (sin reemplazo)

source: ``matplotlib.tk_window_focus`` (use ``rcParams['tk.window_focus']`` instead)
es_es: ``matplotlib.tk_window_focus`` (use ``rcParams['tk.window_focus']`` en su lugar)

source: ``mlab.demean()`` (use ``mlab.detrend_mean()`` instead)
es_es: ``mlab.demean()`` (use ``mlab.detrend_mean()`` en su lugar)

source: ``path.get_paths_extents()`` (use ``path.get_path_collection_extents()`` instead)
es_es: ``path.get_paths_extents()`` (use ``path.get_path_collection_extents()`` en su lugar)

source: ``path.Path.has_nonfinite()`` (use ``not np.isfinite(self.vertices).all()`` instead)
es_es: ``path.Path.has_nonfinite()`` (use ``not np.isfinite(self.vertices).all()`` en su lugar)

source: ``projections.process_projection_requirements()`` (no replacement)
es_es: ``projectections.process_projectection_requirements()`` (sin reemplazo)

source: ``pyplot.plotfile()`` (Instead, load the data using `pandas.read_csv` or `numpy.loadtxt` or similar and use regular pyplot functions to plot the loaded data.)
es_es: ``pyplot.plotfile()`` (en su lugar, carga los datos usando `pandas.read_csv` o `numpy.loadtxt` o similar y usa funciones pyplot regulares para graficar los datos cargados)

source: ``quiver.Quiver.color()`` (use ``Quiver.get_facecolor()`` instead)
es_es: ``quiver.Quiver.color()`` (use ``Quiver.get_facecolor()`` en su lugar)

source: ``quiver.Quiver.keyvec`` property (no replacement)
es_es: Propiedad ``quiver.Quiver.keyvec`` (sin reemplazo)

source: ``quiver.Quiver.keytext`` property (no replacement)
es_es: Propiedad ``quiver.Quiver.keytext`` (sin reemplazo)

source: ``rcsetup.validate_qt4()`` (no replacement)
es_es: ``rcsetup.validate_qt4()`` (sin reemplazo)

source: ``rcsetup.validate_qt5()`` (no replacement)
es_es: ``rcsetup.validate_qt5()`` (sin reemplazo)

source: ``rcsetup.validate_verbose()`` (no replacement)
es_es: ``rcsetup.validate_verbose()`` (sin reemplazo)

source: ``rcsetup.ValidateInterval`` (no replacement)
es_es: ``rcsetup.ValidateInterval`` (sin reemplazo)

source: ``scale.LogTransformBase`` (use ``scale.LogTransform`` instead)
es_es: ``scale.LogTransformBase`` (use ``scale.LogTransform`` en su lugar)

source: ``scale.InvertedLogTransformBase`` (use ``scale.InvertedLogTransform`` instead)
es_es: ``scale.InvertedLogTransformBase`` (use ``scale.InvertedLogTransform`` en su lugar)

source: ``scale.Log10Transform`` (use ``scale.LogTransform`` instead)
es_es: ``scale.Log10Transform`` (use ``scale.LogTransform`` en su lugar)

source: ``scale.InvertedLog10Transform`` (use ``scale.InvertedLogTransform`` instead)
es_es: ``scale.InvertedLog10Transform`` (use ``scale.InvertedLogTransform`` en su lugar)

source: ``scale.Log2Transform`` (use ``scale.LogTransform`` instead)
es_es: ``scale.Log2Transform`` (use ``scale.LogTransform`` en su lugar)

source: ``scale.InvertedLog2Transform`` (use ``scale.InvertedLogTransform`` instead)
es_es: ``scale.InvertedLog2Transform`` (use ``scale.InvertedLogTransform`` en su lugar)

source: ``scale.NaturalLogTransform`` (use ``scale.LogTransform`` instead)
es_es: ``scale.NaturalLogTransform`` (use ``scale.LogTransform`` en su lugar)

source: ``scale.InvertedNaturalLogTransform`` (use ``scale.InvertedLogTransform`` instead)
es_es: ``scale.InvertedNaturalLogTransform`` (use ``scale.InvertedLogTransform`` en su lugar)

source: ``scale.get_scale_docs()`` (no replacement)
es_es: ``scale.get_scale_docs()`` (sin reemplazo)

source: ``sphinxext.plot_directive.plot_directive()`` (use the class ``PlotDirective`` instead)
es_es: ``sphinxext.plot_directive.plot_directive()`` (use la clase ``PlotDirective`` en su lugar)

source: ``sphinxext.mathmpl.math_directive()`` (use the class ``MathDirective`` instead)
es_es: ``sphinxext.mathmpl.math_directive()`` (use la clase ``MathDirective`` en su lugar)

source: ``spines.Spine.is_frame_like()`` (no replacement)
es_es: ``spines.Spine.is_frame_like()`` (sin reemplazo)

source: ``testing.decorators.switch_backend()`` (use ``@pytest.mark.backend`` decorator instead)
es_es: ``testing.decorators.switch_backend()`` (usa el decorador ``@pytest.mark.backend`` en su lugar)

source: ``text.Text.is_math_text()`` (use ``cbook.is_math_text()`` instead)
es_es: ``text.Text.is_math_text()`` (use ``cbook.is_math_text()`` en su lugar)

source: ``text.TextWithDash()`` (use ``text.Annotation`` instead)
es_es: ``text.TextWithDash()`` (use ``text.Annotation`` en su lugar)

source: ``textpath.TextPath.is_math_text()`` (use ``cbook.is_math_text()`` instead)
es_es: ``textpath.TextPath.is_math_text()`` (use ``cbook.is_math_text()`` en su lugar)

source: ``textpath.TextPath.text_get_vertices_codes()`` (use ``textpath.text_to_path.get_text_path()`` instead)
es_es: ``textpath.TextPath.text_get_vertices_codes()`` (use ``textpath.text_to_path.get_text_path()`` en su lugar)

source: ``textpath.TextToPath.glyph_to_path()`` (use ``font.get_path()`` and manual translation of the vertices instead)
es_es: ``textpath.TextToPath.glyph_to_path()`` (use ``font.get_path()`` y traducción manual de los vértices en su lugar)

source: ``ticker.OldScalarFormatter.pprint_val()`` (no replacement)
es_es: ``ticker.OldScalarFormatter.pprint_val()`` (sin reemplazo)

source: ``ticker.ScalarFormatter.pprint_val()`` (no replacement)
es_es: ``ticker.ScalarFormatter.pprint_val()`` (sin reemplazo)

source: ``ticker.LogFormatter.pprint_val()`` (no replacement)
es_es: ``ticker.LogFormatter.pprint_val()`` (sin reemplazo)

source: ``ticker.decade_down()`` (no replacement)
es_es: ``ticker.decade_down()`` (sin reemplazo)

source: ``ticker.decade_up()`` (no replacement)
es_es: ``ticker.decade_up()`` (sin reemplazo)

source: ``Tick`` properties ``gridOn``, ``tick1On``, ``tick2On``, ``label1On``, ``label2On`` (use ``set_visible()`` / ``get_visible()`` on ``Tick.gridline``, ``Tick.tick1line``, ``Tick.tick2line``, ``Tick.label1``, ``Tick.label2`` instead)
es_es: ``Tick`` propiedades ``gridOn``, ``tick1On``, ``tick2On``, ``label1On``, ``label2On`` (use ``set_visible()`` / ``get_visible()`` en ``Tick.gridline``, ``Tick.tick1line``, ``Tick.tick2line``, ``Tick.label1``, ``Tick.label2`` en su lugar)

source: ``widgets.SpanSelector.buttonDown`` property (no replacement)
es_es: Propiedad ``widgets.SpanSelector.buttonDown`` (sin reemplazo)

source: ``mplot3d.proj3d.line2d()`` (no replacement)
es_es: ``mplot3d.proj3d.line2d()`` (sin reemplazo)

source: ``mplot3d.proj3d.line2d_dist()`` (no replacement)
es_es: ``mplot3d.proj3d.line2d_dist()`` (sin reemplazo)

source: ``mplot3d.proj3d.line2d_seg_dist()`` (no replacement)
es_es: ``mplot3d.proj3d.line2d_seg_dist()`` (sin reemplazo)

source: ``mplot3d.proj3d.mod()`` (use `numpy.linalg.norm` instead)
es_es: ``mplot3d.proj3d.mod()`` (use `numpy.linalg.norm` en su lugar)

source: ``mplot3d.proj3d.proj_transform_vec()`` (no replacement)
es_es: ``mplot3d.proj3d.proj_transform_vec()`` (sin reemplazo)

source: ``mplot3d.proj3d.proj_transform_vec_clip()`` (no replacement)
es_es: ``mplot3d.proj3d.proj_transform_vec_clip()`` (sin reemplazo)

source: ``mplot3d.proj3d.vec_pad_ones()`` (no replacement)
es_es: ``mplot3d.proj3d.vec_pad_ones()`` (sin reemplazo)

source: ``mplot3d.proj3d.proj_trans_clip_points()`` (no replacement)
es_es: ``mplot3d.proj3d.proj_trans_clip_points()`` (sin reemplazo)

source: ``mplot3d.art3d.norm_angle()`` (no replacement)
es_es: ``mplot3d.art3d.norm_angle()`` (sin reemplazo)

source: ``mplot3d.art3d.norm_text_angle()`` (no replacement)
es_es: ``mplot3d.art3d.norm_text_angle()`` (sin reemplazo)

source: ``mplot3d.art3d.path_to_3d_segment()`` (no replacement)
es_es: ``mplot3d.art3d.path_to_3d_segment()`` (sin reemplazo)

source: ``mplot3d.art3d.paths_to_3d_segments()`` (no replacement)
es_es: ``mplot3d.art3d.paths_to_3d_segments()`` (sin reemplazo)

source: ``mplot3d.art3d.path_to_3d_segment_with_codes()`` (no replacement)
es_es: ``mplot3d.art3d.path_to_3d_segment_with_codes()`` (sin reemplazo)
