Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.3.0.po
Languages: es_es

source: API Changes for 3.3.0
es_es: Cambios en la API para la versión 3.3.0

source: Behaviour changes
es_es: Cambios de comportamiento

source: `.Formatter.fix_minus` now performs hyphen-to-unicode-minus replacement whenever :rc:`axes.unicode_minus` is True; i.e. its behavior matches the one of ``ScalarFormatter.fix_minus`` (`.ScalarFormatter` now just inherits that implementation).
es_es: `.Formatter.fix_minus` ahora realiza el reemplazo hyphen-to-unicode-menos cada vez que :rc:`axes.unicode_minus` es True; es decir, su comportamiento coincide con el de ``ScalarFormatter.fix_minus`` (`.ScalarFormatter` ahora acaba de heredar esa implementación).

source: This replacement is now used by the ``format_data_short`` method of the various builtin formatter classes, which affects the cursor value in the GUI toolbars.
es_es: Este reemplazo ahora es usado por el método ``format_data_short`` de las distintas clases de formateador incorporadas, que afecta el valor del cursor en las barras de herramientas GUI.

source: ``FigureCanvasBase`` now always has a ``manager`` attribute, which may be None
es_es: ``FigureCanvasBase`` ahora siempre tiene un atributo ``manager``, que puede no ser ninguno

source: Previously, it did not necessarily have such an attribute. A check for ``hasattr(figure.canvas, "manager")`` should now be replaced by ``figure.canvas.manager is not None`` (or ``getattr(figure.canvas, "manager", None) is not None`` for back-compatibility).
es_es: Anteriormente, no tenía necesariamente ese atributo. Una comprobación de ``hasattr(figure.canvas, "manager")`` ahora debería ser reemplazada por ``figure. anvas.manager no es ninguno`` (o ``getattr(figure.canvas, "manager", None) no es ninguno`` para back-compatibility).

source: `.cbook.CallbackRegistry` now propagates exceptions when no GUI event loop is running
es_es: `.cbook.CallbackRegistry` ahora propaga excepciones cuando no se está ejecutando un bucle de eventos GUI

source: `.cbook.CallbackRegistry` now defaults to propagating exceptions thrown by callbacks when no interactive GUI event loop is running. If a GUI event loop *is* running, `.cbook.CallbackRegistry` still defaults to just printing a traceback, as unhandled exceptions can make the program completely ``abort()`` in that case.
es_es: `.cbook.CallbackRegistry` ahora se propaga por defecto excepciones lanzadas por callbacks cuando no se está ejecutando un bucle de evento GUI interactivo. Si un ciclo de eventos GUI *está* en ejecución, `. book.CallbackRegistry` sigue siendo el valor por defecto de sólo imprimir un traceback, ya que las excepciones no controladas pueden hacer que el programa sea completamente ``abort()`` en ese caso.

source: ``Axes.locator_params()`` validates ``axis`` parameter
es_es: ``Axes.locator_params()`` valida el parámetro ``axis``

source: `.axes.Axes.locator_params` used to accept any value for ``axis`` and silently did nothing, when passed an unsupported value. It now raises a ``ValueError``.
es_es: `.axes.Axes.locator_params` usado para aceptar cualquier valor para ``axis`` y silenciosamente no hizo nada, cuando se pasó un valor no soportado. Ahora levanta un ``ValueError``.

source: ``Axis.set_tick_params()`` validates ``which`` parameter
es_es: ``Axis.set_tick_params()`` valida el parámetro ``which``

source: `.Axis.set_tick_params` (and the higher level `.axes.Axes.tick_params` and `.pyplot.tick_params`) used to accept any value for ``which`` and silently did nothing, when passed an unsupported value. It now raises a ``ValueError``.
es_es: `.Axis.set_tick_params` (y los `.axes.Axes.tick_params` y `.pyplot. ick_params`) se usa para aceptar cualquier valor para ``which`` y silenciosamente no hizo nada, cuando se pasó un valor no soportado. Ahora plantea un ``ValueError``.

source: ``Axis.set_ticklabels()`` must match ``FixedLocator.locs``
es_es: ``Axis.set_ticklabels()`` debe coincidir con ``FixedLocator.locs``

source: If an axis is using a `.ticker.FixedLocator`, typically set by a call to `.Axis.set_ticks`, then the number of ticklabels supplied must match the number of locations available (``FixedFormattor.locs``). If not, a ``ValueError`` is raised.
es_es: Si un eje está usando un `.ticker.FixedLocator`, típicamente establecido por una llamada a `.Axis. et_ticks`, entonces el número de etiquetas proporcionadas debe coincidir con el número de ubicaciones disponibles (``FixedFormattor.locs``). Si no, un ``ValueError`` es aumentado.

source: ``backend_pgf.LatexManager.latex`` is now created with ``encoding="utf-8"``, so its ``stdin``, ``stdout``, and ``stderr`` attributes are utf8-encoded.
es_es: ``backend_pgf.LatexManager.latex`` ahora es creado con ``encoding="utf-8"``, así que sus atributos ``stdout``, ``stdout``, y ``stderr`` son utf8-encoded.

source: ``pyplot.xticks()`` and ``pyplot.yticks()``
es_es: ``pyplot.xticks()`` y ``pyplot.yticks()``

source: Previously, passing labels without passing the ticks to either `.pyplot.xticks` and `.pyplot.yticks` would result in
es_es: Anteriormente, pasar etiquetas sin pasar los ticks a `.pyplot.xticks` y `.pyplot.yticks` resultaría en

source: TypeError: object of type 'NoneType' has no len()
es_es: Error de tipo: el objeto del tipo 'Ningtipo' no tiene len()

source: It now raises a ``TypeError`` with a proper description of the error.
es_es: Ahora plantea un ``TypeError`` con una descripción correcta del error.

source: Setting the same property under multiple aliases now raises a TypeError
es_es: Establecer la misma propiedad bajo múltiples alias ahora plantea un TypeError

source: Previously, calling e.g. ``plot(..., color=somecolor, c=othercolor)`` would emit a warning because ``color`` and ``c`` actually map to the same Artist property. This now raises a TypeError.
es_es: Anteriormente, llamando por ejemplo ``plot(... color=somecolor, c=othercolor)`` emitiría una advertencia porque ``color`` y ``c`` realmente se mapean a la misma propiedad Artista. Esto ahora levanta un TypeError.

source: `.FileMovieWriter` temporary frames directory
es_es: Directorio de fotogramas temporales `.FileMo)[video] Writer`

source: `.FileMovieWriter` now defaults to writing temporary frames in a temporary directory, which is always cleared at exit. In order to keep the individual frames saved on the filesystem, pass an explicit *frame_prefix*.
es_es: `.FileMo)[video] Writer` ahora es el valor predeterminado de escribir marcos temporales en un directorio temporal, que siempre se borra al salir. Para mantener los fotogramas individuales guardados en el sistema de archivos, pase un *frame_prefix* explícito.

source: `.Axes.plot` no longer accepts *x* and *y* being both 2D and with different numbers of columns
es_es: `.Axes.plot` ya no acepta que *x* y *y* sean tanto 2D como con diferentes números de columnas

source: Previously, calling `.Axes.plot` e.g. with *x* of shape ``(n, 3)`` and *y* of shape ``(n, 2)`` would plot the first column of *x* against the first column of *y*, the second column of *x* against the second column of *y*, **and** the first column of *x* against the third column of *y*. This now raises an error instead.
es_es: Anteriormente, llamando a `.Axes.plot` p.ej. con *x* de la forma ``(n, 3)`` y *y* de la forma ``(n, 2)`` graficarían la primera columna de *x* contra la primera columna de *y*, la segunda columna de *x* contra la segunda columna de *y*, **y** la primera columna de *x* contra la tercera columna de *y*. Esto plantea ahora un error.

source: `.Text.update_from` now copies usetex state from the source Text
es_es: `.Text.update_from` ahora copia el estado de usetex del texto fuente

source: `~.Axes.stem` now defaults to ``use_line_collection=True``
es_es: `~.Axes.stem` ahora es ``use_line_collection=True``

source: This creates the stem plot as a `.LineCollection` rather than individual `.Line2D` objects, greatly improving performance.
es_es: Esto crea la trama de tallo como un `.LineCollection` en lugar de objetos individuales `.Line2D`, mejorando enormemente el rendimiento.

source: rcParams color validator is now stricter
es_es: El validador de color de rcParams es ahora más estricto

source: Previously, rcParams entries whose values were color-like accepted "spurious" extra letters or characters in the "middle" of the string, e.g. ``"(0, 1a, '0.5')"`` would be interpreted as ``(0, 1, 0.5)``. These extra characters (including the internal quotes) now cause a ValueError to be raised.
es_es: Anteriormente, rcParams entradas cuyos valores eran como colores aceptados "espurios" letras extra o caracteres en el "medio" de la cadena, por ejemplo, ``"(0, 1a, '0. ')"`` sería interpretado como ``(0, 1, 0.5)``. Estos caracteres adicionales (incluyendo las comillas internas) ahora hacen que un ValueError sea levantado.

source: `.SymLogNorm` now has a *base* parameter
es_es: `.SymLogNorm` ahora tiene un parámetro *base*

source: Previously, `.SymLogNorm` had no *base* keyword argument, and defaulted to ``base=np.e`` whereas the documentation said it was ``base=10``. In preparation to make the default 10, calling `.SymLogNorm` without the new *base* keyword argument emits a deprecation warning.
es_es: Anteriormente, `.SymLogNorm` no tenía ningún argumento de palabra clave *base*, y por defecto ``base=np.e`` mientras que la documentación dijo que era ``base=10``. En preparación para hacer el valor por defecto 10, llamar a `.SymLogNorm` sin el nuevo argumento de palabra clave *base* emite una advertencia de desaprobación.

source: `~.Axes.errorbar` now color cycles when only errorbar color is set
es_es: `~.Axes.errorbar` ahora gira el color cuando sólo se establece el color de la barra de error

source: Previously setting the *ecolor* would turn off automatic color cycling for the plot, leading to the the lines and markers defaulting to whatever the first color in the color cycle was in the case of multiple plot calls.
es_es: Configurar previamente el *ecolor* desactivaría el ciclo de color automático para la gráfica, conduciendo a las líneas y marcadores por defecto a cualquier color del primer ciclo de color fue en el caso de múltiples llamadas de traza.

source: `.rcsetup.validate_color_for_prop_cycle` now always raises TypeError for bytes input
es_es: `.rcsetup.validate_color_for_prop_cycle` ahora siempre levanta TypeError para la entrada de bytes

source: It previously raised `TypeError`, **except** when the input was of the form ``b"C[number]"`` in which case it raised a ValueError.
es_es: Anteriormente planteó `TypeError`, **excepto** cuando la entrada era de la forma ``b"C[number]"`` en cuyo caso aumentó un ValueError.

source: `.FigureCanvasPS.print_ps` and `.FigureCanvasPS.print_eps` no longer apply edgecolor and facecolor
es_es: `.FigureCanvasPS.print_ps` y `.FigureCanvasPS.print_eps` ya no aplican color de bordes y facecolor

source: These methods now assume that the figure edge and facecolor have been correctly applied by `.FigureCanvasBase.print_figure`, as they are normally called through it.
es_es: Estos métodos ahora asumen que el borde de la figura y el color facecolor han sido correctamente aplicados por `.FigureCanvasBase.print_figure`, como normalmente son llamados a través de ella.

source: This behavior is consistent with other figure saving methods (`.FigureCanvasAgg.print_png`, `.FigureCanvasPdf.print_pdf`, `.FigureCanvasSVG.print_svg`).
es_es: Este comportamiento es consistente con otros métodos de guardado de figuras (`.FigureCanvasAgg.print_png`, `.FigureCanvasPdf.print_pdf`, `.FigureCanvasSVG.print_svg`).

source: `.pyplot.subplot()` now raises TypeError when given an incorrect number of arguments
es_es: `.pyplot.subplot()` ahora levanta TypeError cuando se le da un número incorrecto de argumentos

source: This is consistent with other signature mismatch errors. Previously a ValueError was raised.
es_es: Esto es consistente con otros errores de no coinciden con la firma. Anteriormente un ValueError fue levantado.

source: Shortcut for closing all figures
es_es: Acceso directo para cerrar todas las figuras

source: Shortcuts for closing all figures now also work for the classic toolbar. There is no default shortcut any more because unintentionally closing all figures by a key press might happen too easily. You can configure the shortcut yourself using :rc:`keymap.quit_all`.
es_es: Los atajos para cerrar todas las figuras ahora también funcionan para la clásica barra de herramientas. Ya no existe un atajo por defecto porque cerrar involuntariamente todas las figuras mediante una pulsación de teclas podría ocurrir demasiado fácilmente. Puede configurar el acceso directo usted mismo usando :rc:`keymap.quit_all`.

source: Autoscale for arrow
es_es: Autoescalar para la flecha

source: Calling ax.arrow() will now autoscale the axes.
es_es: Llamar a ax.arrow() ahora autoescalará los ejes.

source: ``set_tick_params(label1On=False)`` now also makes the offset text (if any) invisible
es_es: ``set_tick_params(label1On=False)`` ahora también hace que el texto de desplazamiento (si existe) sea invisible

source: ... because the offset text can rarely be interpreted without tick labels anyways.
es_es: ... porque el texto offset rara vez se puede interpretar sin etiquetas de marca de todos modos.

source: `.Axes.annotate` and `.pyplot.annotate` parameter name changed
es_es: `.Axes.annotate` y `.pyplot.annotate` han cambiado el nombre del parámetro

source: The parameter ``s`` to `.Axes.annotate` and `.pyplot.annotate` is renamed to ``text``, matching `.Annotation`.
es_es: El parámetro ``s`` a `.Axes.annotate` y `.pyplot.annotate` se renombra a ``text``, coincidiendo con `.Annotation`.

source: The old parameter name remains supported, but support for it will be dropped in a future Matplotlib release.
es_es: El nombre del parámetro antiguo sigue siendo soportado, pero el soporte para él se eliminará en una futura versión de Matplotlib.

source: `.font_manager.json_dump` now locks the font manager dump file
es_es: `.font_manager.json_dump` ahora bloquea el archivo de volcado del gestor de fuentes

source: ... to prevent multiple processes from writing to it at the same time.
es_es: ... para evitar que múltiples procesos le escriban al mismo tiempo.

source: `.pyplot.rgrids` and `.pyplot.thetagrids` now act as setters also when called with only kwargs
es_es: `.pyplot.rgrids` y `.pyplot.thetagrids` ahora actúan como setters también cuando son llamados con solo kwargs

source: Previously, keyword arguments were silently ignored when no positional arguments were given.
es_es: Anteriormente, los argumentos de palabras clave fueron ignorados silenciosamente cuando no se dieron argumentos positivos.

source: `.Axis.get_minorticklabels` and `.Axis.get_majorticklabels` now returns plain list
es_es: `.Axis.get_minorticklabels` y `.Axis.get_majority ticklabels` ahora devuelve la lista simple

source: Previously, `.Axis.get_minorticklabels` and `.Axis.get_majorticklabels` returns silent_list. Their return type is now changed to normal list. `.get_xminorticklabels`, `.get_yminorticklabels`, `.get_zminorticklabels`, `.Axis.get_ticklabels`, `.get_xmajorticklabels`, `.get_ymajorticklabels` and `.get_zmajorticklabels` methods will be affected by this change.
es_es: Anteriormente, `.Axis.get_minorticklabels` y `.Axis.get_majority ticklabels` regresa silencient_list. Su tipo de retorno ahora se cambia a la lista normal. `.get_xminorticklabels`, `. et_yminorticklabels`, `.get_zminorticklabels`, `.Axis.get_ticklabels`, `.get_xmajorticklabels`, `.get_ymajorticklabels` y `.get_zmajorticklabels` se verán afectados por este cambio.

source: Default slider formatter
es_es: Formateador deslizante por defecto

source: The default method used to format `.Slider` values has been changed to use a `.ScalarFormatter` adapted the slider values limits. This should ensure that values are displayed with an appropriate number of significant digits even if they are much smaller or much bigger than 1. To restore the old behavior, explicitly pass a "%1.2f" as the *valfmt* parameter to `.Slider`.
es_es: El método predeterminado usado para formatear los valores `.Slider` ha sido cambiado para usar un `.ScalarFormatter` adaptado los límites de los valores del deslizador. Esto debe asegurar que los valores se muestren con un número apropiado de dígitos significativos, incluso si son mucho más pequeños o mucho más grandes que 1. Para restaurar el comportamiento antiguo, pase explícitamente un "%1.2f" como el parámetro *valfmt* a `.Slider`.

source: Add *normalize* keyword argument to ``Axes.pie``
es_es: Añadir argumento de palabra clave *normalizar* a ``Ejes.pie``

source: ``pie()`` used to draw a partial pie if the sum of the values was < 1. This behavior is deprecated and will change to always normalizing the values to a full pie by default. If you want to draw a partial pie, please pass ``normalize=False`` explicitly.
es_es: ``pie()`` usado para dibujar un pastel parcial si la suma de los valores era < 1. Este comportamiento está obsoleto y cambiará a normalizar siempre los valores a un pie completo por defecto. Si desea dibujar una tarta parcial, por favor pase ``normalize=False`` explícitamente.

source: ``table.CustomCell`` is now an alias for `.table.Cell`
es_es: ``table.CustomCell`` es ahora un alias para `.table.Cell`

source: All the functionality of ``CustomCell`` has been moved to its base class `~.table.Cell`.
es_es: Toda la funcionalidad de ``CustomCell`` se ha movido a su clase base `~.table.Cell`.

source: wx Timer interval
es_es: wx Timer intervalo

source: Setting the timer interval on a not-yet-started ``TimerWx`` won't start it anymore.
es_es: Establecer el intervalo de tiempo en un ``TimerWx`` no iniciado todavía.

source: "step"-type histograms default to the zorder of `.Line2D`
es_es: "step"-type histogramas por defecto al zorder de `.Line2D`

source: This ensures that they go above gridlines by default. The old ``zorder`` can be kept by passing it as a keyword argument to `.Axes.hist`.
es_es: Esto asegura que van por encima de las líneas de cuadrícula por defecto. El antiguo ``zorder`` se puede mantener pasándolo como un argumento de palabra clave a `.Axes.First`.

source: `.Legend` and `.OffsetBox` visibility
es_es: Visibilidad de `.Legend` y `.OffsetBox`

source: `.Legend` and `.OffsetBox` subclasses (`.PaddedBox`, `.AnchoredOffsetbox`, and `.AnnotationBbox`) no longer directly keep track of the visibility of their underlying `.Patch` artist, but instead pass that flag down to the `.Patch`.
es_es: `.Legend` y `.OffsetBox` subclases (`.PaddedBox`, `.AnchoredOffsetbox`, y `. nnotationBbox`) ya no lleva un seguimiento directo de la visibilidad de su artista `.Patch` subyacente, sino que pasa esa bandera al `.Patch`.

source: `.Legend` and `.Table` no longer allow invalid locations
es_es: `.Legend` y `.Table` ya no permiten ubicaciones inválidas

source: This affects legends produced on an Axes (`.Axes.legend` and `.pyplot.legend`) and on a Figure (`.Figure.legend` and `.pyplot.figlegend`). Figure legends also no longer accept the unsupported ``'best'`` location. Previously, invalid Axes locations would use ``'best'`` and invalid Figure locations would used ``'upper right'``.
es_es: Esto afecta a las leyendas producidas en un ejes (`.Axes.legend` y `.pyplot.legend`) y en una Figura (`.Figure.legend` y `.pyplot.figlegend`). Las leyendas de la figura tampoco aceptan la ubicación ``'mejor'`` no soportada. Anteriormente, las ubicaciones de ejes no válidas usarían ``'mejor'`` y las ubicaciones de Figura no válidas usarían ``'superior derecha'``.

source: Passing Line2D's *drawstyle* together with *linestyle* is removed
es_es: Pasar el *estilo de dibujo* de Line2D junto con *estilo de línea* es eliminado

source: Instead of ``plt.plot(..., linestyle="steps--")``, use ``plt.plot(..., linestyle="--", drawstyle="steps")``. ``ds`` is also an alias for ``drawstyle``.
es_es: En lugar de ``plt.plot(..., linestyle="steps--")``, use ``plt.plot(..., linestyle="--", drawstyle="steps")``. ``ds`` también es un alias para ``drawstyle``.

source: Upper case color strings
es_es: Cadenas de color mayúsculas

source: Support for passing single-letter colors (one of "rgbcmykw") as UPPERCASE characters is removed; these colors are now case-sensitive (lowercase).
es_es: Soporte para pasar colores de una sola letra (uno de "rgbcmykw") ya que se eliminan los caracteres UPPERCASE; estos colores ahora son sensibles a mayúsculas y minúsculas (minúsculas).

source: tight/constrained_layout no longer worry about titles that are too wide
es_es: tight/constrained_layout ya no se preocupe por títulos demasiado amplios

source: *tight_layout* and *constrained_layout* shrink axes to accommodate "decorations" on the axes. However, if an xlabel or title is too long in the x direction, making the axes smaller in the x-direction doesn't help. The behavior of both has been changed to ignore the width of the title and xlabel and the height of the ylabel in the layout logic.
es_es: Los ejes *tight_layout* y *constrained_layout* reducen para acomodar "decoraciones" en los ejes. Sin embargo, si un xlabel o título es demasiado largo en la dirección x, hacer los ejes más pequeños en la dirección x no ayuda. El comportamiento de ambos ha sido cambiado para ignorar el ancho del título y xlabel y la altura del ylabel en la lógica del diseño.

source: This also means there is a new keyword argument for `.axes.Axes.get_tightbbox` and `.axis.Axis.get_tightbbox`: ``for_layout_only``, which defaults to *False*, but if *True* returns a bounding box using the rules above.
es_es: Esto también significa que hay un nuevo argumento de palabra clave para `.axes.Axes.get_tightbbox` y `.axis.Axis. et_tightbbox`: ``for_layout_only``, que por defecto es *False*, pero si *True* devuelve un cuadro de límite usando las reglas anteriores.

source: :rc:`savefig.facecolor` and :rc:`savefig.edgecolor` now default to "auto"
es_es: :rc:`savefig.facecolor` y :rc:`savefig.edgecolor` ahora son predeterminados para "auto"

source: This newly allowed value for :rc:`savefig.facecolor` and :rc:`savefig.edgecolor`, as well as the *facecolor* and *edgecolor* parameters to `.Figure.savefig`, means "use whatever facecolor and edgecolor the figure current has".
es_es: Este nuevo valor permitido para :rc:`savefig.facecolor` y :rc:`savefig.edgecolor`, así como los parámetros *facecolor* y *edgecolor* a `. igure.savefig`, significa "usar cualquier color de cara y borde que tenga la figura actual".

source: When using a single dataset, `.Axes.hist` no longer wraps the added artist in a `.silent_list`
es_es: Cuando se usa un único conjunto de datos, `.Axes.nb` ya no envuelve al artista añadido en una `.silent_list`
