Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.5.0.po
Languages: es_es

source: In `.axes_grid1.axes_divider`, various internal APIs will stop supporting passing ``nx1 = None`` or ``ny1 = None`` to mean ``nx + 1`` or ``ny + 1``, in preparation for a possible future API which allows indexing and slicing of dividers (possibly ``divider[a:b] == divider.new_locator(a, b)``, but also ``divider[a:] == divider.new_locator(a, <end>)``). The user-facing `.Divider.new_locator` API is unaffected -- it correctly normalizes ``nx1 = None`` and ``ny1 = None`` as needed.
es_es: En `.axes_grid1.axes_divider`, varias APIs internas dejarán de soportar el paso de ``nx1 = None`` o ``ny1 = None`` para significar ``nx + 1`` o ``ny + 1``, en preparación para una posible API futura que permita la indexación y el corte de divisores (posiblemente ``divider[a:b] == divider.new_locator(a, b)``, pero también ``divider[a:] == divider.new_locator(a, <end>)``). La API `.Divider.new_locator` no se ve afectada - normaliza correctamente ``nx1 = None`` y ``ny1 = None`` según sea necesario.

source: Removals
es_es: Eliminar

source: The following deprecated APIs have been removed:
es_es: Se han eliminado las siguientes APIs obsoletas:

source: Removed behaviour
es_es: Comportamiento eliminado

source: Stricter validation of function parameters
es_es: Validación más estricta de los parámetros de las funciones

source: Calling `.Figure.add_axes` with no arguments will raise an error. Adding a free-floating axes needs a position rectangle. If you want a figure-filling single axes, use `.Figure.add_subplot` instead.
es_es: Llamar a `.Figure.add_axes` sin argumentos generará un error. Añadir un eje libre necesita un rectángulo de posición. Si deseas un eje único que llene la figura, utiliza `.Figure.add_subplot` en su lugar.

source: `.Figure.add_subplot` validates its inputs; in particular, for ``add_subplot(rows, cols, index)``, all parameters must be integral. Previously strings and floats were accepted and converted to int.
es_es: `.Figure.add_subplot` valida sus entradas; en particular, para ``add_subplot(rows, cols, index)``, todos los parámetros deben ser integrales. Anteriormente se aceptaban cadenas y de punto flotante (float) y se convertían a int.

source: Passing *None* as the *which* argument to ``autofmt_xdate`` is no longer supported; use its more explicit synonym, ``which="major"``, instead.
es_es: Ya no se admite pasar *None* como argumento *which* a ``autofmt_xdate``; utiliza en su lugar su sinónimo más explícito, ``which="major"``.

source: Setting the *orientation* of an ``eventplot()`` or `.EventCollection` to "none" or *None* is no longer supported; set it to "horizontal" instead. Moreover, the two orientations ("horizontal" and "vertical") are now case-sensitive.
es_es: Ya no se admite establecer la *orientación* de un ``eventplot()`` o `.EventCollection` a "none" o *None*; en su lugar, establézcala a "horizontal". Además, las dos orientaciones ("horizontal" y "vertical") distinguen ahora entre mayúsculas y minúsculas.

source: Passing parameters *norm* and *vmin*/*vmax* simultaneously to functions using colormapping such as ``scatter()`` and ``imshow()`` is no longer supported. Instead of ``norm=LogNorm(), vmin=min_val, vmax=max_val`` pass ``norm=LogNorm(min_val, max_val)``. *vmin* and *vmax* should only be used without setting *norm*.
es_es: Ya no es posible pasar los parámetros *norm* y *vmin*/*vmax* simultáneamente a las funciones que utilizan el mapeo de colores, como ``scatter()`` y ``imshow()``. En lugar de ``norm=LogNorm(), vmin=min_val, vmax=max_val`` pase ``norm=LogNorm(min_val, max_val)``. *vmin* y *vmax* sólo deben utilizarse sin establecer *norm*.

source: Passing *None* as either the *radius* or *startangle* arguments of an `.Axes.pie` is no longer accepted; use the explicit defaults of 1 and 0, respectively, instead.
es_es: Ya no se acepta pasar *None* como argumentos de *radio* o *ángulo inicial* de un `.Axes.pie`; en su lugar, utiliza los valores predeterminados explícitos de 1 y 0, respectivamente.

source: Passing *None* as the *normalize* argument of `.Axes.pie` (the former default) is no longer accepted, and the pie will always be normalized by default. If you wish to plot an incomplete pie, explicitly pass ``normalize=False``.
es_es: Ya no se acepta pasar *None* como argumento *normalize* de `.Axes.pie` (el anterior valor por defecto), y el pastel siempre se normalizará por defecto. Si desea graficar un círculo incompleto, pase explícitamente ``normalize=False``.

source: Support for passing *None* to ``subplot_class_factory`` has been removed. Explicitly pass in the base `~matplotlib.axes.Axes` class instead.
es_es: Se ha eliminado el soporte para pasar *None* a ``subplot_class_factory``. Pase explícitamente la clase base `~matplotlib.axes.Axes` en su lugar.

source: Passing multiple keys as a single comma-separated string or multiple arguments to `.ToolManager.update_keymap` is no longer supported; pass keys as a list of strings instead.
es_es: Ya no es posible pasar múltiples claves como una sola cadena separada por comas o múltiples argumentos a `.ToolManager.update_keymap`; pase las claves como una lista de cadenas.

source: Passing the dash offset as *None* is no longer accepted, as this was never universally implemented, e.g. for vector output. Set the offset to 0 instead.
es_es: Ya no se acepta pasar el desplazamiento de la raya como *None*, ya que esto nunca se implementó universalmente, por ejemplo, para la salida de vectores. En su lugar, establezca el desplazamiento a 0.

source: Setting a custom method overriding `.Artist.contains` using ``Artist.set_contains`` has been removed, as has ``Artist.get_contains``. There is no replacement, but you may still customize pick events using `.Artist.set_picker`.
es_es: Se ha eliminado la configuración de un método personalizado que sobrescribe `.Artist.contains` mediante ``Artist.set_contains``, así como ``Artist.get_contains``. No hay ningún reemplazo, pero todavía puede personalizar los eventos de selección utilizando `.Artist.set_picker`.

source: `~.Axes.semilogx`, `~.Axes.semilogy`, `~.Axes.loglog`, `.LogScale`, and `.SymmetricalLogScale` used to take keyword arguments that depends on the axis orientation ("basex" vs "basey", "subsx" vs "subsy", "nonposx" vs "nonposy"); these parameter names have been removed in favor of "base", "subs", "nonpositive". This removal also affects e.g. ``ax.set_yscale("log", basey=...)`` which must now be spelled ``ax.set_yscale("log", base=...)``.
es_es: `~.Axes.semilogx`, `~.Axes.semilogy`, `~.Axes.loglog`, `.LogScale`, y `.SymmetricalLogScale` solían tomar argumentos de palabras clave que dependían de la orientación del eje ("basex" vs "basey", "subsx" vs "subsy", "nonposx" vs "nonposy"); estos nombres de parámetros se han eliminado en favor de "base", "subs", "nonpositive". Esta eliminación también afecta, por ejemplo, a ``ax.set_yscale("log", basey=...)`` que ahora debe escribirse ``ax.set_yscale("log", base=...)``.

source: The change from "nonpos" to "nonpositive" also affects `~.scale.LogTransform`, `~.scale.InvertedLogTransform`, `~.scale.SymmetricalLogTransform`, etc.
es_es: El cambio de "nonpos" a "nonpositive" también afecta a `~.scale.LogTransform`, `~.scale.InvertedLogTransform`, `~.scale.SymmetricalLogTransform`, etc.

source: To use *different* bases for the x-axis and y-axis of a `~.Axes.loglog` plot, use e.g. ``ax.set_xscale("log", base=10); ax.set_yscale("log", base=2)``.
es_es: Para utilizar bases *diferentes* para los ejes X e Y de un gráfico `~.Axes.loglog`, utiliza, por ejemplo, ``ax.set_xscale("log", base=10); ax.set_yscale("log", base=2)``.

source: Passing *None*, or no argument, to ``parasite_axes_class_factory``, ``parasite_axes_auxtrans_class_factory``, ``host_axes_class_factory`` is no longer accepted; pass an explicit base class instead.
es_es: Ya no se acepta pasar *None*, o ningún argumento, a ``parasite_axes_class_factory``, ``parasite_axes_auxtrans_class_factory``, ``host_axes_class_factory``; pasa una clase base explícita en su lugar.

source: Case-sensitivity is now enforced more
es_es: La distinción entre mayúsculas y minúsculas se aplica ahora más

source: Upper or mixed-case property names are no longer normalized to lowercase in `.Artist.set` and `.Artist.update`. This allows one to pass names such as *patchA* or *UVC*.
es_es: Los nombres de propiedades en mayúsculas o mixtos ya no se normalizan a minúsculas en `.Artist.set` y `.Artist.update`. Esto permite pasar nombres como *patchA* o *UVC*.

source: Case-insensitive capstyles and joinstyles are no longer lower-cased; please pass capstyles ("miter", "round", "bevel") and joinstyles ("butt", "round", "projecting") as lowercase.
es_es: Las mayúsculas y minúsculas de los estilos de unión ya no se escriben en minúsculas; pase los estilos de unión ("miter", "round", "bevel") y los estilos de unión ("butt", "round", "projecting") en minúsculas.

source: Saving metadata in PDF with the PGF backend no longer changes keys to lowercase. Only the canonically cased keys listed in the PDF specification (and the `~.backend_pgf.PdfPages` documentation) are accepted.
es_es: Guardar metadatos en PDF con el backend PGF ya no cambia las claves a minúsculas. Sólo se aceptan las claves con mayúsculas canónicas enumeradas en la especificación PDF (y en la documentación `~.backend_pgf.PdfPages`).

source: No implicit initialization of ``Tick`` attributes
es_es: No hay inicialización implícita de los atributos ``Tick``

source: The `.Tick` constructor no longer initializes the attributes ``tick1line``, ``tick2line``, ``gridline``, ``label1``, and ``label2`` via ``_get_tick1line``, ``_get_tick2line``, ``_get_gridline``, ``_get_text1``, and ``_get_text2``. Please directly set the attribute in the subclass' ``__init__`` instead.
es_es: El constructor `.Tick` ya no inicializa los atributos ``tick1line``, ``tick2line``, ``gridline``, ``label1``, y ``label2`` mediante ``_get_tick1line``, ``_get_tick2line``, ``_get_gridline``, ``_get_text1``, y ``_get_text2``. Por favor, establece directamente el atributo en el ``__init__`` de la subclase.

source: ``NavigationToolbar2`` subclass changes
es_es: Cambios en la subclase ``NavigationToolbar2``

source: Overriding the ``_init_toolbar`` method of `.NavigationToolbar2` to initialize third-party toolbars is no longer supported. Instead, the toolbar should be initialized in the ``__init__`` method of the subclass (which should call the base-class' ``__init__`` as appropriate).
es_es: Ya no es posible sobrescribir el método ``_init_toolbar`` de `.NavigationToolbar2` para inicializar barras de herramientas de terceros. En su lugar, la barra de herramientas debe ser inicializada en el método ``__init__`` de la subclase (que debe llamar al método ``__init__`` de la clase base, según corresponda).

source: The ``press`` and ``release`` methods of `.NavigationToolbar2` were called when pressing or releasing a mouse button, but *only* when an interactive pan or zoom was occurring (contrary to what the docs stated). They are no longer called; if you write a backend which needs to customize such events, please directly override ``press_pan``/``press_zoom``/``release_pan``/``release_zoom`` instead.
es_es: Los métodos ``press`` y ``release`` de `.NavigationToolbar2` eran llamados cuando se pulsaba o se soltaba un botón del ratón, pero *sólo* cuando se producía una panorámica o un zoom interactivo (al contrario de lo que indicaban los documentos). Ya no se llaman; si escribes un backend que necesita personalizar estos eventos, por favor anula directamente ``press_pan``/`press_zoom``/`release_pan``/`release_zoom``.

source: Removal of old file mode flag
es_es: Eliminación del flag de modo de archivo antiguo

source: Flags containing "U" passed to `.cbook.to_filehandle` and `.cbook.open_file_cm` are no longer accepted. This is consistent with their removal from `open` in Python 3.9.
es_es: Los flags que contienen "U" pasados a `.cbook.to_filehandle` y `.cbook.open_file_cm` ya no se aceptan. Esto es coherente con su eliminación de `open` en Python 3.9.

source: Keymaps toggling ``Axes.get_navigate`` have been removed
es_es: Se han eliminado los mapas de teclas que activan ``Axes.get_navigate``

source: This includes numeric key events and rcParams.
es_es: Esto incluye eventos de teclas numéricas y rcParams.

source: The ``TTFPATH`` and ``AFMPATH`` environment variables
es_es: Las variables de entorno ``TTFPATH`` y ``AFMPATH``

source: Support for the (undocumented) ``TTFPATH`` and ``AFMPATH`` environment variables has been removed. Register additional fonts using ``matplotlib.font_manager.fontManager.addfont()``.
es_es: Se ha eliminado el soporte para las variables de entorno (no documentadas) ``TTFPATH`` y ``AFMPATH``. Registra fuentes adicionales usando ``matplotlib.font_manager.fontManager.addfont()``.

source: Modules
es_es: Módulos

source: ``matplotlib.backends.qt_editor.formsubplottool``; use ``matplotlib.backends.backend_qt.SubplotToolQt`` instead.
es_es: ``matplotlib.backends.qt_editor.formsubplottool``; usa ``matplotlib.backends.backend_qt.SubplotToolQt`` en su lugar.

source: The Qt4-based backends, ``qt4agg`` and ``qt4cairo``, have been removed. Qt4 has reached its end-of-life in 2015 and there are no releases of either PyQt4 or PySide for recent versions of Python. Please use one of the Qt5 or Qt6 backends.
es_es: Los backends basados en Qt4, ``qt4agg`` y ``qt4cairo``, han sido eliminados. Qt4 ha llegado al final de su vida útil en 2015 y no hay versiones de PyQt4 o PySide para versiones recientes de Python. Por favor, utiliza uno de los backends Qt5 o Qt6.

source: Classes, methods and attributes
es_es: Clases, métodos y atributos

source: The following module-level classes/variables have been removed:
es_es: Se han eliminado las siguientes clases/variables a nivel de módulo:

source: ``backend_bases.StatusbarBase`` and all its subclasses, and ``StatusBarWx``; messages are displayed in the toolbar
es_es: ``backend_bases.StatusbarBase`` y todas sus subclases, y ``StatusBarWx``; los mensajes se muestran en la barra de herramientas

source: ``MODIFIER_KEYS``, ``SUPER``, ``ALT``, ``CTRL``, and ``SHIFT`` of `matplotlib.backends.backend_qt5agg` and `matplotlib.backends.backend_qt5cairo`
es_es: ``MODIFIER_KEYS``, ``SUPER``, ``ALT``, ``CTRL``, y ``SHIFT`` de `matplotlib.backends.backend_qt5agg` y `matplotlib.backends.backend_qt5cairo`

source: ``Fil``, ``Fill``, ``Filll``, ``NegFil``, ``NegFill``, ``NegFilll``, and ``SsGlue`` from `.mathtext`; directly construct glue instances with ``Glue("fil")``, etc.
es_es: ``Fil``, ``Fill``, ``Filll``, ``NegFil``, ``NegFilll``, ``NegFilll``, y ``SsGlue`` de `.mathtext`; construir directamente instancias de glue con ``Glue("fil")``, etc.

source: ``OldScalarFormatter``, ``IndexFormatter`` and ``IndexDateFormatter``; use `.FuncFormatter` instead
es_es: ``OldScalarFormatter``, ``IndexFormatter`` y ``IndexDateFormatter``; usa `.FuncFormatter` en su lugar

source: ``AVConvBase``, ``AVConvWriter`` and ``AVConvFileWriter``. Debian 8 (2015, EOL 06/2020) and Ubuntu 14.04 (EOL 04/2019) were the last versions of Debian and Ubuntu to ship avconv. It remains possible to force the use of avconv by using the FFmpeg-based writers with :rc:`animation.ffmpeg_path` set to "avconv".
es_es: ``AVConvBase``, ``AVConvWriter`` y ``AVConvFileWriter``. Debian 8 (2015, EOL 06/2020) y Ubuntu 14.04 (EOL 04/2019) fueron las últimas versiones de Debian y Ubuntu que incorporaron avconv. Sigue siendo posible forzar el uso de avconv utilizando los escritores basados en FFmpeg con :rc:`animation.ffmpeg_path` establecido en "avconv".

source: ``axes_grid1.axes_rgb.RGBAxesBase``; use ``RGBAxes`` instead
es_es: ``axes_grid1.axes_rgb.RGBAxesBase``; usa ``RGBAxes`` en su lugar

source: The following class attributes have been removed:
es_es: Se han eliminado los siguientes atributos de clase:

source: ``ContourSet.ax`` and ``Quiver.ax``; use ``ContourSet.axes`` or ``Quiver.axes`` as with other artists
es_es: ``ContourSet.ax`` y ``Quiver.ax``; utiliza ``ContourSet.axes`` o ``Quiver.axes`` como con otros artists

source: ``dates.YearLocator.replaced``; `.YearLocator` is now a subclass of `.RRuleLocator`, and the attribute ``YearLocator.replaced`` has been removed. For tick locations that required modifying this, a custom rrule and `.RRuleLocator` can be used instead.
es_es: ``dates.YearLocator.replaced``; `.YearLocator` es ahora una subclase de `.RRuleLocator`, y se ha eliminado el atributo ``YearLocator.replaced``. Para las localizaciones de ticks que requieran modificar esto, se puede utilizar una regla personalizada y `.RRuleLocator` en su lugar.

source: ``FigureManagerBase.statusbar``; messages are displayed in the toolbar
es_es: ``FigureManagerBase.statusbar``; los mensajes se muestran en la barra de herramientas

source: ``MovieWriter.args_key``, ``MovieWriter.exec_key``, and ``HTMLWriter.args_key``
es_es: ``MovieWriter.args_key``, ``MovieWriter.exec_key``, y ``HTMLWriter.args_key``

source: ``NavigationToolbar2QT.basedir``; the base directory to the icons is ``os.path.join(mpl.get_data_path(), "images")``
es_es: ``NavigationToolbar2QT.basedir``; el directorio base de los iconos es ``os.path.join(mpl.get_data_path(), "images")``

source: ``NavigationToolbar2QT.parent``; to access the parent window, use ``toolbar.canvas.parent()`` or ``toolbar.parent()``
es_es: ``NavigationToolbar2QT.parent``; para acceder a la ventana padre, utiliza ``toolbar.canvas.parent()`` o ``toolbar.parent()``

source: ``prevZoomRect``, ``retinaFix``, ``savedRetinaImage``, ``wxoverlay``, ``zoomAxes``, ``zoomStartX``, and ``zoomStartY`` attributes of ``NavigationToolbar2Wx``
es_es: Atributos ``prevZoomRect``, ``retinaFix``, ``savedRetinaImage``, ``wxoverlay``, ``zoomAxes``, ``zoomStartX`` y ``zoomStartY`` de ``NavigationToolbar2Wx``

source: ``NonUniformImage.is_grayscale``, ``PcolorImage.is_grayscale``, for consistency with ``AxesImage.is_grayscale``. (Note that previously, these attributes were only available *after rendering the image*).
es_es: ``NonUniformImage.is_grayscale``, ``PcolorImage.is_grayscale``, por coherencia con ``AxesImage.is_grayscale``. (Ten en cuenta que antes, estos atributos sólo estaban disponibles *después de renderizar la imagen*).

source: ``used_characters`` of `.RendererPdf`, `.PdfFile`, and `.RendererPS`
es_es: ``used_characters`` de `.RenderererPdf`, `.PdfFile` y `.RendererPS`

source: ``LogScale.LogTransform``, ``LogScale.InvertedLogTransform``, ``SymmetricalScale.SymmetricalTransform``, and ``SymmetricalScale.InvertedSymmetricalTransform``; directly access the transform classes from `matplotlib.scale`
es_es: ``LogScale.LogTransform``, ``LogScale.InvertedLogTransform``, ``SymmetricalScale.SymmetricalTransform``, y ``SymmetricalScale.InvertedSymmetricalTransform``; accede directamente a las clases de transformación desde `matplotlib.scale`

source: ``cachedir``, ``rgba_arrayd``, ``serif``, ``sans_serif``, ``cursive``, and ``monospace`` attributes of `.TexManager`
es_es: ``cachedir``, ``rgba_arrayd``, ``serif``, ``sans_serif``, ``cursive``, y ``monospace`` atributos de `.TexManager`

source: ``axleft``, ``axright``, ``axbottom``, ``axtop``, ``axwspace``, and ``axhspace`` attributes of `.widgets.SubplotTool`; access the ``ax`` attribute of the corresponding slider
es_es: ``axleft``, ``axright``, ``axbottom``, ``axtop``, ``axwspace``, y los atributos ``axhspace`` de `.widgets.SubplotTool`; acceder al atributo ``ax`` del carrusel correspondiente

source: ``angle_helper.LocatorBase.den``; it has been renamed to *nbins*
es_es: ``angle_helper.LocatorBase.den``; se ha renombrado a *nbins*

source: ``axes_grid.CbarAxesBase.cbid`` and ``axes_grid.CbarAxesBase.locator``; use ``mappable.colorbar_cid`` or ``colorbar.locator`` instead
es_es: ``axes_grid.CbarAxesBase.cbid`` y ``axes_grid.CbarAxesBase.locator``; usa ``mappable.colorbar_cid`` o ``colorbar.locator`` en su lugar

source: The following class methods have been removed:
es_es: Se han eliminado los siguientes métodos de clase:

source: ``Axes.update_datalim_bounds``; use ``ax.dataLim.set(Bbox.union([ax.dataLim, bounds]))``
es_es: ``Axes.update_datalim_bounds``; usa ``ax.dataLim.set(Bbox.union([ax.dataLim, bounds]))``

source: ``pan`` and ``zoom`` methods of `~.axis.Axis` and `~.ticker.Locator` have been removed; panning and zooming are now implemented using the ``start_pan``, ``drag_pan``, and ``end_pan`` methods of `~.axes.Axes`
es_es: Se han eliminado los métodos ``pan`` y ``zoom`` de `~.axis.Axis` y `~.ticker.Locator`; el paneo y el zoom se implementan ahora utilizando los métodos ``start_pan``, ``drag_pan`` y ``end_pan`` de `~.axes.Axes`

source: ``.BboxBase.inverse_transformed``; call `.BboxBase.transformed` on the `~.Transform.inverted()` transform
es_es: ``.BboxBase.inverse_transformed``; invoca `.BboxBase.transformed` en la transformación `~.Transform.inverted()`

source: ``Collection.set_offset_position`` and ``Collection.get_offset_position`` have been removed; the ``offset_position`` of the `.Collection` class is now "screen"
es_es: ``Collection.set_offset_position`` y ``Collection.get_offset_position`` han sido eliminados; el ``offset_position`` de la clase `.Collection` es ahora "screen"

source: ``Colorbar.on_mappable_changed`` and ``Colorbar.update_bruteforce``; use ``Colorbar.update_normal()`` instead
es_es: ``Colorbar.on_mappable_changed`` y ``Colorbar.update_bruteforce``; en su lugar usa ``Colorbar.update_normal()``

source: ``docstring.Substitution.from_params`` has been removed; directly assign to ``params`` of `.Substitution` instead
es_es: ``docstring.Substitution.from_params`` ha sido eliminado; asignar directamente a ``params`` de `.Substitution` en su lugar

source: ``DraggableBase.artist_picker``; set the artist's picker instead
es_es: ``DraggableBase.artist_picker``; establecer el selector del artist en su lugar

source: ``DraggableBase.on_motion_blit``; use `.DraggableBase.on_motion` instead
es_es: ``DraggableBase.on_motion_blit``; utiliza `.DraggableBase.on_motion` en su lugar

source: ``Locator.refresh()`` and the associated helper methods ``NavigationToolbar2.draw()`` and ``ToolViewsPositions.refresh_locators()``
es_es: ``Locator.refresh()`` y los métodos auxiliares asociados ``NavigationToolbar2.draw()`` y ``ToolViewsPositions.refresh_locators()``

source: ``track_characters`` and ``merge_used_characters`` of `.RendererPdf`, `.PdfFile`, and `.RendererPS`
es_es: ``track_characters`` y ``merge_used_characters`` de `.RenderererPdf`, `.PdfFile`, y `.RendererPS`

source: ``SubplotSpec.get_rows_columns``; use the ``GridSpec.nrows``, ``GridSpec.ncols``, ``SubplotSpec.rowspan``, and ``SubplotSpec.colspan`` properties instead.
es_es: ``SubplotSpec.get_rows_columns``; use las propiedades ``GridSpec.nrows``, ``GridSpec.ncols``, ``SubplotSpec.rowspan``, y ``SubplotSpec.colspan`` en su lugar.

source: ``ScalarMappable.update_dict``, ``ScalarMappable.add_checker()``, and ``ScalarMappable.check_update()``; register a callback in ``ScalarMappable.callbacks`` to be notified of updates
es_es: ``ScalarMappable.update_dict``, ``ScalarMappable.add_checker()``, y ``ScalarMappable.check_update()``; registra un callback en ``ScalarMappable.callbacks`` para ser notificado de actualizaciones

source: ``TexManager.make_tex_preview`` and ``TexManager.make_dvi_preview``
es_es: ``TexManager.make_tex_preview`` y ``TexManager.make_dvi_preview``

source: ``funcleft``, ``funcright``, ``funcbottom``, ``functop``, ``funcwspace``, and ``funchspace`` methods of `.widgets.SubplotTool`
es_es: ``funcleft``, ``funcright``, ``funcbottom``, ``functop``, ``funcwspace``, y ``funchspace`` métodos de `.widgets.SubplotTool`
