Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.5.0.po
Languages: es_es

source: ``axisartist.grid_finder.MaxNLocator.set_factor`` and ``axisartist.grid_finder.FixedLocator.set_factor``; the factor is always 1 now
es_es: ``axisartist.grid_finder.MaxNLocator.set_factor`` y ``axisartist.grid_finder.FixedLocator.set_factor``; el factor es siempre 1 ahora

source: Functions
es_es: Funciones

source: ``bezier.make_path_regular`` has been removed; use ``Path.cleaned()`` (or ``Path.cleaned(curves=True)``, etc.) instead, but note that these methods add a ``STOP`` code at the end of the path.
es_es: Se ha eliminado ``bezier.make_path_regular``; utiliza ``Path.cleaned()`` (o ``Path.cleaned(curves=True)``, etc.) en su lugar, pero ten en cuenta que estos métodos añaden un código ``STOP`` al final de la ruta.

source: ``bezier.concatenate_paths`` has been removed; use ``Path.make_compound_path()`` instead.
es_es: Se ha eliminado ``bezier.concatenate_paths``; utiliza ``Path.make_compound_path()`` en su lugar.

source: ``cbook.local_over_kwdict`` has been removed; use `.cbook.normalize_kwargs` instead.
es_es: ``cbook.local_over_kwdict`` ha sido eliminado; usa `.cbook.normalize_kwargs` en su lugar.

source: ``qt_compat.is_pyqt5`` has been removed due to the release of PyQt6. The Qt version can be checked using ``QtCore.qVersion()``.
es_es: ``qt_compat.is_pyqt5`` ha sido eliminado debido a la liberación de PyQt6. La versión Qt puede ser comprobada usando ``QtCore.qVersion()``.

source: ``testing.compare.make_external_conversion_command`` has been removed.
es_es: ``testing.compare.make_external_conversion_command`` ha sido eliminado.

source: ``axes_grid1.axes_rgb.imshow_rgb`` has been removed; use ``imshow(np.dstack([r, g, b]))`` instead.
es_es: ``axes_grid1.axes_rgb.imshow_rgb`` ha sido eliminado; usa ``imshow(np.dstack([r, g, b]))`` en su lugar.

source: Arguments
es_es: Argumentos

source: The *s* parameter to `.Axes.annotate` and `.pyplot.annotate` is no longer supported; use the new name *text*.
es_es: El parámetro *s* de `.Axes.annotate` y `.pyplot.annotate` ya no es compatible; utiliza el nuevo nombre *text*.

source: The *inframe* parameter to `.Axes.draw` has been removed; use `.Axes.redraw_in_frame` instead.
es_es: Se ha eliminado el parámetro *inframe* de `.Axes.draw`; en su lugar, utiliza `.Axes.redraw_in_frame`.

source: The *required*, *forbidden* and *allowed* parameters of `.cbook.normalize_kwargs` have been removed.
es_es: Los parámetros *required*, *forbidden* y *allowed* de `.cbook.normalize_kwargs` han sido eliminados.

source: The *ismath* parameter of the ``draw_tex`` method of all renderer classes has been removed (as a call to ``draw_tex`` — not to be confused with ``draw_text``! — means that the entire string should be passed to the ``usetex`` machinery anyways). Likewise, the text machinery will no longer pass the *ismath* parameter when calling ``draw_tex`` (this should only matter for backend implementers).
es_es: Se ha eliminado el parámetro *ismath* del método ``draw_tex`` de todas las clases de renderizadores (ya que una llamada a ``draw_tex`` -¡no confundir con ``draw_text``! - significa que la cadena completa debe pasarse a la maquinaria ``usetex`` de todos modos). Asimismo, la maquinaria de texto ya no pasará el parámetro *ismath* al llamar a ``draw_tex`` (esto sólo debería importar a los implementadores del backend).

source: The *quality*, *optimize*, and *progressive* parameters of `.Figure.savefig` (which only affected JPEG output) have been removed, as well as from the corresponding ``print_jpg`` methods. JPEG output options can be set by directly passing the relevant parameters in *pil_kwargs*.
es_es: Se han eliminado los parámetros *quality*, *optimize* y *progressive* de `.Figure.savefig` (que sólo afectaban a la salida JPEG), así como de los correspondientes métodos ``print_jpg``. Las opciones de salida JPEG pueden establecerse pasando directamente los parámetros pertinentes en *pil_kwargs*.

source: The *clear_temp* parameter of `.FileMovieWriter` has been removed; files placed in a temporary directory (using ``frame_prefix=None``, the default) will be cleared; files placed elsewhere will not.
es_es: Se ha eliminado el parámetro *clear_temp* de `.FileMovieWriter`; los archivos colocados en un directorio temporal (utilizando ``frame_prefix=None``, por defecto) se borrarán; los archivos colocados en otro lugar no.

source: The *copy* parameter of ``mathtext.Glue`` has been removed.
es_es: El parámetro *copy* de ``mathtext.Glue`` ha sido eliminado.

source: The *quantize* parameter of `.Path.cleaned()` has been removed.
es_es: El parámetro *quantize* de `.Path.cleaned()` ha sido eliminado.

source: The *dummy* parameter of `.RendererPgf` has been removed.
es_es: El parámetro *dummy* de `.RenderererPgf` ha sido eliminado.

source: The *props* parameter of `.Shadow` has been removed; use keyword arguments instead.
es_es: Se ha eliminado el parámetro *props* de `.Shadow`; utiliza en su lugar argumentos de palabras clave.

source: The *recursionlimit* parameter of `matplotlib.test` has been removed.
es_es: El parámetro *recursionlimit* de `matplotlib.test` ha sido eliminado.

source: The *label* parameter of `.Tick` has no effect and has been removed.
es_es: El parámetro *label* de `.Tick` no tiene efecto y ha sido eliminado.

source: `~.ticker.MaxNLocator` no longer accepts a positional parameter and the keyword argument *nbins* simultaneously because they specify the same quantity.
es_es: `~.ticker.MaxNLocator` ya no acepta un parámetro posicional y el argumento de palabra clave *nbins* simultáneamente porque especifican la misma cantidad.

source: The *add_all* parameter to ``axes_grid.Grid``, ``axes_grid.ImageGrid``, ``axes_rgb.make_rgb_axes``, and ``axes_rgb.RGBAxes`` have been removed; the APIs always behave as if ``add_all=True``.
es_es: Se ha eliminado el parámetro *add_all* de ``axes_grid.Grid``, ``axes_grid.ImageGrid``, ``axes_rgb.make_rgb_axes``, y ``axes_rgb.RGBAxes``; las APIs se comportan siempre como si ``add_all=True``.

source: The *den* parameter of ``axisartist.angle_helper.LocatorBase`` has been removed; use *nbins* instead.
es_es: El parámetro *den* de ``axisartist.angle_helper.LocatorBase`` ha sido removido; usa *Textins* en su lugar.

source: The *s* keyword argument to `.AnnotationBbox.get_fontsize` has no effect and has been removed.
es_es: El argumento de palabra clave *s* para `.AnnotationBbox.get_fontsize` no tiene efecto y ha sido eliminado.

source: The *offset_position* keyword argument of the `.Collection` class has been removed; the ``offset_position`` now "screen".
es_es: El argumento de la palabra clave *offset_position* de la clase `.Collection` ha sido eliminado; la ``offset_position`` ahora es "pantalla".

source: Arbitrary keyword arguments to ``StreamplotSet`` have no effect and have been removed.
es_es: Los argumentos arbitrarios de la palabra clave ``StreamplotSet`` no tienen efecto y han sido eliminados.

source: The *fontdict* and *minor* parameters of `.Axes.set_xticklabels` / `.Axes.set_yticklabels` are now keyword-only.
es_es: Los parámetros *fontdict* y *minor* de `.Axes.set_xticklabels` / `.Axes.set_yticklabels` son ahora sólo de palabra clave.

source: All parameters of `.Figure.subplots` except *nrows* and *ncols* are now keyword-only; this avoids typing e.g. ``subplots(1, 1, 1)`` when meaning ``subplot(1, 1, 1)``, but actually getting ``subplots(1, 1, sharex=1)``.
es_es: Todos los parámetros de `.Figure.subplots` excepto *nrows* y *ncols* son ahora de palabra clave; esto evita escribir, por ejemplo, ``subplots(1, 1, 1)`` cuando quiere decir ``subplot(1, 1, 1)``, pero en realidad obtiene ``subplots(1, 1, sharex=1)``.

source: All parameters of `.pyplot.tight_layout` are now keyword-only, to be consistent with `.Figure.tight_layout`.
es_es: Todos los parámetros de `.pyplot.tight_layout` son ahora keyword-only, para ser consistentes con `.Figure.tight_layout`.

source: ``ColorbarBase`` only takes a single positional argument now, the ``Axes`` to create it in, with all other options required to be keyword arguments. The warning for keyword arguments that were overridden by the mappable is now removed.
es_es: ``ColorbarBase`` ahora sólo toma un único argumento posicional, el ``Axes`` para crearlo, con todas las demás opciones requeridas para ser argumentos de palabra clave. Se ha eliminado la advertencia para los argumentos de palabra clave que eran sobreescritos por el mappable.

source: Omitting the *renderer* parameter to `.Axes.draw` is no longer supported; use ``axes.draw_artist(axes)`` instead.
es_es: Omitir el parámetro *renderer* a `.Axes.draw` ya no es compatible; usa ``axes.draw_artist(axes)`` en su lugar.

source: Passing ``ismath="TeX!"`` to `.RendererAgg.get_text_width_height_descent` is no longer supported; pass ``ismath="TeX"`` instead,
es_es: Ya no es posible pasar ``ismath="TeX!"`` a `.RendererAgg.get_text_width_height_descent`; en su lugar, pasa ``ismath="TeX"``,

source: Changes to the signature of the `.Axes.draw` method make it consistent with all other artists; thus additional parameters to `.Artist.draw` have also been removed.
es_es: Los cambios en la firma del método `.Axes.draw` lo hacen consistente con todos los demás artists; por lo tanto, también se han eliminado los parámetros adicionales de `.Artist.draw`.

source: The ``animation.avconv_path`` and ``animation.avconv_args`` rcParams have been removed.
es_es: Los ``animation.avconv_path`` y ``animation.avconv_args`` rcParams han sido eliminados.

source: The ``animation.html_args`` rcParam has been removed.
es_es: La ``animation.html_args`` rcParam ha sido eliminada.

source: The ``keymap.all_axes`` rcParam has been removed.
es_es: La ``keymap.all_axes`` rcParam ha sido eliminada.

source: The ``mathtext.fallback_to_cm`` rcParam has been removed. Use :rc:`mathtext.fallback` instead.
es_es: El rcParam ``mathtext.fallback_to_cm`` ha sido eliminado. Utiliza :rc:`mathtext.fallback` en su lugar.

source: The ``savefig.jpeg_quality`` rcParam has been removed.
es_es: La ``savefig.jpeg_quality`` rcParam ha sido eliminada.

source: The ``text.latex.preview`` rcParam has been removed.
es_es: La ``text.latex.preview`` rcParam ha sido eliminada.

source: The following deprecated rcParams validators, defined in `.rcsetup`, have been removed:
es_es: Se han eliminado los siguientes validadores de rcParams obsoletos, definidos en `.rcsetup`:

source: Some rcParam validation has become stricter:
es_es: Algunas validaciones de rcParam se han vuelto más estrictas:

source: :rc:`axes.axisbelow` no longer accepts strings starting with "line" (case-insensitive) as "line"; use "line" (case-sensitive) instead.
es_es: :rc:`ejes.ejeabajo` ya no acepta cadenas que empiecen por "línea" (insensible a mayúsculas y minúsculas) como "línea"; utiliza en su lugar "línea" (sensible a mayúsculas y minúsculas).

source: :rc:`text.latex.preamble` and :rc:`pdf.preamble` no longer accept non-string values.
es_es: :rc:`text.latex.preamble` y :rc:`pdf.preamble` ya no aceptan valores que no sean cadenas.

source: All ``*.linestyle`` rcParams no longer accept ``offset = None``; set the offset to 0 instead.
es_es: Todos los rcParams ``*.linestyle`` ya no aceptan ``offset = None``; en su lugar, establece el offset a 0.

source: Development changes
es_es: Cambios en el desarrollo

source: Increase to minimum supported versions of dependencies
es_es: Aumento de las versiones mínimas soportadas de las dependencias

source: For Matplotlib 3.5, the :ref:`minimum supported versions <dependencies>` and some :ref:`optional dependencies <optional_dependencies>` are being bumped:
es_es: Para Matplotlib 3.5, las versiones :ref:`mínimas soportadas <dependencies>` y algunas :ref:`dependencias opcionales <optional_dependencies>` están siendo modificadas:

source: Dependency
es_es: Dependencia

source: Tk (optional)
es_es: Tk (opcional)

source: This is consistent with our :ref:`min_deps_policy` and `NEP29 <https://numpy.org/neps/nep-0029-deprecation_policy.html>`__
es_es: Esto es coherente con nuestra :ref:`min_deps_policy` y `NEP29 <https://numpy.org/neps/nep-0029-deprecation_policy.html>`__

source: New wheel architectures
es_es: Nuevas arquitecturas de wheel

source: Wheels have been added for:
es_es: Se han añadido wheels para:

source: macOS on Apple Silicon (both arm64 and universal2)
es_es: macOS en Apple Silicon (tanto arm64 como universal2)

source: New build dependencies
es_es: Nuevas dependencias de compilación

source: Versioning has been switched from bundled versioneer to `setuptools-scm <https://github.com/pypa/setuptools_scm/>`__ using the ``release-branch-semver`` version scheme. The latter is well-maintained, but may require slight modification to packaging scripts.
es_es: Se ha cambiado el versionado del paquete a `setuptools-scm <https://github.com/pypa/setuptools_scm/>`__ utilizando el esquema de versiones ``release-branch-semver``. Este último está bien mantenido, pero puede requerir una ligera modificación de los scripts de empaquetado.

source: The `setuptools-scm-git-archive <https://pypi.org/project/setuptools-scm-git-archive/>`__ plugin is also used for consistent version export.
es_es: El plugin `setuptools-scm-git-archive <https://pypi.org/project/setuptools-scm-git-archive/>`__ también se utiliza para la exportación consistente de versiones.

source: Data directory is no longer optional
es_es: El directorio de datos ya no es opcional

source: Historically, the ``mpl-data`` directory has been optional (example files were unnecessary, and fonts could be deleted if a suitable dependency on a system font were provided). Though example files are still optional, they have been substantially pared down, and we now consider the directory to be required.
es_es: Históricamente, el directorio ``mpl-data`` ha sido opcional (los archivos de ejemplo eran innecesarios, y las fuentes podían eliminarse si se proporcionaba una dependencia adecuada de una fuente del sistema). Aunque los archivos de ejemplo siguen siendo opcionales, se han reducido sustancialmente, y ahora consideramos que el directorio es obligatorio.

source: Specifically, the ``matplotlibrc`` file found there is used for runtime verifications and must exist. Packagers may still symlink fonts to system versions if needed.
es_es: En concreto, el archivo ``matplotlibrc`` que se encuentra allí se utiliza para las verificaciones en tiempo de ejecución y debe existir. Los empaquetadores pueden seguir enlazando simbólicamente las fuentes a las versiones del sistema si es necesario.

source: New runtime dependencies
es_es: Nuevas dependencias de tiempo de ejecución

source: fontTools for type 42 subsetting
es_es: fontTools para el subconjunto de tipo 42

source: A new dependency `fontTools <https://fonttools.readthedocs.io/>`_ is integrated into Matplotlib 3.5. It is designed to be used with PS/EPS and PDF documents; and handles Type 42 font subsetting.
es_es: Una nueva dependencia `fontTools <https://fonttools.readthedocs.io/>`_ está integrada en Matplotlib 3.5. Está diseñada para ser utilizada con documentos PS/EPS y PDF; y maneja el subconjunto de fuentes Type 42.

source: Underscore support in LaTeX
es_es: Soporte de guiones bajos en LaTeX

source: The `underscore <https://ctan.org/pkg/underscore>`_ package is now a requirement to improve support for underscores in LaTeX.
es_es: El paquete `underscore <https://ctan.org/pkg/underscore>`_ es ahora un requisito para mejorar el soporte de guiones bajos en LaTeX.

source: This is consistent with our :ref:`min_deps_policy`.
es_es: Esto es consistente con nuestra :ref:`min_deps_policy`.

source: Matplotlib-specific build options moved from ``setup.cfg`` to ``mplsetup.cfg``
es_es: Las opciones de construcción específicas de Matplotlib se han movido de ``setup.cfg`` a ``mplsetup.cfg``

source: In order to avoid conflicting with the use of :file:`setup.cfg` by ``setuptools``, the Matplotlib-specific build options have moved from ``setup.cfg`` to ``mplsetup.cfg``. The :file:`setup.cfg.template` has been correspondingly been renamed to :file:`mplsetup.cfg.template`.
es_es: Para evitar conflictos con el uso de :file:`setup.cfg` por parte de ``setuptools``, las opciones de construcción específicas de Matplotlib se han movido de ``setup.cfg`` a ``mplsetup.cfg``. El archivo :file:`setup.cfg.template` ha sido renombrado correspondientemente a :file:`mplsetup.cfg.template`.

source: Note that the path to this configuration file can still be set via the :envvar:`MPLSETUPCFG` environment variable, which allows one to keep using the same file before and after this change.
es_es: Ten en cuenta que la ruta de este archivo de configuración puede seguir siendo establecida a través de la variable de entorno :envvar:`MPLSETUPCFG`, lo que permite seguir utilizando el mismo archivo antes y después de este cambio.
