Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_0.91.0.po
Languages: es_es

source: Changes for 0.91.0
es_es: Cambios para 0.91.0

source: Changed ``cbook.is_file_like`` to ``cbook.is_writable_file_like`` and corrected behavior.
es_es: Se cambió ``cbook.is_file_like`` a ``cbook.is_writable_file_like`` y se corrigió el comportamiento.

source: Added *ax* keyword argument to :func:`.pyplot.colorbar` and :meth:`.Figure.colorbar` so that one can specify the axes object from which space for the colorbar is to be taken, if one does not want to make the colorbar axes manually.
es_es: Se añadió un argumento de palabra clave *ax* a :func:`.pyplot.colorbar` y :meth:`.Figure. olorbar` para que uno pueda especificar el objeto de ejes desde el cual se debe tomar el espacio para la barra de colores, si uno no quiere hacer manualmente los ejes de la barra de color.

source: Changed ``cbook.reversed`` so it yields a tuple rather than a (index, tuple). This agrees with the Python reversed builtin, and cbook only defines reversed if Python doesn't provide the builtin.
es_es: Cambiado ``cbook.reversed`` para que produzca una tupla en lugar de un (índice, tuple). Esto está de acuerdo con el Python reversed builtin, y cbook sólo define invertido si Python no proporciona la incorporación.

source: Made skiprows=1 the default on ``csv2rec``
es_es: Hizo skiprows=1 por defecto en ``csv2rec``

source: The gd and paint backends have been deleted.
es_es: Los backends de gd y pintura han sido eliminados.

source: The errorbar method and function now accept additional kwargs so that upper and lower limits can be indicated by capping the bar with a caret instead of a straight line segment.
es_es: El método y función de la barra de error ahora aceptan kwargs adicionales para que los límites superiores e inferiores puedan ser indicados limitando la barra con un cursor en lugar de un segmento de línea recta.

source: The :mod:`matplotlib.dviread` file now has a parser for files like psfonts.map and pdftex.map, to map TeX font names to external files.
es_es: El archivo :mod:`matplotlib.dviread` ahora tiene un analizador para archivos como psfonts.map y pdftex.map, para mapear nombres de fuentes TeX a archivos externos.

source: The file :mod:`matplotlib.type1font` contains a new class for Type 1 fonts. Currently it simply reads pfa and pfb format files and stores the data in a way that is suitable for embedding in pdf files. In the future the class might actually parse the font to allow e.g., subsetting.
es_es: El archivo :mod:`matplotlib.type1font` contiene una nueva clase para las fuentes Tipo 1. Actualmente simplemente lee archivos en formato pfa y pfb y almacena los datos de una manera que es adecuada para incrustar en archivos pdf. En el futuro, la clase podría analizar la fuente para permitir por ejemplo, subajuste.

source: :mod:`matplotlib.ft2font` now supports ``FT_Attach_File``. In practice this can be used to read an afm file in addition to a pfa/pfb file, to get metrics and kerning information for a Type 1 font.
es_es: :mod:`matplotlib.ft2font` ahora soporta ``FT_Attach_File``. En la práctica esto se puede utilizar para leer un archivo afm además de un archivo pfa/pfb, para obtener las métricas y la información de kerning para una fuente de tipo 1.

source: The :class:`.AFM` class now supports querying CapHeight and stem widths. The get_name_char method now has an isord kwarg like get_width_char.
es_es: La clase :class:`.AFM` ahora soporta los anchos de CapHeight y tallo. El método get_name_caracteres ahora tiene un kwarg isord como get_width_char.

source: Changed :func:`.pcolor` default to ``shading='flat'``; but as noted now in the docstring, it is preferable to simply use the *edgecolor* keyword argument.
es_es: Se cambió el valor predeterminado :func:`.pcolor` a ``shading='flat'``; pero como se indica ahora en la cadena de documentación, es preferible usar simplemente el argumento de la palabra clave *edgecolor*.

source: The mathtext font commands (``\cal``, ``\rm``, ``\it``, ``\tt``) now behave as TeX does: they are in effect until the next font change command or the end of the grouping. Therefore uses of ``$\cal{R}$`` should be changed to ``${\cal R}$``. Alternatively, you may use the new LaTeX-style font commands (``\mathcal``, ``\mathrm``, ``\mathit``, ``\mathtt``) which do affect the following group, e.g., ``$\mathcal{R}$``.
es_es: Los comandos de fuente matemática (``\cal``, ``\rm``, ``\it``, ``\tt``) ahora se comporta como lo hace TeX: están en vigor hasta el siguiente comando de cambio de fuente o el final de la agrupación. Por lo tanto los usos de ``$\cal{R}$`` deben cambiarse a ``${\cal R}$``. Alternativamente, puedes usar los nuevos comandos de tipo LaTeX (``\mathcal``, ``\mathrm``, ``\mathit``, ``\mathtt``) que sí afectan al siguiente grupo, por ejemplo, ``$\mathcal{R}$``.

source: Text creation commands have a new default linespacing and a new ``linespacing`` kwarg, which is a multiple of the maximum vertical extent of a line of ordinary text. The default is 1.2; ``linespacing=2`` would be like ordinary double spacing, for example.
es_es: Los comandos de creación de texto tienen un nuevo espacio de línea por defecto y un nuevo kwarg, que es un múltiplo de la máxima extensión vertical de una línea de texto ordinario. El valor por defecto es 1.2; ``linespacing=2`` sería como el doble espaciado ordinario, por ejemplo.

source: Changed default kwarg in `matplotlib.colors.Normalize` to ``clip=False``; clipping silently defeats the purpose of the special over, under, and bad values in the colormap, thereby leading to unexpected behavior. The new default should reduce such surprises.
es_es: Cambiado kwarg por defecto en `matplotlib.colors. ormalizar` a ``clip=False``; recortar silenciosamente derrota el propósito del especial, bajo y malos valores en el mapa de color, lo que conduce a un comportamiento inesperado. El nuevo default debería reducir esas sorpresas.

source: Made the emit property of :meth:`~matplotlib.axes.Axes.set_xlim` and :meth:`~matplotlib.axes.Axes.set_ylim` ``True`` by default; removed the Axes custom callback handling into a 'callbacks' attribute which is a :class:`~matplotlib.cbook.CallbackRegistry` instance. This now supports the 'xlim_changed' and 'ylim_changed' Axes events.
es_es: Hizo la propiedad de emisión de :meth:`~matplotlib.axes.Axes.set_xlim` y :meth:`~matplotlib.axes.Axes. et_ylim` ``True`` de forma predeterminada; eliminó el manejo del callback personalizado de ejes en un atributo 'callbacks' que es un :class:`~matplotlib. instancia de book.CallbackRegistry`. Esto ahora soporta los eventos 'xlim_changed' y 'ylim_changed' Ejes.
