Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_0.99.x.po
Languages: es_es

source: Changes beyond 0.99.x
es_es: Cambios más allá de 0.99.x

source: The default behavior of :meth:`matplotlib.axes.Axes.set_xlim`, :meth:`matplotlib.axes.Axes.set_ylim`, and :meth:`matplotlib.axes.Axes.axis`, and their corresponding pyplot functions, has been changed: when view limits are set explicitly with one of these methods, autoscaling is turned off for the matching axis. A new *auto* kwarg is available to control this behavior. The limit kwargs have been renamed to *left* and *right* instead of *xmin* and *xmax*, and *bottom* and *top* instead of *ymin* and *ymax*. The old names may still be used, however.
es_es: El comportamiento predeterminado de :meth:`matplotlib.axes.Axes.set_xlim`, :meth:`matplotlib.axes.Axes.set_ylim`, y :meth:`matplotlib.axes.Ejes. xis`, y sus correspondientes funciones de pyplot, han sido cambiados: cuando los límites de vista se establecen explícitamente con uno de estos métodos, El autoescalado está desactivado para el eje correspondiente. Un nuevo kwarg *auto* está disponible para controlar este comportamiento. Los kwargs de límite han sido renombrados a *izquierda* y *derecha* en lugar de *xmin* y *xmax*, y *abajo* y *arriba* en lugar de *ymin* y *ymax*. Sin embargo, los viejos nombres pueden seguir utilizándose.

source: There are five new Axes methods with corresponding pyplot functions to facilitate autoscaling, tick location, and tick label formatting, and the general appearance of ticks and tick labels:
es_es: Hay cinco nuevos métodos de ejes con las correspondientes funciones de pyplot para facilitar la auto-escalado, ubicación de tick, formato de etiqueta y apariencia general de ticks y etiquetas tick:

source: :meth:`matplotlib.axes.Axes.autoscale` turns autoscaling on or off, and applies it.
es_es: :meth:`matplotlib.axes.Axes.autoscale` activa o desactiva la autoescalada y la aplica.

source: :meth:`matplotlib.axes.Axes.margins` sets margins used to autoscale the :attr:`matplotlib.axes.Axes.viewLim` based on the :attr:`matplotlib.axes.Axes.dataLim`.
es_es: :meth:`matplotlib.axes.Axes.margins` establece los márgenes usados para autoescalar el :attr:`matplotlib.axes.Axes.viewLim` basado en el :attr:`matplotlib.axes.Axes.dataLim`.

source: :meth:`matplotlib.axes.Axes.locator_params` allows one to adjust axes locator parameters such as *nbins*.
es_es: :meth:`matplotlib.axes.Axes.locator_params` permite ajustar parámetros de localización de ejes, como *nighins*.

source: :meth:`matplotlib.axes.Axes.ticklabel_format` is a convenience method for controlling the :class:`matplotlib.ticker.ScalarFormatter` that is used by default with linear axes.
es_es: :meth:`matplotlib.axes.Axes.ticklabel_format` es un método de conveniencia para controlar el :class:`matplotlib.ticker.ScalarFormatter` que se utiliza por defecto con ejes lineales.

source: :meth:`matplotlib.axes.Axes.tick_params` controls direction, size, visibility, and color of ticks and their labels.
es_es: :meth:`matplotlib.axes.Axes.tick_params` controla la dirección, tamaño, visibilidad y color de ticks y sus etiquetas.

source: The :meth:`matplotlib.axes.Axes.bar` method accepts a *error_kw* kwarg; it is a dictionary of kwargs to be passed to the errorbar function.
es_es: El método :meth:`matplotlib.axes.Axes.bar` acepta un kwarg* *error_kw*; es un diccionario de kwargs que debe ser pasado a la función errorbar.

source: The :meth:`matplotlib.axes.Axes.hist` *color* kwarg now accepts a sequence of color specs to match a sequence of datasets.
es_es: El :meth:`matplotlib.axes.Axes.ml` *color* kwarg ahora acepta una secuencia de especificaciones de color para que coincida con una secuencia de conjuntos de datos.

source: The :class:`~matplotlib.collections.EllipseCollection` has been changed in two ways:
es_es: El :class:`~matplotlib.collections.EllipseCollection` ha sido cambiado de dos maneras:

source: There is a new *units* option, 'xy', that scales the ellipse with the data units. This matches the :class:'~matplotlib.patches.Ellipse` scaling.
es_es: Hay una nueva opción de *unidades*, 'xy', que escala el elipse con las unidades de datos. Esto coincide con el escalado :class:'~matplotlib.patches.Ellipse'.

source: The *height* and *width* kwargs have been changed to specify the height and width, again for consistency with :class:`~matplotlib.patches.Ellipse`, and to better match their names; previously they specified the half-height and half-width.
es_es: Los kwargs *altura* y *ancho* se han cambiado para especificar la altura y el ancho, de nuevo para consistencia con :class:`~matplotlib. atches.Ellipse`, y para coincidir mejor con sus nombres; previamente especificaban la media altura y la media anchura.

source: There is a new rc parameter ``axes.color_cycle``, and the color cycle is now independent of the rc parameter ``lines.color``. ``matplotlib.Axes.set_default_color_cycle`` is deprecated.
es_es: Hay un nuevo parámetro rc ``axes.color_cycle``, y el ciclo de color es ahora independiente del parámetro rc ``lines.color``. ``matplotlib.Axes.set_default_color_cycle`` está obsoleto.

source: You can now print several figures to one pdf file and modify the document information dictionary of a pdf file. See the docstrings of the class :class:`matplotlib.backends.backend_pdf.PdfPages` for more information.
es_es: Ahora puede imprimir varias cifras en un archivo pdf y modificar el diccionario de información de documentos de un archivo pdf. Vea los documentos de la clase :class:`matplotlib.backends.backend_pdf.PdfPages` para más información.

source: Removed configobj_ and `enthought.traits`_ packages, which are only required by the experimental traited config and are somewhat out of date. If needed, install them independently.
es_es: Se eliminaron los paquetes configobj_ y `enthough, ht.traits`_, los cuales sólo son requeridos por la configuración experimental traited y están algo desactualizados. Si es necesario, instálalos independientemente.

source: The new rc parameter ``savefig.extension`` sets the filename extension that is used by :meth:`matplotlib.figure.Figure.savefig` if its *fname* argument lacks an extension.
es_es: El nuevo parámetro rc ``savefig.extension`` establece la extensión de nombre de archivo que es usada por :meth:`matplotlib.figure.Figure.savefig` si su argumento *fname* carece de una extensión.

source: There are four new Axes methods with corresponding pyplot functions that deal with unstructured triangular grids:
es_es: Hay cuatro nuevos métodos de ejes con las correspondientes funciones de pyplot que tratan con rejillas triangulares no estructuradas:

source: :meth:`matplotlib.axes.Axes.tricontour` draws contour lines on a triangular grid.
es_es: :meth:`matplotlib.axes.Axes.tricontour` dibuja líneas de contorno en una cuadrícula triangular.

source: :meth:`matplotlib.axes.Axes.tricontourf` draws filled contours on a triangular grid.
es_es: :meth:`matplotlib.axes.Axes.tricontourf` dibuja contornos llenados en una cuadrícula triangular.

source: :meth:`matplotlib.axes.Axes.tripcolor` draws a pseudocolor plot on a triangular grid.
es_es: :meth:`matplotlib.axes.Axes.tripcolor` dibuja una gráfica pseudocolor en una cuadrícula triangular.

source: :meth:`matplotlib.axes.Axes.triplot` draws a triangular grid as lines and/or markers.
es_es: :meth:`matplotlib.axes.Axes.triplot` dibuja una cuadrícula triangular como líneas y/o marcadores.
