Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_2.1.0.po
Languages: es_es

source: Moved to ``qt_compat.py``. Renamed because it now handles Qt5 as well.
es_es: Movió a ``qt_compat.py``. Renombrado porque ahora también maneja Qt5.

source: Previously Deprecated methods
es_es: Métodos obsoletos anteriormente

source: The ``GraphicsContextBase.set_graylevel``, ``FigureCanvasBase.onHilite`` and ``mpl_toolkits.axes_grid1.mpl_axes.Axes.toggle_axisline`` methods have been removed.
es_es: Los métodos ``GraphicsContextBase.set_graylevel``, ``FigureCanvasBase.onHilite`` y ``mpl_toolkits.axes_grid1.mpl_axes.Axes.toggle_axisline`` han sido eliminados.

source: The ``ArtistInspector.findobj`` method, which was never working due to the lack of a ``get_children`` method, has been removed.
es_es: El método ``ArtistInspector.findobj``, que nunca funcionó debido a la falta de un método ``get_children``, ha sido eliminado.

source: The deprecated ``point_in_path``, ``get_path_extents``, ``point_in_path_collection``, ``path_intersects_path``, ``convert_path_to_polygons``, ``cleanup_path`` and ``clip_path_to_rect`` functions in the ``matplotlib.path`` module have been removed. Their functionality remains exposed as methods on the ``Path`` class.
es_es: El ``point_in_path``, ``get_path_extents``, ``point_in_path_collection``, ``path_intersects_path``, ``convert_path_to_polygons``, ``cleanup_path`` y ``clip_path_to_rect`` funciones en el ``matplotlib. El módulo ath`` ha sido eliminado. Su funcionalidad sigue expuesta como métodos en la clase ``Path``.

source: The deprecated ``Artist.get_axes`` and ``Artist.set_axes`` methods have been removed
es_es: Los métodos obsoletos ``Artist.get_axes`` y ``Artist.set_axes`` han sido eliminados

source: The ``matplotlib.backends.backend_ps.seq_allequal`` function has been removed. Use ``np.array_equal`` instead.
es_es: La función ``matplotlib.backends.backend_ps.seq_allequal`` ha sido eliminada. Utilice ``np.array_equal`` en su lugar.

source: The deprecated ``matplotlib.rcsetup.validate_maskedarray``, ``matplotlib.rcsetup.deprecate_savefig_extension`` and ``matplotlib.rcsetup.validate_tkpythoninspect`` functions, and associated ``savefig.extension`` and ``tk.pythoninspect`` rcparams entries have been removed.
es_es: Las entradas de rcparams ``matplotlib.rcsetup.validate_maskedarray``, ``matplotlib.rcsetup.deprecate_savefig_extension`` y ``matplotlib.rcsetup.validate_tkpythoninspect`` asociadas, y ``savefig.extension`` y ``tk.pythoninspect`` han sido eliminadas.

source: The keyword argument *resolution* of :class:`matplotlib.projections.polar.PolarAxes` has been removed. It has deprecation with no effect from version *0.98.x*.
es_es: El argumento de palabra clave *resolución* de :class:`matplotlib.projections.polar.PolarAxes` ha sido eliminado. Tiene desaprobación sin efecto de la versión *0.98.x*.

source: ``Axes.set_aspect("normal")``
es_es: ``Ejes.set_aspect("normal")``

source: Support for setting an ``Axes``\'s aspect to ``"normal"`` has been removed, in favor of the synonym ``"auto"``.
es_es: Soporte para establecer un aspecto de ``ejes``\'s a ``"normal"`` ha sido eliminado, a favor del sinónimo ``"auto"``.

source: ``shading`` kwarg to ``pcolor``
es_es: ``sombreando`` kwarg a ``pcolor``

source: The ``shading`` kwarg to `~matplotlib.axes.Axes.pcolor` has been removed. Set ``edgecolors`` appropriately instead.
es_es: El ``shading`` kwarg a `~matplotlib.axes.Axes.pcolor` ha sido removido. Establece ``edgecolors`` apropiadamente en su lugar.

source: Functions removed from the `.lines` module
es_es: Funciones eliminadas del módulo `.lines`

source: The :mod:`matplotlib.lines` module no longer imports the ``pts_to_prestep``, ``pts_to_midstep`` and ``pts_to_poststep`` functions from :mod:`matplotlib.cbook`.
es_es: El módulo :mod:`matplotlib.lines` ya no importa las funciones ``pts_to_prestep``, ``pts_to_midstep`` y ``pts_to_poststep`` de :mod:`matplotlib.cbook`.

source: PDF backend functions
es_es: Funciones de backend PDF

source: The methods ``embedTeXFont`` and ``tex_font_mapping`` of :class:`matplotlib.backends.backend_pdf.PdfFile` have been removed. It is unlikely that external users would have called these methods, which are related to the font system internal to the PDF backend.
es_es: Los métodos ``embedTeXFont`` y ``tex_font_mapping`` de :class:`matplotlib.backends.backend_pdf.PdfFile` han sido eliminados. Es poco probable que los usuarios externos hubieran llamado estos métodos, los cuales están relacionados con el sistema de fuentes interno del backend PDF.

source: Remove the delaunay triangulation code which is now handled by Qhull via :mod:`matplotlib.tri`.
es_es: Eliminar el código de triangulación delaunay que ahora es manejado por Qhull a través de :mod:`matplotlib.tri`.
