Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.0.0.po
Languages: es_es

source: `ArtistInspector.get_aliases` previously returned the set of aliases as ``{fullname: {alias1: None, alias2: None, ...}}``. The dict-to-None mapping was used to simulate a set in earlier versions of Python. It has now been replaced by a set, i.e. ``{fullname: {alias1, alias2, ...}}``.
es_es: `ArtistInspector.get_aliases` devolvió previamente el conjunto de alias como ``{fullname: {alias1: None, alias2: None, ...}}``. El mapeo dictado a Ninguno se utilizó para simular un conjunto en versiones anteriores de Python. Ahora ha sido reemplazado por un conjunto, es decir, ``{fullname: {alias1, alias2, ...}}``.

source: This value is also stored in `.ArtistInspector.aliasd`, which has likewise changed.
es_es: Este valor también se almacena en `.ArtistInspector.aliasd`, que también ha cambiado.

source: Removed ``pytz`` as a dependency
es_es: Se ha eliminado ``pytz`` como una dependencia

source: Since ``dateutil`` and ``pytz`` both provide time zones, and matplotlib already depends on ``dateutil``, matplotlib will now use ``dateutil`` time zones internally and drop the redundant dependency on ``pytz``. While ``dateutil`` time zones are preferred (and currently recommended in the Python documentation), the explicit use of ``pytz`` zones is still supported.
es_es: Como ``dateutil`` y ``pytz`` proporcionan zonas horarias, y matplotlib ya depende de ``dateutil``, matplotlib ahora usará internamente las zonas horarias ``dateutil`` y eliminará la dependencia redundante de ``pytz``. Mientras que las zonas horarias ``dateutil`` son preferidas (y actualmente recomendadas en la documentación de Python), el uso explícito de las zonas ``pytz`` sigue siendo soportado.

source: Deprecations
es_es: Obsolescencias

source: Modules
es_es: Módulos

source: The following modules are deprecated:
es_es: Los siguientes módulos están obsoletos:

source: ``matplotlib.compat.subprocess``. This was a python 2 workaround, but all the functionality can now be found in the python 3 standard library :mod:`subprocess`.
es_es: ``matplotlib.compat.subprocess``. Esto era una solución python 2, pero ahora se puede encontrar toda la funcionalidad en la librería estándar python 3 :mod:`subprocess`.

source: ``matplotlib.backends.wx_compat``. Python 3 is only compatible with wxPython 4, so support for wxPython 3 or earlier can be dropped.
es_es: ``matplotlib.backends.wx_compat``. Python 3 sólo es compatible con wxPython 4, así que el soporte para wxPython 3 o anterior puede ser eliminado.

source: Classes, methods, functions, and attributes
es_es: Clases, métodos, funciones y atributos

source: The following classes, methods, functions, and attributes are deprecated:
es_es: Las siguientes clases, métodos, funciones y atributos están obsoletos:

source: ``backend_qt5.FigureCanvasQT.keyAutoRepeat`` (directly check ``event.guiEvent.isAutoRepeat()`` in the event handler to decide whether to handle autorepeated key presses).
es_es: ``backend_qt5.FigureCanvasQT.keyAutoRepeat`` (comprobar directamente ``event.guiEvent.isAutoRepeat()`` en el controlador de eventos para decidir si manejar o no las teclas automáticas).

source: ``cbook.is_numlike`` (use ``isinstance(..., numbers.Number)`` instead), ``cbook.listFiles``, ``cbook.unicode_safe``
es_es: ``cbook.is_numlike`` (use ``isinstance(..., numbers.Number)`` en su lugar), ``cbook.listFiles``, ``cbook.unicode_safe``

source: ``contour.ContourLabeler.cl``, ``.cl_xy``, and ``.cl_cvalues``
es_es: ``contour.ContourLabeler.cl``, ``.cl_xy``, y ``.cl_cvalues``

source: ``image._ImageBase.iterpnames``, use the ``interpolation_names`` property instead. (this affects classes that inherit from ``_ImageBase`` including `.FigureImage`, `.BboxImage`, and `.AxesImage`)
es_es: ``image._ImageBase.iterpnames``, utilice la propiedad ``interpolation_names`` en su lugar. (esto afecta a las clases que heredan de ``_ImageBase`` incluyendo `.FigureImage`, `.BboxImage`, y `.AxesImage`)

source: ``mathtext.unichr_safe`` (use ``chr`` instead)
es_es: ``mathtext.unichr_safe`` (use ``chr`` en su lugar)

source: ``patches.Polygon.xy``
es_es: ``parches.Polygon.xy``

source: ``table.Table.get_child_artists`` (use ``get_children`` instead)
es_es: ``table.Table.get_child_artists`` (use ``get_children`` en su lugar)

source: ``FigureCanvasQT.keyAutoRepeat`` (directly check ``event.guiEvent.isAutoRepeat()`` in the event handler to decide whether to handle autorepeated key presses)
es_es: ``FigureCanvasQT.keyAutoRepeat`` (comprueba directamente ``event.guiEvent.isAutoRepeat()`` en el controlador de eventos para decidir si manejar o no pulsaciones de teclas automáticas)

source: ``_ImageBase.iterpnames``, use the ``interpolation_names`` property instead. (this affects classes that inherit from ``_ImageBase`` including `.FigureImage`, `.BboxImage`, and `.AxesImage`)
es_es: ``_ImageBase.iterpnames``, utilice la propiedad ``interpolation_names`` en su lugar. (esto afecta a las clases que heredan de ``_ImageBase`` incluyendo `.FigureImage`, `.BboxImage`, y `.AxesImage`)

source: ``Legend.draggable()``, in favor of `.Legend.set_draggable()`
es_es: ``Legend.draggable()``, a favor de `.Legend.set_draggable()`

source: (``Legend.draggable`` may be reintroduced as a property in future releases)
es_es: (``Legend.draggable`` puede ser reintroducido como una propiedad en futuras versiones)

source: ``matplotlib.cbook.deprecation.mplDeprecation`` will be removed in future versions. It is just an alias for ``matplotlib.cbook.deprecation.MatplotlibDeprecationWarning``. Please use ``matplotlib.cbook.MatplotlibDeprecationWarning`` directly if necessary.
es_es: ``matplotlib.cbook.deprecation.mplDeprecation`` se eliminará en versiones futuras. Es sólo un alias para ``matplotlib.cbook.deprecation.MatplotlibDeprecationWarning``. Por favor, utilice ``matplotlib.cbook.MatplotlibDeprecationWarning`` directamente si es necesario.

source: The ``matplotlib.cbook.Bunch`` class has been deprecated. Instead, use `types.SimpleNamespace` from the standard library which provides the same functionality.
es_es: La clase ``matplotlib.cbook.Bunch`` ha sido obsoleta. En su lugar, use `types.SimpleNamespace` de la biblioteca estándar que proporciona la misma funcionalidad.

source: ``Axes.mouseover_set`` is now a frozenset, and deprecated. Directly manipulate the artist's ``.mouseover`` attribute to change their mouseover status.
es_es: ``Axes.mouseover_set`` es ahora un frozenset, y está obsoleto. Maneje directamente el atributo ``.mouseover`` del artista para cambiar el estado de su mouseover.

source: The following keyword arguments are deprecated:
es_es: Los siguientes argumentos de palabra clave están obsoletos:

source: passing ``verts`` to ``Axes.scatter`` (use ``marker`` instead)
es_es: pasando ``verts`` a ``Axes.scatter`` (use ``marker`` en su lugar)

source: passing ``obj_type`` to ``cbook.deprecated``
es_es: pasando ``obj_type`` a ``cbook.deprecated``

source: The following call signatures are deprecated:
es_es: Las siguientes firmas de llamada están obsoletas:

source: passing a ``wx.EvtHandler`` as first argument to ``backend_wx.TimerWx``
es_es: pasando un ``wx.EvtHandler`` como primer argumento a ``backend_wx.TimerWx``

source: The following rcParams are deprecated:
es_es: Los siguientes rcParams están obsoletos:

source: ``examples.directory`` (use ``datapath`` instead)
es_es: ``examples.directory`` (use ``datapath`` en su lugar)

source: ``pgf.debug`` (the pgf backend relies on logging)
es_es: ``pgf.debug`` (el backend de pgf depende del registro)

source: ``text.latex.unicode`` (always True now)
es_es: ``text.latex.unicode`` (siempre Verdadero ahora)

source: Using ``(n, 3)`` as marker style to specify a circle marker is deprecated. Use ``"o"`` instead.
es_es: Usando ``(n, 3)`` como estilo de marcador para especificar un marcador de círculo está obsoleto. Use ``"o"`` en su lugar.

source: Using ``([(x0, y0), (x1, y1), ...], 0)`` as marker style to specify a custom marker path is deprecated. Use ``[(x0, y0), (x1, y1), ...]`` instead.
es_es: Usando ``([(x0, y0), (x1, y1), ...], 0)`` como estilo marcador para especificar una ruta de marcador personalizada es obsoleta. Use ``[(x0, y0), (x1, y1), ...]`` en su lugar.

source: Deprecation of ``LocatableAxes`` in toolkits
es_es: Deprecación de ``LocatableAxes`` en los kits de herramientas

source: The ``LocatableAxes`` classes in toolkits have been deprecated. The base `~.axes.Axes` classes provide the same functionality to all subclasses, thus these mixins are no longer necessary. Related functions have also been deprecated. Specifically:
es_es: Las clases ``LocatableAxes`` en los kits de herramientas han sido obsoletas. El archivo base `~.axes. Las clases xes` proporcionan la misma funcionalidad a todas las subclases, por lo que estas mezclas ya no son necesarias. Las funciones relacionadas también han sido obsoletas. Específicamente:

source: ``mpl_toolkits.axes_grid1.axes_divider.LocatableAxesBase``: no specific replacement; use any other ``Axes``-derived class directly instead.
es_es: ``mpl_toolkits.axes_grid1.axes_divider.LocatableAxesBase``: no hay reemplazo específico; use cualquier otra clase derivada de ``ejes``directamente en su lugar.

source: ``mpl_toolkits.axes_grid1.axes_divider.locatable_axes_factory``: no specific replacement; use any other ``Axes``-derived class directly instead.
es_es: ``mpl_toolkits.axes_grid1.axes_divider.locatable_axes_factory``: ninguna sustitución específica; use cualquier otra clase derivada de ``ejes``directamente en su lugar.

source: ``mpl_toolkits.axes_grid1.axes_divider.Axes``: use `mpl_toolkits.axes_grid1.mpl_axes.Axes` directly.
es_es: ``mpl_toolkits.axes_grid1.axes_divider.Axes``: use `mpl_toolkits.axes_grid1.mpl_axes.Axes` directamente.

source: ``mpl_toolkits.axes_grid1.axes_divider.LocatableAxes``: use `mpl_toolkits.axes_grid1.mpl_axes.Axes` directly.
es_es: ``mpl_toolkits.axes_grid1.axes_divider.LocatableAxes``: use `mpl_toolkits.axes_grid1.mpl_axes.Axes` directamente.

source: ``mpl_toolkits.axisartist.axes_divider.Axes``: use `mpl_toolkits.axisartist.axislines.Axes` directly.
es_es: ``mpl_toolkits.axisartist.axes_divider.Axes``: use `mpl_toolkits.axisartist.axislines.Axes` directamente.

source: ``mpl_toolkits.axisartist.axes_divider.LocatableAxes``: use `mpl_toolkits.axisartist.axislines.Axes` directly.
es_es: ``mpl_toolkits.axisartist.axes_divider.LocatableAxes``: use `mpl_toolkits.axisartist.axislines.Axes` directamente.

source: Removals
es_es: Eliminar

source: Hold machinery
es_es: Mantener maquinaria

source: Setting or unsetting ``hold`` (:ref:`deprecated in version 2.0<v200_deprecate_hold>`) has now been completely removed. Matplotlib now always behaves as if ``hold=True``. To clear an axes you can manually use :meth:`~.axes.Axes.cla()`, or to clear an entire figure use :meth:`~.figure.Figure.clf()`.
es_es: Establecer o desestablecer ``hold`` (:ref:`desaprobado en la versión 2.0<v200_deprecate_hold>`) ha sido eliminado por completo. Matplotlib ahora siempre se comporta como si ``hold=True``. Para limpiar un eje, puedes usar manualmente :meth:`~.axes.Axes.cla()`, o para limpiar una figura completa usa :meth:`~.figure.Figure.clf()`.

source: Removal of deprecated backends
es_es: Eliminación de backends obsoletos

source: Deprecated backends have been removed:
es_es: Los backends obsoletos han sido eliminados:

source: Deprecated APIs
es_es: APIs obsoletas

source: The following deprecated API elements have been removed:
es_es: Se han eliminado los siguientes elementos de API obsoletos:

source: The deprecated methods ``knownfailureif`` and ``remove_text`` have been removed from :mod:`matplotlib.testing.decorators`.
es_es: Los métodos obsoletos ``knownfailureif`` y ``remove_text`` han sido eliminados de :mod:`matplotlib.testing.decorators`.

source: The entire contents of ``testing.noseclasses`` have also been removed.
es_es: El contenido completo de ``testing.noseclasses`` también ha sido eliminado.

source: ``cbook.converter``, ``cbook.tostr``, ``cbook.todatetime``, ``cbook.todate``, ``cbook.tofloat``, ``cbook.toint``, ``cbook.unique``, ``cbook.is_string_like``, ``cbook.is_sequence_of_strings``, ``cbook.is_scalar``, ``cbook.soundex``, ``cbook.dict_delall``, ``cbook.get_split_ind``, ``cbook.wrap``, ``cbook.get_recursive_filelist``, ``cbook.pieces``, ``cbook.exception_to_str``, ``cbook.allequal``, ``cbook.alltrue``, ``cbook.onetrue``, ``cbook.allpairs``, ``cbook.finddir``, ``cbook.reverse_dict``, ``cbook.restrict_dict``, ``cbook.issubclass_safe``, ``cbook.recursive_remove``, ``cbook.unmasked_index_ranges``, ``cbook.Null``, ``cbook.RingBuffer``, ``cbook.Sorter``, ``cbook.Xlator``,
es_es: ``cbook.converter``, ``cbook.tostr``, ``cbook.todatetime``, ``cbook.todate``, ``cbook.tofloat``, ``cbook.toint``, ``cbook.unique``, ``cbook.is_string_like``, ``cbook.is_sequence_of_strings``, ``cbook.is_scalar``, ``cbook.soundex``, ``cbook.dict_delall``, ``cbook.get_split_ind``, ``cbook.wrap``, ``cbook.get_recursive_filelist``, ``cbook.get_recursive_filelist``, ``cbook. ieces``, ``cbook.exception_to_str``, ``cbook.allequal``, ``cbook.alltrue``, ``cbook.onetrue``, ``cbook.allpairs``, ``cbook.finddir``, ``cbook.reverse_dict``, ``cbook.restrict_dict``, ``cbook.issubclass_safe``, ``cbook.recursive_remove``, ``cbook.unmasked_index_ranges``, ``cbook.Null``, ``cbook.RingBuffer``, ``cbook.Sorter``, ``cbook.Xlator``, ``cbook.Xlator``,

source: ``FigureCanvasTk.show`` (alternative: ``FigureCanvasTk.draw``)
es_es: ``FigureCanvasTk.show`` (alternativa: ``FigureCanvasTk.draw``)

source: ``FigureManagerTkAgg`` (alternative: ``FigureManagerTk``)
es_es: ``FigureManagerTkAgg`` (alternativa: ``FigureManagerTk``)

source: ``NavigationToolbar2TkAgg`` (alternative: ``NavigationToolbar2Tk``)
es_es: ``NavigationToolbar2TkAgg`` (alternativa: ``NavigationToolbar2Tk``)

source: ``backend_wxagg.Toolbar`` (alternative: ``backend_wxagg.NavigationToolbar2WxAgg``)
es_es: ``backend_wxagg.Toolbar`` (alternativa: ``backend_wxagg.NavigationToolbar2WxAgg``)

source: passing non-numbers to ``EngFormatter.format_eng``
es_es: pasando los no-números a ``EngFormatter.format_eng``

source: passing ``frac`` to ``PolarAxes.set_theta_grids``
es_es: pasando ``frac`` a ``PolarAxes.set_theta_grids``

source: any mention of idle events
es_es: cualquier mención de eventos inactivos

source: The following API elements have been removed:
es_es: Se han eliminado los siguientes elementos API:

source: ``backend_cairo.HAS_CAIRO_CFFI``
es_es: ``backend_cairo.HAS_CAIRO_CFI``

source: Proprietary sphinx directives
es_es: Directivas de esfinge patentadas

source: The matplotlib documentation used the proprietary sphinx directives ``.. htmlonly::``, and ``.. latexonly::``. These have been replaced with the standard sphinx directives ``.. only:: html`` and ``.. only:: latex``. This change will not affect any users. Only downstream package maintainers, who have used the proprietary directives in their docs, will have to switch to the sphinx directives.
es_es: La documentación de matplotlib utilizó las directivas sphinx propietarias ``.. htmlonly::``, y ``.. latexonly::``. Estos han sido reemplazados por las directivas de esfinge estándar ``.. solamente:: html`` y ``. only:: latex``. Este cambio no afectará a ningún usuario. Sólo los mantenedores de paquetes downstream que han utilizado las directivas propietarias en sus documentos, tendrán que cambiar a las directivas sphinx.

source: The symlink from lib/mpl_examples to ../examples has been removed. This is not installed as an importable package and should not affect end users, however this may require down-stream packagers to adjust. The content is still available top-level examples directory.
es_es: El enlace simbólico de lib/mpl_examples a ../examples ha sido eliminado. Esto no se instala como un paquete importable y no debería afectar a los usuarios finales, sin embargo esto puede requerir que los empaquetadores down-stream se ajusten. El contenido todavía está disponible en el directorio de ejemplos de nivel superior.
