Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.0.0.po
Languages: es_es

source: API Changes for 3.0.0
es_es: Cambios en la API para la versión 3.0.0

source: Drop support for python 2
es_es: Soporte para soltar python 2

source: Matplotlib 3 only supports python 3.5 and higher.
es_es: Matplotlib 3 sólo soporta python 3.5 y superior.

source: Changes to backend loading
es_es: Cambios a la carga del backend

source: Failure to load backend modules (``macosx`` on non-framework builds and ``gtk3`` when running headless) now raises `ImportError` (instead of `RuntimeError` and `TypeError`, respectively).
es_es: No se pudo cargar los módulos del backend (``macosx`` en compilaciones que no son de framework y ``gtk3`` cuando se ejecuta sin cabezas) ahora aumenta `ImportError` (en lugar de `RuntimeError` y `TypeError`, respectivamente).

source: Third-party backends that integrate with an interactive framework are now encouraged to define the ``required_interactive_framework`` global value to one of the following values: "qt5", "qt4", "gtk3", "wx", "tk", or "macosx". This information will be used to determine whether it is possible to switch from a backend to another (specifically, whether they use the same interactive framework).
es_es: Los backends de terceros que se integran con un framework interactivo ahora son animados a definir el valor global ``required_interactive_framework`` a uno de los siguientes valores: "qt5", "qt4", "gtk3", "wx", "tk", o "macosx". Esta información se utilizará para determinar si es posible cambiar de un backend a otro (específicamente, si utilizan el mismo marco interactivo).

source: `.Axes.hist2d` now uses `~.Axes.pcolormesh` instead of `~.Axes.pcolorfast`
es_es: `.Axes.medium2d` ahora usa `~.Axes.pcolormesh` en lugar de `~.Axes.pcolorfast`

source: `.Axes.hist2d` now uses `~.Axes.pcolormesh` instead of `~.Axes.pcolorfast`, which will improve the handling of log-axes. Note that the returned *image* now is of type `~.matplotlib.collections.QuadMesh` instead of `~.matplotlib.image.AxesImage`.
es_es: `.Axes.medium2d` ahora usa `~.Axes.pcolormesh` en lugar de `~.Axes.pcolorfast`, lo que mejorará el manejo de los ejes del log. Ten en cuenta que la *image* devuelta ahora es del tipo `~.matplotlib.collections.QuadMesh` en lugar de `~.matplotlib.image.AxesImage`.

source: `.matplotlib.axes.Axes.get_tightbbox` now includes all artists
es_es: `.matplotlib.axes.Axes.get_tightbbox` ahora incluye a todos los artistas

source: For Matplotlib 3.0, *all* artists are now included in the bounding box returned by `.matplotlib.axes.Axes.get_tightbbox`.
es_es: Para Matplotlib 3.0, *todos* los artistas están ahora incluidos en el cuadro de límites devuelto por `.matplotlib.axes.Axes.get_tightbbox`.

source: `.matplotlib.axes.Axes.get_tightbbox` adds a new kwarg ``bbox_extra_artists`` to manually specify the list of artists on the axes to include in the tight bounding box calculation.
es_es: `.matplotlib.axes.Axes.get_tightbbox` añade un nuevo kwarg ``bbox_extra_artists`` para especificar manualmente la lista de artistas en los ejes a incluir en el estricto cálculo de la caja límite.

source: Layout tools like `.Figure.tight_layout`, ``constrained_layout``, and ``fig.savefig('fname.png', bbox_inches="tight")`` use `.matplotlib.axes.Axes.get_tightbbox` to determine the bounds of each axes on a figure and adjust spacing between axes.
es_es: Herramientas de diseño como `.Figure.tight_layout`, ``constrained_layout``, y ``fig.savefig('fname.png', bbox_inches="tight")`` usan `.matplotlib.axes.Axes.get_tightbbox` para determinar los límites de cada eje en una figura y ajustar el espacio entre ejes.

source: In Matplotlib 2.2 ``get_tightbbox`` started to include legends made on the axes, but still excluded some other artists, like text that may overspill an axes. This has been expanded to include *all* artists.
es_es: En Matplotlib 2.2 ``get_tightbbox`` comenzó a incluir leyendas hechas en los ejes, pero todavía excluyó a algunos otros artistas, como el texto que puede sobrecargar un eje. Esto se ha ampliado para incluir a *todos* los artistas.

source: This new default may be overridden in either of three ways:
es_es: Este nuevo valor por defecto puede ser anulado de tres maneras:

source: Make the artist to be excluded a child of the figure, not the axes. E.g., call ``fig.legend()`` instead of ``ax.legend()`` (perhaps using `~.matplotlib.axes.Axes.get_legend_handles_labels` to gather handles and labels from the parent axes).
es_es: Haz que el artista sea excluido un hijo de la figura, no de los ejes. Por ejemplo, llama a ``fig.legend()`` en lugar de ``ax. egend()`` (tal vez usando `~.matplotlib.axes.Axes.get_legend_handles_labels` para recoger asas y etiquetas de los ejes principales).

source: If the artist is a child of the axes, set the artist property ``artist.set_in_layout(False)``.
es_es: Si el artista es un hijo de los ejes, establezca la propiedad del artista ``artist.set_in_layout(False)``.

source: Manually specify a list of artists in the new kwarg ``bbox_extra_artists``.
es_es: Especifique manualmente una lista de artistas en el nuevo kwarg ``bbox_extra_artists``.

source: `.Text.set_text` with string argument ``None`` sets string to empty
es_es: `.Text.set_text` con el argumento de cadena ``None `` establece que la cadena esté vacía

source: `.Text.set_text` when passed a string value of ``None`` would set the string to ``"None"``, so subsequent calls to `.Text.get_text` would return the ambiguous ``"None"`` string.
es_es: `.Text.set_text` cuando se le pasa un valor de cadena de ``Ninguno`` establecería la cadena a ``"Ninguno"``, así que las llamadas subsiguientes a `.Text.get_text` devolverían la ambigua cadena ``"Ninguno"``.

source: This change sets text objects passed ``None`` to have empty strings, so that `.Text.get_text` returns an empty string.
es_es: Este cambio establece que los objetos de texto pasados ``nunca`` tengan cadenas vacías, así que `.Text.get_text` devuelve una cadena vacía.

source: ``Axes3D.get_xlim``, ``get_ylim`` and ``get_zlim`` now return a tuple
es_es: ``Axes3D.get_xlim``, ``get_ylim`` y ``get_zlim`` ahora devuelven una tupla

source: They previously returned an array. Returning a tuple is consistent with the behavior for 2D axes.
es_es: Previamente devolvieron una matriz. Devolver una tupla es consistente con el comportamiento de los ejes 2D.

source: ``font_manager.list_fonts`` now follows the platform's casefolding semantics
es_es: ``font_manager.list_fonts`` ahora sigue la semántica de casefolding de la plataforma

source: i.e., it behaves case-insensitively on Windows only.
es_es: es decir, se comporta sólo en Windows con insensibilidad a mayúsculas.

source: ``bar`` / ``barh`` no longer accepts ``left`` / ``bottom`` as first named argument
es_es: ``bar`` / ``barh`` ya no acepta ``left`` / ``bottom`` como primer argumento nombrado

source: These arguments were renamed in 2.0 to ``x`` / ``y`` following the change of the default alignment from ``edge`` to ``center``.
es_es: Estos argumentos fueron renombrados en 2.0 a ``x`` / ``y`` después del cambio de alineamiento predeterminado de ``edge`` a ``center``.

source: Different exception types for undocumented options
es_es: Diferentes tipos de excepción para opciones indocumentadas

source: Passing ``style='comma'`` to :meth:`~matplotlib.axes.Axes.ticklabel_format` was never supported. It now raises ``ValueError`` like all other unsupported styles, rather than ``NotImplementedError``.
es_es: Pasar ``style='comma'`` a :meth:`~matplotlib.axes.Axes.ticklabel_format` nunca fue soportado. Ahora aumenta ``ValueError`` como todos los demás estilos no soportados, en lugar de ``NotImplementedError``.

source: Passing the undocumented ``xmin`` or ``xmax`` arguments to :meth:`~matplotlib.axes.Axes.set_xlim` would silently override the ``left`` and ``right`` arguments. :meth:`~matplotlib.axes.Axes.set_ylim` and the 3D equivalents (e.g. `~.Axes3D.set_zlim3d`) had a corresponding problem. A ``TypeError`` will be raised if they would override the earlier limit arguments. In 3.0 these were kwargs were deprecated, but in 3.1 the deprecation was undone.
es_es: Pasando los argumentos ``xmin`` o ``xmax`` indocumentados a :meth:`~matplotlib.axes.Axes. et_xlim` anularía silenciosamente los argumentos ``left`` y ``right``. :meth:`~matplotlib.axes.Axes.set_ylim` y los equivalentes 3D (e. . `~.Axes3D.set_zlim3d`) tuvo un problema correspondiente. Se planteará un ``TypeError`` si anulan los argumentos límite anteriores. En 3.0 estos eran kwargs estaban obsoletos, pero en 3.1 se deshizo la desaprobación.

source: Improved call signature for ``Axes.margins``
es_es: Firma de llamada mejorada para ``Ejes.margins``

source: `.Axes.margins` and `.Axes3D.margins` no longer accept arbitrary keywords. ``TypeError`` will therefore be raised if unknown kwargs are passed; previously they would be silently ignored.
es_es: `.Axes.margins` y `.Axes3D.margins` ya no aceptan palabras clave arbitrarias. ``TypeError`` se levantará si se pasan kwargs desconocidos; anteriormente serían ignorados silenciosamente.

source: If too many positional arguments are passed, ``TypeError`` will be raised instead of ``ValueError``, for consistency with other call-signature violations.
es_es: Si se pasan demasiados argumentos posicionales, ``TypeError`` se levantará en lugar de ``ValueError``, para que sea consistente con otras violaciones de la firma de llamada.

source: `.Axes3D.margins` now raises ``TypeError`` instead of emitting a deprecation warning if only two positional arguments are passed. To supply only ``x`` and ``y`` margins, use keyword arguments.
es_es: `.Axes3D.margins` ahora aumenta ``TypeError`` en lugar de emitir una advertencia de desaprobación si sólo se pasan dos argumentos posicionales. Para proporcionar sólo los márgenes ``x`` y ``y``, utilice argumentos de palabra clave.

source: Explicit arguments instead of \*args, \*\*kwargs
es_es: Argumentos explícitos en lugar de \*args, \*\*kwargs

source: :PEP:`3102` describes keyword-only arguments, which allow Matplotlib to provide explicit call signatures - where we previously used ``*args, **kwargs`` and ``kwargs.pop``, we can now expose named arguments. In some places, unknown kwargs were previously ignored but now raise ``TypeError`` because ``**kwargs`` has been removed.
es_es: :PEP:`3102` describe argumentos de palabra clave, que permiten a Matplotlib proporcionar firmas de llamada explícitas - donde previamente usamos ``*args, **kwargs`` y ``kwargs. op``, ahora podemos exponer los argumentos nombrados. En algunos lugares, kwargs desconocidos fueron previamente ignorados, pero ahora elevar ``TypeError`` porque ``**kwargs`` ha sido eliminado.

source: :meth:`matplotlib.axes.Axes.stem` no longer accepts unknown keywords, and raises ``TypeError`` instead of emitting a deprecation.
es_es: :meth:`matplotlib.axes.Axes.stem` ya no acepta palabras clave desconocidas, y aumenta ``TypeError`` en lugar de emitir una desaprobación.

source: :meth:`matplotlib.axes.Axes.stem` now raises TypeError when passed unhandled positional arguments. If two or more arguments are passed (ie X, Y, [linefmt], ...) and Y cannot be cast to an array, an error will be raised instead of treating X as Y and Y as linefmt.
es_es: :meth:`matplotlib.axes.Axes.stem` ahora levanta TypeError cuando se pasan argumentos posicionales no controlados. Si se pasan dos o más argumentos (es decir, X, Y, [linefmt], . .) y Y no se puede convertir en una matriz, se generará un error en lugar de tratar X como Y e como linefmt.

source: `mpl_toolkits.axes_grid1.axes_divider.SubplotDivider` raises ``TypeError`` instead of ``Exception`` when passed unknown kwargs.
es_es: `mpl_toolkits.axes_grid1.axes_divider.SubplotDivider` aumenta ``TypeError`` en lugar de ``Exception`` cuando se pasan kwargs desconocidos.

source: Cleanup decorators and test classes no longer destroy warnings filter on exit
es_es: Los decoradores de limpieza y las clases de prueba ya no destruyen el filtro de advertencias al salir

source: The decorators and classes in matplotlib.testing.decorators no longer destroy the warnings filter on exit. Instead, they restore the warnings filter that existed before the test started using ``warnings.catch_warnings``.
es_es: Los decoradores y las clases en matplotlib.testing.decorators ya no destruyen el filtro de advertencias al salir. En cambio, restauran el filtro de advertencias que existía antes de que la prueba comenzara a usar ``warnings.catch_warnings``.

source: Non-interactive FigureManager classes are now aliases of FigureManagerBase
es_es: Las clases FigureManager no interactivas son ahora alias de FigureManagerBase

source: The ``FigureManagerPdf``, ``FigureManagerPS``, and ``FigureManagerSVG`` classes, which were previously empty subclasses of `.FigureManagerBase` (i.e., not adding or overriding any attribute or method), are now direct aliases for `.FigureManagerBase`.
es_es: Las clases ``FigureManagerPdf``, ``FigureManagerPS``, y ``FigureManagerSVG``, que eran subclases previamente vacías de `. igureManagerBase` (es decir, no añadir o reemplazar ningún atributo o método), ahora son alias directos para `.FigureManagerBase`.

source: Change to the output of `.image.thumbnail`
es_es: Cambia a la salida de `.image.thumbnail nail`

source: When called with ``preview=False``, `.image.thumbnail` previously returned an figure whose canvas class was set according to the output file extension. It now returns a figure whose canvas class is the base `.FigureCanvasBase` (and relies on `.FigureCanvasBase.print_figure`) to handle the canvas switching properly).
es_es: Cuando se llama con ``preview=False``, `.image.thumbnail nail` devolvió previamente una figura cuya clase canvas fue establecida de acuerdo a la extensión del archivo de salida. Ahora devuelve una figura cuya clase de lienzo es la base `.FigureCanvasBase` (y se basa en `.FigureCanvasBase.print_figure`) para manejar el cambio de lienzo adecuadamente).

source: As a side effect of this change, `.image.thumbnail` now also supports .ps, .eps, and .svgz output.
es_es: Como efecto secundario de este cambio, `.image.thumbnail nail` ahora también soporta salida .ps, .eps y .svgz.

source: `.FuncAnimation` now draws artists according to their zorder when blitting
es_es: `.FuncAnimation` ahora dibuja artistas de acuerdo a su zorder cuando explota

source: `.FuncAnimation` now draws artists returned by the user- function according to their zorder when using blitting, instead of using the order in which they are being passed. However, note that only zorder of passed artists will be respected, as they are drawn on top of any existing artists (see `#11369 <https://github.com/matplotlib/matplotlib/issues/11369>`_).
es_es: `.FuncAnimation` ahora dibuja artistas devueltos por la función de usuario de acuerdo a su zorder al usar blitting, en lugar de utilizar el orden en el que se pasan. Sin embargo, tenga en cuenta que sólo se respetará el zorder de los artistas pasados, ya que se dibujan sobre cualquier artista existente (ver `#11369 <https://github.com/matplotlib/matplotlib/issues/11369>`_).

source: Contour color autoscaling improvements
es_es: Mejoras de autoescalado de color de contorno

source: Selection of contour levels is now the same for contour and contourf; previously, for contour, levels outside the data range were deleted. (Exception: if no contour levels are found within the data range, the `levels` attribute is replaced with a list holding only the minimum of the data range.)
es_es: La selección de niveles de contorno es ahora la misma para contorno y contorno; anteriormente, para contorno, se eliminaron niveles fuera del rango de datos. (Excepción: si no se encuentran niveles de contorno dentro del rango de datos, el atributo `levels` es reemplazado por una lista que contiene sólo el mínimo del rango de datos.)

source: When contour is called with levels specified as a target number rather than a list, and the 'extend' kwarg is used, the levels are now chosen such that some data typically will fall in the extended range.
es_es: Cuando se llama al contorno con niveles especificados como un número objetivo en lugar de una lista, y se utiliza el enano 'extendido' los niveles ahora se eligen de tal manera que algunos datos típicamente caerán en el rango ampliado.

source: When contour is called with a `.LogNorm` or a `.LogLocator`, it will now select colors using the geometric mean rather than the arithmetic mean of the contour levels.
es_es: Cuando el contorno es llamado con un `.LogNorm` o un `. ogLocator`, ahora seleccionará los colores utilizando la media geométrica en lugar de la media aritmética de los niveles de contorno.

source: Streamplot last row and column fixed
es_es: Última fila y columna de Streamplot arreglada

source: A bug was fixed where the last row and column of data in `~.Axes.streamplot` were being dropped.
es_es: Se corrigió un error donde se soltaba la última fila y columna de datos en `~.Axes.streamplot`.

source: Changed default `.AutoDateLocator` kwarg *interval_multiples* to ``True``
es_es: Cambió el valor predeterminado `.AutoDateLocator` kwarg *interval_multiples* a ``True``

source: The default value of the tick locator for dates, `.dates.AutoDateLocator` kwarg *interval_multiples* was set to ``False`` which leads to not-nice looking automatic ticks in many instances. The much nicer ``interval_multiples=True`` is the new default. See below to get the old behavior back:
es_es: El valor por defecto del localizador de tick para las fechas, `.dates. utoDateLocator` kwarg *interval_multiples* fue establecido en ``False`` lo que lleva a ticks automáticos no bonitos en muchas instancias. El ``interval_multiples=True`` mucho más atractivo es el nuevo valor por defecto. Ve abajo para recuperar el comportamiento antiguo:

source: (`Source code <../../api/prev_api_changes/api_changes_3-0-0-1.py>`__, `png <../../api/prev_api_changes/api_changes_3-0-0-1.png>`__, `pdf <../../api/prev_api_changes/api_changes_3-0-0-1.pdf>`__)
es_es: (`Código fuente <../../api/prev_api_changes/api_changes_3-0-0-1.py>`__, `png <../../api/prev_api_changes/api_changes_3-0-0-1.png>`__, `pdf <../../api/prev_api_changes/api_changes_3-0-1.pdf>`__)

source: `.Axes.get_position` now returns actual position if aspect changed
es_es: `.Axes.get_position` ahora devuelve la posición real si el aspecto ha cambiado

source: `.Axes.get_position` used to return the original position unless a draw had been triggered or `.Axes.apply_aspect` had been called, even if the kwarg *original* was set to ``False``. Now `.Axes.apply_aspect` is called so ``ax.get_position()`` will return the new modified position. To get the old behavior use ``ax.get_position(original=True)``.
es_es: `.Axes.get_position` usado para devolver la posición original a menos que se haya activado un sorteo o `. xes.apply_aspect` había sido llamado, incluso si el kwarg *original* se estableció en ``False``. Ahora `.Axes.apply_aspect` es llamado así que ``ax.get_position()`` devolverá la nueva posición modificada. Para obtener el comportamiento antiguo use ``ax.get_position(original=True)``.

source: The ticks for colorbar now adjust for the size of the colorbar
es_es: Los ticks de la barra de color ahora se ajustan para el tamaño de la barra de colores

source: Colorbar ticks now adjust for the size of the colorbar if the colorbar is made from a mappable that is not a contour or doesn't have a BoundaryNorm, or boundaries are not specified. If boundaries, etc are specified, the colorbar maintains the original behavior.
es_es: Las marcas de la barra de colores ahora se ajustan para el tamaño de la barra de colores si la barra de colores está hecha de un mapeable que no es un contorno o no tiene una norma límite, o los límites no están especificados. Si se especifican límites, etc , la barra de colores mantiene el comportamiento original.

source: Colorbar for log-scaled hexbin
es_es: Barra de color para hexbin escala de registro

source: When using `~.Axes.hexbin` and plotting with a logarithmic color scale, the colorbar ticks are now correctly log scaled. Previously the tick values were linear scaled log(number of counts).
es_es: Al usar `~.Axes.hexbin` y trazar con una escala de color logarítmica, los ticks de la barra de colores ahora están correctamente escalados en el registro. Anteriormente, los valores de tick eran registros escalados lineales (número de cuentas).

source: PGF backend now explicitly makes black text black
es_es: El backend PGF ahora explícitamente hace negro texto negro

source: Previous behavior with the pgf backend was for text specified as black to actually be the default color of whatever was rendering the pgf file (which was of course usually black). The new behavior is that black text is black, regardless of the default color. However, this means that there is no way to fall back on the default color of the renderer.
es_es: El comportamiento anterior con el backend pgf era para que el texto especificado como negro fuera realmente el color predeterminado de lo que estuviera renderizando el archivo pgf (que por supuesto era normalmente negro). El nuevo comportamiento es que el texto negro es negro, independientemente del color predeterminado. Sin embargo, esto significa que no hay manera de volver al color predeterminado del renderizador.

source: Blacklisted rcparams no longer updated by `~matplotlib.rcdefaults`, `~matplotlib.rc_file_defaults`, `~matplotlib.rc_file`
es_es: Rcparams en lista negra ya no actualizado por `~matplotlib.rcdefaults`, `~matplotlib.rc_file_defaults`, `~matplotlib.rc_file`

source: The rc modifier functions `~matplotlib.rcdefaults`, `~matplotlib.rc_file_defaults` and `~matplotlib.rc_file` now ignore rcParams in the `matplotlib.style.core.STYLE_BLACKLIST` set. In particular, this prevents the ``backend`` and ``interactive`` rcParams from being incorrectly modified by these functions.
es_es: Las funciones del modificador rc `~matplotlib.rcdefaults`, `~matplotlib.rc_file_defaults` y `~matplotlib.rc_file` ahora ignoran rcParams en `matplotlib.style. ore.STYLE_BLACKLIST`. En particular, esto evita que los rcParams ``backend`` y ``interactive`` sean modificados incorrectamente por estas funciones.

source: `.CallbackRegistry` now stores callbacks using stdlib's `weakref.WeakMethod`\s
es_es: `.CallbackRegistry` ahora almacena callbacks usando stdlib's `weakref.WeakMethod`\s

source: In particular, this implies that ``CallbackRegistry.callbacks[signal]`` is now a mapping of callback ids to `weakref.WeakMethod`\s (i.e., they need to be first called with no arguments to retrieve the method itself).
es_es: En particular, esto implica que ``CallbackRegistry.callbacks[signal]`` es ahora un mapeo de id de devolución de llamada a `weakref. eakMethod`\s (es decir, primero necesitan ser llamados sin argumentos para recuperar el método en sí).

source: Changes regarding the text.latex.unicode rcParam
es_es: Cambios relacionados con text.latex.unicode rcParam

source: The rcParam now defaults to True and is deprecated (i.e., in future versions of Matplotlib, unicode input will always be supported).
es_es: Ahora rcParam por defecto es True y está obsoleto (es decir, en futuras versiones de Matplotlib, la entrada unicode siempre será soportada).

source: Moreover, the underlying implementation now uses ``\usepackage[utf8]{inputenc}`` instead of ``\usepackage{ucs}\usepackage[utf8x]{inputenc}``.
es_es: Además, la implementación subyacente ahora usa ``\usepackage[utf8]{inputenc}`` en lugar de ``\usepackage{ucs}\usepackage[utf8x]{inputenc}``.

source: Return type of ArtistInspector.get_aliases changed
es_es: Se ha cambiado el tipo de retorno de ArtistInspector.get_aliases
