Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.3.0.po
Languages: es_es

source: This method is deprecated. If you previously reimplemented it in a subclass, set the artist's picker instead with `.Artist.set_picker`.
es_es: Este método es obsoleto. Si lo has reimplementado previamente en una subclase, establece el selector del artista en su lugar con `.Artist.set_picker`.

source: *clear_temp* parameter and attribute of `.FileMovieWriter`
es_es: Parámetro y atributo *clear_temp* de `.FileMo)[video] Writer`

source: The *clear_temp* parameter and attribute of `.FileMovieWriter` is deprecated. In the future, files placed in a temporary directory (using ``frame_prefix=None``, the default) will be cleared; files placed elsewhere will not.
es_es: El parámetro y atributo *clear_temp* de `.FileMo)[video] Writer` está obsoleto. En el futuro, los archivos colocados en un directorio temporal (usando ``frame_prefix=Ningun``, el predeterminado) serán borrados; los archivos colocados en otro lugar no lo harán.

source: Deprecated rcParams validators
es_es: Validadores rcParams obsoletos

source: The following validators, defined in `.rcsetup`, are deprecated: ``validate_fontset``, ``validate_mathtext_default``, ``validate_alignment``, ``validate_svg_fontset``, ``validate_pgf_texsystem``, ``validate_movie_frame_fmt``, ``validate_axis_locator``, ``validate_movie_html_fmt``, ``validate_grid_axis``, ``validate_axes_titlelocation``, ``validate_toolbar``, ``validate_ps_papersize``, ``validate_legend_loc``, ``validate_bool_maybe_none``, ``validate_hinting``, ``validate_movie_writer``, ``validate_webagg_address``, ``validate_nseq_float``, ``validate_nseq_int``. To test whether an rcParam value would be acceptable, one can test e.g. ``rc = RcParams(); rc[k] = v`` raises an exception.
es_es: Los siguientes validadores, definidos en `. csetup`, son desaprobados: ``validate_fontset``, ``validate_mathtext_default``, ``validate_alignment``, ``validate_svg_fontset``, ``validate_pgf_texsystem``, ``validate_mo(0)[video] _frame_fmt``, ``validate_axis_locator``, ``validate_mo)[video] _html_fmt``, ``validate_grid_axis``, ``validate_axes_titlelocation``, ``validate_toolbar``, ``validate_ps_papersize``, ``validate_legend_loc``validate_bool_maybe_parall``, ``validate_hinting``, ``validate_moprósper_writer``, ``validate_webagg Para comprobar si un valor de rcParam sería aceptable, uno puede probar por ejemplo ``rc = RcParams(); rc[k] = v`` levanta una excepción.

source: Stricter rcParam validation
es_es: Validación más estricta de rcParam

source: :rc:`axes.axisbelow` currently normalizes all strings starting with "line" (case-insensitive) to the option "line". This is deprecated; in a future version only the exact string "line" (case-sensitive) will be supported.
es_es: :rc:`axes.axisbelow` actualmente normaliza todas las cadenas que comienzan con "línea" (insensibles en mayúsculas) a la opción "línea". Esto está obsoleto; en una versión futura sólo la cadena exacta "línea" (sensible a mayúsculas y minúsculas) será soportada.

source: ``add_subplot()`` validates its inputs
es_es: ``add_subplot()`` valida sus entradas

source: In particular, for ``add_subplot(rows, cols, index)``, all parameters must be integral. Previously strings and floats were accepted and converted to int. This will now emit a deprecation warning.
es_es: En particular, para ``add_subplot(filas, cols, índice)``, todos los parámetros deben ser integrales. Anteriormente las cadenas y flotantes fueron aceptadas y convertidas en int. Esto ahora emitirá una advertencia de desaprobación.

source: Toggling axes navigation from the keyboard using "a" and digit keys
es_es: Alternar ejes de navegación desde el teclado usando teclas "a" y dígitos

source: Axes navigation can still be toggled programmatically using `.Axes.set_navigate`.
es_es: La navegación por ejes puede ser cambiada programáticamente usando `.Axes.set_navigate`.

source: The following related APIs are also deprecated: ``backend_tools.ToolEnableAllNavigation``, ``backend_tools.ToolEnableNavigation``, and ``rcParams["keymap.all_axes"]``.
es_es: Las siguientes APIs relacionadas también están obsoletas: ``backend_tools.ToolEnableAllNavigation``, ``backend_tools.ToolEnableNavigation``, y ``rcParams["keymap.all_axes"]``.

source: The *recursionlimit* parameter of ``matplotlib.test`` is deprecated.
es_es: El parámetro *recursionlimit* de ``matplotlib.test`` está obsoleto.

source: mathtext glues
es_es: pezones de texto matemático

source: The *copy* parameter of ``mathtext.Glue`` is deprecated (the underlying glue spec is now immutable). ``mathtext.GlueSpec`` is deprecated.
es_es: El parámetro *copy* de ``mathtext.Glue`` está obsoleto (la especificación de cola subyacente es ahora inmutable). ``mathtext.GlueSpec`` está obsoleto.

source: Signatures of `.Artist.draw` and `.Axes.draw`
es_es: Firmas de `.Artist.draw` y `.Axes.draw`

source: The *inframe* parameter to `.Axes.draw` is deprecated. Use `.Axes.redraw_in_frame` instead.
es_es: El parámetro *inframe* a `.Axes.draw` está obsoleto. Use `.Axes.redraw_in_frame` en su lugar.

source: Not passing the *renderer* parameter to `.Axes.draw` is deprecated. Use ``axes.draw_artist(axes)`` instead.
es_es: No pasar el parámetro *renderer* a `.Axes.draw` está obsoleto. Use ``axes.draw_artist(axes)`` en su lugar.

source: These changes make the signature of the ``draw`` (``artist.draw(renderer)``) method consistent across all artists; thus, additional parameters to `.Artist.draw` are deprecated.
es_es: Estos cambios hacen que la firma del método ``draw`` (``artist.draw(render)``) sea consistente entre todos los artistas; por lo tanto, los parámetros adicionales a `.Artist.draw` son obsoletos.

source: ``DraggableBase.on_motion_blit``
es_es: ``ArrastrableBase.on_motion_blit``

source: This method is deprecated. `.DraggableBase.on_motion` now handles both the blitting and the non-blitting cases.
es_es: Este método está obsoleto. `.DraggableBase.on_motion` ahora maneja tanto los casos de flitting como los no fliting.

source: Passing the dash offset as None
es_es: Pasando el desplazamiento del guión como ninguno

source: Fine control of dash patterns can be achieved by passing an ``(offset, (on-length, off-length, on-length, off-length, ...))`` pair as the linestyle property of `.Line2D` and `.LineCollection`. Previously, certain APIs would accept ``offset = None`` as a synonym for ``offset = 0``, but this was never universally implemented, e.g. for vector output. Support for ``offset = None`` is deprecated, set the offset to 0 instead.
es_es: Se puede lograr un control fino de los patrones de guión pasando un ``(offset, on-length, off-length, on-length, off-length, . .))`` par como la propiedad linestyle de `.Line2D` y `.LineCollection`. Anteriormente, ciertas APIs aceptarían ``offset = delet`` como sinónimo de ``offset = 0``, pero esto nunca fue implementado universalmente. . para la salida vectorial. El soporte para ``offset = delet`` está obsoleto, establece el offset a 0 en su lugar.

source: ... are deprecated.
es_es: ... están en desuso.

source: ``autofmt_xdate(which=None)``
es_es: ``autofmt_xdate(which=Ninguno)``

source: This is deprecated, use its more explicit synonym, ``which="major"``, instead.
es_es: Esto está obsoleto, utilice su sinónimo más explícito, ``which="major"``, en su lugar.

source: JPEG options
es_es: Opciones JPEG

source: The *quality*, *optimize*, and *progressive* keyword arguments to `~.Figure.savefig`, which were only used when saving to JPEG, are deprecated. :rc:`savefig.jpeg_quality` is likewise deprecated.
es_es: Los argumentos de la palabra clave *calidad*, *optimizar*, y *progresivo* para `~.Figure.savefig`, que solo se usaron cuando se guardaban en JPEG, están desaprobados. :rc:`savefig.jpeg_quality` es igual que desaprobado.

source: Such options should now be directly passed to Pillow using ``savefig(..., pil_kwargs={"quality": ..., "optimize": ..., "progressive": ...})``.
es_es: Tales opciones ahora deberían pasarse directamente a Pillow usando ``savefig(..., pil_kwargs={"quality": ..., "optimize": ..., "progresivo": ...})``.

source: This class was (mostly) broken and is deprecated.
es_es: Esta clase estaba (mayormente) dañada y está obsoleta.

source: Axis and Locator ``pan`` and ``zoom``
es_es: Eje y Localizador ``pan`` y ``zoom``

source: The unused ``pan`` and ``zoom`` methods of `~.axis.Axis` and `~.ticker.Locator` are deprecated. Panning and zooming are now implemented using the ``start_pan``, ``drag_pan``, and ``end_pan`` methods of `~.axes.Axes`.
es_es: Los métodos sin usar ``pan`` y ``zoom`` de `~.axis.Axis` y `~.ticker.Locator` son obsoletos. Panning and zooming are now implemented using the ``start_pan``, ``drag_pan``, and ``end_pan`` methods of `~.axes.Axes`.

source: Passing None to various Axes subclass factories
es_es: Pasar Ninguno a varias fábricas de subclases de ejes

source: Support for passing ``None`` as base class to `.axes.subplot_class_factory`, ``axes_grid1.parasite_axes.host_axes_class_factory``, ``axes_grid1.parasite_axes.host_subplot_class_factory``, ``axes_grid1.parasite_axes.parasite_axes_class_factory``, and ``axes_grid1.parasite_axes.parasite_axes_auxtrans_class_factory`` is deprecated. Explicitly pass the correct base ``Axes`` class instead.
es_es: Soporte para pasar ``Ninguno`` como clase base a `.axes.subplot_class_factory`, ``axes_grid1.parasite_axes.host_axes_class_factory``, ``axes_grid1.parasite_axes.host_subplot_class_factory``, ``axes_grid1.parasite_axes.parasite_axes_class_factory``, y ``axes_grid1.parasite_axes.parasite_axes_auxtrans_class_factory`` es obsoleado. En su lugar, pasa la base correcta ``Axes``.

source: ``axes_rgb``
es_es: ``ejes_rgb``

source: In :mod:`mpl_toolkits.axes_grid1.axes_rgb`, ``imshow_rgb`` is deprecated (use ``ax.imshow(np.dstack([r, g, b]))`` instead); ``RGBAxesBase`` is deprecated (use ``RGBAxes`` instead); ``RGBAxes.add_RGB_to_figure`` is deprecated (it was an internal helper).
es_es: En :mod:`mpl_toolkits.axes_grid1.axes_rgb`, ``imshow_rgb`` está obsoleto (usa ``ax.imshow(np.dstack([r, g, b]))`` en su lugar); ``RGBAxesBase`` está obsoleto (usa ``RGBAxes`` en su lugar); ``RGBAxes.add_RGB_to_figure`` está obsoleto (era un ayudante interno).

source: ``Substitution.from_params``
es_es: ``Sustitución.from_params``

source: This method is deprecated. If needed, directly assign to the ``params`` attribute of the Substitution object.
es_es: Este método es obsoleto. Si es necesario, asignar directamente al atributo ``params`` del objeto Sustitución.

source: PGF backend cleanups
es_es: Limpieza de back-end PGF

source: The *dummy* parameter of `.RendererPgf` is deprecated.
es_es: El parámetro *dummy* de `.RenderererPgf` está obsoleto.

source: ``GraphicsContextPgf`` is deprecated (use `.GraphicsContextBase` instead).
es_es: ``GraphicsContextPgf`` está obsoleto (use `.GraphicsContextBase` en su lugar).

source: ``set_factor`` method of :mod:`mpl_toolkits.axisartist` locators
es_es: método ``set_factor`` de los localizadores de :mod:`mpl_toolkits.axisartist`

source: The ``set_factor`` method of :mod:`mpl_toolkits.axisartist` locators (which are different from "standard" Matplotlib tick locators) is deprecated.
es_es: El método ``set_factor`` de los locatores de :mod:`mpl_toolkits.axisartist` (que son diferentes de los locadores de tick estándar de Matplotlib) está desaprobado.

source: `.widgets.SubplotTool` callbacks and axes
es_es: callbacks y ejes `.widgets.SubplotTool`

source: The ``funcleft``, ``funcright``, ``funcbottom``, ``functop``, ``funcwspace``, and ``funchspace`` methods of `.widgets.SubplotTool` are deprecated.
es_es: Los métodos ``funcleft``, ``funcright``, ``funcbottom``, ``functop``, ``funcwspace``, y ``funchspace`` de `.widgets.SubplotTool` son obsoletos.

source: The ``axleft``, ``axright``, ``axbottom``, ``axtop``, ``axwspace``, and ``axhspace`` attributes of `.widgets.SubplotTool` are deprecated. Access the ``ax`` attribute of the corresponding slider, if needed.
es_es: Los atributos ``axleft``, ``axright``, ``axbottom``, ``axtop``, ``axwspace``, y ``axhspace`` de `.widgets.SubplotTool` están desaprobados. Acceda al atributo ``ax`` del deslizador correspondiente, si es necesario.

source: mathtext ``Glue`` helper classes
es_es: clases ayudantes de mathtext ``Glue``

source: The ``Fil``, ``Fill``, ``Filll``, ``NegFil``, ``NegFill``, ``NegFilll``, and ``SsGlue`` classes in the :mod:`matplotlib.mathtext` module are deprecated. As an alternative, directly construct glue instances with ``Glue("fil")``, etc.
es_es: Las clases ``Fil``, ``Fill``, ``Filll``, ``NegFil``, ``NegFill``, ``NegFilll``, y ``SsGlue`` en las clases :mod:`matplotlib. el módulo athtext` es obsoleto. Como alternativa, construye directamente instancias de pegamento con ``Glue("fil")``, etc.

source: NavigationToolbar2._init_toolbar
es_es: Barra de herramientas de navegación.

source: Overriding this method to initialize third-party toolbars is deprecated. Instead, the toolbar should be initialized in the ``__init__`` method of the subclass (which should call the base-class' ``__init__`` as appropriate). To keep back-compatibility with earlier versions of Matplotlib (which *required* ``_init_toolbar`` to be overridden), a fully empty implementation (``def _init_toolbar(self): pass``) may be kept and will not trigger the deprecation warning.
es_es: Anular este método para inicializar barras de herramientas de terceros está obsoleto. En su lugar, la barra de herramientas debe inicializarse en el método ``__init__`` de la subclase (que debería llamar a la clase base-' ``__init__`` según corresponde). Para mantener la compatibilidad con versiones anteriores de Matplotlib (que *requiere* que ``_init_toolbar`` sea anulada), una implementación completamente vacía (``def _init_toolbar(self): pass``) puede mantenerse y no desencadenará la advertencia de desaprobación.

source: NavigationToolbar2QT.parent and .basedir
es_es: NavigationToolbar2QT.parent y .basedir

source: These attributes are deprecated. In order to access the parent window, use ``toolbar.canvas.parent()``. Once the deprecation period is elapsed, it will also be accessible as ``toolbar.parent()``. The base directory to the icons is ``os.path.join(mpl.get_data_path(), "images")``.
es_es: Estos atributos están obsoletos. Para acceder a la ventana padre, use ``toolbar.canvas.parent()``. Una vez transcurrido el período de desaprobación, también será accesible como ``toolbar.parent()``. El directorio base de los iconos es ``os.path.join(mpl.get_data_path(), "images")``.

source: NavigationToolbar2Wx attributes
es_es: Atributos de NavigationToolbar2Wx

source: The ``prevZoomRect``, ``retinaFix``, ``savedRetinaImage``, ``wxoverlay``, ``zoomAxes``, ``zoomStartX``, and ``zoomStartY`` attributes are deprecated.
es_es: Los atributos ``prevZoomRect``, ``retinaFix``, ``savedRetinaImage``, ``wxoverlay``, ``zoomAxes``, ``zoomStartX``, y ``zoomStartY`` son obsoletos.

source: NavigationToolbar2.press and .release
es_es: NavigationToolbar2.press y .release

source: These methods were called when pressing or releasing a mouse button, but *only* when an interactive pan or zoom was occurring (contrary to what the docs stated). They are deprecated; if you write a backend which needs to customize such events, please directly override ``press_pan``/``press_zoom``/``release_pan``/``release_zoom`` instead.
es_es: Estos métodos fueron llamados al presionar o liberar un botón del ratón, pero *sólo* cuando estaba ocurriendo un sartén o zoom interactivo (contrario a lo que los documentos declararon). Están obsoletos; si escribe un backend que necesita personalizar tales eventos, por favor anule directamente ``press_pan``/``press_zoom``/``release_pan``/``release_zoom`` en su lugar.

source: FigureCanvasGTK3._renderer_init
es_es: FigureCanvasGK3._render_init

source: Overriding this method to initialize renderers for GTK3 canvases is deprecated. Instead, the renderer should be initialized in the ``__init__`` method of the subclass (which should call the base-class' ``__init__`` as appropriate). To keep back-compatibility with earlier versions of Matplotlib (which *required* ``_renderer_init`` to be overridden), a fully empty implementation (``def _renderer_init(self): pass``) may be kept and will not trigger the deprecation warning.
es_es: Anular este método para inicializar renderizadores para lienzos GTK3 es obsoleto. En su lugar, el renderizador debe inicializarse en el método ``__init__`` de la subclase (que debería llamar a la clase base-' ``__init__`` según corresponde). Para mantener la compatibilidad con versiones anteriores de Matplotlib (que *requiere* que ``_renderer_init`` sea anulada), una implementación completamente vacía (``def _renderer_init(self): pass``) puede mantenerse y no desencadenará la advertencia de desaprobación.

source: Path helpers in :mod:`.bezier`
es_es: Ayudantes de ruta en :mod:`.bezier`

source: ``bezier.make_path_regular`` is deprecated. Use ``Path.cleaned()`` (or ``Path.cleaned(curves=True)``, etc.) instead (but note that these methods add a ``STOP`` code at the end of the path).
es_es: ``bezier.make_path_regular`` está obsoleto. Utilice ``Path.cleaned()`` (o ``Path.cleaned(curves=True)``, etc.) en su lugar (pero tenga en cuenta que estos métodos agregan un código ``STOP`` al final de la ruta).

source: ``bezier.concatenate_paths`` is deprecated. Use ``Path.make_compound_path()`` instead.
es_es: ``bezier.concatenate_paths`` está obsoleto. Use ``Path.make_compound_path()`` en su lugar.

source: The unused ``animation.html_args`` rcParam and ``animation.HTMLWriter.args_key`` attribute are deprecated.
es_es: El atributo no utilizado ``animation.html_args`` rcParam y ``animation.HTMLWriter.args_key`` son obsoletos.

source: This rcParam, which controlled the use of the preview.sty LaTeX package to align TeX string baselines, is deprecated, as Matplotlib's own dvi parser now computes baselines just as well as preview.sty.
es_es: Este rcParam, que controlaba el uso de la vista previa. ty paquete LaTeX para alinear las líneas de base de cadenas TeX, está obsoleto, ya que el propio analizador dvi de Matplotlib's ahora calcula las líneas de base así como preview.sty.

source: This method is deprecated. Use the ``GridSpec.nrows``, ``GridSpec.ncols``, ``SubplotSpec.rowspan``, and ``SubplotSpec.colspan`` properties instead.
es_es: Este método está obsoleto. Utilice las propiedades ``GridSpec.nrows``, ``GridSpec.ncols``, ``SubplotSpec.rowspan``, y ``SubplotSpec.colspan`` en su lugar.

source: Qt4-based backends
es_es: backends basados en Qt4

source: The qt4agg and qt4cairo backends are deprecated. Qt4 has reached its end-of-life in 2015 and there are no releases for recent versions of Python. Please consider switching to Qt5.
es_es: Los backends qt4agg y qt4cairo están obsoletos. Qt4 ha alcanzado su final de vida en 2015 y no hay lanzamientos para versiones recientes de Python. Por favor considere cambiar a Qt5.

source: *fontdict* and *minor* parameters of `.Axes.set_xticklabels` and `.Axes.set_yticklabels` will become keyword-only
es_es: *fontdict* y *menor* parámetros de `.Axes.set_xticklabels` y `.Axes.set_yticklabels` se convertirán en palabras clave

source: All parameters of `.Figure.subplots` except *nrows* and *ncols* will become keyword-only
es_es: Todos los parámetros de `.Figure.subplots` excepto *nrows* y *ncols* se convertirán en palabra clave

source: This avoids typing e.g. ``subplots(1, 1, 1)`` when meaning ``subplot(1, 1, 1)``, but actually getting ``subplots(1, 1, sharex=1)``.
es_es: Esto evita escribir por ejemplo ``subplots(1, 1, 1)`` cuando significa ``subplot(1, 1, 1)``, pero realmente obtiene ``subplots(1, 1, sharex=1)``.

source: This method is deprecated. Access the ``gc`` attribute directly instead.
es_es: Este método está obsoleto. Accede al atributo ``gc`` directamente en su lugar.

source: *add_all* parameter in ``axes_grid``
es_es: *add_all* parámetro en ``axes_grid``

source: The *add_all* parameter of `.axes_grid1.axes_grid.Grid`, `.axes_grid1.axes_grid.ImageGrid`, `.axes_grid1.axes_rgb.make_rgb_axes` and `.axes_grid1.axes_rgb.RGBAxes` is deprecated. Axes are now always added to the parent figure, though they can be later removed with ``ax.remove()``.
es_es: El parámetro *add_all* de `.axes_grid1.axes_grid.Grid`, `.axes_grid1.axes_grid.ImageGrid`, `.axes_grid1.axes_rgb.make_rgb_axes` y `.axes_grid1. xes_rgb.RGBAxes` está obsoleto. Los ejes ahora siempre se añaden a la figura padre, aunque pueden ser eliminados más tarde con ``ax.remove()``.

source: ``.BboxBase.inverse_transformed`` is deprecated (call `.BboxBase.transformed` on the `~.Transform.inverted()` transform instead).
es_es: ``.BboxBase.inverse_transformed`` está obsoleto (llame `.BboxBase.transformed` en la transformación `~.Transform.inverted()` en su lugar).

source: *orientation* of ``eventplot()`` and `.EventCollection`
es_es: *orientación* de ``eventplot()`` y `.EventCollection`

source: Setting the *orientation* of an ``eventplot()`` or `.EventCollection` to "none" or None is deprecated; set it to "horizontal" instead. Moreover, the two orientations ("horizontal" and "vertical") will become case-sensitive in the future.
es_es: Establecer la *orientación* de un ``eventplot()`` o `.EventCollection` a "ninguno" o Ninguno está obsoleto; establecerlo a "horizontal" en su lugar. Además, las dos orientaciones ("horizontal" y "vertical") serán sensibles a mayúsculas y minúsculas en el futuro.

source: *minor* kwarg to `.Axis.get_ticklocs` will become keyword-only
es_es: *menor* kwarg a `.Axis.get_ticklocs` se convertirá en palabra clave

source: Passing this argument positionally is deprecated.
es_es: Pasar este argumento posicionalmente está obsoleto.

source: Case-insensitive properties
es_es: Propiedades insensibles en mayúsculas

source: Normalization of upper or mixed-case property names to lowercase in `.Artist.set` and `.Artist.update` is deprecated. In the future, property names will be passed as is, allowing one to pass names such as *patchA* or *UVC*.
es_es: La normalización de nombres de propiedades en mayúsculas o minúsculas en `.Artist.set` y `.Artist.update` está obsoleta. En el futuro, los nombres de propiedades serán pasados tal como es, permitiendo que uno pase nombres como *patchA* o *UVC*.

source: These attributes are deprecated in favor of ``ContourSet.axes`` and ``Quiver.axes``, for consistency with other artists.
es_es: Estos atributos están obsoletos a favor de ``ContourSet.axes`` y ``Quiver.axes``, por consistencia con otros artistas.

source: ``Locator.refresh()`` and associated methods
es_es: ``Locator.refresh()`` y métodos asociados

source: ``Locator.refresh()`` is deprecated. This method was called at certain places to let locators update their internal state, typically based on the axis limits. Locators should now always consult the axis limits when called, if needed.
es_es: ``Locator.refresh()`` está obsoleto. Este método fue llamado en ciertos lugares para permitir a los localizadores actualizar su estado interno, normalmente basado en los límites del eje. Los localizadores deberían consultar siempre los límites del eje cuando se llamen, si es necesario.

source: The associated helper methods ``NavigationToolbar2.draw()`` and ``ToolViewsPositions.refresh_locators()`` are deprecated, and should be replaced by calls to ``draw_idle()`` on the corresponding canvas.
es_es: Los métodos auxiliares asociados ``NavigationToolbar2.draw()`` y ``ToolViewsPositions.refresh_locators()`` son obsoletos, y deben ser reemplazados por llamadas a ``draw_idle()`` en el lienzo correspondiente.
