Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.1.0.po
Languages: es_es

source: API Changes for 3.1.0
es_es: Cambios en la API para la versión 3.1.0

source: Behavior changes
es_es: Cambios de comportamiento

source: Switching backends via `matplotlib.use` is now allowed by default, regardless of whether `matplotlib.pyplot` has been imported. If the user tries to switch from an already-started interactive backend to a different interactive backend, an `ImportError` will be raised.
es_es: El cambio de backends a través de `matplotlib.use` ahora está permitido por defecto, independientemente de si `matplotlib.pyplot` ha sido importado. Si el usuario intenta cambiar de un backend interactivo ya iniciado a otro backend interactivo, se levantará un `ImportError`.

source: Invalid points in PathCollections
es_es: Puntos no válidos en PathCollections

source: PathCollections created with `~.Axes.scatter` now keep track of invalid points. Previously, points with nonfinite (infinite or nan) coordinates would not be included in the offsets (as returned by `.PathCollection.get_offsets`) of a `.PathCollection` created by `~.Axes.scatter`, and points with nonfinite values (as specified by the *c* kwarg) would not be included in the array (as returned by `.PathCollection.get_array`)
es_es: Colecciones de rutas creadas con `~.Axes.scatter` ahora llevan un registro de puntos no válidos. Anteriormente, los puntos con coordenadas no finitas (infinitas o nan) no se incluirían en los desplazamientos (como devuelto por `.PathCollection. et_offsets`) de un `.PathCollection` creado por `~.Axes. catter`, y puntos con valores no finitos (como se especifica en *c* kwarg) no se incluirían en la matriz (devuelto por `.PathCollection.get_array`)

source: Such points are now included, but masked out by returning a masked array.
es_es: Estos puntos ahora están incluidos, pero enmascarados devolviendo una matriz enmascarada.

source: If the *plotnonfinite* kwarg to `~.Axes.scatter` is set, then points with nonfinite values are plotted using the bad color of the `.collections.PathCollection`\ 's colormap (as set by :meth:`.colors.Colormap.set_bad`).
es_es: Si el kwarg *plotnonfinite* a `~.Axes.scatter` está definido, entonces los puntos con valores no finitos son trazados usando el color malo del `. mapa de colores de ollections.PathCollection`\ (establecido por :meth:`.colors.Colormap.set_bad`).

source: Alpha blending in imshow of RBGA input
es_es: Mezcla alfa en imshow de entrada RBGA

source: The alpha-channel of RBGA images is now re-sampled independently of RGB channels. While this is a bug fix, it does change the output and may result in some down-stream image comparison tests to fail.
es_es: El canal alfa de imágenes RBGA ahora se muestra de nuevo independientemente de los canales RGB. Si bien esto es una corrección de errores, sí cambia la salida y puede resultar en que algunas pruebas de comparación de imágenes fallen.

source: Autoscaling
es_es: Autoescalado

source: On log-axes where a single value is plotted at a "full" decade (1, 10, 100, etc.), the autoscaling now expands the axis symmetrically around that point, instead of adding a decade only to the right.
es_es: En los ejes del tronco donde un único valor es trazado en una década "completa" (1, 10, 100, etc. , el autoescalado ahora expande el eje de forma simétrica alrededor de ese punto, en lugar de añadir sólo una década a la derecha.

source: Log-scaled axes
es_es: Ejes escalados en el tronco

source: When the default `.LogLocator` would generate no ticks for an axis (e.g., an axis with limits from 0.31 to 0.39) or only a single tick, it now instead falls back on the linear `.AutoLocator` to pick reasonable tick positions.
es_es: Cuando el `.LogLocator` por defecto no generaba ticks para un eje (por ejemplo, un eje con límites de 0.31 a 0. 9) o sólo un solo tick, ahora en su lugar cae en el linear `.AutoLocator` para elegir posiciones razonables de tick.

source: `.Figure.add_subplot` with no arguments
es_es: `.Figure.add_subplot` sin argumentos

source: Calling `.Figure.add_subplot()` with no positional arguments used to do nothing; this now is equivalent to calling ``add_subplot(111)`` instead.
es_es: Llamar a `.Figure.add_subplot()` sin argumentos posicionales usados para no hacer nada; ahora es equivalente a llamar a ``add_subplot(111)`` en su lugar.

source: `~.Axes.bxp` and rcparams
es_es: `~.Axes.bxp` y rcparams

source: `~.Axes.bxp` now respects :rc:`boxplot.boxprops.linewidth` even when *patch_artist* is set. Previously, when the *patch_artist* parameter was set, `~.Axes.bxp` would ignore :rc:`boxplot.boxprops.linewidth`. This was an oversight -- in particular, `~.Axes.boxplot` did not ignore it.
es_es: `~.Axes.bxp` ahora respeta :rc:`boxplot.boxprops.linewidth` incluso cuando *patch_artist* está definido. Anteriormente, cuando se estableció el parámetro *patch_artist*, `~. xes.bxp` ignoraría :rc:`boxplot.boxprops.linewidth`. Esto era un exceso -- en particular, `~.Axes.boxplot` no lo ignoró.

source: Major/minor tick collisions
es_es: Colisiones mayores/menores de ticks

source: Minor ticks that collide with major ticks are now hidden by default. Previously, certain locator classes (`~.ticker.LogLocator`, `~.ticker.AutoMinorLocator`) contained custom logic to avoid emitting tick locations that collided with major ticks when they were used as minor locators. This logic has now moved to the `~.axis.Axis` class, and is used regardless of the locator class. You can control this behavior via the `~.Axis.remove_overlapping_locs` attribute on `~.axis.Axis`.
es_es: Los ticks menores que colisionan con los ticks principales están ahora ocultos por defecto. Anteriormente, ciertas clases de localizador (`~.ticker.LogLocator`, `~.ticker. utoMinorLocator`) contenía lógica personalizada para evitar emitir ubicaciones de ticks que chocaban con los ticks principales cuando se usaban como localizadores menores. Esta lógica se ha movido ahora a la clase `~.axis.Axis` y se utiliza independientemente de la clase de localizador. Puedes controlar este comportamiento a través del atributo `~.Axis.remove_overlapping_locs` en `~.axis.Axis`.

source: If you were relying on both the major and minor tick labels to appear on the same tick, you may need to update your code. For example, the following snippet ::
es_es: Si estabas confiando tanto en las etiquetas de tick importantes como menores para que aparezcan en el mismo tick, tal vez necesites actualizar tu código. Por ejemplo, el siguiente fragmento ::

source: labeled days using major ticks, and hours and minutes using minor ticks and added a newline to the major ticks labels to avoid them crashing into the minor tick labels. Setting the `~.Axis.remove_overlapping_locs` property (also accessible via `~.Axis.set_remove_overlapping_locs` / `~.Axis.get_remove_overlapping_locs` and `~.pyplot.setp`) disables removing overlapping tick locations.
es_es: días etiquetados usando ticks principales, y horas y minutos usando ticks menores y añadió una nueva línea a las etiquetas de ticks principales para evitar que se estrellen en las etiquetas de ticks menores. Estableciendo el `~.Axis. la propiedad emove_overlapping_locs` (también accesible a través de `~.Axis.set_remove_overlapping_locs` / `~.Axis.get_remove_overlapping_locs` y `~.pyplot.setp`) desactiva la eliminación de ubicaciones de tick.

source: The major tick labels could also be adjusted include hours and minutes, as the minor ticks are gone, so the ``major_formatter`` would be::
es_es: Las etiquetas principales de tick también podrían ser ajustadas incluyen horas y minutos, ya que los ticks menores han desaparecido, así que el ``mayor_formatter`` sería::

source: usetex support
es_es: soporte usetex

source: Previously, if :rc:`text.usetex` was True, then constructing a `.TextPath` on a non-mathtext string with ``usetex=False`` would rely on the mathtext parser (but not on usetex support!) to parse the string. The mathtext parser is not invoked anymore, which may cause slight changes in glyph positioning.
es_es: Anteriormente, si :rc:`text.usetex` era Verdadero, entonces construyendo un `. extPath` en una cadena non-mathtext con ``usetex=False`` se basaría en el analizador de mathtext (¡pero no en el soporte de usetex!) para analizar la cadena. El analizador de mathtext ya no es invocado, lo que puede causar ligeros cambios en la posición de los glifos.

source: `.matplotlib.axes.Axes.get_window_extent` used to return a bounding box that was slightly larger than the axes, presumably to take into account the ticks that may be on a spine. However, it was not scaling the tick sizes according to the dpi of the canvas, and it did not check if the ticks were visible, or on the spine.
es_es: `.matplotlib.axes.Ejes. et_window_extent` usado para devolver una caja delimitadora que era ligeramente más grande que los ejes, presumiblemente tener en cuenta las garrapatas que pueden estar en la columna vertebral. Sin embargo, no estaba escalando los tamaños de tick de acuerdo con el dpi del lienzo, y no comprobó si los ticks eran visibles, o en la columna vertebral.

source: Now `.matplotlib.axes.Axes.get_window_extent` just returns the axes extent with no padding for ticks.
es_es: Ahora `.matplotlib.axes.Axes.get_window_extent` sólo devuelve la extensión de los ejes sin relleno para los ticks.

source: This affects `.matplotlib.axes.Axes.get_tightbbox` in cases where there are outward ticks with no tick labels, and it also removes the (small) pad around axes in that case.
es_es: Esto afecta a `.matplotlib.axes.Axes. et_tightbbox` en los casos en que hay marcas externas sin etiquetas de tick, y también elimina la almohadilla (pequeña) alrededor de los ejes en ese caso.

source: `.spines.Spine.get_window_extent` now takes into account ticks that are on the spine.
es_es: `.spines.Spine.get_window_extent` ahora tiene en cuenta ticks que están en la columna vertebral.

source: Previously, `.Sankey.add` would only accept a single string as the *labels* argument if its length is equal to the number of flows, in which case it would use one character of the string for each flow.
es_es: Anteriormente, `.Sankey. dd` sólo aceptaría una sola cadena como argumento de *etiquetas* si su longitud es igual al número de flujos, en cuyo caso usaría un carácter de la cadena para cada flujo.

source: The behavior has been changed to match the documented one: when a single string is passed, it is used to label all the flows.
es_es: El comportamiento ha sido cambiado para que coincida con el documentado: cuando se pasa una sola cadena, se utiliza para etiquetar todos los flujos.

source: `~.font_manager.FontManager` scores
es_es: `~.font_manager.FontManager` anota

source: `.font_manager.FontManager.score_weight` is now more strict with its inputs. Previously, when a weight string was passed to `.font_manager.FontManager.score_weight`,
es_es: `.font_manager.FontManager.score_weight` ahora es más estricto con sus entradas. Anteriormente, cuando una cadena de peso fue pasada a `.font_manager.FontManager.score_weight`,

source: if the weight was the string representation of an integer, it would be converted to that integer,
es_es: si el peso era la representación de cadena de un entero, se convertiría a ese entero,

source: otherwise, if the weight was not a standard weight name, it would be silently replaced by a value of 500 ("normal" weight).
es_es: de otro modo, si el peso no era un nombre de peso estándar, se reemplazaría silenciosamente por un valor de 500 (peso "normal").

source: `.font_manager.FontManager.score_weight` now raises an exception on such inputs.
es_es: `.font_manager.FontManager.score_weight` ahora plantea una excepción en tales entradas.

source: Text alignment
es_es: Alineación de texto

source: Text alignment was previously incorrect, in particular for multiline text objects with large descenders (i.e. subscripts) and rotated text. These have been fixed and made more consistent, but could make old code that has compensated for this no longer have the correct alignment.
es_es: La alineación del texto era anteriormente incorrecta, en particular para objetos de texto multilíneas con grandes descendentes (es decir, suscriptos) y texto rotado. Se han corregido y se han hecho más coherentes, pero podrían hacer el código antiguo que ha compensado esto ya no tiene la alineación correcta.

source: Upper case color strings
es_es: Cadenas de color mayúsculas

source: Support for passing single-letter colors (one of "rgbcmykw") as UPPERCASE characters is deprecated; these colors will become case-sensitive (lowercase) after the deprecation period has passed.
es_es: Soporte para pasar colores de una sola letra (uno de "rgbcmykw") ya que los caracteres UPPERCASE están obsoletos; estos colores serán sensibles a mayúsculas (minúsculas) una vez haya pasado el período de desaprobación.

source: The goal is to decrease the number of ambiguous cases when using the ``data`` keyword to plotting methods; e.g. ``plot("X", "Y", data={"X": ..., "Y": ...})`` will not warn about "Y" possibly being a color anymore after the deprecation period has passed.
es_es: El objetivo es disminuir el número de casos ambiguos cuando se usa la palabra clave ``data`` para trazar métodos; por ejemplo, ``plot("X", "Y", data={"X": . ., "Y": ...})`` no avisará de que "Y" posiblemente sea un color después de que haya pasado el período de desaprobación.

source: Degenerate limits
es_es: Límites de degeneración

source: When bounds passed to `~.axes.Axes.set_xlim` are degenerate (i.e. the lower and upper value are equal), the method used to "expand" the bounds now matches the expansion behavior of autoscaling when the plot contains a single x-value, and should in particular produce nicer limits for non-linear scales.
es_es: Cuando los límites pasados a `~.axes.Axes.set_xlim` son degenerados (i.e. el valor inferior y superior son iguales), el método utilizado para "expandir" los límites ahora coincide con el comportamiento de expansión de la autoescalado cuando la trama contiene un valor x único, y, en particular, debería producir límites más bonitos para las escamas no lineales.

source: `~.Axes.plot` format string parsing
es_es: `~.Axes.plot` formato de análisis de cadena

source: In certain cases, `~.Axes.plot` would previously accept format strings specifying more than one linestyle (e.g. ``"---."`` which specifies both ``"--"`` and ``"-."``); only use one of them would be used. This now raises a `ValueError` instead.
es_es: En ciertos casos, `~.Axes.plot` aceptaba previamente cadenas de formato especificando más de un estilo de línea (por ejemplo, ``"---. `` que especifica tanto ``"--"`` como ``"-."``); solo usar uno de ellos sería usado. Esto ahora plantea un `ValueError` en su lugar.

source: HTMLWriter
es_es: Escritor HTML

source: The HTMLWriter constructor is more strict: it no longer normalizes unknown values of *default_mode* to 'loop', but errors out instead.
es_es: El constructor HTMLWriter es más estricto: ya no normaliza valores desconocidos de *default_mode* a 'loop', sino errores en su lugar.

source: In accordance with the AFM spec, the AFM parser no longer truncates the ``UnderlinePosition`` and ``UnderlineThickness`` fields to integers.
es_es: De acuerdo con la especificación AFM, el analizador AFM ya no trunca los campos ``UnderlinePosition`` y ``UnderlineThickness`` a enteros.

source: The ``Notice`` field (which can only be publicly accessed by the deprecated ``afm.parse_afm`` API) is no longer decoded to a `str`, but instead kept as `bytes`, to support non-conformant AFM files that use non-ASCII characters in that field.
es_es: El campo ``Notice`` (que sólo puede ser accesible públicamente por el ``afm obsoleto'. la API arse_afm`` ya no está decodificada a una `str`, sino que se mantiene como `bytes`, para soportar ficheros AFM no conformes que usen caracteres no ASCII en ese campo.

source: `.Artist.set` keyword normalisation
es_es: normalización de la palabra clave `.Artist.set`

source: `.Artist.set` now normalizes keywords before sorting them. Previously it sorted its keyword arguments in reverse alphabetical order (with a special-case to put ``color`` at the end) before applying them.
es_es: `.Artist.set` ahora normaliza las palabras clave antes de ordenarlas. Anteriormente, ordenó sus argumentos de palabras clave en orden alfabético inverso (con un caso especial para poner ``color`` al final) antes de aplicarlos.

source: It now normalizes aliases (and, as above, emits a warning on duplicate properties) before doing the sorting (so ``c`` goes to the end too).
es_es: Ahora normaliza los alias (y, como arriba, emite una advertencia sobre las propiedades duplicadas) antes de hacer la clasificación (así que ``c`` también va al final).

source: `.Axes.tick_params` argument checking
es_es: Comprobación de argumento `.Axes.tick_params`

source: Previously `.Axes.tick_params` silently did nothing when an invalid *axis* parameter was supplied. This behavior has been changed to raise a `ValueError` instead.
es_es: Anteriormente `.Axes.tick_params` no hizo nada cuando se proporcionó un parámetro *axis* inválido. Este comportamiento se ha cambiado para elevar un `ValueError` en su lugar.

source: `.Axes.hist` output
es_es: `.Ejes. salida de Axes

source: Input that consists of multiple empty lists will now return a list of histogram values for each one of the lists. For example, an input of ``[[],[]]`` will return 2 lists of histogram values. Previously, a single list was returned.
es_es: La entrada que consiste en múltiples listas vacías devolverá ahora una lista de valores de histogramas para cada una de las listas. Por ejemplo, una entrada de ``[[],[]]`` devolverá 2 listas de histogramas. Anteriormente, una sola lista fue devuelta.

source: ``backend_bases.TimerBase.remove_callback`` future signature change
es_es: ``backend_bases.TimerBase.remove_callback`` cambio de firma futura

source: Currently, ``backend_bases.TimerBase.remove_callback(func, *args, **kwargs)`` removes a callback previously added by ``backend_bases.Timer.add_callback(func, *args, **kwargs)``, but if ``*args, **kwargs`` is not passed in (i.e., ``TimerBase.remove_callback(func)``), then the first callback with a matching ``func`` is removed, regardless of whether it was added with or without ``*args, **kwargs``.
es_es: Actualmente, ``backend_bases.TimerBase.remove_callback(func, *args, **kwargs)`` elimina un callback previamente agregado por ``backend_bases.Timer.add_callback(func, *args, **kwargs)``, pero si ``*args, **kwargs`` no es pasado (i. ., ``TimerBase.remove_callback(func)``), luego se elimina el primer callback con un ``func`` coincidente, independientemente de si fue agregado con o sin ``*args, **kwargs``.

source: In a future version, `.TimerBase.remove_callback` will always use the latter behavior (not consider ``*args, **kwargs``); to specifically consider them, add the callback as a `functools.partial` object ::
es_es: En una versión futura, `.TimerBase. emove_callback` siempre usará este último comportamiento (no considera ``*args, **kwargs``); para considerarlos específicamente, agregue el callback como un objeto `functools.partial` ::

source: `.TimerBase.add_callback` was modified to return *func* to simplify the above usage (previously it returned None); this also allows using it as a decorator.
es_es: `.TimerBase.add_callback` fue modificado para devolver *func* para simplificar el uso anterior (anteriormente devolvió ninguno); esto también permite usarlo como decorador.

source: The new API is modelled after `atexit.register` / `atexit.unregister`.
es_es: La nueva API está modelada después de `atexit.register` / `atexit.unregister`.

source: `~.container.StemContainer` performance increase
es_es: `~.container.StemContainer` aumento de rendimiento

source: `~.container.StemContainer` objects can now store a `~.collections.LineCollection` object instead of a list of `~.lines.Line2D` objects for stem lines plotted using `~.Axes.stem`. This gives a very large performance boost to displaying and moving `~.Axes.stem` plots.
es_es: Los objetos `~.container.StemContainer` ahora pueden almacenar un objeto `~.collections.LineCollection` en lugar de una lista de `~.lines. Objetos ine2D` para líneas de tallo trazadas usando `~.Axes.stem`. Esto da un gran incremento de rendimiento para mostrar y mover parcelas `~.Axes.stem`.

source: This will become the default behaviour in Matplotlib 3.3. To use it now, the *use_line_collection* keyword argument to `~.Axes.stem` can be set to `True` ::
es_es: Este será el comportamiento predeterminado en Matplotlib 3.3. Para usarlo ahora, el argumento de palabra clave *use_line_collection* a `~.Axes.stem` puede establecerse en `True` ::

source: Individual line segments can be extracted from the `~.collections.LineCollection` using `~.collections.LineCollection.get_segments()`. See the `~.collections.LineCollection` documentation for other methods to retrieve the collection properties.
es_es: Los segmentos de línea individuales pueden extraerse de `~.collections.LineCollection` usando `~.collections.LineCollection.get_segments()`. Vea la documentación `~.collections.LineCollection` para otros métodos para recuperar las propiedades de la colección.

source: `~matplotlib.colorbar.ColorbarBase` inheritance
es_es: herencia `~matplotlib.colorbar.ColorbarBase`

source: `matplotlib.colorbar.ColorbarBase` is no longer a subclass of `.cm.ScalarMappable`. This inheritance lead to a confusing situation where the `.cm.ScalarMappable` passed to `matplotlib.colorbar.Colorbar` (`~.Figure.colorbar`) had a ``set_norm`` method, as did the colorbar. The colorbar is now purely a follower to the `.ScalarMappable` norm and colormap, and the old inherited methods `~matplotlib.colorbar.ColorbarBase.set_norm`, `~matplotlib.colorbar.ColorbarBase.set_cmap`, `~matplotlib.colorbar.ColorbarBase.set_clim` are deprecated, as are the getter versions of those calls. To set the norm associated with a colorbar do ``colorbar.mappable.set_norm()`` etc.
es_es: `matplotlib.colorbar.ColorbarBase` ya no es una subclase de `.cm.ScalarMappable`. Esta herencia lleva a una situación confusa donde el `.cm. calarMappable` pasó a `matplotlib.colorbar.Colorbar` (`~.Figure.colorbar`) tenía un método ``set_norm``, al igual que la barra de colores. calarMappable` norm and colormap, and the old inherited methods `~matplotlib.colorbar.ColorbarBase.set_norm`, `~matplotlib.colorbar.ColorbarBase.set_cmap`, `~matplotlib. olorbar.ColorbarBase.set_clim` son obsoletas, al igual que las versiones getter de esas llamadas. Para establecer la norma asociada con una barra de colores hacer ``colorbar.mappable.set_norm()`` etc.

source: FreeType and libpng search paths
es_es: Rutas de búsqueda de FreeType y libpng

source: The ``MPLBASEDIRLIST`` environment variables and ``basedirlist`` entry in ``setup.cfg`` have no effect anymore. Instead, if building in situations where FreeType or libpng are not in the compiler or linker's default path, set the standard environment variables ``CFLAGS``/``LDFLAGS`` on Linux or OSX, or ``CL``/``LINK`` on Windows, to indicate the relevant paths.
es_es: Las variables de entorno ``MPLBASEDIRLIST`` y la entrada ``basedirlist`` en ``setup.cfg`` ya no tienen efecto. En su lugar, si la construcción en situaciones donde FreeType o libpng no están en el compilador o la ruta predeterminada del enlazador, establecer las variables de entorno estándar ``CFLAGS``/``LDFLAGS`` en Linux o OSX, o ``CL``/``LINK`` en Windows, para indicar las rutas relevantes.

source: See details in :doc:`/users/installing/index`.
es_es: Ver detalles en :doc:`/users/installing/index`.

source: Setting artist properties twice or more in the same call
es_es: Configurar propiedades del artista dos o más en la misma llamada
