Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_0.98.0.po
Languages: es_es

source: Changes for 0.98.0
es_es: Cambios para 0.98.0

source: :func:`matplotlib.image.imread` now no longer always returns RGBA data---if the image is luminance or RGB, it will return a MxN or MxNx3 array if possible. Also uint8 is no longer always forced to float.
es_es: :func:`matplotlib.imagen. mread` ahora ya no siempre devuelve datos RGBA ---si la imagen es luminancia o RGB, devolverá una matriz MxN o MxNx3 si es posible. También uint8 ya no siempre se ve obligado a flotar.

source: Rewrote the :class:`matplotlib.cm.ScalarMappable` callback infrastructure to use :class:`matplotlib.cbook.CallbackRegistry` rather than custom callback handling. Any users of ``matplotlib.cm.ScalarMappable.add_observer`` of the :class:`~matplotlib.cm.ScalarMappable` should use the :attr:`matplotlib.cm.ScalarMappable.callbacksSM` :class:`~matplotlib.cbook.CallbackRegistry` instead.
es_es: Reescribió la infraestructura de devolución de llamada :class:`matplotlib.cm.ScalarMappable` para usar :class:`matplotlib.cbook.CallbackRegistry` en lugar de la gestión de callback personalizada. Cualquier usuario de ``matplotlib.cm. calarMappable.add_observer`` del :class:`~matplotlib.cm.ScalarMappable` debería usar el :attr:`matplotlib.cm.ScalarMappable.callbacksSM` :class:`~matplotlib.cbook.CallbackRegistry` en su lugar.

source: New axes function and Axes method provide control over the plot color cycle: ``matplotlib.axes.set_default_color_cycle`` and ``matplotlib.axes.Axes.set_color_cycle``.
es_es: La función de ejes nuevos y el método de ejes proporcionan control sobre el ciclo de color de la parcela: ``matplotlib.axes.set_default_color_cycle`` y ``matplotlib.axes.Axes.set_color_cycle``.

source: Matplotlib now requires Python 2.4, so :mod:`matplotlib.cbook` will no longer provide :class:`set`, :func:`enumerate`, :func:`reversed` or ``izip`` compatibility functions.
es_es: Matplotlib ahora requiere Python 2.4, así que :mod:`matplotlib.cbook` ya no proporcionará las funciones de compatibilidad :class:`set`, :func:`enumerate`, :func:`reversed` o ``izip``.

source: In Numpy 1.0, bins are specified by the left edges only. The axes method :meth:`matplotlib.axes.Axes.hist` now uses future Numpy 1.3 semantics for histograms. Providing ``binedges``, the last value gives the upper-right edge now, which was implicitly set to +infinity in Numpy 1.0. This also means that the last bin doesn't contain upper outliers any more by default.
es_es: En Numpy 1.0, las papeleras son especificadas únicamente por los bordes izquierdos. El método :meth:`matplotlib. xes.Axes.First` ahora usa la semántica numérica futura 1.3 para los histogramas. Proporcionando ``binedges``, el último valor da el borde superior derecho ahora, que fue establecido implícitamente a +infinity en Numpy 1. Esto también significa que la última papelera ya no contiene más atípicos superiores por defecto.

source: New axes method and pyplot function, :func:`~matplotlib.pyplot.hexbin`, is an alternative to :func:`~matplotlib.pyplot.scatter` for large datasets. It makes something like a :func:`~matplotlib.pyplot.pcolor` of a 2-D histogram, but uses hexagonal bins.
es_es: Nuevo método de ejes y función pyplot, :func:`~matplotlib.pyplot.hexbin`, es una alternativa a :func:`~matplotlib.pyplot. catter` para conjuntos de datos grandes. Hace algo como un :func:`~matplotlib.pyplot.pcolor` de un histograma 2-D, pero usa papeles hexagonales.

source: New kwarg, ``symmetric``, in :class:`matplotlib.ticker.MaxNLocator` allows one require an axis to be centered around zero.
es_es: Nuevo kwarg, ``simétrico``, en :class:`matplotlib.ticker.MaxNLocator` permite que uno requiera un eje centrado en cero.

source: Toolkits must now be imported from ``mpl_toolkits`` (not ``matplotlib.toolkits``)
es_es: Los kits de herramientas ahora deben importarse de ``mpl_toolkits`` (no ``matplotlib.toolkits``)

source: Notes about the transforms refactoring
es_es: Notas sobre la refactorización de las transformaciones

source: A major new feature of the 0.98 series is a more flexible and extensible transformation infrastructure, written in Python/Numpy rather than a custom C extension.
es_es: Una nueva característica importante de la serie 0.98 es una infraestructura de transformación más flexible y extensible, escrita en Python/Numpy en lugar de una extensión de C personalizada.

source: The primary goal of this refactoring was to make it easier to extend matplotlib to support new kinds of projections. This is mostly an internal improvement, and the possible user-visible changes it allows are yet to come.
es_es: El objetivo principal de esta refactorización era facilitar la extensión de matplotlib para apoyar nuevos tipos de proyecciones. Esto es principalmente una mejora interna, y los posibles cambios visibles por el usuario que permite todavía están por venir.

source: See :mod:`matplotlib.transforms` for a description of the design of the new transformation framework.
es_es: Vea :mod:`matplotlib.transforms` para una descripción del diseño del nuevo framework de transformación.

source: For efficiency, many of these functions return views into Numpy arrays. This means that if you hold on to a reference to them, their contents may change. If you want to store a snapshot of their current values, use the Numpy array method copy().
es_es: Para la eficiencia, muchas de estas funciones devuelven vistas a matrices Numpy. Esto significa que si usted mantiene una referencia a ellos, su contenido puede cambiar. Si desea almacenar una instantánea de sus valores actuales, utilice el método Numpy copy().

source: The view intervals are now stored only in one place -- in the :class:`matplotlib.axes.Axes` instance, not in the locator instances as well. This means locators must get their limits from their :class:`matplotlib.axis.Axis`, which in turn looks up its limits from the :class:`~matplotlib.axes.Axes`. If a locator is used temporarily and not assigned to an Axis or Axes, (e.g., in :mod:`matplotlib.contour`), a dummy axis must be created to store its bounds. Call :meth:`matplotlib.ticker.TickHelper.create_dummy_axis` to do so.
es_es: Los intervalos de las vistas ahora solo se almacenan en un lugar -- en la instancia de :class:`matplotlib.axes.Axes`, no en las instancias del localizador también. Esto significa que los localizadores deben obtener sus límites de su :class:`matplotlib.axis.Axis`, que a su vez mira sus límites desde el :class:`~matplotlib. xes.Axes`. Si un localizador se utiliza temporalmente y no se asigna a un eje o ejes, (por ejemplo, en :mod:`matplotlib. ontour`), se debe crear un eje falso para almacenar sus límites. Llame a :meth:`matplotlib.ticker.TickHelper.create_dummy_axis` para hacerlo.

source: The functionality of ``Pbox`` has been merged with :class:`~matplotlib.transforms.Bbox`. Its methods now all return copies rather than modifying in place.
es_es: La funcionalidad de ``Pbox`` se ha fusionado con :class:`~matplotlib.transforms.Bbox`. Ahora todos sus métodos retornan copias en lugar de modificarlas.

source: The following lists many of the simple changes necessary to update code from the old transformation framework to the new one. In particular, methods that return a copy are named with a verb in the past tense, whereas methods that alter an object in place are named with a verb in the present tense.
es_es: A continuación se listan muchos de los cambios simples necesarios para actualizar el código desde el viejo marco de transformación hasta el nuevo. En particular, los métodos que retornan una copia son nombrados con un verbo en el pasado, mientras que los métodos que alteran un objeto en su lugar son nombrados con un verbo en el presente tenso.

source: Old method
es_es: Método antiguo

source: New method
es_es: Nuevo método

source: ``Bbox.get_bounds``
es_es: ``Bbox.get_límites``

source: :attr:`.transforms.Bbox.bounds`
es_es: :attr:`.transforms.Bbox.límites`

source: :attr:`.transforms.Bbox.intervalx` [It is now a property.]
es_es: :attr:`.transforms.Bbox.intervalx` [Ahora es una propiedad.]

source: :attr:`.transforms.Bbox.intervaly` [It is now a property.]
es_es: :attr:`.transforms.Bbox.intervaly` [Ahora es una propiedad.]

source: :attr:`.transforms.Bbox.x0` or :attr:`transforms.Bbox.xmin <.transforms.BboxBase.xmin>` [1]_
es_es: :attr:`.transforms.Bbox.x0` o :attr:`transforms.Bbox.xmin <.transforms.BboxBase.xmin>` [1]_

source: :attr:`.transforms.Bbox.y0` or :attr:`transforms.Bbox.ymin <.transforms.BboxBase.ymin>` [1]_
es_es: :attr:`.transforms.Bbox.y0` o :attr:`transforms.Bbox.ymin <.transforms.BboxBase.ymin>` [1]_

source: :attr:`.transforms.Bbox.x1` or :attr:`transforms.Bbox.xmax <.transforms.BboxBase.xmax>` [1]_
es_es: :attr:`.transforms.Bbox.x1` o :attr:`transforms.Bbox.xmax <.transforms.BboxBase.xmax>` [1]_

source: :attr:`.transforms.Bbox.y1` or :attr:`transforms.Bbox.ymax <.transforms.BboxBase.ymax>` [1]_
es_es: :attr:`.transforms.Bbox.y1` o :attr:`transforms.Bbox.ymax <.transforms.BboxBase.ymax>` [1]_

source: `Bbox.union(bboxes) <.BboxBase.union>` [It is a staticmethod.]
es_es: `Bbox.union(bboxes) <.BboxBase.union>` [Es un método estático.]

source: `Bbox.from_bounds(x0, y0, w, h) <.Bbox.from_bounds>` [It is a staticmethod.]
es_es: `Bbox.from_bounds(x0, y0, w, h) <.Bbox.from_bounds>` [Es un método estático.]

source: `interval_contains_open(tuple, v) <.interval_contains_open>`
es_es: `interval_contains_open(tupla, v) <.interval_contains_open>`

source: ``identity_transform()``
es_es: ``identidad_transform()``

source: ``scale_transform(xs, ys)``
es_es: ``escala_transform(xs, ys)``

source: ``Transform.seq_xy_tup(points)``
es_es: ``Transform.seq_xy_tup(puntos)``

source: `Transform.transform(points) <.Transform.transform>`
es_es: `Transform.transform(puntos) <.Transform.transform>`

source: ``Transform.inverse_xy_tup(points)``
es_es: ``Transform.inverse_xy_tup(puntos)``

source: `Transform.inverted() <.Transform.inverted>`.transform(points)
es_es: `Transform.inverted() <.Transform.inverted>`.transform(puntos)

source: The :class:`~matplotlib.transforms.Bbox` is bound by the points (x0, y0) to (x1, y1) and there is no defined order to these points, that is, x0 is not necessarily the left edge of the box. To get the left edge of the :class:`.Bbox`, use the read-only property :attr:`xmin <matplotlib.transforms.BboxBase.xmin>`.
es_es: El :class:`~matplotlib.transforms. box` está vinculado por los puntos (x0, y0) a (x1, y1) y no hay orden definido para estos puntos, es decir, x0 no es necesariamente el borde izquierdo de la caja. Para obtener el borde izquierdo del :class:`.Bbox`, utiliza la propiedad de solo lectura :attr:`xmin <matplotlib.transforms.BboxBase.xmin>`.

source: ``Axes.get_position()``
es_es: ``Ejes.get_position()``

source: ``Axes.set_position()``
es_es: ``Ejes.set_position()``

source: ``Axes.toggle_log_lineary()``
es_es: ``Ejes.toggle_log_lineal()``

source: removed
es_es: eliminado

source: The ``Polar`` class has moved to :mod:`matplotlib.projections.polar`.
es_es: La clase ``Polar`` se ha movido a :mod:`matplotlib.projections.polar`.

source: :meth:`matplotlib.axes.Axes.get_position` used to return a list of points, now it returns a :class:`matplotlib.transforms.Bbox` instance.
es_es: :meth:`matplotlib.axes.Axes.get_position` usado para devolver una lista de puntos, ahora devuelve una instancia de :class:`matplotlib.transforms.Bbox`.

source: :meth:`matplotlib.axes.Axes.set_position` now accepts either four scalars or a :class:`matplotlib.transforms.Bbox` instance.
es_es: :meth:`matplotlib.axes.Axes.set_position` ahora acepta cuatro escalares o una instancia de :class:`matplotlib.transforms.Bbox`.

source: Since the recfactoring allows for more than two scale types ('log' or 'linear'), it no longer makes sense to have a toggle. ``Axes.toggle_log_lineary()`` has been removed.
es_es: Dado que la refactorización permite más de dos tipos de escala ('log' o 'lineal'), ya no tiene sentido tener un interruptor. ``Axes.toggle_log_lineary()`` ha sido eliminado.

source: ``Artist.set_clip_path(path, transform)`` [5]_
es_es: ``Artist.set_clip_path(ruta, transform)`` [5]_

source: :meth:`matplotlib.artist.Artist.set_clip_path` now accepts a :class:`matplotlib.path.Path` instance and a :class:`matplotlib.transforms.Transform` that will be applied to the path immediately before clipping.
es_es: :meth:`matplotlib.artist.Artist.set_clip_path` ahora acepta una instancia de :class:`matplotlib.path.Path` y una :class:`matplotlib.transforms.Transform` que será aplicada a la ruta inmediatamente antes del recorte.

source: *linestyle*
es_es: *estilo de línea*

source: Linestyles are now treated like all other collection attributes, i.e. a single value or multiple values may be provided.
es_es: Los estilos de línea ahora son tratados como todos los demás atributos de la colección, es decir, un único valor o múltiples valores pueden ser proporcionados.

source: ``colors.to_rgba_array(c)`` [:meth:`matplotlib.colors.to_rgba_array` returns an Nx4 NumPy array of RGBA color quadruples.]
es_es: ``colors.to_rgba_array(c)`` [:meth:`matplotlib.colors.to_rgba_array` devuelve un arreglo numérico Nx4 de cuadruplicas de color RGBA.]

source: ``matplotlib.contour.Contour.get_paths`` [Returns a list of :class:`matplotlib.path.Path` instances.]
es_es: ``matplotlib.contour.Contour.get_paths`` [Devuelve una lista de las instancias :class:`matplotlib.path.Path`.]

source: :attr:`matplotlib.figure.Figure.dpi` *(a property)*
es_es: :attr:`matplotlib.figure.Figure.dpi` *(una propiedad)*

source: ``Patch.get_verts()``
es_es: ``Parch.get_verts()``

source: :meth:`matplotlib.patches.Patch.get_path` [Returns a :class:`matplotlib.path.Path` instance]
es_es: :meth:`matplotlib.patches.Patch.get_path` [Devuelve una instancia de :class:`matplotlib.path.Path`

source: ``GraphicsContext.set_clip_rectangle(tuple)``
es_es: ``GráficosContext.set_clip_rectángulo(tuple)``

source: ``GraphicsContext.get_clip_path()``
es_es: ``GráficosContext.get_clip_path()``

source: :meth:`matplotlib.backend_bases.GraphicsContextBase.get_clip_path` returns a tuple of the form (*path*, *affine_transform*), where *path* is a :class:`matplotlib.path.Path` instance and *affine_transform* is a :class:`matplotlib.transforms.Affine2D` instance.
es_es: :meth:`matplotlib.backend_bases.GraphicsContextBase.get_clip_path` devuelve una tupla de la forma (*ruta*, *affine_transform*), donde *ruta* es una instancia de :class:`matplotlib.path.Path` y *affine_transform* es una instancia de :class:`matplotlib.transforms.Affine2D`.

source: :meth:`matplotlib.backend_bases.GraphicsContextBase.set_clip_path` now only accepts a :class:`matplotlib.transforms.TransformedPath` instance.
es_es: :meth:`matplotlib.backend_bases.GraphicsContextBase.set_clip_path` ahora solo acepta una instancia de :class:`matplotlib.transformedPath`.

source: New methods:
es_es: Nuevos métodos:

source: :meth:`draw_path(self, gc, path, transform, rgbFace) <matplotlib.backend_bases.RendererBase.draw_path>`
es_es: :meth:`draw_path(self, gc, ruta, transformación, rgbFace) <matplotlib.backend_bases.RendererBase.draw_path>`

source: :meth:`draw_markers(self, gc, marker_path, marker_trans, path, trans, rgbFace) <matplotlib.backend_bases.RendererBase.draw_markers>`
es_es: :meth:`draw_markers(self, gc, marker_path, marker_trans, ruta, trans, rgbFace) <matplotlib.backend_bases.RendererBase.draw_markers>`

source: :meth:`draw_path_collection(self, master_transform, cliprect, clippath, clippath_trans, paths, all_transforms, offsets, offsetTrans, facecolors, edgecolors, linewidths, linestyles, antialiaseds) <matplotlib.backend_bases.RendererBase.draw_path_collection>` *[optional]*
es_es: :meth:`draw_path_collection(self, master_transform, cliprect, clippath, clippath_trans, paths, all_transforms, offsets, offsets, offsetTrans, facecolors, edgecolors, linewidths, linestyles, antialiaseds) <matplotlib.backend_bases.RendererBase.draw_path_collection>` *[optional]*

source: Changed methods:
es_es: Métodos modificados:

source: ``draw_image(self, x, y, im, bbox)`` is now :meth:`draw_image(self, x, y, im, bbox, clippath, clippath_trans) <matplotlib.backend_bases.RendererBase.draw_image>`
es_es: ``draw_image(self, x, y, im, bbox)`` es ahora :meth:`draw_image(self, x, y, im, bbox, clippath, clippath_trans) <matplotlib.backend_bases.RendererBase.draw_image>`

source: Removed methods:
es_es: Métodos eliminados:

source: ``draw_arc``
es_es: ``dibujar_arco``

source: ``draw_line_collection``
es_es: ``dibujar línea_colección``

source: ``draw_line``
es_es: ``dibujar_línea``

source: ``draw_lines``
es_es: ``dibujar_líneas``

source: ``draw_point``
es_es: ``punto de dibujo``

source: ``draw_quad_mesh``
es_es: ``dibujar_mesa_cuadrada``

source: ``draw_poly_collection``
es_es: ``dibujar_colección``

source: ``draw_polygon``
es_es: ``dibujar_polígón``

source: ``draw_rectangle``
es_es: ``dibujar rectángulo``

source: ``draw_regpoly_collection``
es_es: ``dibujar_colección_regpoly``
