Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_2.2.0.po
Languages: es_es

source: API Changes in 2.2.0
es_es: Cambios de API en 2.2.0

source: New dependency
es_es: Nueva dependencia

source: `kiwisolver <https://github.com/nucleic/kiwi>`__ is now a required dependency to support the new constrained_layout, see :doc:`/tutorials/intermediate/constrainedlayout_guide` for more details.
es_es: `kiwisolver <https://github.com/nucleic/kiwi>`__ es ahora una dependencia necesaria para soportar el nuevo diseño restringido, vea :doc:`/tutorials/intermediate/constrainedlayout_guide` para más detalles.

source: Deprecations
es_es: Obsolescencias

source: Classes, functions, and methods
es_es: Clases, funciones y métodos

source: The unused and untested ``Artist.onRemove`` and ``Artist.hitlist`` methods have been deprecated.
es_es: Los métodos ``Artist.onRemove`` y ``Artist.hitlist`` no utilizados y no probados han sido obsoletos.

source: The now unused ``mlab.less_simple_linear_interpolation`` function is deprecated.
es_es: La función ``mlab.less_simple_linear_interpolation`` ahora no utilizada está obsoleta.

source: The unused ``ContourLabeler.get_real_label_width`` method is deprecated.
es_es: El método no utilizado ``ContourLabeler.get_real_label_width`` está obsoleto.

source: The unused ``FigureManagerBase.show_popup`` method is deprecated. This introduced in e945059b327d42a99938b939a1be867fa023e7ba in 2005 but never built out into any of the backends.
es_es: El método sin usar ``FigureManagerBase.show_popup`` está obsoleto. Esto se introdujo en e945059b327d42a99938b939a1be867fa023e7ba en 2005 pero nunca se incorporó en ninguno de los backends.

source: ``backend_tkagg.AxisMenu`` is deprecated, as it has become unused since the removal of "classic" toolbars.
es_es: ``backend_tkagg.AxisMenu`` está obsoleto, ya que no se ha utilizado desde la eliminación de barras de herramientas "clásicas".

source: Changed function signatures
es_es: Firmas de función cambiadas

source: kwarg ``fig`` to `.GridSpec.get_subplot_params` is deprecated, use ``figure`` instead.
es_es: kwarg ``fig`` a `.GridSpec.get_subplot_params` está obsoleto, use ``figure`` en su lugar.

source: Using `.pyplot.axes` with an `~matplotlib.axes.Axes` as argument is deprecated. This sets the current axes, i.e. it has the same effect as `.pyplot.sca`. For clarity ``plt.sca(ax)`` should be preferred over ``plt.axes(ax)``.
es_es: Usando `.pyplot.axes` con un `~matplotlib.axes.Axes` como argumento es obsoleto. Esto establece los ejes actuales, p.e. tiene el mismo efecto que `.pyplot.sca`. Para mayor claridad ``plt.sca(ax)`` debe ser preferido sobre ``plt.axes(ax)``.

source: Using strings instead of booleans to control grid and tick visibility is deprecated. Using ``"on"``, ``"off"``, ``"true"``, or ``"false"`` to control grid and tick visibility has been deprecated. Instead, use normal booleans (``True``/``False``) or boolean-likes. In the future, all non-empty strings may be interpreted as ``True``.
es_es: El uso de cadenas en lugar de booleanos para controlar la cuadrícula y la visibilidad de ticks está obsoleto. El uso de ``"on"``, ``"off"``, ``"true"``, o ``"false"`` para controlar la cuadrícula y la visibilidad de ticks ha sido obsoleto. En cambio, utilice booleans normales (``True``/``False``) o "likes" booleanos. En el futuro, todas las cadenas no vacías pueden ser interpretadas como ``True``.

source: When given 2D inputs with non-matching numbers of columns, `~.pyplot.plot` currently cycles through the columns of the narrower input, until all the columns of the wider input have been plotted. This behavior is deprecated; in the future, only broadcasting (1 column to *n* columns) will be performed.
es_es: Cuando se dan entradas 2D con números no coincidentes de columnas, `~.pyplot. lot` actualmente cicla a través de las columnas de la entrada más estrecha, hasta que todas las columnas de la entrada más ancha hayan sido trazadas. Este comportamiento está obsoleto; en el futuro, sólo se realizará la transmisión (una columna a *n* columnas).

source: The :rc:`backend.qt4` and :rc:`backend.qt5` rcParams were deprecated in version 2.2. In order to force the use of a specific Qt binding, either import that binding first, or set the ``QT_API`` environment variable.
es_es: Los :rc:`backend.qt4` y :rc:`backend.qt5` rcParams fueron desaprobados en la versión 2.2. Para forzar el uso de un enlace Qt específico, importar primero ese enlace, o establecer la variable de entorno ``QT_API``.

source: Deprecation of the ``nbagg.transparent`` rcParam. To control transparency of figure patches in the nbagg (or any other) backend, directly set ``figure.patch.facecolor``, or the ``figure.facecolor`` rcParam.
es_es: Deprecación del rcParam ``Textagg.transparent``. Para controlar la transparencia de los parches de figuras en el tutorial (o cualquier otro), establece directamente ``figure.patch.facecolor``, o el rcParam ``figure.facecolor``.

source: Deprecated ``Axis.unit_data``
es_es: Obsoleto ``Axis.unit_data``

source: Use `.Axis.units` (which has long existed) instead.
es_es: En su lugar, usa `.Axis.units` (que existe desde hace tiempo).

source: Removals
es_es: Eliminar

source: Function Signatures
es_es: Firmas de la función

source: Contouring no longer supports ``legacy`` corner masking. The deprecated ``ContourSet.vmin`` and ``ContourSet.vmax`` properties have been removed.
es_es: La conversión ya no soporta la máscara de esquina ``legacy``. Las propiedades obsoletas ``ContourSet.vmin`` y ``ContourSet.vmax`` han sido eliminadas.

source: Passing ``None`` instead of ``"none"`` as format to `~.Axes.errorbar` is no longer supported.
es_es: Pasar ``Ninguno`` en lugar de ``"ninguno"`` como formato a `~.Axes.errorbar` ya no es compatible.

source: The ``bgcolor`` keyword argument to ``Axes`` has been removed.
es_es: El argumento de palabra clave ``bgcolor`` para ``Ejes`` ha sido removido.

source: Modules, methods, and functions
es_es: Módulos, métodos y funciones

source: The ``matplotlib.finance``, ``mpl_toolkits.exceltools`` and ``mpl_toolkits.gtktools`` modules have been removed. ``matplotlib.finance`` remains available at https://github.com/matplotlib/mpl_finance.
es_es: Los módulos ``matplotlib.finance``, ``mpl_toolkits.exceltools`` y ``mpl_toolkits.gtktools`` han sido removidos. ``matplotlib.finance`` permanece disponible en https://github.com/matplotlib/mpl_finance.

source: The ``mpl_toolkits.mplot3d.art3d.iscolor`` function has been removed.
es_es: La función ``mpl_toolkits.mplot3d.art3d.iscolor`` ha sido eliminada.

source: The ``Axes.get_axis_bgcolor``, ``Axes.set_axis_bgcolor``, ``Bbox.update_from_data``, ``Bbox.update_datalim_numerix``, ``MaxNLocator.bin_boundaries`` methods have been removed.
es_es: Los métodos ``Axes.get_axis_bgcolor``, ``Axes.set_axis_bgcolor``, ``Bbox.update_from_data``, ``Bbox.update_datalim_numerix``, ``MaxNLocator.bin_boundaries`` han sido eliminados.

source: ``mencoder`` can no longer be used to encode animations.
es_es: ``mencoder`` ya no puede ser usado para codificar animaciones.

source: The unused ``FONT_SCALE`` and ``fontd`` attributes of the `.RendererSVG` class have been removed.
es_es: Los atributos no utilizados ``FONT_SCALE`` y ``fontd`` de la clase `.RenderererSVG` han sido eliminados.

source: colormaps
es_es: mapas de colores

source: The ``spectral`` colormap has been removed. The ``Vega*`` colormaps, which were aliases for the ``tab*`` colormaps, have been removed.
es_es: El mapa de colores ``spectral`` ha sido eliminado. Los mapas de colores ``Vega*``, que eran alias para los mapas de colores ``tab*``, han sido removidos.

source: The following deprecated rcParams have been removed:
es_es: Se han eliminado los siguientes rcParams obsoletos:

source: ``axes.color_cycle`` (see ``axes.prop_cycle``),
es_es: ``axes.color_cycle`` (ver ``axes.prop_cycle``),

source: ``svg.embed_char_paths`` (see ``svg.fonttype``),
es_es: ``svg.embed_char_paths`` (ver ``svg.fonttype``),

source: ``text.fontstyle``, ``text.fontangle``, ``text.fontvariant``, ``text.fontweight``, ``text.fontsize`` (renamed to ``text.style``, etc.),
es_es: ``text.fontstyle``, ``text.fontangle``, ``text.fontvariant``, ``text.fontweight``, ``text.fontsize`` (renombrado a ``text.style``, etc.),

source: ``tick.size`` (renamed to ``tick.major.size``).
es_es: ``tick.size`` (renombrado a ``tick.major.size``).

source: Only accept string-like for Categorical input
es_es: Sólo aceptar cadena para entrada Categórica

source: Do not accept mixed string / float / int input, only strings are valid categoricals.
es_es: No acepte cadenas mixtas / float / int entrada, sólo cadenas son categorías válidas.

source: Removal of unused imports
es_es: Eliminación de las importaciones no utilizadas

source: Many unused imports were removed from the codebase. As a result, trying to import certain classes or functions from the "wrong" module (e.g. `~.Figure` from :mod:`matplotlib.backends.backend_agg` instead of :mod:`matplotlib.figure`) will now raise an `ImportError`.
es_es: Muchas importaciones no utilizadas fueron removidas de la base de código. Como resultado, tratando de importar ciertas clases o funciones del módulo "incorrecto" (e. . `~.Figure` de :mod:`matplotlib.backends.backend_agg` en lugar de :mod:`matplotlib.figure`) ahora generará un `ImportError`.

source: ``Axes3D.get_xlim``, ``get_ylim`` and ``get_zlim`` now return a tuple
es_es: ``Axes3D.get_xlim``, ``get_ylim`` y ``get_zlim`` ahora devuelven una tupla

source: They previously returned an array. Returning a tuple is consistent with the behavior for 2D axes.
es_es: Previamente devolvieron una matriz. Devolver una tupla es consistente con el comportamiento de los ejes 2D.

source: Exception type changes
es_es: Cambios de tipo de excepción

source: If `.MovieWriterRegistry` can't find the requested `.MovieWriter`, a more helpful `RuntimeError` message is now raised instead of the previously raised `KeyError`.
es_es: Si `.Mo)[video] WriterRegistry` no puede encontrar el `.Mo)[video] Writer`, ahora se levanta un mensaje `RuntimeError` más útil en lugar del `KeyError` previamente planteado.

source: `~.tight_layout.auto_adjust_subplotpars` now raises `ValueError` instead of `RuntimeError` when sizes of input lists don't match
es_es: `~.tight_layout.auto_adjust_subplotpars` ahora aumenta `ValueError` en lugar de `RuntimeError` cuando los tamaños de las listas de entrada no coinciden

source: `.Figure.set_figwidth` and `.Figure.set_figheight` default *forward* to True
es_es: `.Figure.set_figwidth` y `.Figure.set_figheight` *hacia adelante* a True

source: `matplotlib.figure.Figure.set_figwidth` and `matplotlib.figure.Figure.set_figheight` had the keyword argument ``forward=False`` by default, but `.figure.Figure.set_size_inches` now defaults to ``forward=True``. This makes these functions conistent.
es_es: `matplotlib.figure.Figure.set_figwidth` y `matplotlib.figure.Figure.set_figheight` tenían el argumento de palabra clave ``forward=False`` por defecto, pero `.figure.Figure.set_size_inches` ahora por defecto ``forward=True``. Esto hace que estas funciones sean conistentes.

source: Do not truncate svg sizes to nearest point
es_es: No truncar tamaños de svg al punto más cercano

source: There is no reason to size the SVG out put in integer points, change to out putting floats for the *height*, *width*, and *viewBox* attributes of the *svg* element.
es_es: No hay ninguna razón para medir el tamaño de la salida SVG en puntos enteros, cambiar a los atributos de *altura*, *ancho*, y *viewBox* del elemento *svg*.

source: Fontsizes less than 1 pt are clipped to be 1 pt.
es_es: Los tamaños de letra inferiores a 1 pt son recortados a 1 pt.

source: FreeType doesn't allow fonts to get smaller than 1 pt, so all Agg backends were silently rounding up to 1 pt. PDF (other vector backends?) were letting us write fonts that were less than 1 pt, but they could not be placed properly because position information comes from FreeType. This change makes it so no backends can use fonts smaller than 1 pt, consistent with FreeType and ensuring more consistent results across backends.
es_es: FreeType no permite que las fuentes sean menores de 1 pt, por lo que todos los backends de Agg estaban redondeando silenciosamente hasta 1 pt. PDF (¿otros servidores vectoriales? estaban permitiéndonos escribir fuentes que eran inferiores a 1 pt, pero no pudieron colocarse correctamente porque la información de posición viene de FreeType. Este cambio lo hace así que ningún backend puede usar fuentes más pequeñas de 1 pt, consistentes con FreeType y garantizando resultados más consistentes entre los backends.

source: Changes to Qt backend class MRO
es_es: Cambios a la clase backend Qt MRO

source: To support both Agg and cairo rendering for Qt backends all of the non-Agg specific code previously in ``backend_qt5agg.FigureCanvasQTAggBase`` has been moved to :class:`.backend_qt5.FigureCanvasQT` so it can be shared with the cairo implementation. The ``FigureCanvasQTAggBase.paintEvent``, ``FigureCanvasQTAggBase.blit``, and ``FigureCanvasQTAggBase.print_figure`` methods have moved to :meth:`.FigureCanvasQTAgg.paintEvent`, :meth:`.FigureCanvasQTAgg.blit`, and :meth:`.FigureCanvasQTAgg.print_figure`. The first two methods assume that the instance is also a ``QWidget`` so to use ``FigureCanvasQTAggBase`` it was required to multiple inherit from a ``QWidget`` sub-class.
es_es: Para soportar tanto el renderizado Agg como cairo para los backends Qt todo el código específico no Agg previamente en ``backend_qt5agg. igureCanvasQTAggBase`` ha sido movido a :class:`. ackend_qt5.FigureCanvasQT` para que pueda ser compartido con la implementación de cairo. El ``FigureCanvasQTAggBase.paintEvent``, ``FigureCanvasQTAggBase.blit``, y ``FigureCanvasQTAggBase. los métodos rint_figure`` se han movido a :meth:`.FigureCanvasQTAgg.paintEvent`, :meth:`.FigureCanvasQTAgg.blit`, y :meth:`.FigureCanvasQTAgg.print_figure`. Los dos primeros métodos asumen que la instancia es también un ``QWidget`` así que para usar ``FigureCanvasQTAggBase`` fue necesario para múltiples heredar de una subclase ``QWidget``.

source: Having moved all of its methods either up or down the class hierarchy ``FigureCanvasQTAggBase`` has been deprecated. To do this without warning and to preserve as much API as possible, ``.backend_qt5agg.FigureCanvasQTAggBase`` now inherits from :class:`.backend_qt5.FigureCanvasQTAgg`.
es_es: Habiendo movido todos sus métodos, tanto hacia arriba como hacia abajo la jerarquía de clases ``FigureCanvasQTAggBase`` ha sido obsoleta. Para hacer esto sin aviso y preservar la mayor cantidad de API posible, ``.backend_qt5agg.FigureCanvasQTAggBase`` ahora hereda de :class:`.backend_qt5.FigureCanvasQTAgg`.

source: The MRO for :class:`.FigureCanvasQTAgg` and ``FigureCanvasQTAggBase`` used to be ::
es_es: El MRO de :class:`.FigureCanvasQTAgg` y ``FigureCanvasQTAggBase`` solían ser ::

source: and ::
es_es: y ::

source: respectively. They are now ::
es_es: respectivamente. Ahora son ::

source: `.axes.Axes.imshow` clips RGB values to the valid range
es_es: `.axes.Axes.imshow` recorta los valores RGB al rango válido

source: When `.axes.Axes.imshow` is passed an RGB or RGBA value with out-of-range values, it now logs a warning and clips them to the valid range. The old behaviour, wrapping back in to the range, often hid outliers and made interpreting RGB images unreliable.
es_es: Cuando a `.axes.Axes.imshow` se le pasa un valor RGB o RGBA con valores fuera de rango, ahora registra una advertencia y los recorta al rango válido. El viejo comportamiento, envuelto de nuevo en el rango, a menudo oculta atípicos y hace que la interpretación de imágenes RGB no sea fiable.

source: GTKAgg and GTKCairo backends deprecated
es_es: Los backends de GTKAgg y GTKCairo están obsoletos

source: The GTKAgg and GTKCairo backends have been deprecated. These obsolete backends allow figures to be rendered via the GTK+ 2 toolkit. They are untested, known to be broken, will not work with Python 3, and their use has been discouraged for some time. Instead, use the ``GTK3Agg`` and ``GTK3Cairo`` backends for rendering to GTK+ 3 windows.
es_es: Los backends de GTKAgg y GTKCairo han sido obsoletos. Estos backends obsoletos permiten que las figuras sean renderizadas a través del kit de herramientas GTK+ 2. No se han probado, se sabe que están rotos, no funcionarán con Python 3, y su uso ha sido desalentado durante algún tiempo. En su lugar, use los backends ``GTK3Agg`` y ``GTK3Cairo`` para renderizarlos en ventanas GTK+ 3.
