Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.5.0.po
Languages: es_es

source: API Changes for 3.5.0
es_es: Cambios en la API para la versión 3.5.0

source: Behaviour changes
es_es: Cambios de comportamiento

source: First argument to ``subplot_mosaic`` renamed
es_es: Primer argumento a ``subplot_mosaic`` renombrado

source: Both `.FigureBase.subplot_mosaic`, and `.pyplot.subplot_mosaic` have had the first positional argument renamed from *layout* to *mosaic*. As we have consolidated the *constrained_layout* and *tight_layout* keyword arguments in the Figure creation functions of `.pyplot` into a single *layout* keyword argument, the original ``subplot_mosaic`` argument name would collide.
es_es: Tanto `.FigureBase.subplot_mosaic`, como `.pyplot.subplot_mosaic` han cambiado el nombre del primer argumento posicional de *layout* a *mosaic*. Como hemos consolidado los argumentos de palabra clave *constrained_layout* y *tight_layout* en las funciones de creación de figuras de `.pyplot` en un único argumento de palabra clave *layout*, el nombre del argumento original ``subplot_mosaic`` colisionaría.

source: As this API is provisional, we are changing this argument name with no deprecation period.
es_es: Como esta API es provisional, estamos cambiando el nombre de este argumento sin periodo de obsolescencia.

source: ``Axes`` children are no longer separated by type
es_es: Los hijos de ``Axes`` ya no están separados por tipo

source: Formerly, `.axes.Axes` children were separated by `.Artist` type, into sublists such as ``Axes.lines``. For methods that produced multiple elements (such as `.Axes.errorbar`), though individual parts would have similar *zorder*, this separation might cause them to be drawn at different times, causing inconsistent results when overlapping other Artists.
es_es: Anteriormente, los hijos de `.axes.Axes` estaban separados por el tipo `.Artist`, en sublistas como ``Axes.lines``. En el caso de los métodos que producían múltiples elementos (como `.Axes.errorbar`), aunque las partes individuales tuvieran un *orden zonal* similar, esta separación podía hacer que se dibujaran en momentos diferentes, provocando resultados incoherentes cuando se superponían a otros Artists.

source: Now, the children are no longer separated by type, and the sublist properties are generated dynamically when accessed. Consequently, Artists will now always appear in the correct sublist; e.g., if `.axes.Axes.add_line` is called on a `.Patch`, it will appear in the ``Axes.patches`` sublist, *not* ``Axes.lines``. The ``Axes.add_*`` methods will now warn if passed an unexpected type.
es_es: Ahora, los hijos ya no están separados por tipo, y las propiedades de la sublista se generan dinámicamente cuando se accede a ellas. En consecuencia, los artists aparecerán siempre en la sublista correcta; por ejemplo, si se llama a `.axes.Axes.add_line` en un `.Patch`, aparecerá en la sublista ``Axes.patches``, *no* en ``Axes.lines``. Los métodos ``Axes.add_*`` ahora avisarán si se les pasa un tipo inesperado.

source: Modification of the following sublists is still accepted, but deprecated:
es_es: La modificación de las siguientes sublistas sigue siendo aceptada, pero está obsoleta:

source: To remove an Artist, use its `.Artist.remove` method. To add an Artist, use the corresponding ``Axes.add_*`` method.
es_es: Para eliminar un artist, utiliza su método `.Artist.remove`. Para añadir un Artist, utiliza el método correspondiente ``Axes.add_*``.

source: ``MatplotlibDeprecationWarning`` now subclasses ``DeprecationWarning``
es_es: ``MatplotlibDeprecationWarning`` ahora subclase ``DeprecationWarning``

source: Historically, it has not been possible to filter `.MatplotlibDeprecationWarning`\s by checking for `DeprecationWarning`, since we subclass `UserWarning` directly.
es_es: Históricamente, no ha sido posible filtrar `.MatplotlibDeprecationWarning` comprobando `DeprecationWarning`, ya que subclasificamos `UserWarning` directamente.

source: The decision to not subclass `DeprecationWarning` has to do with a decision from core Python in the 2.x days to not show `DeprecationWarning`\s to users. However, there is now a more sophisticated filter in place (see https://www.python.org/dev/peps/pep-0565/).
es_es: La decisión de no subclasificar `DeprecationWarning` tiene que ver con una decisión del núcleo de Python en los días de la 2.x de no mostrar `DeprecationWarning` a los usuarios. Sin embargo, ahora hay un filtro más sofisticado (ver https://www.python.org/dev/peps/pep-0565/).

source: Users will now see `.MatplotlibDeprecationWarning` only during interactive sessions, and these can be silenced by the standard mechanism:
es_es: Los usuarios verán ahora `.MatplotlibDeprecationWarning` sólo durante las sesiones interactivas, y éstas pueden ser silenciadas por el mecanismo estándar:

source: Library authors must now enable `DeprecationWarning`\s explicitly in order for (non-interactive) CI/CD pipelines to report back these warnings, as is standard for the rest of the Python ecosystem:
es_es: Los autores de las librerías deben ahora habilitar explícitamente los `DeprecationWarning` para que los pipelines CI/CD (no interactivos) informen de estas advertencias, como es habitual en el resto del ecosistema Python:

source: ``Artist.set`` applies artist properties in the order in which they are given
es_es: ``Artist.set`` aplica las propiedades del artist en el orden en que se dan

source: The change only affects the interaction between the *color*, *edgecolor*, *facecolor*, and (for `.Collection`\s) *alpha* properties: the *color* property now needs to be passed first in order not to override the other properties. This is consistent with e.g. `.Artist.update`, which did not reorder the properties passed to it.
es_es: El cambio sólo afecta a la interacción entre las propiedades *color*, *edgecolor*, *facecolor* y (para `.Collection`s) *alpha*: la propiedad *color* debe pasarse primero para no sobreescribir las demás propiedades. Esto es coherente con, por ejemplo, `.Artist.update`, que no reordena las propiedades que se le pasan.

source: ``pcolor(mesh)`` shading defaults to auto
es_es: ``pcolor(mesh)`` sombreado por defecto en auto

source: The *shading* keyword argument for `.Axes.pcolormesh` and `.Axes.pcolor` default has been changed to 'auto'.
es_es: El argumento de la palabra clave *shading* para `.Axes.pcolormesh` y `.Axes.pcolor` por defecto ha sido cambiado a 'auto'.

source: Passing ``Z(M, N)``, ``x(N)``, ``y(M)`` to ``pcolormesh`` with ``shading='flat'`` will now raise a `TypeError`. Use ``shading='auto'`` or ``shading='nearest'`` for ``x`` and ``y`` to be treated as cell centers, or drop the last column and row of ``Z`` to get the old behaviour with ``shading='flat'``.
es_es: Al pasar ``Z(M, N)``, ``x(N)``, ``y(M)`` a ``pcolormesh`` con ``shading='flat'`` se producirá un `TypeError`. Utiliza ``shading='auto'`` o ``shading='nearest'`` para que ``x`` y ``y`` sean tratados como centros de celdas, o elimina la última columna y fila de ``Z`` para obtener el antiguo comportamiento con ``shading='flat'``.

source: Colorbars now have pan and zoom functionality
es_es: Las barras de color tienen ahora la función de desplazamiento y zoom

source: Interactive plots with colorbars can now be zoomed and panned on the colorbar axis. This adjusts the *vmin* and *vmax* of the `.ScalarMappable` associated with the colorbar. This is currently only enabled for continuous norms. Norms used with ``contourf`` and categoricals, such as `.BoundaryNorm` and `.NoNorm`, have the interactive capability disabled by default. `cb.ax.set_navigate() <.Axes.set_navigate>` can be used to set whether a colorbar axes is interactive or not.
es_es: Los gráficos interactivos con barras de color pueden ahora ser ampliados y desplazados en el eje de la barra de color. Esto ajusta el *vmin* y *vmax* del `.ScalarMappable` asociado con la barra de colores. Actualmente, esto sólo está habilitado para las normas continuas. Las normas utilizadas con ``contourf`` y categóricas, como `.BoundaryNorm` y `.NoNorm`, tienen la capacidad interactiva desactivada por defecto. Se puede utilizar `cb.ax.set_navigate() <.Axes.set_navigate>` para establecer si un eje de la barra de color es interactivo o no.

source: Colorbar lines no longer clipped
es_es: Las líneas de la barra de color ya no se recortan

source: If a colorbar has lines added to it (e.g. for contour lines), these will no longer be clipped. This is an improvement for lines on the edge of the colorbar, but could lead to lines off the colorbar if the limits of the colorbar are changed.
es_es: Si una barra de color tiene líneas añadidas (por ejemplo, para las líneas de contorno), éstas ya no se recortarán. Esto es una mejora para las líneas en el borde de la barra de colores, pero podría dar lugar a líneas fuera de la barra de colores si se modifican los límites de la misma.

source: ``Figure.suppressComposite`` now also controls compositing of Axes images
es_es: ``Figure.suppressComposite`` ahora también controla la composición de las imágenes de los ejes

source: The output of ``NonUniformImage`` and ``PcolorImage`` has changed
es_es: La salida de ``NonUniformImage`` y ``PcolorImage`` ha cambiado

source: Pixel-level differences may be observed in images generated using `.NonUniformImage` or `.PcolorImage`, typically for pixels exactly at the boundary between two data cells (no user-facing axes method currently generates `.NonUniformImage`\s, and only `.pcolorfast` can generate `.PcolorImage`\s). These artists are also now slower, normally by ~1.5x but sometimes more (in particular for ``NonUniformImage(interpolation="bilinear")``. This slowdown arises from fixing occasional floating point inaccuracies.
es_es: Pueden observarse diferencias a nivel de píxel en las imágenes generadas con `.NonUniformImage` o `.PcolorImage`, normalmente para los píxeles que se encuentran exactamente en el límite entre dos celdas de datos (ningún método de ejes orientados al usuario genera actualmente `.NonUniformImage`, y sólo `.pcolorfast` puede generar `.PcolorImage`). Estos artistas también son ahora más lentos, normalmente por ~1,5x pero a veces más (en particular para ``NonUniformImage(interpolation="bilinear")``. Esta ralentización se debe a la corrección de imprecisiones ocasionales en el punto flotante.

source: Change of the (default) legend handler for ``Line2D`` instances
es_es: Cambio del manejador de leyendas (por defecto) para las instancias de ``Line2D``

source: The default legend handler for Line2D instances (`.HandlerLine2D`) now consistently exposes all the attributes and methods related to the line marker (:ghissue:`11358`). This makes it easy to change the marker features after instantiating a legend.
es_es: El manejador de leyendas por defecto para las instancias de Line2D (`.HandlerLine2D`) expone ahora de forma consistente todos los atributos y métodos relacionados con el marcador de línea (:ghissue:`11358`). Esto facilita el cambio de las características del marcador después de instanciar una leyenda.

source: The former legend handler for Line2D objects has been renamed `.HandlerLine2DCompound`. To revert to the previous behaviour, one can use
es_es: El antiguo manejador de leyendas para objetos Line2D ha sido renombrado como `.HandlerLine2DCompound`. Para volver al comportamiento anterior, se puede utilizar

source: Setting ``Line2D`` marker edge/face color to *None* use rcParams
es_es: Establecer el color de arista/cara del marcador ``Line2D`` a *None* use rcParams

source: ``Line2D.set_markeredgecolor(None)`` and ``Line2D.set_markerfacecolor(None)`` now set the line property using the corresponding rcParam (:rc:`lines.markeredgecolor` and :rc:`lines.markerfacecolor`). This is consistent with other `.Line2D` property setters.
es_es: ``Line2D.set_markeredgecolor(None)`` y ``Line2D.set_markerfacecolor(None)`` ahora establecen la propiedad de la línea utilizando el correspondiente rcParam (:rc:`lines.markeredgecolor` y :rc:`lines.markerfacecolor`). Esto es coherente con otros definidores de propiedades `.Line2D`.

source: Default theta tick locations for wedge polar plots have changed
es_es: Se han modificado las ubicaciones predeterminadas del tick de theta para los gráficos polares de cuña

source: For polar plots that don't cover a full circle, the default theta tick locations are now at multiples of 10°, 15°, 30°, 45°, 90°, rather than using values that mostly make sense for linear plots (20°, 25°, etc.).
es_es: Para los gráficos polares que no cubren un círculo completo, las ubicaciones de las marcas theta por defecto están ahora en múltiplos de 10°, 15°, 30°, 45°, 90°, en lugar de utilizar valores que en su mayoría tienen sentido para los gráficos lineales (20°, 25°, etc.).

source: ``axvspan`` now plots full wedges in polar plots
es_es: ``axvspan`` ahora grafica cuñas completas en los gráficos polares

source: ... rather than triangles.
es_es: ... en lugar de triángulos.

source: Convenience converter from ``Scale`` to ``Normalize`` now public
es_es: Convertidor de conveniencia de ``Escala`` a ``Normalizar`` ahora público

source: Downstream libraries can take advantage of `.colors.make_norm_from_scale` to create a `~.colors.Normalize` subclass directly from an existing scale. Usually norms have a scale, and the advantage of having a `~.scale.ScaleBase` attached to a norm is to provide a scale, and associated tick locators and formatters, for the colorbar.
es_es: Las bibliotecas posteriores pueden aprovechar `.colors.make_norm_from_scale` para crear una subclase `~.colors.Normalize` directamente a partir de una escala existente. Normalmente las normas tienen una escala, y la ventaja de tener una `~.scale.ScaleBase` adjunta a una norma es proporcionar una escala, y los localizadores de tick y formateadores asociados, para la barra de colores.

source: ``ContourSet`` always use ``PathCollection``
es_es: ``ContourSet`` siempre utiliza ``PathCollection``

source: In order to correct rendering issues with closed loops, the `.ContourSet` now creates a `.PathCollection` instead of a `.LineCollection` for line contours. This type matches the artist used for filled contours.
es_es: Para corregir las incidencias de renderizado con bucles cerrados, el `.ContourSet` crea ahora una `.PathCollection` en lugar de una `.LineCollection` para los contornos de línea. Este tipo corresponde con el artist utilizado para los contornos rellenos.

source: This affects `.ContourSet` itself and its subclasses, `.QuadContourSet` (returned by `.Axes.contour`), and `.TriContourSet` (returned by `.Axes.tricontour`).
es_es: Esto afecta al propio `.ContourSet` y a sus subclases, `.QuadContourSet` (devuelto por `.Axes.contour`), y `.TriContourSet` (devuelto por `.Axes.tricontour`).

source: ``hatch.SmallFilledCircles`` inherits from ``hatch.Circles``
es_es: ``hatch.SmallFilledCircles`` hereda de ``hatch.Circles``

source: The ``hatch.SmallFilledCircles`` class now inherits from ``hatch.Circles`` rather than from ``hatch.SmallCircles``.
es_es: La clase ``hatch.SmallFilledCircles`` ahora hereda de ``hatch.Circles`` en lugar de ``hatch.SmallCircles``.

source: hexbin with a log norm
es_es: hexbin con norma logarítmica

source: `~.axes.Axes.hexbin` no longer (incorrectly) adds 1 to every bin value if a log norm is being used.
es_es: `~.axes.Axes.hexbin` ya no añade (de forma incorrecta) 1 a cada valor de intervalo si se utiliza una norma logarítmica.

source: Setting invalid ``rcParams["date.converter"]`` now raises ValueError
es_es: Establecer un valor inválido ``rcParams["date.converter"]`` ahora plantea ValueError

source: Previously, invalid values passed to :rc:`date.converter` would be ignored with a `UserWarning`, but now raise `ValueError`.
es_es: Antes, los valores no válidos pasados a :rc:`date.converter` se ignoraban con un `UserWarning`, pero ahora plantea `ValueError`.

source: ``Text`` and ``TextBox`` added *parse_math* option
es_es: ``Text`` y ``TextBox`` han añadido la opción *parse_math*

source: `.Text` and `.TextBox` objects now allow a *parse_math* keyword-only argument which controls whether math should be parsed from the displayed string. If *True*, the string will be parsed as a math text object. If *False*, the string will be considered a literal and no parsing will occur.
es_es: Los objetos `.Text` y `.TextBox` permiten ahora un argumento de palabra clave *parse_math* que controla si las matemáticas deben ser analizadas desde la cadena mostrada. Si es *True*, la cadena será analizada como un objeto de texto matemático. Si es *False*, la cadena se considerará un literal y no se realizará ningún análisis.

source: For `.Text`, this argument defaults to *True*. For `.TextBox` this argument defaults to *False*.
es_es: Para `.Text`, este argumento por defecto es *True*. Para `.TextBox` este argumento por defecto es *False*.

source: ``Type1Font`` objects now decrypt the encrypted part
es_es: Los objetos ``Type1Font`` ahora descifran la parte cifrada

source: Type 1 fonts have a large part of their code encrypted as an obsolete copy-protection measure. This part is now available decrypted as the ``decrypted`` attribute of `~.type1font.Type1Font`. This decrypted data is not yet parsed, but this is a prerequisite for implementing subsetting.
es_es: Las fuentes Type 1 tienen una gran parte de su código encriptado como una medida obsoleta de protección anticopia. Esta parte está ahora disponible descifrada como el atributo ``descifrado`` de `~.type1font.Type1Font`. Estos datos descifrados aún no se analizan, pero es un requisito previo para implementar el subconjunto.

source: 3D contourf polygons placed between levels
es_es: Polígonos de contorno 3D colocados entre niveles

source: The polygons used in a 3D `~mpl_toolkits.mplot3d.Axes3D.contourf` plot are now placed halfway between the contour levels, as each polygon represents the location of values that lie between two levels.
es_es: Los polígonos utilizados en un gráfico 3D `~mpl_toolkits.mplot3d.Axes3D.contourf` se colocan ahora a mitad de camino entre los niveles de contorno, ya que cada polígono representa la ubicación de los valores que se encuentran entre dos niveles.

source: ``AxesDivider`` now defaults to rcParams-specified pads
es_es: ``AxesDivider`` ahora por defecto a los pads especificados en rcParams

source: `.AxesDivider.append_axes`, `.AxesDivider.new_horizontal`, and `.AxesDivider.new_vertical` now default to paddings specified by :rc:`figure.subplot.wspace` and :rc:`figure.subplot.hspace` rather than zero.
es_es: `.AxesDivider.append_axes`, `.AxesDivider.new_horizontal`, y `.AxesDivider.new_vertical` ahora se ajustan por defecto a los paddings especificados por :rc:`figure.subplot.wspace` y :rc:`figure.subplot.hspace` en lugar de cero.

source: Deprecations
es_es: Obsolescencias

source: Discouraged: ``Figure`` parameters *tight_layout* and *constrained_layout*
es_es: Desaconsejados: parámetros ``Figure`` *tight_layout* y *constrained_layout*

source: The ``Figure`` parameters *tight_layout* and *constrained_layout* are triggering competing layout mechanisms and thus should not be used together.
es_es: Los parámetros ``Figure`` *tight_layout* y *constrained_layout* activan mecanismos de diseño que compiten entre sí y, por tanto, no deben utilizarse juntos.

source: To make the API clearer, we've merged them under the new parameter *layout* with values 'constrained' (equal to ``constrained_layout=True``), 'tight' (equal to ``tight_layout=True``). If given, *layout* takes precedence.
es_es: Para que la API sea más clara, los hemos fusionado bajo el nuevo parámetro *layout* con los valores 'constrained' (igual a ``constrained_layout=True``), 'tight' (igual a ``tight_layout=True``). Si se da, *layout* tiene prioridad.

source: The use of *tight_layout* and *constrained_layout* is discouraged in favor of *layout*. However, these parameters will stay available for backward compatibility.
es_es: Se desaconseja el uso de *tight_layout* y *constrained_layout* en favor de *layout*. Sin embargo, estos parámetros seguirán estando disponibles por compatibilidad con versiones anteriores.

source: Modification of ``Axes`` children sublists
es_es: Modificación de las sublistas de hijos de ``Axes``

source: See :ref:`Behavioural API Changes 3.5 - Axes children combined` for more information; modification of the following sublists is deprecated:
es_es: Ver :ref:`Cambios en la API de comportamiento 3.5 - Ejes hijos combinados` para más información; la modificación de las siguientes sublistas está obsoleta:

source: Passing incorrect types to ``Axes.add_*`` methods
es_es: Pasar tipos incorrectos a los métodos ``Axes.add_*``

source: The following ``Axes.add_*`` methods will now warn if passed an unexpected type. See their documentation for the types they expect.
es_es: Los siguientes métodos ``Axes.add_*`` ahora avisarán si se les pasa un tipo inesperado. Consulta su documentación para conocer los tipos que esperan.

source: Discouraged: ``plot_date``
es_es: Descartado: ``plot_date``

source: The use of `~.Axes.plot_date` is discouraged. This method exists for historic reasons and may be deprecated in the future.
es_es: Se desaconseja el uso de `~.Axes.plot_date`. Este método existe por razones históricas y puede quedar obsoleto en el futuro.

source: ``datetime``-like data should directly be plotted using `~.Axes.plot`.
es_es: Los datos de tipo ``datetime`` deben representarse directamente con `~.Axes.plot`.

source: If you need to plot plain numeric data as :ref:`date-format` or need to set a timezone, call ``ax.xaxis.axis_date`` / ``ax.yaxis.axis_date`` before `~.Axes.plot`. See `.Axis.axis_date`.
es_es: Si necesita trazar datos numéricos planos como :ref:`date-format` o necesita establecer una zona horaria, invoca ``ax.xaxis.axis_date`` / ``ax.yaxis.axis_date`` antes de `~.Axes.plot`. Ver `.Axis.axis_date`.

source: ``epoch2num`` and ``num2epoch`` are deprecated
es_es: ``epoch2num`` y ``num2epoch`` están obsoletos

source: These methods convert from unix timestamps to matplotlib floats, but are not used internally to matplotlib, and should not be needed by end users. To convert a unix timestamp to datetime, simply use `datetime.datetime.utcfromtimestamp`, or to use NumPy `~numpy.datetime64` ``dt = np.datetim64(e*1e6, 'us')``.
es_es: Estos métodos convierten las marcas de tiempo unix en flotantes de matplotlib, pero no se utilizan internamente en matplotlib, y no deberían ser necesarios para los usuarios finales. Para convertir una marca de tiempo unix a datetime, simplemente use `datetime.datetime.utcfromtimestamp`, o para usar NumPy `~numpy.datetime64` ``dt = np.datetim64(e*1e6, 'us')``.

source: Auto-removal of grids by `~.Axes.pcolor` and `~.Axes.pcolormesh`
es_es: Eliminación automática de mallas por `~.Axes.pcolor` y `~.Axes.pcolormesh`

source: `~.Axes.pcolor` and `~.Axes.pcolormesh` currently remove any visible axes major grid. This behavior is deprecated; please explicitly call ``ax.grid(False)`` to remove the grid.
es_es: Actualmente, `~.Axes.pcolor` y `~.Axes.pcolormesh` eliminan cualquier malla mayor de los ejes visibles. Este comportamiento está obsoleto; por favor, invoca explícitamente ``ax.grid(False)`` para eliminar la malla.

source: The first parameter of ``Axes.grid`` and ``Axis.grid`` has been renamed to *visible*
es_es: El primer parámetro de ``Axes.grid`` y ``Axis.grid`` ha sido renombrado a *visible*

source: The parameter was previously named *b*. This deprecation only matters if that parameter was passed using a keyword argument, e.g. ``grid(b=False)``.
es_es: El parámetro fue previamente llamado *b*. Esta obsoleto y sólo importa si ese parámetro fue pasado usando un argumento de palabra clave, por ejemplo, ``grid(b=False)``.

source: Unification and cleanup of Selector widget API
es_es: Unificación y limpieza de la API del widget Selector
