Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_1.5.0.po
Languages: es_es

source: Removed *Lena* images from sample_data
es_es: Imágenes de *Lena* eliminadas de sample_data

source: The ``lena.png`` and ``lena.jpg`` images have been removed from Matplotlib's sample_data directory. The images are also no longer available from `matplotlib.cbook.get_sample_data`. We suggest using ``matplotlib.cbook.get_sample_data('grace_hopper.png')`` or ``matplotlib.cbook.get_sample_data('grace_hopper.jpg')`` instead.
es_es: Las imágenes ``lena.png`` y ``lena.jpg`` han sido eliminadas del directorio sample_data de Matplotlib. Las imágenes ya no están disponibles en `matplotlib.cbook. et_sample_data`. Sugerimos usar ``matplotlib.cbook.get_sample_data('grace_hopper.png')`` o ``matplotlib.cbook.get_sample_data('grace_hopper.jpg')`` en su lugar.

source: Legend
es_es: Leyenda

source: Removed handling of *loc* as a positional argument to `.Legend`
es_es: Se ha eliminado el manejo de *loc* como argumento posicional para `.Legend`

source: Legend handlers
es_es: Manejadores de leyendas

source: Remove code to allow legend handlers to be callable. They must now implement a method ``legend_artist``.
es_es: Eliminar código para permitir que los manejadores de leyendas sean llamables. Ahora deben implementar un método ``legend_artist``.

source: Axis
es_es: Eje

source: Removed method ``set_scale``. This is now handled via a private method which should not be used directly by users. It is called via ``Axes.set_{x,y}scale`` which takes care of ensuring the related changes are also made to the Axes object.
es_es: Método eliminado ``set_scale``. Esto ahora es manejado mediante un método privado que no debería ser utilizado directamente por los usuarios. Se llama a través de ``Ejes.set_{x,y}escala`` que se encarga de asegurar que los cambios relacionados también se hagan en el objeto Ejes.

source: Removed functions with ambiguous argument order from finance.py
es_es: Funciones eliminadas con orden de argumentos ambiguo de finance.py

source: Annotation
es_es: Anuncio

source: Removed ``textcoords`` and ``xytext`` proprieties from Annotation objects.
es_es: Se han eliminado los ``textcoords`` y ``xytext`` de los objetos de anotación.

source: Both ``ipython_console_highlighting`` and ``ipython_directive`` have been moved to IPython.
es_es: Ambos ``ipython_console_highlighting`` y ``ipython_directive`` han sido movidos a IPython.

source: Change your import from ``matplotlib.sphinxext.ipython_directive`` to ``IPython.sphinxext.ipython_directive`` and from ``matplotlib.sphinxext.ipython_directive`` to ``IPython.sphinxext.ipython_directive``
es_es: Cambie su importación de ``matplotlib.sphinxext.ipython_directive`` a ``IPython.sphinxext.ipython_directive`` y de ``matplotlib.sphinxext.ipython_directive`` a ``IPython.sphinxext.ipython_directive``

source: Deprecated in 2005, use ``set_color``
es_es: Obsoleto en 2005, use ``set_color``

source: remove ``'faceted'`` as a valid value for *shading* in ``tri.tripcolor``
es_es: eliminar ``'faceted'`` como un valor válido para *sombreando* en ``tri.tripcolor``

source: Use *edgecolor* instead. Added validation on *shading* to only be valid values.
es_es: Utilice *edgecolor* en su lugar. Se añadió la validación al *sombrear* para que sólo sea un valor válido.

source: Remove ``faceted`` kwarg from scatter
es_es: Elimina el kwarg ``faceted`` del scatter

source: Remove support for the ``faceted`` kwarg. This was deprecated in d48b34288e9651ff95c3b8a071ef5ac5cf50bae7 (2008-04-18!) and replaced by ``edgecolor``.
es_es: Retire el soporte para el kwarg. Esto fue obsoleto en d48b34288e9651ff95c3b8a071ef5ac5cf50bae7 (¡2008-04-18!) y reemplazado por ``edgecolor``.

source: Remove ``set_colorbar`` method from ``ScalarMappable``
es_es: Remover el método ``set_colorbar`` de ``ScalarMappable``

source: Remove ``set_colorbar`` method, use `~.cm.ScalarMappable.colorbar` attribute directly.
es_es: Remueve el método ``set_colorbar``, usa el atributo `~.cm.ScalarMappable.colorbar` directamente.

source: remove ``get_proxy_renderer`` method from ``AbstarctPathEffect`` class
es_es: eliminar el método ``get_proxy_render`` de la clase ``AbstarctPathEffect``

source: remove ``patch_alpha`` and ``offset_xy`` from ``SimplePatchShadow``
es_es: elimina ``patch_alpha`` y ``offset_xy`` de ``SimplePatchShadow``

source: Contained only a no-longer used port of functionality from PIL
es_es: Solo contiene un puerto de funcionalidad de PIL no más largo

source: Not used internally and not part of core mission of mpl.
es_es: No se utiliza internamente y no parte de la misión central del mpl.

source: Remove ``mlab.prepca``
es_es: Eliminar ``mlab.prepca``

source: Deprecated in 2009.
es_es: Desaprobado en 2009.

source: Added no functionality over the base ``NavigationToolbar2Qt``
es_es: No se ha añadido ninguna funcionalidad sobre la base ``NavigationToolbar2Qt``

source: Remove the module ``matplotlib.mpl``. Deprecated in 1.3 by PR #1670 and commit 78ce67d161625833cacff23cfe5d74920248c5b2
es_es: Remover el módulo ``matplotlib.mpl``. Desaprobado en 1.3 por PR #1670 y commit 78ce67d161625833cacff23cfe5d74920248c5b2
