Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.3.0.po
Languages: es_es

source: When `.Axes.hist` is called with a single dataset, it adds to the axes either a `.BarContainer` object (when ``histtype="bar"`` or ``"barstacked"``), or a `.Polygon` object (when ``histype="step"`` or ``"stepfilled"``) -- the latter being wrapped in a list-of-one-element. Previously, either artist would be wrapped in a `.silent_list`. This is no longer the case: the `.BarContainer` is now returned as is (this is an API breaking change if you were directly relying on the concrete `list` API; however, `.BarContainer` inherits from `tuple` so most common operations remain available), and the list-of-one `.Polygon` is returned as is. This makes the `repr` of the returned artist more accurate: it is now ::
es_es: Cuando se llama a `.Axes.First` con un único conjunto de datos, se añade a los ejes un objeto `.BarContainer` (cuando ``compantype="bar"`` o ``"stacked"``), o un `. objeto olygon` (cuando ``Textype="step"`` o ``"stepfilled"``) -- este último está siendo envuelto en una lista de elementos unos. Anteriormente, cualquiera de los artistas estaría envuelto en un `.silent_list`. Este ya no es el caso: el `. arContainer` ahora se devuelve como es (esto es un cambio de ruptura de API si usted se basaba directamente en la API concreta de `list`; sin embargo, `. arContainer` hereda de `tuple` para que las operaciones más comunes permanezcan disponibles), y la lista de uno `. olygon` es devuelto tal cual es. Esto hace que el `repr` del artista devuelto sea más preciso: ahora es ::

source: instead of ::
es_es: en lugar de ::

source: When `.Axes.hist` is called with multiple artists, it still wraps its return value in a `.silent_list`, but uses more accurate type information ::
es_es: Cuando `.Axes.First` es llamado con múltiples artistas, todavía envuelve su valor de retorno en una `.silent_list`, pero utiliza información de tipo más precisa ::

source: Qt and wx backends no longer create a status bar by default
es_es: Los backends Qt y wx ya no crean una barra de estado por defecto

source: The coordinates information is now displayed in the toolbar, consistently with the other backends. This is intended to simplify embedding of Matplotlib in larger GUIs, where Matplotlib may control the toolbar but not the status bar.
es_es: La información de las coordenadas ahora se muestra en la barra de herramientas, consistentemente con los otros backends. Esto pretende simplificar el embebido de Matplotlib en GUI más grandes, donde Matplotlib puede controlar la barra de herramientas pero no la barra de estado.

source: :rc:`text.hinting` now supports names mapping to FreeType flags
es_es: :rc:`text.hinting` ahora soporta nombres mapeando a banderas FreeType

source: :rc:`text.hinting` now supports the values "default", "no_autohint", "force_autohint", and "no_hinting", which directly map to the FreeType flags FT_LOAD_DEFAULT, etc. The old synonyms (respectively "either", "native", "auto", and "none") are still supported, but their use is discouraged. To get normalized values, use `.backend_agg.get_hinting_flag`, which returns integer flag values.
es_es: :rc:`text.hinting` ahora soporta los valores "default", "no_autohint", "force_autohint", y "no_hinting", que asignan directamente a las banderas de FreeType FT_LOAD_DEFAULT, etc. Los antiguos sinónimos (respectivamente "dos", "nativo", "auto" y "ninguno") siguen siendo soportados, pero su uso está desalentado. Para obtener valores normalizados, use `.backend_agg.get_hinting_flag`, que devuelve valores de bandera entera.

source: `.cbook.get_sample_data` auto-loads numpy arrays
es_es: `.cbook.get_sample_data` auto-carga matrices numéricas

source: When `.cbook.get_sample_data` is used to load a npy or npz file and the keyword-only parameter ``np_load`` is True, the file is automatically loaded using `numpy.load`. ``np_load`` defaults to False for backwards compatibility, but will become True in a later release.
es_es: Cuando `.cbook.get_sample_data` es usado para cargar un archivo npy o npz y el parámetro ``np_load`` es verdadero, el archivo se carga automáticamente usando `numpy. oad`. ``np_load`` por defecto a False para compatibilidad hacia atrás, pero se convertirá en True en una versión posterior.

source: ``get_text_width_height_descent`` now checks ``ismath`` rather than :rc:`text.usetex`
es_es: ``get_text_width_height_descent`` ahora comprueba ``ismath`` en lugar de :rc:`text.usetex`

source: ... to determine whether a string should be passed to the usetex machinery or not. This allows single strings to be marked as not-usetex even when the rcParam is True.
es_es: ... para determinar si una cadena debe pasarse a la maquinaria usetex o no. Esto permite marcar cadenas simples como not-usetex incluso cuando rcParam es True.

source: `.Axes.vlines`, `.Axes.hlines`, `.pyplot.vlines` and `.pyplot.hlines` *colors* parameter default change
es_es: `.Axes.vlines`, `.Axes.hlines`, `.pyplot.vlines` y `.pyplot.hlines` *colors* cambio predeterminado del parámetro

source: The *colors* parameter will now default to :rc:`lines.color`, while previously it defaulted to 'k'.
es_es: El parámetro *colors* ahora será por defecto :rc:`lines.color`, mientras que previamente se predeterminó a 'k'.

source: Aggressively autoscale clim in ``ScalerMappable`` classes
es_es: Automáticamente escalar clim en clases ``ScalerMappable``

source: Previously some plotting methods would defer autoscaling until the first draw if only one of the *vmin* or *vmax* keyword arguments were passed (`.Axes.scatter`, `.Axes.hexbin`, `.Axes.imshow`, `.Axes.pcolorfast`) but would scale based on the passed data if neither was passed (independent of the *norm* keyword arguments). Other methods (`.Axes.pcolor`, `.Axes.pcolormesh`) always autoscaled base on the initial data.
es_es: Anteriormente, algunos métodos de trazado diferirían la autoescala hasta el primer dibujo si sólo se pasaba uno de los argumentos de palabra clave *vmin* o *vmax* (`. xes.scatter`, `.Axes.hexbin`, `.Axes.imshow`, `.Axes. colorfast`), pero escalaría basándose en los datos pasados si ninguno fue pasado (independiente de los argumentos de palabra clave *normal*). Otros métodos (`.Axes.pcolor`, `.Axes.pcolormesh`) siempre autoescalado base en los datos iniciales.

source: All of the plotting methods now resolve the unset *vmin* or *vmax* at the initial call time using the data passed in.
es_es: Todos los métodos de trazado ahora resuelven el valor unset *vmin* o *vmax* en el tiempo de llamada inicial usando los datos pasados.

source: If you were relying on exactly one of the *vmin* or *vmax* remaining unset between the time when the method is called and the first time the figure is rendered you get back the old behavior by manually setting the relevant limit back to `None` ::
es_es: Si estabas confiando exactamente en uno de los indefinidos *vmin* o *vmax* entre el tiempo en el que se llama el método y la primera vez que la figura es renderizada, recuperarás el comportamiento antiguo estableciendo manualmente el límite relevante de vuelta a `Ninguno` ::

source: which will be resolved during the draw process.
es_es: que se resolverá durante el proceso de dibujo.

source: Deprecations
es_es: Obsolescencias

source: ``figure.add_axes()`` without arguments
es_es: ``figure.add_axes()`` sin argumentos

source: Calling ``fig.add_axes()`` with no arguments currently does nothing. This call will raise an error in the future. Adding a free-floating axes needs a position rectangle. If you want a figure-filling single axes, use ``add_subplot()`` instead.
es_es: Llamar a ``fig.add_axes()`` sin argumentos actualmente no hace nada. Esta llamada provocará un error en el futuro. Añadir un eje flotante libre necesita un rectángulo de posición. Si desea un ejes simples de llenado de figura, utilice ``add_subplot()`` en su lugar.

source: ``backend_wx.DEBUG_MSG`` is deprecated. The wx backends now use regular logging.
es_es: ``backend_wx.DEBUG_MSG`` está obsoleto. Los backends de wx ahora usan registro regular.

source: ``Colorbar.config_axis()`` is considered internal. Its use is deprecated.
es_es: ``Colorbar.config_axis()`` es considerado interno. Su uso está obsoleto.

source: ``NonUniformImage.is_grayscale`` and ``PcolorImage.is_grayscale``
es_es: ``NonUniformImage.is_grayscale`` y ``PcolorImage.is_grayscale``

source: These attributes are deprecated, for consistency with ``AxesImage.is_grayscale``, which was removed back in Matplotlib 2.0.0. (Note that previously, these attributes were only available *after rendering the image*).
es_es: Estos atributos son obsoletos, por consistencia con ``AxesImage.is_grayscale``, que fue eliminado de nuevo en Matplotlib 2. .0. (Tenga en cuenta que anteriormente, estos atributos sólo estaban disponibles *después de representar la imagen*).

source: ``den`` parameter and attribute to :mod:`mpl_toolkits.axisartist.angle_helper`
es_es: ``den`` parámetro y atributo a :mod:`mpl_toolkits.axisartist.angle_helper`

source: For all locator classes defined in :mod:`mpl_toolkits.axisartist.angle_helper`, the ``den`` parameter has been renamed to ``nbins``, and the ``den`` attribute deprecated in favor of its (preexisting) synonym ``nbins``, for consistency with locator classes defined in :mod:`matplotlib.ticker`.
es_es: Para todas las clases de localización definidas en :mod:`mpl_toolkits.axisartist. ngle_helper`, el parámetro ``den`` ha sido renombrado como ``Textins``, y el atributo ``den`` desaprobado a favor de su sinónimo (preexistente) ``futuros``, para consistencia con las clases de localizador definidas en :mod:`matplotlib. icker`.

source: ``backend_pgf.LatexManager.latex`` is now created with ``encoding="utf-8"``, so its ``stdin`` attribute is already utf8-encoded; the ``latex_stdin_utf8`` attribute is thus deprecated.
es_es: ``backend_pgf.LatexManager.latex`` ahora es creado con ``encoding="utf-8"``, así que su atributo ``stdin`` ya está utf8-encoded; el atributo ``latex_stdin_utf8`` está así obsoleto.

source: Flags containing "U" passed to `.cbook.to_filehandle` and `.cbook.open_file_cm`
es_es: Marcas que contienen "U" pasadas a `.cbook.to_filehandle` y `.cbook.open_file_cm`

source: Please remove "U" from flags passed to `.cbook.to_filehandle` and `.cbook.open_file_cm`. This is consistent with their removal from `open` in Python 3.9.
es_es: Por favor, elimina "U" de las banderas pasadas a `.cbook.to_filehandle` y `.cbook.open_file_cm`. Esto es consistente con su eliminación de `open` en Python 3.9.

source: PDF and PS character tracking internals
es_es: Rastreo interno de caracteres PDF y PS

source: The ``used_characters`` attribute and ``track_characters`` and ``merge_used_characters`` methods of `.RendererPdf`, `.PdfFile`, and `.RendererPS` are deprecated.
es_es: El atributo ``used_characters`` y los métodos ``track_characters`` y ``merge_used_characters`` de `.RenderererPdf`, `.PdfFile`, y `.RendererPS` están obsoletos.

source: Case-insensitive capstyles and joinstyles
es_es: Capestilos y joinstyles insensibles mayúsculas

source: Please pass capstyles ("miter", "round", "bevel") and joinstyles ("butt", "round", "projecting") as lowercase.
es_es: Por favor pase los capstyles ("miter", "round", "bevel") y los joinstyles ("butt", "round", "projecting") como minúsculas.

source: Passing raw data to ``register_cmap()``
es_es: Pasando datos brutos a ``register_cmap()``

source: Passing raw data via parameters *data* and *lut* to `.register_cmap()` is deprecated. Instead, explicitly create a `.LinearSegmentedColormap` and pass it via the *cmap* parameter: ``register_cmap(cmap=LinearSegmentedColormap(name, data, lut))``.
es_es: Pasar datos crudos a través de parámetros *data* y *lut* a `.register_cmap()` es obsoleto. En su lugar, crear explícitamente un `. inearSegmentedColormap` y pasarlo a través del parámetro *cmap*: ``register_cmap(cmap=LinearSegmentedColormap(nombre, datos, lut)``.

source: This attribute is unused and deprecated.
es_es: Este atributo no se utiliza y está obsoleto.

source: This attribute is deprecated.
es_es: Este atributo está obsoleto.

source: Revert deprecation \*min, \*max keyword arguments to ``set_x/y/zlim_3d()``
es_es: Revertir deprecación \*min, \*max argumentos de palabra clave a ``set_x/y/zlim_3d()``

source: These keyword arguments were deprecated in 3.0, alongside with the respective parameters in ``set_xlim()`` / ``set_ylim()``. The deprecations of the 2D versions were already reverted in 3.1.
es_es: Estos argumentos de palabra clave fueron obsoletos en 3.0, junto con los respectivos parámetros en ``set_xlim()`` / ``set_ylim()``. Las desaprobaciones de las versiones 2D ya se revirtieron en 3.1.

source: This function is deprecated. Use `.cbook.normalize_kwargs` instead.
es_es: Esta función está obsoleta. Usa `.cbook.normalize_kwargs` en su lugar.

source: Passing both singular and plural *colors*, *linewidths*, *linestyles* to `.Axes.eventplot`
es_es: Pasando *colores* singulares y plurales, *anchuras*, *linestyles* a `.Axes.eventplot`

source: Passing e.g. both *linewidth* and *linewidths* will raise a TypeError in the future.
es_es: Pasar por ejemplo *Ancho de línea* y *Ancho de línea* provocará un TypeError en el futuro.

source: Setting :rc:`text.latex.preamble` or :rc:`pdf.preamble` to non-strings
es_es: Establecer :rc:`text.latex.preamble` o :rc:`pdf.preamble` a non-strings

source: These rcParams should be set to string values. Support for None (meaning the empty string) and lists of strings (implicitly joined with newlines) is deprecated.
es_es: Estos rcParams deben establecerse en valores de cadena. El soporte para Ninguno (es decir, la cadena vacía) y listas de cadenas (implícitamente unidas con nuevas líneas) está obsoleto.

source: Parameters *norm* and *vmin*/*vmax* should not be used simultaneously
es_es: Los parámetros *normal* y *vmin*/*vmax* no deben usarse simultáneamente

source: Passing parameters *norm* and *vmin*/*vmax* simultaneously to functions using colormapping such as ``scatter()`` and ``imshow()`` is deprecated. Instead of ``norm=LogNorm(), vmin=min_val, vmax=max_val`` pass ``norm=LogNorm(min_val, max_val)``. *vmin* and *vmax* should only be used without setting *norm*.
es_es: Pasar los parámetros *normal* y *vmin*/*vmax* simultáneamente a las funciones que usan mapeo de colores como ``scatter()`` y ``imshow()`` está obsoleto. En lugar de ``norma=LogNorm(), vmin=min_val, vmax=max_val`` pase ``norm=LogNorm(min_val, max_val)``. *vmin* y *vmax* sólo deben usarse sin establecer *norma*.

source: Effectless parameters of `.Figure.colorbar` and `matplotlib.colorbar.Colorbar`
es_es: Parámetros sin efecto de `.Figure.colorbar` y `matplotlib.colorbar.Colorbar`

source: The *cmap* and *norm* parameters of `.Figure.colorbar` and `matplotlib.colorbar.Colorbar` have no effect because they are always overridden by the mappable's colormap and norm; they are thus deprecated. Likewise, passing the *alpha*, *boundaries*, *values*, *extend*, or *filled* parameters with a `.ContourSet` mappable, or the *alpha* parameter with an `.Artist` mappable, is deprecated, as the mappable would likewise override them.
es_es: Los parámetros *cmap* y *normal* de `.Figure.colorbar` y `matplotlib.colorbar. olorbar` no tienen efecto porque siempre son anulados por el mapa de color y la norma del mapeo; por lo tanto, están obsoletos. De la misma manera, pasando los parámetros *alpha*, *límites*, *valores*, *ampliado*, o *llenado* con un `. ontourSet` mapeable, o el parámetro *alpha* con un mapeable `.Artist`, es obsoleto, ya que el mapeable también los anularía.

source: ``args_key`` and ``exec_key`` attributes of builtin `.MovieWriter`\s
es_es: ``args_key`` y los atributos ``exec_key`` de builtin `.Mo)[video] Writer`\s

source: These attributes are deprecated.
es_es: Estos atributos están obsoletos.

source: Unused parameters
es_es: Parámetros no usados

source: The following parameters do not have any effect and are deprecated:
es_es: Los siguientes parámetros no tienen ningún efecto y están obsoletos:

source: arbitrary keyword arguments to ``StreamplotSet``
es_es: argumentos de palabra clave arbitrarios a ``StreamplotSet``

source: parameter *quantize* of `.Path.cleaned()`
es_es: parámetro *quantize* de `.Path.cleaned()`

source: parameter *s* of `.AnnotationBbox.get_fontsize()`
es_es: parámetro *s* de `.AnnotationBbox.get_fontsize()`

source: parameter *label* of `.Tick`
es_es: parámetro *etiqueta* de `.Tick`

source: Passing *props* to `.Shadow`
es_es: Pasando *props* a `.Shadow`

source: The parameter *props* of `.Shadow` is deprecated. Use keyword arguments instead.
es_es: El parámetro *props* de `.Shadow` está obsoleto. Use argumentos de palabra clave en su lugar.

source: ``Axes.update_datalim_bounds``
es_es: ``Ejes.update_datalim_limunds``

source: This method is deprecated. Use ``ax.dataLim.set(Bbox.union([ax.dataLim, bounds]))`` instead.
es_es: Este método está obsoleto. Utilice ``ax.dataLim.set(Bbox.union([ax.dataLim, límites])`` en su lugar.

source: ``{,Symmetrical}LogScale.{,Inverted}LogTransform``
es_es: ``(Aplausos) Simétrica }Escala de Log. Invertida}Transforma``

source: ``LogScale.LogTransform``, ``LogScale.InvertedLogTransform``, ``SymmetricalScale.SymmetricalTransform`` and ``SymmetricalScale.InvertedSymmetricalTransform`` are deprecated. Directly access the transform classes from the :mod:`.scale` module.
es_es: ``LogScale.LogTransform``, ``LogScale.InvertedLogTransform``, ``SymmetricalScale.SymmetricalTransform`` y ``SymmetricalScale.InvertedSymmetricalTransform`` están desaprobados. Acceda directamente a las clases de transformación del módulo :mod:`.scale`.

source: Use `matplotlib.get_cachedir()` instead for the former; there is no replacement for the latter.
es_es: En su lugar, use `matplotlib.get_cachedir()` para el primero; no hay reemplazo para el segundo.

source: Setting `.Line2D`\'s pickradius via `.Line2D.set_picker`
es_es: Configurando el radio de selección de `.Line2D` a través de `.Line2D.set_picker`

source: Setting a `.Line2D`\'s pickradius (i.e. the tolerance for pick events and containment checks) via `.Line2D.set_picker` is deprecated. Use `.Line2D.set_pickradius` instead.
es_es: Establecer un radio de selección `.Line2D` (es decir, la tolerancia para seleccionar eventos y comprobaciones de contenido) a través de `.Line2D.set_picker` es obsoleto. Usa `.Line2D.set_pickradius` en su lugar.

source: `.Line2D.set_picker` no longer sets the artist's custom-contain() check.
es_es: `.Line2D.set_picker` ya no establece la comprobación custom-contain() del artista.

source: Setting a custom method overriding `.Artist.contains` is deprecated. There is no replacement, but you may still customize pick events using `.Artist.set_picker`.
es_es: Establecer un método personalizado sobre `.Artist.contains` está obsoleto. No hay reemplazo, pero puedes personalizar los eventos de selección usando `.Artist.set_picker`.

source: `~matplotlib.colorbar.Colorbar` methods
es_es: Métodos `~matplotlib.colorbar.Colorbar`

source: The ``on_mappable_changed`` and ``update_bruteforce`` methods of `~matplotlib.colorbar.Colorbar` are deprecated; both can be replaced by calls to `~matplotlib.colorbar.Colorbar.update_normal`.
es_es: Los métodos ``on_mappable_changed`` y ``update_bruteforce`` de `~matplotlib.colorbar.Colorbar` están obsoletos; ambos pueden ser reemplazados por llamadas a `~matplotlib.colorbar.Colorbar.update_normal`.

source: ``OldScalarFormatter``, ``IndexFormatter`` and ``IndexDateFormatter``
es_es: ``OldScalarFormatter``, ``IndexFormatter`` y ``IndexDateFormatter``

source: These formatters are deprecated. Their functionality can be implemented using e.g. `.FuncFormatter`.
es_es: Estos formateadores están obsoletos. Su funcionalidad puede ser implementada usando por ejemplo `.FuncFormatter`.

source: This ticker is deprecated.
es_es: Este ticker está obsoleto.

source: *required*, *forbidden* and *allowed* parameters of `.cbook.normalize_kwargs`
es_es: *requerido*, *prohibido* y *permitidos* parámetros de `.cbook.normalize_kwargs`

source: These parameters are deprecated.
es_es: Estos parámetros están obsoletos.

source: The ``TTFPATH`` and ``AFMPATH`` environment variables
es_es: Las variables de entorno ``TTFPATH`` y ``AFMPATH``

source: Support for the (undocumented) ``TTFPATH`` and ``AFMPATH`` environment variables is deprecated. Additional fonts may be registered using ``matplotlib.font_manager.fontManager.addfont()``.
es_es: Soporte para las variables de entorno (indocumentadas) ``TTFPATH`` y ``AFMPATH`` está obsoleto. Las fuentes adicionales pueden ser registradas usando ``matplotlib.font_manager.fontManager.addfont()``.

source: This module is deprecated.
es_es: Este módulo está obsoleto.

source: This module is deprecated. Use ``matplotlib.backends.backend_qt5.SubplotToolQt`` instead.
es_es: Este módulo está obsoleto. Utilice en su lugar ``matplotlib.backends.backend_qt5.SubplotToolQt``.

source: AVConv animation writer deprecated
es_es: Escritor de animación AVConv obsoleto

source: The ``AVConvBase``, ``AVConvWriter`` and ``AVConvFileWriter`` classes, and the associated ``animation.avconv_path`` and ``animation.avconv_args`` rcParams are deprecated.
es_es: Las clases ``AVConvBase``, ``AVConvWriter`` y ``AVConvFileWriter``, y las clases ``animation.avconv_path`` asociadas y ``animation.avconv_args`` rcParams están obsoletas.

source: Debian 8 (2015, EOL 06/2020) and Ubuntu 14.04 (EOL 04/2019) were the last versions of Debian and Ubuntu to ship avconv. It remains possible to force the use of avconv by using the ffmpeg-based writers with :rc:`animation.ffmpeg_path` set to "avconv".
es_es: Debian 8 (2015, EOL 06/2020) y Ubuntu 14.04 (EOL 04/2019) fueron las últimas versiones de Debian y Ubuntu que enviaron avconv. Sigue siendo posible forzar el uso de avconv usando los escritores basados en ffmpeg con :rc:`animation.ffmpeg_path` establecido en "avconv".

source: log/symlog scale base, ticks, and nonpos specification
es_es: base de escalas de log/symlog, ticks, y especificaciones de no pos

source: `~.Axes.semilogx`, `~.Axes.semilogy`, `~.Axes.loglog`, `.LogScale`, and `.SymmetricalLogScale` used to take keyword arguments that depends on the axis orientation ("basex" vs "basey", "subsx" vs "subsy", "nonposx" vs "nonposy"); these parameter names are now deprecated in favor of "base", "subs", "nonpositive". This deprecation also affects e.g. ``ax.set_yscale("log", basey=...)`` which must now be spelled ``ax.set_yscale("log", base=...)``.
es_es: `~.Axes.semilogx`, `~.Axes.semilogy`, `~.Axes.log`, `.LogScale`, y `. ymmetricalLogScale` utilizado para tomar argumentos de palabra clave que dependen de la orientación del eje ("basex" vs "basey", "subsx" vs "subsy", "nonposx" vs "no posy"); estos nombres de parámetros ahora están obsoletos a favor de "base", "subs", "nonpositive". Esta desaprobación también afecta por ejemplo ``ax.set_yscale("log", basey=...)`` que ahora debe ser escrita ``ax.set_yscale("log", base=...)``.

source: The change from "nonpos" to "nonpositive" also affects `~.scale.LogTransform`, `~.scale.InvertedLogTransform`, `~.scale.SymmetricalLogTransform`, etc.
es_es: El cambio de "nonpos" a "nonpositive" también afecta a `~.scale.LogTransform`, `~.scale.InvertedLogTransform`, `~.scale.SymmetricalLogTransform`, etc.

source: To use *different* bases for the x-axis and y-axis of a `~.Axes.loglog` plot, use e.g. ``ax.set_xscale("log", base=10); ax.set_yscale("log", base=2)``.
es_es: Para utilizar bases *diferentes* para los ejes X e Y de un gráfico `~.Axes.loglog`, utiliza, por ejemplo, ``ax.set_xscale("log", base=10); ax.set_yscale("log", base=2)``.

source: ``DraggableBase.artist_picker``
es_es: ``ArrastrableBase.artist_picker``
