Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_3.4.0.po
Languages: es_es

source: The ``MathtextBackendPdf``, ``MathtextBackendPs``, ``MathtextBackendSvg``, and ``MathtextBackendCairo`` classes from the :mod:`.mathtext` module, as well as the corresponding ``.mathtext_parser`` attributes on ``RendererPdf``, ``RendererPS``, ``RendererSVG``, and ``RendererCairo``, are deprecated. The ``MathtextBackendPath`` class can be used to obtain a list of glyphs and rectangles in a mathtext expression, and renderer-specific logic should be directly implemented in the renderer.
es_es: Las clases ``MathtextBackendPdf``, ``MathtextBackendPs``, ``MathtextBackendSvg``, y ``MathtextBackendCairo`` del módulo :mod:`.mathtext`, así como los correspondientes atributos ``.mathtext_parser`` en ``RendererPdf``, ``RendererPS``, ``RendererSVG``, y ``RendererCairo``, están obsoletos. La clase ``MathtextBackendPath`` puede utilizarse para obtener una lista de glifos y rectángulos en una expresión de texto matemático, y la lógica específica del renderizador debería implementarse directamente en el renderizador.

source: ``StandardPsFonts.pswriter`` is unused and deprecated.
es_es: ``StandardPsFonts.pswriter`` no se utiliza y está obsoleto.

source: Widget class internals
es_es: Clases internas de Widget

source: Several `.widgets.Widget` class internals have been privatized and deprecated:
es_es: Varios elementos internos de la clase `.widgets.Widget` han sido privatizados y obsoletos:

source: ``Button.cnt`` and ``Button.observers``
es_es: ``Button.cnt`` y ``Button.observers``

source: ``CheckButtons.cnt`` and ``CheckButtons.observers``
es_es: ``CheckButtons.cnt`` y ``CheckButtons.observers``

source: ``RadioButtons.cnt`` and ``RadioButtons.observers``
es_es: ``RadioButtons.cnt`` y ``RadioButtons.observers``

source: ``Slider.cnt`` and ``Slider.observers``
es_es: ``Slider.cnt`` y ``Slider.observers``

source: ``TextBox.cnt``, ``TextBox.change_observers`` and ``TextBox.submit_observers``
es_es: ``TextBox.cnt``, ``TextBox.change_observers`` y ``TextBox.submit_observers``

source: 3D properties on renderers
es_es: Propiedades 3D en los renderizadores

source: The properties of the 3D Axes that were placed on the Renderer during draw are now deprecated:
es_es: Las propiedades de los Ejes 3D que se colocaban en el Renderizador durante el dibujo están ahora obsoletas:

source: These attributes are all available via `.Axes3D`, which can be accessed via ``self.axes`` on all `.Artist`\s.
es_es: Estos atributos están disponibles a través de `.Axes3D`, al que se puede acceder a través de ``self.axes`` en todos los `.Artist`.

source: *renderer* argument of ``do_3d_projection`` method for ``Collection3D``/``Patch3D``
es_es: Argumento *renderer* del método ``do_3d_projection`` para ``Collection3D``/`Patch3D``

source: The *renderer* argument for the ``do_3d_projection`` method on ``Collection3D`` and ``Patch3D`` is no longer necessary, and passing it during draw is deprecated.
es_es: El argumento *renderer* para el método ``do_3d_projection`` en ``Collection3D`` y ``Patch3D`` ya no es necesario, y pasarlo durante el dibujo está obsoleto.

source: *project* argument of ``draw`` method for ``Line3DCollection``
es_es: Argumento *project* del método ``draw`` para ``Line3DCollection``

source: The *project* argument for the ``draw`` method on ``Line3DCollection`` is deprecated. Call `.Line3DCollection.do_3d_projection` explicitly instead.
es_es: El argumento *project* para el método ``draw`` en ``Line3DCollection`` está obsoleto. invoca a `.Line3DCollection.do_3d_projection` explícitamente en su lugar.

source: Extra positional parameters to ``plot_surface`` and ``plot_wireframe``
es_es: Parámetros de posición adicionales para ``plot_surface`` y ``plot_wireframe``

source: Positional parameters to `~.axes3d.Axes3D.plot_surface` and `~.axes3d.Axes3D.plot_wireframe` other than ``X``, ``Y``, and ``Z`` are deprecated. Pass additional artist properties as keyword arguments instead.
es_es: Los parámetros de posición para `~.axes3d.Axes3D.plot_surface` y `~.axes3d.Axes3D.plot_wireframe` que no sean ``X``, ``Y`` y ``Z`` están obsoletos. En su lugar, pase las propiedades adicionales del artist como argumentos de palabra clave.

source: ``ParasiteAxesAuxTransBase`` class
es_es: Clase ``ParasiteAxesAuxTransBase``

source: The functionality of that mixin class has been moved to the base ``ParasiteAxesBase`` class. Thus, ``ParasiteAxesAuxTransBase``, ``ParasiteAxesAuxTrans``, and ``parasite_axes_auxtrans_class_factory`` are deprecated.
es_es: La funcionalidad de esa clase mixin se ha trasladado a la clase base ``ParasiteAxesBase``. Por lo tanto, ``ParasiteAxesAuxTransBase``, ``ParasiteAxesAuxTrans``, y ``parasite_axes_auxtrans_class_factory`` están obsoletos.

source: In general, it is suggested to use ``HostAxes.get_aux_axes`` to create parasite Axes, as this saves the need of manually appending the parasite to ``host.parasites`` and makes sure that their ``remove()`` method works properly.
es_es: En general, se sugiere utilizar ``HostAxes.get_aux_axes`` para crear ejes parásitos, ya que esto ahorra la necesidad de añadir manualmente el parásito a ``host.parasites`` y asegura que su método ``remove()`` funciona correctamente.

source: ``AxisArtist.ZORDER`` attribute
es_es: Atributo ``AxisArtist.ZORDER``

source: Use ``AxisArtist.zorder`` instead.
es_es: Utiliza ``AxisArtist.zorder`` en su lugar.

source: ``GridHelperBase`` invalidation
es_es: ``GridHelperBase`` invalidación

source: The ``GridHelperBase.invalidate``, ``GridHelperBase.valid``, and ``axislines.Axes.invalidate_grid_helper`` methods are considered internal and deprecated.
es_es: Los métodos ``GridHelperBase.invalidate``, ``GridHelperBase.valid`` y ``axislines.Axes.invalidate_grid_helper`` se consideran internos y obsoletos.

source: ... is deprecated. Use ``docutils.parsers.rst.directives.images.Image.align`` instead.
es_es: ... está obsoleto. Utiliza ``docutils.parsers.rst.directives.images.Image.align`` en su lugar.

source: Deprecation-related functionality is considered internal
es_es: La funcionalidad relacionada con la obsolescencia se considera interna

source: The module ``matplotlib.cbook.deprecation`` is considered internal and will be removed from the public API. This also holds for deprecation-related re-imports in ``matplotlib.cbook``, i.e. ``matplotlib.cbook.deprecated()``, ``matplotlib.cbook.warn_deprecated()``, ``matplotlib.cbook.MatplotlibDeprecationWarning`` and ``matplotlib.cbook.mplDeprecation``.
es_es: El módulo ``matplotlib.cbook.deprecation`` se considera interno y será eliminado de la API pública. Esto también es válido para las reimportaciones relacionadas con la obsolescencia en ``matplotlib.cbook``, es decir, ``matplotlib.cbook.deprecated()``, ``matplotlib.cbook.warn_deprecated()``, ``matplotlib.cbook.MatplotlibDeprecationWarning`` y ``matplotlib.cbook.mplDeprecation``.

source: If needed, external users may import ``MatplotlibDeprecationWarning`` directly from the ``matplotlib`` namespace. ``mplDeprecation`` is only an alias of ``MatplotlibDeprecationWarning`` and should not be used anymore.
es_es: Si es necesario, los usuarios externos pueden importar ``MatplotlibDeprecationWarning`` directamente desde el espacio de nombres ``matplotlib``. ``mplDeprecation`` es sólo un alias de ``MatplotlibDeprecationWarning`` y no debería usarse más.

source: Removals
es_es: Eliminar

source: The following deprecated APIs have been removed:
es_es: Se han eliminado las siguientes APIs obsoletas:

source: Removed behaviour
es_es: Comportamiento eliminado

source: The "smart bounds" functionality on `~.axis.Axis` and `.Spine` has been deleted, and the related methods have been removed.
es_es: Se ha eliminado la funcionalidad de "límites inteligentes" en `~.axis.Axis` y `.Spine`, y se han eliminado los métodos relacionados.

source: Converting a string with single color characters (e.g. ``'cymk'``) in `~.colors.to_rgba_array` is no longer supported. Instead, the colors can be passed individually in a list (e.g. ``['c', 'y', 'm', 'k']``).
es_es: Ya no se admite la conversión de una cadena con caracteres de un solo color (por ejemplo, ``'cymk'``) en `~.colors.to_rgba_array`. En su lugar, los colores se pueden pasar individualmente en una lista (por ejemplo, ``['c', 'y', 'm', 'k']``).

source: Returning a factor equal to ``None`` from ``mpl_toolkits.axisartist`` Locators (which are **not** the same as "standard" tick Locators), or passing a factor equal to ``None`` to axisartist Formatters (which are **not** the same as "standard" tick Formatters) is no longer supported. Pass a factor equal to 1 instead.
es_es: Ya no se admite devolver un factor igual a ``None`` de los localizadores ``mpl_toolkits.axisartist`` (que **no** son los mismos que los localizadores de ticks "estándar"), ni pasar un factor igual a ``None`` a los formateadores de axisartist (que **no** son los mismos que los formateadores de ticks "standard"). Pase un factor igual a 1 en su lugar.

source: Modules
es_es: Módulos

source: The entire ``matplotlib.testing.disable_internet`` module has been removed. The `pytest-remotedata package <https://github.com/astropy/pytest-remotedata>`_ can be used instead.
es_es: Se ha eliminado todo el módulo ``matplotlib.testing.disable_internet``. En su lugar se puede utilizar el paquete `pytest-remotedata <https://github.com/astropy/pytest-remotedata>`_.

source: The ``mpl_toolkits.axes_grid1.colorbar`` module and its colorbar implementation have been removed in favor of `matplotlib.colorbar`.
es_es: El módulo ``mpl_toolkits.axes_grid1.colorbar`` y su implementación de la barra de colores han sido eliminados en favor de `matplotlib.colorbar`.

source: Classes, methods and attributes
es_es: Clases, métodos y atributos

source: The `.animation.MovieWriterRegistry` methods ``.set_dirty()``, ``.ensure_not_dirty()``, and ``.reset_available_writers()`` do nothing and have been removed. The ``.avail()`` method has been removed; use ``.list()`` instead to get a list of available writers.
es_es: Los métodos `.animation.MovieWriterRegistry` ``.set_dirty()``, ``.ensure_not_dirty()``, y ``.reset_available_writers()`` no hacen nada y han sido eliminados. Se ha eliminado el método ``.avail()``; en su lugar, utiliza ``.list()`` para obtener una lista de escritores disponibles.

source: The ``matplotlib.artist.Artist.eventson`` and ``matplotlib.container.Container.eventson`` attributes have no effect and have been removed.
es_es: Los atributos ``matplotlib.artist.Artist.eventson`` y ``matplotlib.container.Container.eventson`` no tienen efecto y han sido eliminados.

source: ``matplotlib.axes.Axes.get_data_ratio_log`` has been removed.
es_es: ``matplotlib.axes.Axes.get_data_ratio_log`` ha sido eliminado.

source: ``matplotlib.axes.SubplotBase.rowNum``; use ``ax.get_subplotspec().rowspan.start`` instead.
es_es: ``matplotlib.axes.SubplotBase.rowNum``; usa ``ax.get_subplotspec().rowspan.start`` en su lugar.

source: ``matplotlib.axes.SubplotBase.colNum``; use ``ax.get_subplotspec().colspan.start`` instead.
es_es: ``matplotlib.axes.SubplotBase.colNum``; usa ``ax.get_subplotspec().colspan.start`` en su lugar.

source: ``matplotlib.axis.Axis.set_smart_bounds`` and ``matplotlib.axis.Axis.get_smart_bounds`` have been removed.
es_es: ``matplotlib.axis.Axis.set_smart_bounds`` y ``matplotlib.axis.Axis.get_smart_bounds`` han sido eliminados.

source: ``matplotlib.colors.DivergingNorm`` has been renamed to `~matplotlib.colors.TwoSlopeNorm`.
es_es: ``matplotlib.colors.DivergingNorm`` ha sido renombrado a `~matplotlib.colors.TwoSlopeNorm`.

source: ``matplotlib.figure.AxesStack`` has been removed.
es_es: ``matplotlib.figure.AxesStack`` ha sido eliminado.

source: ``matplotlib.font_manager.JSONEncoder`` has been removed; use `.font_manager.json_dump` to dump a `.FontManager` instance.
es_es: ``matplotlib.font_manager.JSONEncoder`` ha sido eliminado; usa `.font_manager.json_dump` para volcar una instancia de `.FontManager`.

source: The ``matplotlib.ft2font.FT2Image`` methods ``.as_array()``, ``.as_rgba_str()``, ``.as_str()``, ``.get_height()`` and ``.get_width()`` have been removed. Convert the ``FT2Image`` to a NumPy array with ``np.asarray`` before processing it.
es_es: Los métodos ``matplotlib.ft2font.FT2Image`` ``.as_array()``, ``.as_rgba_str()``, ``.as_str()``, ``.get_height()`` y ``.get_width()`` han sido eliminados. Convierte la ``FT2Image`` en un arreglo de NumPy con ``np.asarray`` antes de procesarla.

source: ``matplotlib.quiver.QuiverKey.quiverkey_doc`` has been removed; use ``matplotlib.quiver.QuiverKey.__init__.__doc__`` instead.
es_es: ``matplotlib.quiver.QuiverKey.quiverkey_doc`` ha sido eliminado; utiliza ``matplotlib.quiver.QuiverKey.__init__.__doc__`` en su lugar.

source: ``matplotlib.spines.Spine.set_smart_bounds`` and ``matplotlib.spines.Spine.get_smart_bounds`` have been removed.
es_es: ``matplotlib.spines.Spine.set_smart_bounds`` y ``matplotlib.spines.Spine.get_smart_bounds`` han sido eliminados.

source: ``matplotlib.testing.jpl_units.UnitDbl.checkUnits`` has been removed; use ``units not in self.allowed`` instead.
es_es: Se ha eliminado ``matplotlib.testing.jpl_units.UnitDbl.checkUnits``; en su lugar, utiliza ``units no incluidas en self.allowed``.

source: The unused ``matplotlib.ticker.Locator.autoscale`` method has been removed (pass the axis limits to `.Locator.view_limits` instead). The derived methods ``Locator.autoscale``, ``AutoDateLocator.autoscale``, ``RRuleLocator.autoscale``, ``RadialLocator.autoscale``, ``ThetaLocator.autoscale``, and ``YearLocator.autoscale`` have also been removed.
es_es: Se ha eliminado el método ``matplotlib.ticker.Locator.autoscale`` que no se utilizaba (en su lugar se pasan los límites de los ejes a `.Locator.view_limits`). Los métodos derivados ``Locator.autoscale``, ``AutoDateLocator.autoscale``, ``RRuleLocator.autoscale``, ``RadialLocator.autoscale``, ``ThetaLocator.autoscale``, y `YearLocator.autoscale`` también han sido eliminados.

source: ``matplotlib.transforms.BboxBase.is_unit`` has been removed; check the `.Bbox` extents if needed.
es_es: ``matplotlib.transforms.BboxBase.is_unit`` ha sido eliminado; comprueba las extensiones `.Bbox` si es necesario.

source: ``matplotlib.transforms.Affine2DBase.matrix_from_values(...)`` has been removed; use (for example) ``Affine2D.from_values(...).get_matrix()`` instead.
es_es: ``matplotlib.transforms.Affine2DBase.matrix_from_values(...)`` ha sido eliminado; use (por ejemplo) ``Affine2D.from_values(...).get_matrix()`` en su lugar.

source: ``matplotlib.backend_bases.FigureCanvasBase.draw_cursor`` has been removed.
es_es: ``matplotlib.backend_bases.FigureCanvasBase.draw_cursor`` ha sido eliminado.

source: ``matplotlib.backends.backend_gtk.ConfigureSubplotsGTK3.destroy`` and ``matplotlib.backends.backend_gtk.ConfigureSubplotsGTK3.init_window`` methods have been removed.
es_es: Los métodos ``matplotlib.backends.backend_gtk.ConfigureSubplotsGTK3.destroy`` y ``matplotlib.backends.backend_gtk.ConfigureSubplotsGTK3.init_window`` han sido eliminados.

source: ``matplotlib.backends.backend_gtk.ConfigureSubplotsGTK3.window`` property has been removed.
es_es: La propiedad ``matplotlib.backends.backend_gtk.ConfigureSubplotsGTK3.window`` ha sido eliminada.

source: ``matplotlib.backends.backend_macosx.FigureCanvasMac.invalidate`` has been removed.
es_es: ``matplotlib.backends.backend_macosx.FigureCanvasMac.invalidate`` ha sido eliminado.

source: ``matplotlib.backends.backend_pgf.RendererPgf.latexManager`` has been removed.
es_es: ``matplotlib.backends.backend_pgf.RendererPgf.latexManager`` ha sido eliminado.

source: ``matplotlib.backends.backend_wx.FigureFrameWx.statusbar``, ``matplotlib.backends.backend_wx.NavigationToolbar2Wx.set_status_bar``, and ``matplotlib.backends.backend_wx.NavigationToolbar2Wx.statbar`` have been removed. The status bar can be retrieved by calling standard wx methods (``frame.GetStatusBar()`` and ``toolbar.GetTopLevelParent().GetStatusBar()``).
es_es: Se han eliminado ``matplotlib.backends.backend_wx.FigureFrameWx.statusbar``, ``matplotlib.backends.backend_wx.NavigationToolbar2Wx.set_status_bar`` y ``matplotlib.backends.backend_wx.NavigationToolbar2Wx.statbar``. La barra de estado se puede recuperar invocando métodos wx estándar (``frame.GetStatusBar()`` y ``toolbar.GetTopLevelParent().GetStatusBar()``).

source: ``matplotlib.backends.backend_wx.ConfigureSubplotsWx.configure_subplots`` and ``matplotlib.backends.backend_wx.ConfigureSubplotsWx.get_canvas`` have been removed.
es_es: Se han eliminado ``matplotlib.backends.backend_wx.ConfigureSubplotsWx.configure_subplots`` y ``matplotlib.backends.backend_wx.ConfigureSubplotsWx.get_canvas``.

source: ``mpl_toolkits.axisartist.grid_finder.GridFinderBase`` has been removed; use `.GridFinder` instead.
es_es: Se ha eliminado ``mpl_toolkits.axisartist.grid_finder.GridFinderBase``; utiliza `.GridFinder` en su lugar.

source: ``mpl_toolkits.axisartist.axis_artist.BezierPath`` has been removed; use `.patches.PathPatch` instead.
es_es: Se ha eliminado ``mpl_toolkits.axisartist.axis_artist.BezierPath``; utiliza en su lugar `.patches.PathPatch``.

source: Functions
es_es: Funciones

source: ``matplotlib.backends.backend_pgf.repl_escapetext`` and ``matplotlib.backends.backend_pgf.repl_mathdefault`` have been removed.
es_es: Se han eliminado ``matplotlib.backends.backend_pgf.repl_escapetext`` y ``matplotlib.backends.backend_pgf.repl_mathdefault``.

source: ``matplotlib.checkdep_ps_distiller`` has been removed.
es_es: ``matplotlib.checkdep_ps_distiller`` ha sido eliminado.

source: ``matplotlib.cm.revcmap`` has been removed; use `.Colormap.reversed` instead.
es_es: ``matplotlib.cm.revcmap`` ha sido eliminado; usa `.Colormap.reversed` en su lugar.

source: ``matplotlib.colors.makeMappingArray`` has been removed.
es_es: ``matplotlib.colors.makeMappingArray`` ha sido eliminado.

source: ``matplotlib.compare_versions`` has been removed; use comparison of ``distutils.version.LooseVersion``\s instead.
es_es: Se ha eliminado ``matplotlib.compare_versions``; en su lugar, utiliza la comparación de ``distutils.version.LooseVersion``.

source: ``matplotlib.dates.mx2num`` has been removed.
es_es: ``matplotlib.dates.mx2num`` ha sido eliminado.

source: ``matplotlib.font_manager.createFontList`` has been removed; `.font_manager.FontManager.addfont` is now available to register a font at a given path.
es_es: Se ha eliminado ``matplotlib.font_manager.createFontList``; ahora está disponible `.font_manager.FontManager.addfont` para registrar una fuente en una ruta determinada.

source: ``matplotlib.get_home`` has been removed; use standard library instead.
es_es: ``matplotlib.get_home`` ha sido eliminado; usa librería estándar en su lugar.

source: ``matplotlib.mlab.apply_window`` and ``matplotlib.mlab.stride_repeat`` have been removed.
es_es: Se han eliminado ``matplotlib.mlab.apply_window`` y ``matplotlib.mlab.stride_repeat``.

source: ``matplotlib.rcsetup.update_savefig_format`` has been removed; this just replaced ``'auto'`` with ``'png'``, so do the same.
es_es: Se ha eliminado ``matplotlib.rcsetup.update_savefig_format``; esto acaba de sustituir ``'auto'`` por ``'png'``, así que haz lo mismo.

source: ``matplotlib.rcsetup.validate_animation_writer_path`` has been removed.
es_es: ``matplotlib.rcsetup.validate_animation_writer_path`` ha sido eliminado.

source: ``matplotlib.rcsetup.validate_path_exists`` has been removed; use `os.path.exists` or `pathlib.Path.exists` instead.
es_es: ``matplotlib.rcsetup.validate_path_exists`` ha sido eliminado; usa `os.path.exists` o `pathlib.Path.exists` en su lugar.

source: ``matplotlib.style.core.is_style_file`` and ``matplotlib.style.core.iter_style_files`` have been removed.
es_es: ``matplotlib.style.core.is_style_file`` y ``matplotlib.style.core.iter_style_files`` han sido eliminados.

source: ``matplotlib.testing.is_called_from_pytest`` has been removed.
es_es: ``matplotlib.testing.is_called_from_pytest`` ha sido eliminado.

source: ``mpl_toolkits.mplot3d.axes3d.unit_bbox`` has been removed; use `.Bbox.unit` instead.
es_es: ``mpl_toolkits.mplot3d.axes3d.unit_bbox`` ha sido eliminado; usa `.Bbox.unit` en su lugar.

source: Arguments
es_es: Argumentos

source: Passing more than one positional argument to `.axes.Axes.axis` will now raise an error.
es_es: Si se pasa más de un argumento posicional a `.axes.Axes.axis` ahora se producirá un error.

source: Passing ``"range"`` to the *whis* parameter of `.Axes.boxplot` and `.cbook.boxplot_stats` to mean "the whole data range" is no longer supported.
es_es: Ya no se admite pasar ``"range"`` al parámetro *whis* de `.Axes.boxplot` y `.cbook.boxplot_stats` para significar "todo el rango de datos".

source: Passing scalars to the *where* parameter in `.axes.Axes.fill_between` and `.axes.Axes.fill_betweenx` is no longer accepted and non-matching sizes now raise a `ValueError`.
es_es: Ya no se acepta el paso de escalares al parámetro *where* en `.axes.Axes.fill_between` y `.axes.Axes.fill_betweenx` y los tamaños no correspondientes ahora plantean un `ValueError`.

source: The *verts* parameter to `.Axes.scatter` has been removed; use *marker* instead.
es_es: Se ha eliminado el parámetro *verts* de `.Axes.scatter`; utiliza en su lugar *marker*.

source: The *minor* parameter in `.Axis.set_ticks` and ``SecondaryAxis.set_ticks`` is now keyword-only.
es_es: El parámetro *minor* en `.Axis.set_ticks` y `SecondaryAxis.set_ticks` ahora es de palabra clave.

source: `.scale.ScaleBase`, `.scale.LinearScale` and `.scale.SymmetricalLogScale` now error if any unexpected keyword arguments are passed to their constructors.
es_es: Los programas `.scale.ScaleBase`, `.scale.LinearScale` y `.scale.SymmetricalLogScale` ahora dan un error si se pasan argumentos inesperados a sus constructores.

source: The *renderer* parameter to `.Figure.tight_layout` has been removed; this method now always uses the renderer instance cached on the `.Figure`.
es_es: Se ha eliminado el parámetro *renderer* de `.Figure.tight_layout`; ahora este método utiliza siempre la instancia de renderización almacenada en la caché de `.Figure`.

source: The *locator* parameter to `mpl_toolkits.axes_grid1.axes_grid.CbarAxesBase.colorbar` has been removed in favor of its synonym *ticks* (which already existed previously, and is consistent with :mod:`matplotlib.colorbar`).
es_es: El parámetro *locator* de `mpl_toolkits.axes_grid1.axes_grid.CbarAxesBase.colorbar` ha sido eliminado en favor de su sinónimo *ticks* (que ya existía previamente, y es consistente con :mod:`matplotlib.colorbar`).

source: The *switch_backend_warn* parameter to ``matplotlib.test`` has no effect and has been removed.
es_es: El parámetro *switch_backend_warn* de ``matplotlib.test`` no tiene efecto y ha sido eliminado.

source: The *dryrun* parameter to the various ``FigureCanvas*.print_*`` methods has been removed.
es_es: Se ha eliminado el parámetro *dryrun* de los distintos métodos ``FigureCanvas*.print_*``.

source: The ``datapath`` rcParam has been removed. Use `matplotlib.get_data_path` instead.
es_es: Se ha eliminado el rcParam ``datapath``. Utiliza `matplotlib.get_data_path` en su lugar.

source: The ``mpl_toolkits.legacy_colorbar`` rcParam has no effect and has been removed.
es_es: El rcParam ``mpl_toolkits.legacy_colorbar`` no tiene efecto y ha sido eliminado.

source: Setting :rc:`boxplot.whiskers` to ``"range"`` is no longer valid; set it to ``0, 100`` instead.
es_es: Establecer :rc:`boxplot.whiskers` a ``"range"`` ya no es válido; establézcalo a ``0, 100`` en su lugar.

source: Setting :rc:`savefig.format` to ``"auto"`` is no longer valid; use ``"png"`` instead.
es_es: Establecer :rc:`savefig.format` a ``"auto"`` ya no es válido; usa ``"png"`` en su lugar.
