Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_2.1.0.po
Languages: es_es

source: API Changes in 2.1.0
es_es: Cambios de API en 2.1.0

source: Default behavior of log scales changed to mask <= 0 values
es_es: Comportamiento por defecto de escalas de registro cambiadas a máscara <= 0 valores

source: Calling `matplotlib.axes.Axes.set_xscale` or `matplotlib.axes.Axes.set_yscale` now uses 'mask' as the default method to handle invalid values (as opposed to 'clip'). This means that any values <= 0 on a log scale will not be shown.
es_es: Llamando a `matplotlib.axes.Axes.set_xscale` o `matplotlib.axes.Axes. et_yscale` ahora usa 'mask' como método predeterminado para manejar valores no válidos (a diferencia de 'clip'). Esto significa que cualquier valor <= 0 en una escala de registro no se mostrará.

source: Previously they were clipped to a very small number and shown.
es_es: Anteriormente fueron recortados a un número muy pequeño y mostrados.

source: :meth:`matplotlib.cbook.CallbackRegistry.process` suppresses exceptions by default
es_es: :meth:`matplotlib.cbook.CallbackRegistry.process` elimina las excepciones por defecto

source: Matplotlib uses instances of :obj:`~matplotlib.cbook.CallbackRegistry` as a bridge between user input event from the GUI and user callbacks. Previously, any exceptions raised in a user call back would bubble out of the ``process`` method, which is typically in the GUI event loop. Most GUI frameworks simple print the traceback to the screen and continue as there is not always a clear method of getting the exception back to the user. However PyQt5 now exits the process when it receives an un-handled python exception in the event loop. Thus, :meth:`~matplotlib.cbook.CallbackRegistry.process` now suppresses and prints tracebacks to stderr by default.
es_es: Matplotlib utiliza instancias de :obj:`~matplotlib.cbook.CallbackRegistry` como un puente entre el evento de entrada de usuario de la GUI y las llamadas de usuario. Anteriormente, cualquier excepción planteada en una llamada de usuario volvería a salirse del método ``process``, que típicamente está en el bucle de eventos GUI. La mayoría de los frameworks GUI simplemente imprimen el traceback a la pantalla y continúan, ya que no siempre hay un método claro de devolver la excepción al usuario. Sin embargo, PyQt5 ahora sale del proceso cuando recibe una excepción de python no manejada en el bucle de eventos. Así, :meth:`~matplotlib.cbook.CallbackRegistry.process` ahora suprime e imprime los tracebacks a stderr por defecto.

source: What :meth:`~matplotlib.cbook.CallbackRegistry.process` does with exceptions is now user configurable via the ``exception_handler`` attribute and kwarg. To restore the previous behavior pass ``None`` ::
es_es: Lo que hace :meth:`~matplotlib.cbook.CallbackRegistry.process` con excepciones ahora es configurable por el usuario a través del atributo ``exception_handler`` y kwarg. Para restaurar el comportamiento anterior pase ``Ninguno`` ::

source: A function which take and ``Exception`` as its only argument may also be passed ::
es_es: Una función que toma y ``Excepción`` como su único argumento también puede ser pasado ::

source: Improved toggling of the axes grids
es_es: Interruptor mejorado de las rejillas de los ejes

source: The ``g`` key binding now switches the states of the ``x`` and ``y`` grids independently (by cycling through all four on/off combinations).
es_es: El enlace de la clave ``g`` ahora cambia los estados de las rejillas ``x`` y ``y`` de forma independiente (mediante el cicloturismo a través de las cuatro combinaciones on/off).

source: The new ``G`` key binding switches the states of the minor grids.
es_es: La nueva clave ``G`` cambia los estados de las rejillas menores.

source: Both bindings are disabled if only a subset of the grid lines (in either direction) is visible, to avoid making irreversible changes to the figure.
es_es: Ambos enlaces están desactivados si sólo un subconjunto de las líneas de cuadrícula (en cualquiera de las direcciones) es visible, para evitar hacer cambios irreversibles a la figura.

source: Ticklabels are turned off instead of being invisible
es_es: Etiqueta de la marca del eje se desactivan en lugar de ser invisibles

source: Internally, the `.Tick`'s ``~matplotlib.axis.Tick.label1On`` attribute is now used to hide tick labels instead of setting the visibility on the tick label objects. This improves overall performance and fixes some issues. As a consequence, in case those labels ought to be shown, :func:`~matplotlib.axes.Axes.tick_params` needs to be used, e.g.
es_es: Internamente, el atributo ``~matplotlib.axis.Tick.label1On`` de `.Tick` ahora se utiliza para ocultar etiquetas de tick en lugar de establecer la visibilidad en los objetos de la etiqueta tick. Esto mejora el rendimiento general y soluciona algunos problemas. Como consecuencia, en caso de que estas etiquetas deban ser mostradas, :func:`~matplotlib.axes.Axes.tick_params` necesita ser usado, p.ej.

source: Removal of warning on empty legends
es_es: Eliminación de advertencia en leyendas vacías

source: `.pyplot.legend` used to issue a warning when no labeled artist could be found. This warning has been removed.
es_es: `.pyplot.legend` solía emitir una advertencia cuando no se encontró ningún artista etiquetado. Esta advertencia ha sido eliminada.

source: More accurate legend autopositioning
es_es: Autoposicionamiento de leyendas más preciso

source: Automatic positioning of legends now prefers using the area surrounded by a `.Line2D` rather than placing the legend over the line itself.
es_es: La posición automática de las leyendas ahora prefiere usar el área rodeada por un `.Line2D` en lugar de colocar la leyenda sobre la línea misma.

source: Cleanup of stock sample data
es_es: Limpieza de datos de muestra de stock

source: The sample data of stocks has been cleaned up to remove redundancies and increase portability. The ``AAPL.dat.gz``, ``INTC.dat.gz`` and ``aapl.csv`` files have been removed entirely and will also no longer be available from `matplotlib.cbook.get_sample_data`. If a CSV file is required, we suggest using the ``msft.csv`` that continues to be shipped in the sample data. If a NumPy binary file is acceptable, we suggest using one of the following two new files. The ``aapl.npy.gz`` and ``goog.npy`` files have been replaced by ``aapl.npz`` and ``goog.npz``, wherein the first column's type has changed from `datetime.date` to `numpy.datetime64` for better portability across Python versions. Note that Matplotlib does not fully support `numpy.datetime64` as yet.
es_es: Los datos de muestra de las acciones se han limpiado para eliminar las redundancias y aumentar la portabilidad. Los ``AAPL.dat.gz``, ``INTC.dat.gz`` y ``aapl. los archivos sv`` han sido eliminados por completo y ya no estarán disponibles en `matplotlib.cbook.get_sample_data`. Si se requiere un archivo CSV, le sugerimos utilizar el ``msft.csv`` que continúa enviándose en los datos de muestra. Si un archivo binario NumPy es aceptable, le sugerimos que utilice uno de los siguientes dos ficheros nuevos. Los archivos ``aapl.npy.gz`` y ``goog.npy`` han sido reemplazados por ``aapl.npz`` y ``goog. pz``, donde el tipo de la primera columna ha cambiado de `datetime.date` a `numpy. atetime64` para una mejor portabilidad entre las versiones de Python. Tenga en cuenta que Matplotlib no soporta completamente `numpy.datetime64` todavía.

source: Updated qhull to 2015.2
es_es: qhull actualizado a 2015.2

source: The version of qhull shipped with Matplotlib, which is used for Delaunay triangulation, has been updated from version 2012.1 to 2015.2.
es_es: La versión de qhull cargada con Matplotlib, que se utiliza para triangulación de Delaunay, ha sido actualizada de la versión 2012.1 a 2015.2.

source: Improved Delaunay triangulations with large offsets
es_es: Triangulaciones de Delaunay mejoradas con grandes desplazamientos

source: Delaunay triangulations now deal with large x,y offsets in a better way. This can cause minor changes to any triangulations calculated using Matplotlib, i.e. any use of `matplotlib.tri.Triangulation` that requests that a Delaunay triangulation is calculated, which includes `matplotlib.pyplot.tricontour`, `matplotlib.pyplot.tricontourf`, `matplotlib.pyplot.tripcolor`, `matplotlib.pyplot.triplot`, ``matplotlib.mlab.griddata`` and `mpl_toolkits.mplot3d.axes3d.Axes3D.plot_trisurf`.
es_es: Las triangulaciones de Delaunay ahora tratan con grandes compensaciones x,y de una manera mejor. Esto puede causar cambios menores en cualquier triangulación calculada usando Matplotlib, i. . cualquier uso de `matplotlib.tri.Triangulation` que solicite que se calcule una triangulación de Delaunay, que incluye `matplotlib. yplot.tricontour`, `matplotlib.pyplot.tricontourf`, `matplotlib.pyplot.tripcolor`, `matplotlib.pyplot.triplot`, ``matplotlib.mlab.griddata`` y `mpl_toolkits.mplot3d.axes3d.Axes3D.plot_trisurf`.

source: Use ``backports.functools_lru_cache`` instead of ``functools32``
es_es: Usar ``backports.functools_lru_cache`` en lugar de ``functools32``

source: It's better maintained and more widely used (by pylint, jaraco, etc).
es_es: Es mejor mantenido y utilizado más ampliamente (por pylint, jaraco, etc.).

source: ``cbook.is_numlike`` only performs an instance check
es_es: ``cbook.is_numlike`` sólo realiza una comprobación de instancia

source: ``matplotlib.cbook.is_numlike`` now only checks that its argument is an instance of ``(numbers.Number, np.Number)``. In particular, this means that arrays are now not num-like.
es_es: ``matplotlib.cbook.is_numlike`` ahora sólo comprueba que su argumento es una instancia de ``(numbers.Number, np.Number)``. En particular, esto significa que ahora las matrices no son num-like.

source: Elliptical arcs now drawn between correct angles
es_es: Arcos elípticos dibujados entre ángulos correctos

source: The `matplotlib.patches.Arc` patch is now correctly drawn between the given angles.
es_es: El parche `matplotlib.patches.Arc` ahora se dibuja correctamente entre los ángulos dados.

source: Previously a circular arc was drawn and then stretched into an ellipse, so the resulting arc did not lie between *theta1* and *theta2*.
es_es: Anteriormente se dibujó un arco circular y luego se estiró en una elipse, por lo que el arco resultante no se encontraba entre *theta1* y *theta2*.

source: ``-d$backend`` no longer sets the backend
es_es: ``-d$backend`` ya no establece el backend

source: It is no longer possible to set the backend by passing ``-d$backend`` at the command line. Use the ``MPLBACKEND`` environment variable instead.
es_es: Ya no es posible establecer el backend pasando ``-d$backend`` en la línea de comandos. Utilice la variable de entorno ``MPLBACKEND`` en su lugar.

source: Path.intersects_bbox always treats the bounding box as filled
es_es: Path.intersects_bbox siempre trata la caja límite como llena

source: Previously, when ``Path.intersects_bbox`` was called with ``filled`` set to ``False``, it would treat both the path and the bounding box as unfilled. This behavior was not well documented and it is usually not the desired behavior, since bounding boxes are used to represent more complex shapes located inside the bounding box. This behavior has now been changed: when ``filled`` is ``False``, the path will be treated as unfilled, but the bounding box is still treated as filled. The old behavior was arguably an implementation bug.
es_es: Anteriormente, cuando ``Path.intersects_bbox`` fue llamado con ``filled`` establecido en ``False``, trataría tanto la ruta como la caja de límites como la no llenada. Este comportamiento no estaba bien documentado y usualmente no es el comportamiento deseado, ya que las cajas delimitadoras se utilizan para representar formas más complejas situadas dentro de la caja de delimitación. Este comportamiento ha sido cambiado: cuando ``llenado`` es ``False``, la ruta será tratada como no rellenada, pero la caja de límites sigue siendo tratada como llenada. El comportamiento antiguo era argualmente un error de implementación.

source: When ``Path.intersects_bbox`` is called with ``filled`` set to ``True`` (the default value), there is no change in behavior. For those rare cases where ``Path.intersects_bbox`` was called with ``filled`` set to ``False`` and where the old behavior is actually desired, the suggested workaround is to call ``Path.intersects_path`` with a rectangle as the path::
es_es: Cuando ``Path.intersects_bbox`` es llamado con ``filled`` establecido en ``True`` (el valor por defecto), no hay cambio de comportamiento. Para aquellos casos raros en los que ``Path`. ntersects_bbox`` fue llamado con ``filled`` establecido en ``False`` y donde el comportamiento antiguo es realmente deseado, la solución sugerida es llamar a ``Path. ntersects_path`` con un rectángulo como ruta::

source: WX no longer calls generates ``IdleEvent`` events or calls ``idle_event``
es_es: WX ya no genera eventos ``IdleEvent`` o llama ``idle_event``

source: Removed unused private method ``_onIdle`` from ``FigureCanvasWx``.
es_es: Se eliminó el método privado no utilizado ``_onIdle`` de ``FigureCanvasWx``.

source: The ``IdleEvent`` class and ``FigureCanvasBase.idle_event`` method will be removed in 2.2
es_es: La clase ``IdleEvent`` y el método ``FigureCanvasBase.idle_event`` se eliminarán en 2.2

source: Correct scaling of ``magnitude_spectrum()``
es_es: Escala correcta de ``magnitude_spectrum()``

source: The functions :func:`matplotlib.mlab.magnitude_spectrum()` and :func:`matplotlib.pyplot.magnitude_spectrum()` implicitly assumed the sum of windowing function values to be one. In Matplotlib and Numpy the standard windowing functions are scaled to have maximum value of one, which usually results in a sum of the order of n/2 for a n-point signal. Thus the amplitude scaling ``magnitude_spectrum()`` was off by that amount when using standard windowing functions (`Bug 8417 <https://github.com/matplotlib/matplotlib/issues/8417>`_ ). Now the behavior is consistent with :func:`matplotlib.pyplot.psd()` and :func:`scipy.signal.welch()`. The following example demonstrates the new and old scaling::
es_es: Las funciones :func:`matplotlib.mlab.magnitude_spectrum()` y :func:`matplotlib.pyplot.magnitude_spectrum()` implícitamente asumieron la suma de los valores de función de ventanilla a ser uno. En Matplotlib y Numpy las funciones estándar de ventana son escaladas para tener el máximo valor de una, que normalmente resulta en una suma del orden de n/2 para una señal de punto propio. Así, la amplitud de escala ``magnitude_spectrum()`` estaba deshabilitada por esa cantidad cuando se usaban funciones de ventana estándar (`Bug 8417 <https://github.com/matplotlib/matplotlib/issues/8417>`_ ). Ahora el comportamiento es consistente con :func:`matplotlib.pyplot.psd()` y :func:`scipy.signal.welch()`. El siguiente ejemplo demuestra la nueva y antigua escala::

source: Change to signatures of :meth:`~matplotlib.axes.Axes.bar` & :meth:`~matplotlib.axes.Axes.barh`
es_es: Cambia a firmas de :meth:`~matplotlib.axes.Axes.bar` & :meth:`~matplotlib.axes.Axes.barh`

source: For 2.0 the :ref:`default value of *align* <barbarh_align>` changed to ``'center'``. However this caused the signature of :meth:`~matplotlib.axes.Axes.bar` and :meth:`~matplotlib.axes.Axes.barh` to be misleading as the first parameters were still *left* and *bottom* respectively::
es_es: Para 2.0 el valor predeterminado :ref:de *align* <barbarh_align>` cambió a ``'center'``. Sin embargo, esto causó la firma de :meth:`~matplotlib. xes.Axes.bar` y :meth:`~matplotlib.axes.Axes.barh` para ser engañoso ya que los primeros parámetros seguían siendo *izquierdas* y *inferior* respectivamente::

source: despite behaving as the center in both cases. The methods now take ``*args, **kwargs`` as input and are documented to have the primary signatures of::
es_es: a pesar de comportarse como el centro en ambos casos. Los métodos ahora toman ``*args, **kwargs`` como entrada y están documentados para tener las firmas principales de::

source: Passing *left* and *bottom* as keyword arguments to :meth:`~matplotlib.axes.Axes.bar` and :meth:`~matplotlib.axes.Axes.barh` respectively will warn. Support will be removed in Matplotlib 3.0.
es_es: Pasando *izquierda* y *abajo* como argumentos de palabra clave a :meth:`~matplotlib.axes.Axes.bar` y :meth:`~matplotlib.axes.Axes.barh` respectivamente advertirán. El soporte se eliminará en Matplotlib 3.0.

source: Font cache as json
es_es: Caché de fuentes como json

source: The font cache is now saved as json, rather than a pickle.
es_es: La caché de fuentes ahora se guarda como json, en lugar de como un pico.

source: Invalid (Non-finite) Axis Limit Error
es_es: Error de límite de eje no válido (no finito)

source: When using :func:`~matplotlib.axes.Axes.set_xlim` and :func:`~matplotlib.axes.Axes.set_ylim`, passing non-finite values now results in a ``ValueError``. The previous behavior resulted in the limits being erroneously reset to ``(-0.001, 0.001)``.
es_es: Al usar :func:`~matplotlib.axes.Axes.set_xlim` y :func:`~matplotlib.axes.Axes.set_ylim`, pasar valores no finitos ahora resulta en un ``ValueError``. El comportamiento anterior resultó en que los límites se restablecieran erróneamente a ``(-0.001, 0.001)``.

source: ``scatter`` and ``Collection`` offsets are no longer implicitly flattened
es_es: Los desplazamientos ``scatter`` y ``Collection`` ya no están implícitamente aplanados

source: `~matplotlib.collections.Collection` (and thus both 2D `~matplotlib.axes.Axes.scatter` and 3D `~mpl_toolkits.mplot3d.axes3d.Axes3D.scatter`) no longer implicitly flattens its offsets. As a consequence, ``scatter``'s ``x`` and ``y`` arguments can no longer be 2+-dimensional arrays.
es_es: `~matplotlib.collections.Collection` (y así tanto `~matplotlib.axes.Axes.scatter` como 3D `~mpl_toolkits.mplot3d.axes3d.Axes3D. catter`) ya no aplasta implícitamente sus desplazamientos. Como consecuencia, los argumentos ``scatter'' de ``x`` y ``y`` ya no pueden ser arreglos 2+-dimensionales.

source: Deprecations
es_es: Obsolescencias

source: ``GraphicsContextBase``\'s ``linestyle`` property.
es_es: ``GraphicsContextBase``\'s propiedad ``linestyle``.

source: The ``GraphicsContextBase.get_linestyle`` and ``GraphicsContextBase.set_linestyle`` methods, which had no effect, have been deprecated. All of the backends Matplotlib ships use ``GraphicsContextBase.get_dashes`` and ``GraphicsContextBase.set_dashes`` which are more general. Third-party backends should also migrate to the ``*_dashes`` methods.
es_es: Los métodos ``GraphicsContextBase.get_linestyle`` y ``GraphicsContextBase.set_linestyle`` que no tuvieron efecto, han sido obsoletos. Todos los backends de Matplotlib usan ``GraphicsContextBase. et_dashes`` y ``GraphicsContextBase.set_dashes`` que son más generales. Los backends de terceros también deben migrar a los métodos ``*_dashes``.

source: Use :meth:`.draw_idle` method on the ``Canvas`` instance instead.
es_es: Utilice el método :meth:`.draw_idle` en su lugar en la instancia de ``Canvas``.

source: Testing
es_es: Prueba

source: ``matplotlib.testing.noseclasses`` is deprecated and will be removed in 2.3
es_es: ``matplotlib.testing.noseclasses`` está obsoleto y será eliminado en 2.3

source: ``EngFormatter`` *num* arg as string
es_es: ``EngFormatter`` *num* argumento como cadena

source: Passing a string as *num* argument when calling an instance of `matplotlib.ticker.EngFormatter` is deprecated and will be removed in 2.3.
es_es: Pasar una cadena como argumento *num* al llamar a una instancia de `matplotlib.ticker.EngFormatter` está obsoleto y será eliminado en 2.3.

source: ``mpl_toolkits.axes_grid`` module
es_es: módulo ``mpl_toolkits.axes_grid``

source: All functionally from ``mpl_toolkits.axes_grid`` can be found in either `mpl_toolkits.axes_grid1` or `mpl_toolkits.axisartist`. Axes classes from ``mpl_toolkits.axes_grid`` based on ``Axis`` from `mpl_toolkits.axisartist` can be found in `mpl_toolkits.axisartist`.
es_es: Funcionalmente de ``mpl_toolkits.axes_grid`` se puede encontrar en `mpl_toolkits.axes_grid1` o `mpl_toolkits.axisartist`. Clases de ejes de ``mpl_toolkits.axes_grid`` basadas en ``Axis`` de `mpl_toolkits.axisartist` pueden encontrarse en `mpl_toolkits.axisartist`.

source: ``Axes`` collision in ``Figure.add_axes``
es_es: ``Ejes`` colisión en ``Figure.add_axes``

source: Adding an axes instance to a figure by using the same arguments as for a previous axes instance currently reuses the earlier instance. This behavior has been deprecated in Matplotlib 2.1. In a future version, a *new* instance will always be created and returned. Meanwhile, in such a situation, a deprecation warning is raised by ``matplotlib.figure.AxesStack``.
es_es: Añadir una instancia de ejes a una figura utilizando los mismos argumentos que para una instancia de ejes anteriores actualmente reutiliza la instancia anterior. Este comportamiento ha sido obsoleto en Matplotlib 2. . En una versión futura, una instancia *nueva* siempre será creada y retornada. Mientras tanto, en una situación así, una advertencia de desaprobación es planteada por ``matplotlib.figure.AxesStack``.

source: This warning can be suppressed, and the future behavior ensured, by passing a *unique* label to each axes instance. See the docstring of :meth:`~matplotlib.figure.Figure.add_axes` for more information.
es_es: Esta advertencia puede ser suprimida, y el comportamiento futuro garantizado, pasando una etiqueta *única* a cada instancia de los ejes. Vea la docstring de :meth:`~matplotlib.figure.Figure.add_axes` para más información.

source: Additional details on the rationale behind this deprecation can be found in :ghissue:`7377` and :ghissue:`9024`.
es_es: Detalles adicionales sobre la clasificación detrás de esta desaprobación se pueden encontrar en :ghissue:`7377` y :ghissue:`9024`.

source: Former validators for ``contour.negative_linestyle``
es_es: Anteriores validadores para ``contour.negative_linestyle``

source: The former public validation functions ``validate_negative_linestyle`` and ``validate_negative_linestyle_legacy`` will be deprecated in 2.1 and may be removed in 2.3. There are no public functions to replace them.
es_es: Las antiguas funciones de validación pública ``validate_negative_linestyle`` y ``validate_negative_linestyle_legacy`` serán obsoletas en 2. y puede ser eliminado en 2.3. No hay funciones públicas para reemplazarlas.

source: ``cbook``
es_es: ``libro``

source: Many unused or near-unused :mod:`matplotlib.cbook` functions and classes have been deprecated: ``converter``, ``tostr``, ``todatetime``, ``todate``, ``tofloat``, ``toint``, ``unique``, ``is_string_like``, ``is_sequence_of_strings``, ``is_scalar``, ``Sorter``, ``Xlator``, ``soundex``, ``Null``, ``dict_delall``, ``RingBuffer``, ``get_split_ind``, ``wrap``, ``get_recursive_filelist``, ``pieces``, ``exception_to_str``, ``allequal``, ``alltrue``, ``onetrue``, ``allpairs``, ``finddir``, ``reverse_dict``, ``restrict_dict``, ``issubclass_safe``, ``recursive_remove``, ``unmasked_index_ranges``.
es_es: Muchos :mod:`matplotlib sin usar o casi sin usar. las funciones y clases del libro han sido desaprobadas: ``converter``, ``tostr``, ``todatetime``, ``todate``, ``tofloat``, ``toint``, ``unique``, ``is_string_like``, ``is_sequence_of_strings``, ``is_scalar``, ``Sorter``, ``Xlator``, ``soundex``, ``Null``, ``dict_delall``, ``RingBuffer``, ``get_split_ind``, ``wrap``, ``get_recursive_filelist``, ``pieces``, ``exception_to_str``, ``allequal``, ``alltrue``, ``onetrue``, ``allpairs``, ``finddir``, ``reverse_dict``, ``restrict_dict``, ``issubclass_safe``, ``recursive_remove``, ``unmasked_index_ranges``.

source: Code Removal
es_es: Eliminar código
