Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/api/prev_api_changes/api_changes_0.98.x.po
Languages: es_es

source: Changes for 0.98.x
es_es: Cambios para 0.98.x

source: ``psd()``, ``csd()``, and ``cohere()`` will now automatically wrap negative frequency components to the beginning of the returned arrays. This is much more sensible behavior and makes them consistent with ``specgram()``. The previous behavior was more of an oversight than a design decision.
es_es: ``psd()``, ``csd()``, y ``cohere()`` ahora envuelven automáticamente los componentes de frecuencia negativa al comienzo de los arrays devueltos. Este es un comportamiento mucho más sensato y los hace consistentes con ``specgram()``. El comportamiento anterior fue más un exceso que una decisión de diseño.

source: Added new keyword parameters *nonposx*, *nonposy* to :class:`matplotlib.axes.Axes` methods that set log scale parameters. The default is still to mask out non-positive values, but the kwargs accept 'clip', which causes non-positive values to be replaced with a very small positive value.
es_es: Se añadieron nuevos parámetros de palabra clave *no posx*, *no posy* a los métodos :class:`matplotlib.axes.Axes` que establecen los parámetros de escala de registro. El valor por defecto sigue siendo la máscara de valores no positivos, pero los kwargs aceptan 'clip', que hace que los valores no positivos se sustituyan por un valor positivo muy pequeño.

source: Added new :func:`matplotlib.pyplot.fignum_exists` and :func:`matplotlib.pyplot.get_fignums`; they merely expose information that had been hidden in ``matplotlib._pylab_helpers``.
es_es: Se añadió el nuevo :func:`matplotlib.pyplot.fignum_exists` y el :func:`matplotlib.pyplot.get_fignums`; simplemente exponen información que había sido oculta en ``matplotlib._pylab_helpers``.

source: Deprecated numerix package.
es_es: Paquete numerix obsoleto.

source: Added new :func:`matplotlib.image.imsave` and exposed it to the :mod:`matplotlib.pyplot` interface.
es_es: Se añadió el nuevo :func:`matplotlib.image.imsave` y se expuso a la interfaz :mod:`matplotlib.pyplot`.

source: Remove support for pyExcelerator in exceltools -- use xlwt instead
es_es: Eliminar soporte para pyExcelerator en exceltools -- use xlwt en su lugar

source: Following keyword parameters for :class:`matplotlib.legend.Legend` are now deprecated and new set of parameters are introduced. The new parameters are given as a fraction of the font-size. Also, *scatteryoffsets*, *fancybox* and *columnspacing* are added as keyword parameters.
es_es: Los siguientes parámetros de palabras clave para :class:`matplotlib.legend.Legend` ahora están obsoletos y se introducen un nuevo conjunto de parámetros. Los nuevos parámetros son dados como una fracción del tamaño de la fuente. También, *scatteryoffsets*, *fancybox* y *columnspacing* son agregados como parámetros de palabras clave.

source: Deprecated
es_es: Desaprobado

source: New
es_es: Nuevo

source: borderpad
es_es: bordepad

source: labelsep
es_es: labelio

source: labelspacing
es_es: espaciado de etiqueta

source: handlelength
es_es: longitud de manejo

source: Removed the configobj and experimental traits rc support
es_es: Eliminado el soporte configobj y experimental de rc rasgos

source: Modified :func:`matplotlib.mlab.psd`, :func:`matplotlib.mlab.csd`, :func:`matplotlib.mlab.cohere`, and :func:`matplotlib.mlab.specgram` to scale one-sided densities by a factor of 2. Also, optionally scale the densities by the sampling frequency, which gives true values of densities that can be integrated by the returned frequency values. This also gives better MATLAB compatibility. The corresponding :class:`matplotlib.axes.Axes` methods and :mod:`matplotlib.pyplot` functions were updated as well.
es_es: Se modificó :func:`matplotlib.mlab.psd`, :func:`matplotlib.mlab.csd`, :func:`matplotlib.mlab.cohere`, y :func:`matplotlib.mlab.specgram` para escalar densidades de un lado por un factor de 2. Además, opcionalmente escala las densidades por la frecuencia de muestreo, lo que da valores reales de densidades que pueden ser integradas por los valores de frecuencia devuelta. Esto también da una mejor compatibilidad con MATLAB. También se actualizaron los métodos de :class:`matplotlib.axes.Axes` y las funciones :mod:`matplotlib.pyplot` correspondientes.

source: Font lookup now uses a nearest-neighbor approach rather than an exact match. Some fonts may be different in plots, but should be closer to what was requested.
es_es: La búsqueda de fuentes ahora utiliza un enfoque cercano al vecino en lugar de una coincidencia exacta. Algunas fuentes pueden ser diferentes en parcelas, pero deben estar más cerca de lo que se solicitó.

source: :meth:`matplotlib.axes.Axes.set_xlim`, :meth:`matplotlib.axes.Axes.set_ylim` now return a copy of the ``viewlim`` array to avoid modify-in-place surprises.
es_es: :meth:`matplotlib.axes.Axes.set_xlim`, :meth:`matplotlib.axes.Axes.set_ylim` ahora devuelve una copia del array ``viewlim`` para evitar sorpresas modificadas.

source: :meth:`matplotlib.afm.AFM.get_fullname` and :meth:`matplotlib.afm.AFM.get_familyname` no longer raise an exception if the AFM file does not specify these optional attributes, but returns a guess based on the required FontName attribute.
es_es: :meth:`matplotlib.afm.AFM.get_fullname` y :meth:`matplotlib.afm.AFM. et_familyname` ya no genera una excepción si el archivo AFM no especifica estos atributos opcionales, pero devuelve una conjetura basada en el atributo FontName requerido.

source: Changed precision kwarg in :func:`matplotlib.pyplot.spy`; default is 0, and the string value 'present' is used for sparse arrays only to show filled locations.
es_es: Se ha cambiado el kwarg de precisión en :func:`matplotlib.pyplot.spy`; por defecto es 0, y el valor de cadena 'present' se utiliza para arreglos esparse solo para mostrar ubicaciones rellenadas.

source: :class:`matplotlib.collections.EllipseCollection` added.
es_es: :class:`matplotlib.collections.EllipseCollection` añadido.

source: Added ``angles`` kwarg to :func:`matplotlib.pyplot.quiver` for more flexible specification of the arrow angles.
es_es: Se añadió el engranaje ``angles`` a :func:`matplotlib.pyplot.quiver` para una especificación más flexible de los ángulos de flecha.

source: Deprecated (raise NotImplementedError) all the mlab2 functions from :mod:`matplotlib.mlab` out of concern that some of them were not clean room implementations.
es_es: Obsoleto (raise NotImplementedError) todas las funciones mlab2 de :mod:`matplotlib.mlab` por preocupación de que algunas de ellas no fueran implementaciones de habitaciones limpias.

source: Methods :meth:`matplotlib.collections.Collection.get_offsets` and :meth:`matplotlib.collections.Collection.set_offsets` added to :class:`~matplotlib.collections.Collection` base class.
es_es: Los métodos :meth:`matplotlib.collections.Collection.get_offsets` y :meth:`matplotlib.collections.Collection.set_offsets` añadieron a :class:la clase base `~matplotlib.collections.Collection`.

source: ``matplotlib.figure.Figure.figurePatch`` renamed :attr:`matplotlib.figure.Figure.patch`; ``matplotlib.axes.Axes.axesPatch`` renamed :attr:`matplotlib.axes.Axes.patch`; ``matplotlib.axes.Axes.axesFrame`` renamed :attr:`matplotlib.axes.Axes.frame`. ``matplotlib.axes.Axes.get_frame``, which returns :attr:`matplotlib.axes.Axes.patch`, is deprecated.
es_es: ``matplotlib.figure.Figure.figurePatch`` renombró :attr:`matplotlib.figure.Figure.patch`; ``matplotlib.axes.Axes.axesPatch`` renombró :attr:`matplotlib.axes.Axes.patch`; ``matplotlib.axes.Axes.axesFrame`` renombrado :attr:`matplotlib.axes.Axes.frame`. ``matplotlib.axes.Axes.get_frame``, que devuelve :attr:`matplotlib.axes.Axes.patch`, está desaprobado.

source: Changes in the :class:`matplotlib.contour.ContourLabeler` attributes (:func:`matplotlib.pyplot.clabel` function) so that they all have a form like ``.labelAttribute``. The three attributes that are most likely to be used by end users, ``.cl``, ``.cl_xy`` and ``.cl_cvalues`` have been maintained for the moment (in addition to their renamed versions), but they are deprecated and will eventually be removed.
es_es: Cambios en la función :class:`matplotlib.contour.ContourLabeler` de atributos (:func:`matplotlib.pyplot.clabel`) para que todos tengan una forma como ``.labelAttribute``. Los tres atributos que son más propensos a ser usados por los usuarios finales, ``.cl``, ``.cl_xy`` y ``. l_cvalues`` han sido mantenidos por el momento (además de sus versiones renombradas), pero son obsoletas y finalmente serán eliminadas.

source: Moved several functions in :mod:`matplotlib.mlab` and :mod:`matplotlib.cbook` into a separate module ``matplotlib.numerical_methods`` because they were unrelated to the initial purpose of mlab or cbook and appeared more coherent elsewhere.
es_es: Se movieron varias funciones en :mod:`matplotlib.mlab` y :mod:`matplotlib.cbook` a un módulo separado ``matplotlib. umerical_methods`` porque no estaban relacionados con el propósito inicial de mlab o cbook y aparecieron más coherentes en otros lugares.
