Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/text_labels_and_annotations/annotation_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_text_labels_and_annotations_annotation_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_text_labels_and_annotations_annotation_demo.py>` para descargar el código de ejemplo completo

source: Annotating Plots
es_es: Anotar gráficos

source: The following examples show how it is possible to annotate plots in Matplotlib. This includes highlighting specific points of interest and using various visual tools to call attention to this point. For a more complete and in-depth description of the annotation and text tools in Matplotlib, see the :doc:`tutorial on annotation </tutorials/text/annotations>`.
es_es: Los siguientes ejemplos muestran cómo es posible anotar gráficos en Matplotlib. Esto incluye resaltar puntos específicos de interés y utilizar varias herramientas visuales para llamar la atención sobre este punto. Para una descripción más completa y en profundidad de las herramientas de anotación y texto en Matplotlib, véase el :doc:`tutorial sobre anotación </tutorials/text/annotations>`.

source: Specifying text points and annotation points
es_es: Especificación de puntos de texto y puntos de anotación

source: You must specify an annotation point ``xy=(x, y)`` to annotate this point. Additionally, you may specify a text point ``xytext=(x, y)`` for the location of the text for this annotation. Optionally, you can specify the coordinate system of *xy* and *xytext* with one of the following strings for *xycoords* and *textcoords* (default is 'data')::
es_es: Debes especificar un punto de anotación ``xy=(x, y)`` para anotar este punto. Además, puedes especificar un punto de texto ``xytext=(x, y)`` para la ubicación del texto de esta anotación. Opcionalmente, puedes especificar el sistema de coordenadas de *xy* y *xytext* con una de las siguientes cadenas para *xycoords* y *textcoords* (por defecto es 'data')::

source: Note: for physical coordinate systems (points or pixels) the origin is the (bottom, left) of the figure or axes.
es_es: Nota: para los sistemas de coordenadas físicas (puntos o píxeles) el origen es el (abajo, izquierda) de la figura o los ejes.

source: Optionally, you can specify arrow properties which draws and arrow from the text to the annotated point by giving a dictionary of arrow properties
es_es: Opcionalmente, puede especificar las propiedades de las flechas que dibujan una flecha desde el texto hasta el punto anotado dando un diccionario de propiedades de las flechas

source: Valid keys are::
es_es: Las claves válidas son::

source: Out:
es_es: Salida:

source: Using multiple coordinate systems and axis types
es_es: Uso de múltiples sistemas de coordenadas y tipos de ejes

source: You can specify the *xypoint* and the *xytext* in different positions and coordinate systems, and optionally turn on a connecting line and mark the point with a marker. Annotations work on polar axes too.
es_es: Puedes especificar el *puntoxy* y el *textoxy* en diferentes posiciones y sistemas de coordenadas, y opcionalmente activar una línea de conexión y marcar el punto con un marcador. Las anotaciones también funcionan en ejes polares.

source: In the example below, the *xy* point is in native coordinates (*xycoords* defaults to 'data'). For a polar axes, this is in (theta, radius) space. The text in the example is placed in the fractional figure coordinate system. Text keyword arguments like horizontal and vertical alignment are respected.
es_es: En el siguiente ejemplo, el punto *xy* está en coordenadas nativas (*xycoords* por defecto es 'data'). Para un eje polar, esto es en el espacio (theta, radio). El texto en el ejemplo se coloca en el sistema de coordenadas de la figura fraccional. Se respetan los argumentos de la palabra clave de texto como la alineación horizontal y vertical.

source: You can also use polar notation on a cartesian axes. Here the native coordinate system ('data') is cartesian, so you need to specify the xycoords and textcoords as 'polar' if you want to use (theta, radius).
es_es: También se puede utilizar la notación polar en un eje cartesiano. Aquí el sistema de coordenadas nativo ('data') es cartesiano, por lo que debes especificar las coordenadas xy y las coordenadas text como 'polares' si quieres usar (theta, radio).

source: Customizing arrow and bubble styles
es_es: Personalización de los estilos de flechas y burbujas

source: The arrow between *xytext* and the annotation point, as well as the bubble that covers the annotation text, are highly customizable. Below are a few parameter options as well as their resulting output.
es_es: La flecha entre *xytext* y el punto de anotación, así como la burbuja que cubre el texto de la anotación, son altamente personalizables. A continuación se muestran algunas opciones de parámetros así como su salida resultante.

source: We'll create another figure so that it doesn't get too cluttered
es_es: Vamos a crear otra figura para que no quede muy desordenada

source: More examples of coordinate systems
es_es: Más ejemplos de sistemas de coordenadas

source: Below we'll show a few more examples of coordinate systems and how the location of annotations may be specified.
es_es: A continuación mostraremos algunos ejemplos más de sistemas de coordenadas y cómo se puede especificar la ubicación de las anotaciones.

source: **Total running time of the script:** ( 0 minutes 1.998 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.998 segundos)

source: :download:`Download Python source code: annotation_demo.py <annotation_demo.py>`
es_es: :download:`Descargar el código fuente de Python: annotation_demo.py <annotation_demo.py>`

source: :download:`Download Jupyter notebook: annotation_demo.ipynb <annotation_demo.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: annotation_demo.ipynb <annotation_demo.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
