Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/text_labels_and_annotations/custom_legends.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_text_labels_and_annotations_custom_legends.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_text_labels_and_annotations_custom_legends.py>` para descargar el código de ejemplo completo

source: Composing Custom Legends
es_es: Composición de leyendas personalizadas

source: Composing custom legends piece-by-piece.
es_es: Componiendo leyendas personalizadas pieza a pieza.

source: For more information on creating and customizing legends, see the following pages:
es_es: Para más información sobre la creación y personalización de leyendas, consulta las siguientes páginas:

source: Sometimes you don't want a legend that is explicitly tied to data that you have plotted. For example, say you have plotted 10 lines, but don't want a legend item to show up for each one. If you simply plot the lines and call ``ax.legend()``, you will get the following:
es_es: A veces no quieres una leyenda que esté explícitamente ligada a los datos que has trazado. Por ejemplo, digamos que ha trazado 10 líneas, pero no quiere que aparezca un elemento de leyenda para cada una. Si simplemente trazas las líneas y llamas a ``ax.legend()``, obtendrás lo siguiente:

source: Out:
es_es: Salida:

source: Note that no legend entries were created. In this case, we can compose a legend using Matplotlib objects that aren't explicitly tied to the data that was plotted. For example:
es_es: Observa que no se ha creado ninguna entrada de leyenda. En este caso, podemos componer una leyenda utilizando objetos Matplotlib que no están explícitamente ligados a los datos que se trazaron. Por ejemplo:

source: There are many other Matplotlib objects that can be used in this way. In the code below we've listed a few common ones.
es_es: Hay muchos otros objetos de Matplotlib que se pueden utilizar de esta manera. En el código siguiente hemos enumerado algunos comunes.

source: :download:`Download Python source code: custom_legends.py <custom_legends.py>`
es_es: :download:`Descarga el código fuente de Python: custom_legends.py <custom_legends.py>`

source: :download:`Download Jupyter notebook: custom_legends.ipynb <custom_legends.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: custom_legends.ipynb <custom_legends.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
