Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/text_labels_and_annotations/demo_text_rotation_mode.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_text_labels_and_annotations_demo_text_rotation_mode.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_text_labels_and_annotations_demo_text_rotation_mode.py>` para descargar el código de ejemplo completo

source: Text Rotation Mode
es_es: Modo de rotación del texto

source: This example illustrates the effect of ``rotation_mode`` on the positioning of rotated text.
es_es: Este ejemplo ilustra el efecto de ``rotation_mode`` en el posicionamiento del texto rotado.

source: Rotated `.Text`\s are created by passing the parameter ``rotation`` to the constructor or the axes' method `~.axes.Axes.text`.
es_es: Los textos rotados se crean pasando el parámetro ``rotación`` al constructor o al método de los ejes `~.axes.Axes.text`.

source: The actual positioning depends on the additional parameters ``horizontalalignment``, ``verticalalignment`` and ``rotation_mode``. ``rotation_mode`` determines the order of rotation and alignment:
es_es: El posicionamiento real depende de los parámetros adicionales ``horizontalalignment``, ``verticalalignment`` y ``rotation_mode``. ``rotation_mode`` determina el orden de rotación y alineación:

source: ``rotation_mode='default'`` (or None) first rotates the text and then aligns the bounding box of the rotated text.
es_es: ``rotation_mode='default'`` (o None) primero rota el texto y luego alinea el cuadro delimitador del texto rotado.

source: ``rotation_mode='anchor'`` aligns the unrotated text and then rotates the text around the point of alignment.
es_es: ``rotation_mode='anchor'`` alinea el texto sin rotar y luego rota el texto alrededor del punto de alineación.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: demo_text_rotation_mode.py <demo_text_rotation_mode.py>`
es_es: :download:`Descargar el código fuente de Python: demo_text_rotation_mode.py <demo_text_rotation_mode.py>`

source: :download:`Download Jupyter notebook: demo_text_rotation_mode.ipynb <demo_text_rotation_mode.ipynb>`
es_es: :download:`Descarga el código fuente de Python: dfrac_demo.py <dfrac_demo.py>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
