Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/text_labels_and_annotations/font_file.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_text_labels_and_annotations_font_file.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_text_labels_and_annotations_font_file.py>` para descargar el código de ejemplo completo

source: Using a ttf font file in Matplotlib
es_es: Uso de un archivo de fuentes ttf en Matplotlib

source: Although it is usually not a good idea to explicitly point to a single ttf file for a font instance, you can do so by passing a `pathlib.Path` instance as the *font* parameter. Note that passing paths as `str`\s is intentionally not supported, but you can simply wrap `str`\s in `pathlib.Path`\s as needed.
es_es: Aunque normalmente no es una buena idea apuntar explícitamente a un único archivo ttf para una instancia de fuente, puedes hacerlo pasando una instancia de `pathlib.Path` como parámetro *font*. Ten en cuenta que pasar rutas como `str` no está soportado intencionadamente, pero puede simplemente envolver `str` en `pathlib.Path` cuando sea necesario.

source: Here, we use the Computer Modern roman font (``cmr10``) shipped with Matplotlib.
es_es: En este caso, utilizamos la fuente romana Computer Modern (``cmr10``) incluida en Matplotlib.

source: For a more flexible solution, see :doc:`/gallery/text_labels_and_annotations/font_family_rc_sgskip` and :doc:`/gallery/text_labels_and_annotations/fonts_demo`.
es_es: Para una solución más flexible, ver :doc:`/gallery/text_labels_and_annotations/font_family_rc_sgskip` y :doc:`/gallery/text_labels_and_annotations/fonts_demo`.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: font_file.py <font_file.py>`
es_es: :download:`Descargar el código fuente de Python: font_file.py <font_file.py>`

source: :download:`Download Jupyter notebook: font_file.ipynb <font_file.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: font_file.ipynb <font_file.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
