Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/text_labels_and_annotations/label_subplots.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_text_labels_and_annotations_label_subplots.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_text_labels_and_annotations_label_subplots.py>` para descargar el código de ejemplo completo

source: Labelling subplots
es_es: Etiquetado de subplots

source: Labelling subplots is relatively straightforward, and varies, so Matplotlib does not have a general method for doing this.
es_es: El etiquetado de los subplots es relativamente sencillo, y varía, por lo que Matplotlib no tiene un método general para hacerlo.

source: Simplest is putting the label inside the axes. Note, here we use `.pyplot.subplot_mosaic`, and use the subplot labels as keys for the subplots, which is a nice convenience. However, the same method works with `.pyplot.subplots` or keys that are different than what you want to label the subplot with.
es_es: Lo más sencillo es poner la etiqueta dentro de los ejes. Nota, aquí usamos `.pyplot.subplot_mosaic`, y utilizamos las etiquetas de los subplots como claves para los subplots, lo cual es una buena comodidad. Sin embargo, el mismo método funciona con `.pyplot.subplots` o con claves diferentes a la que se quiere etiquetar el subplot.

source: We may prefer the labels outside the axes, but still aligned with each other, in which case we use a slightly different transform:
es_es: Podemos preferir que las etiquetas queden fuera de los ejes, pero que sigan alineadas entre sí, en cuyo caso utilizaremos una transformación ligeramente diferente:

source: If we want it aligned with the title, either incorporate in the title or use the *loc* keyword argument:
es_es: Si queremos que se alinee con el título, o bien se incorpora en el título o se utiliza el argumento de la palabra clave *loc*:

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 2.234 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2.234 segundos)

source: :download:`Download Python source code: label_subplots.py <label_subplots.py>`
es_es: :download:`Descarga el código fuente de Python: label_subplots.py <label_subplots.py>`

source: :download:`Download Jupyter notebook: label_subplots.ipynb <label_subplots.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: label_subplots.ipynb <label_subplots.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
