Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/text_labels_and_annotations/legend_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_text_labels_and_annotations_legend_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_text_labels_and_annotations_legend_demo.py>` para descargar el código de ejemplo completo

source: Legend Demo
es_es: Demostración de la leyenda

source: Plotting legends in Matplotlib.
es_es: Trazando leyendas en Matplotlib.

source: There are many ways to create and customize legends in Matplotlib. Below we'll show a few examples for how to do so.
es_es: Hay muchas formas de crear y personalizar leyendas en Matplotlib. A continuación mostraremos algunos ejemplos para hacerlo.

source: First we'll show off how to make a legend for specific lines.
es_es: Primero mostraremos cómo hacer una leyenda para líneas específicas.

source: Next we'll demonstrate plotting more complex labels.
es_es: A continuación, demostraremos el trazado de etiquetas más complejas.

source: Here we attach legends to more complex plots.
es_es: Aquí adjuntamos leyendas a gráficos más complejos.

source: Now we'll showcase legend entries with more than one legend key.
es_es: Ahora mostraremos las entradas de leyenda con más de una clave de leyenda.

source: Finally, it is also possible to write custom objects that define how to stylize legends.
es_es: Por último, también es posible escribir objetos personalizados que definan cómo estilizar las leyendas.

source: **Total running time of the script:** ( 0 minutes 2.752 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2.752 segundos)

source: :download:`Download Python source code: legend_demo.py <legend_demo.py>`
es_es: :download:`Descargar el código fuente de Python: legend_demo.py <legend_demo.py>`

source: :download:`Download Jupyter notebook: legend_demo.ipynb <legend_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: legend_demo.ipynb <legend_demo.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
