Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/text_labels_and_annotations/rainbow_text.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_text_labels_and_annotations_rainbow_text.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_text_labels_and_annotations_rainbow_text.py>` para descargar el código de ejemplo completo

source: Rainbow text
es_es: Texto del arco iris

source: The example shows how to string together several text objects.
es_es: El ejemplo muestra cómo encadenar varios objetos de texto.

source: History
es_es: Historia

source: On the matplotlib-users list back in February 2012, Gökhan Sever asked the following question:
es_es: En la lista de usuarios de matplotlib, allá por febrero de 2012, Gökhan Sever hizo la siguiente pregunta:

source: Is there a way in matplotlib to partially specify the color of a string?
es_es: ¿Hay alguna forma en matplotlib de especificar parcialmente el color de una cadena?

source: Example:
es_es: Ejemplo:

source: plt.ylabel("Today is cloudy.")
es_es: plt.ylabel("Hoy está nublado.")

source: How can I show "today" as red, "is" as green and "cloudy." as blue?
es_es: ¿Cómo puedo mostrar "hoy" como rojo, "es" como verde y "nublado" como azul?

source: Thanks.
es_es: Gracias.

source: The solution below is modified from Paul Ivanov's original answer.
es_es: La solución que sigue es una modificación de la respuesta original de Paul Ivanov.

source: :download:`Download Python source code: rainbow_text.py <rainbow_text.py>`
es_es: :download:`Descargar el código fuente de Python: rainbow_text.py <rainbow_text.py>`

source: :download:`Download Jupyter notebook: rainbow_text.ipynb <rainbow_text.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: rainbow_text.ipynb <rainbow_text.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
