Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/text_labels_and_annotations/tex_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_text_labels_and_annotations_tex_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_text_labels_and_annotations_tex_demo.py>` para descargar el código de ejemplo completo

source: Rendering math equations using TeX
es_es: Renderización de ecuaciones matemáticas con TeX

source: You can use TeX to render all of your Matplotlib text by setting :rc:`text.usetex` to True. This requires that you have TeX and the other dependencies described in the :doc:`/tutorials/text/usetex` tutorial properly installed on your system. Matplotlib caches processed TeX expressions, so that only the first occurrence of an expression triggers a TeX compilation. Later occurrences reuse the rendered image from the cache and are thus faster.
es_es: Puedes usar TeX para renderizar todo el texto de Matplotlib estableciendo :rc:`text.usetex` a True. Esto requiere que tengas TeX y las otras dependencias descritas en el tutorial :doc:`/tutorials/text/usetex` correctamente instaladas en tu sistema. Matplotlib almacena en caché las expresiones TeX procesadas, de modo que sólo la primera ocurrencia de una expresión desencadena una compilación TeX. Las ocurrencias posteriores reutilizan la imagen renderizada de la caché y por lo tanto son más rápidas.

source: Unicode input is supported, e.g. for the y-axis label in this example.
es_es: Se admite la entrada Unicode, por ejemplo, para la etiqueta del eje Y en este ejemplo.

source: Out:
es_es: Salida:

source: A more complex example.
es_es: Un ejemplo más complejo.

source: **Total running time of the script:** ( 0 minutes 16.724 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 16,724 segundos)

source: :download:`Download Python source code: tex_demo.py <tex_demo.py>`
es_es: :download:`Descarga el código fuente de Python: tex_demo.py <tex_demo.py>`

source: :download:`Download Jupyter notebook: tex_demo.ipynb <tex_demo.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: tex_demo.ipynb <tex_demo.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
