Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/color/color_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_color_color_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_color_color_demo.py>` para descargar el código de ejemplo completo

source: Color Demo
es_es: Demo de color

source: Matplotlib recognizes the following formats to specify a color:
es_es: Matplotlib reconoce los siguientes formatos para especificar un color:

source: an RGB or RGBA tuple of float values in ``[0, 1]`` (e.g. ``(0.1, 0.2, 0.5)`` or ``(0.1, 0.2, 0.5, 0.3)``). RGBA is short for Red, Green, Blue, Alpha;
es_es: una tupla RGB o RGBA de valores flotantes en ``[0, 1]`` (por ejemplo, ``(0,1, 0,2, 0,5)`` o ``(0,1, 0,2, 0,5, 0,3)``). RGBA es la abreviatura de Red, Green, Blue, Alpha;

source: a hex RGB or RGBA string (e.g., ``'#0F0F0F'`` or ``'#0F0F0F0F'``);
es_es: una cadena hexadecimal RGB o RGBA (por ejemplo, ``'#0F0F0F'`` o ``'#0F0F0F'``);

source: a shorthand hex RGB or RGBA string, equivalent to the hex RGB or RGBA string obtained by duplicating each character, (e.g., ``'#abc'``, equivalent to ``'#aabbcc'``, or ``'#abcd'``, equivalent to ``'#aabbccdd'``);
es_es: una cadena hexadecimal RGB o RGBA, equivalente a la cadena hexadecimal RGB o RGBA obtenida duplicando cada carácter, (por ejemplo, ``'#abc'``, equivalente a ``'#aabbcc'``, o ``'#abcd'``, equivalente a ``'#aabbccdd'``);

source: a string representation of a float value in ``[0, 1]`` inclusive for gray level (e.g., ``'0.5'``);
es_es: una representación de cadena de un valor flotante en ``[0, 1]`` inclusive para el nivel de gris (por ejemplo, ``'0.5'``);

source: a single letter string, i.e. one of ``{'b', 'g', 'r', 'c', 'm', 'y', 'k', 'w'}``, which are short-hand notations for shades of blue, green, red, cyan, magenta, yellow, black, and white;
es_es: una cadena de una sola letra, es decir, una de ``{'b', 'g', 'r', 'c', 'm', 'y', 'k', 'w'}``, que son anotaciones cortas para los tonos de azul, verde, rojo, cian, magenta, amarillo, negro y blanco;

source: a X11/CSS4 ("html") color name, e.g. ``"blue"``;
es_es: un nombre de color X11/CSS4 ("html"), por ejemplo ``"blue"``;

source: a name from the `xkcd color survey <https://xkcd.com/color/rgb/>`__, prefixed with ``'xkcd:'`` (e.g., ``'xkcd:sky blue'``);
es_es: un nombre de la `encuesta de colores de xkcd <https://xkcd.com/color/rgb/>`__, prefijado con ``'xkcd:'`` (por ejemplo, ``'xkcd:sky blue'``);

source: a "Cn" color spec, i.e. ``'C'`` followed by a number, which is an index into the default property cycle (:rc:`axes.prop_cycle`); the indexing is intended to occur at rendering time, and defaults to black if the cycle does not include color.
es_es: una especificación de color "Cn", es decir, ``'C'`` seguida de un número, que es un índice en el ciclo de propiedades por defecto (:rc:`axes.prop_cycle`); la indexación está pensada para que se produzca en el momento de la renderización, y por defecto es negra si el ciclo no incluye color.

source: one of ``{'tab:blue', 'tab:orange', 'tab:green', 'tab:red', 'tab:purple', 'tab:brown', 'tab:pink', 'tab:gray', 'tab:olive', 'tab:cyan'}`` which are the Tableau Colors from the 'tab10' categorical palette (which is the default color cycle);
es_es: uno de ``{'tab:blue', 'tab:orange', 'tab:green', 'tab:red', 'tab:purple', 'tab:brown', 'tab:pink', 'tab:gray', 'tab:olive', 'tab:cyan'}` que son los Colores de Tableau de la paleta categórica 'tab10' (que es el ciclo de colores por defecto);

source: For more information on colors in matplotlib see
es_es: Para más información sobre los colores en matplotlib ver

source: the :doc:`/tutorials/colors/colors` tutorial;
es_es: el tutorial :doc:`/tutorials/colors/colors`;

source: the `matplotlib.colors` API;
es_es: la API `matplotlib.colors`;

source: the :doc:`/gallery/color/named_colors` example.
es_es: el ejemplo :doc:`/gallery/color/named_colors`.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: color_demo.py <color_demo.py>`
es_es: :download:`Descarga el código fuente de Python: color_demo.py <color_demo.py>`

source: :download:`Download Jupyter notebook: color_demo.ipynb <color_demo.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: color_demo.ipynb <color_demo.ipynb>`
