Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/color/colormap_reference.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_color_colormap_reference.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_color_colormap_reference.py>` para descargar el código de ejemplo completo

source: Colormap reference
es_es: Referencia del mapa de colores

source: Reference for colormaps included with Matplotlib.
es_es: Referencia para mapas de colores incluidos con Matplotlib.

source: A reversed version of each of these colormaps is available by appending ``_r`` to the name, e.g., ``viridis_r``.
es_es: Una versión revertida de cada uno de estos mapas de colores está disponible añadiendo ``_r`` al nombre, por ejemplo, ``viridis_r``.

source: See :doc:`/tutorials/colors/colormaps` for an in-depth discussion about colormaps, including colorblind-friendliness.
es_es: Consulta :doc:`/tutorials/colors/colormaps` para una discusión en profundidad sobre los mapas de colores, incluyendo la compatibilidad con los daltónicos.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 3.212 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 3.212 segundos)

source: :download:`Download Python source code: colormap_reference.py <colormap_reference.py>`
es_es: :download:`Descargar código fuente de Python: colormap_reference.py <colormap_reference.py>`

source: :download:`Download Jupyter notebook: colormap_reference.ipynb <colormap_reference.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: colormap_reference.ipynb <colormap_reference.ipynb>`
