Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/color/custom_cmap.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_color_custom_cmap.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_color_custom_cmap.py>` para descargar el código de ejemplo completo

source: Creating a colormap from a list of colors
es_es: Crear un mapa de colores a partir de una lista de colores

source: For more detail on creating and manipulating colormaps see :doc:`/tutorials/colors/colormap-manipulation`.
es_es: Para más detalles sobre la creación y manipulación de mapas de colores, véase :doc:`/tutorials/colors/colormap-manipulation`.

source: Creating a :doc:`colormap </tutorials/colors/colormaps>` from a list of colors can be done with the `.LinearSegmentedColormap.from_list` method. You must pass a list of RGB tuples that define the mixture of colors from 0 to 1.
es_es: La creación de un :doc:`colormap </tutorials/colors/colormaps>` a partir de una lista de colores puede hacerse con el método `.LinearSegmentedColormap.from_list`. Debes pasar una lista de tuplas RGB que definan la mezcla de colores de 0 a 1.

source: Creating custom colormaps
es_es: Creación de mapas de colores personalizados

source: It is also possible to create a custom mapping for a colormap. This is accomplished by creating dictionary that specifies how the RGB channels change from one end of the cmap to the other.
es_es: También es posible crear un mapeo personalizado para un mapa de colores. Esto se consigue creando un diccionario que especifica cómo cambian los canales RGB de un extremo a otro del cmap.

source: Example: suppose you want red to increase from 0 to 1 over the bottom half, green to do the same over the middle half, and blue over the top half. Then you would use::
es_es: Ejemplo: supongamos que queremos que el rojo aumente de 0 a 1 en la mitad inferior, el verde haga lo mismo en la mitad central y el azul en la mitad superior. Entonces utilizarías::

source: If, as in this example, there are no discontinuities in the r, g, and b components, then it is quite simple: the second and third element of each tuple, above, is the same--call it "y". The first element ("x") defines interpolation intervals over the full range of 0 to 1, and it must span that whole range. In other words, the values of x divide the 0-to-1 range into a set of segments, and y gives the end-point color values for each segment.
es_es: Si, como en este ejemplo, no hay discontinuidades en los componentes r, g y b, entonces es bastante sencillo: el segundo y tercer elemento de cada tupla, arriba, es el mismo -llámalo "y". El primer elemento ("x") define los intervalos de interpolación en todo el rango de 0 a 1, y debe abarcar todo ese rango. En otras palabras, los valores de x dividen el rango de 0 a 1 en un conjunto de segmentos, e y da los valores de color del punto final de cada segmento.

source: Now consider the green. cdict['green'] is saying that for 0 <= x <= 0.25, y is zero; no green. 0.25 < x <= 0.75, y varies linearly from 0 to 1. x > 0.75, y remains at 1, full green.
es_es: Ahora considere el verde. cdict['green'] está diciendo que para 0 <= x <= 0.25, y es cero; no hay verde. 0.25 < x <= 0.75, y varía linealmente de 0 a 1. x > 0.75, y permanece en 1, verde completo.

source: If there are discontinuities, then it is a little more complicated. Label the 3 elements in each row in the cdict entry for a given color as (x, y0, y1). Then for values of x between x[i] and x[i+1] the color value is interpolated between y1[i] and y0[i+1].
es_es: Si hay discontinuidades, entonces es un poco más complicado. Etiquete los 3 elementos de cada fila en la entrada cdict para un color determinado como (x, y0, y1). Entonces, para los valores de x entre x[i] y x[i+1] el valor del color se interpola entre y1[i] y y0[i+1].

source: Going back to the cookbook example, look at cdict['red']; because y0 != y1, it is saying that for x from 0 to 0.5, red increases from 0 to 1, but then it jumps down, so that for x from 0.5 to 1, red increases from 0.7 to 1. Green ramps from 0 to 1 as x goes from 0 to 0.5, then jumps back to 0, and ramps back to 1 as x goes from 0.5 to 1.::
es_es: Volviendo al ejemplo del libro de cocina, mira el cdict['red']; porque y0 != y1, está diciendo que para x de 0 a 0,5, el rojo aumenta de 0 a 1, pero luego salta hacia abajo, de modo que para x de 0,5 a 1, el rojo aumenta de 0,7 a 1. El verde salta de 0 a 1 cuando x va de 0 a 0,5, luego salta de nuevo a 0, y vuelve a saltar a 1 cuando x va de 0,5 a 1.::

source: Above is an attempt to show that for x in the range x[i] to x[i+1], the interpolation is between y1[i] and y0[i+1]. So, y0[0] and y1[-1] are never used.
es_es: Lo anterior es un intento de mostrar que para x en el rango x[i] a x[i+1], la interpolación es entre y1[i] e y0[i+1]. Por lo tanto, y0[0] e y1[-1] nunca se utilizan.

source: --- Colormaps from a list ---
es_es: --- Mapas de colores de una lista ---

source: --- Custom colormaps ---
es_es: --- Mapas de colores personalizados ---

source: Now we will use this example to illustrate 2 ways of handling custom colormaps. First, the most direct and explicit:
es_es: Ahora utilizaremos este ejemplo para ilustrar dos formas de manejar los mapas de colores personalizados. Primero, la más directa y explícita:

source: Second, create the map explicitly and register it. Like the first method, this method works with any kind of Colormap, not just a LinearSegmentedColormap:
es_es: En segundo lugar, crear el mapa explícitamente y registrarlo. Al igual que el primer método, este método funciona con cualquier tipo de Colormap, no sólo con un LinearSegmentedColormap:

source: Make the figure:
es_es: Hacer la figura:

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.807 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.807 segundos)

source: :download:`Download Python source code: custom_cmap.py <custom_cmap.py>`
es_es: :download:`Descargar código fuente de Python: custom_cmap.py <custom_cmap.py>`

source: :download:`Download Jupyter notebook: custom_cmap.ipynb <custom_cmap.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: custom_cmap.ipynb <custom_cmap.ipynb>`
