Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/color/named_colors.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_color_named_colors.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_color_named_colors.py>` para descargar el código de ejemplo completo

source: List of named colors
es_es: Lista de colores con nombre

source: This plots a list of the named colors supported in matplotlib. Note that :ref:`xkcd colors <xkcd-colors>` are supported as well, but are not listed here for brevity.
es_es: Esto grafica una lista de los colores con nombre soportados en matplotlib. Ten en cuenta que :ref:`xkcd colors <xkcd-colors>` también está soportado, pero no está listado aquí por brevedad.

source: For more information on colors in matplotlib see
es_es: Para más información sobre los colores en matplotlib ver

source: the :doc:`/tutorials/colors/colors` tutorial;
es_es: el tutorial :doc:`/tutorials/colors/colors`;

source: the `matplotlib.colors` API;
es_es: la API `matplotlib.colors`;

source: the :doc:`/gallery/color/color_demo`.
es_es: el :doc:`/gallery/color/color_demo`.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.332 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.332 segundos)

source: :download:`Download Python source code: named_colors.py <named_colors.py>`
es_es: :download:`Descarga el código fuente de Python: named_colors.py <named_colors.py>`

source: :download:`Download Jupyter notebook: named_colors.ipynb <named_colors.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: named_colors.ipynb <named_colors.ipynb>`
