Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/showcase/integral.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_showcase_integral.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_showcase_integral.py>` para descargar el código de ejemplo completo

source: Integral as the area under a curve
es_es: Integral como área bajo una curva

source: Although this is a simple example, it demonstrates some important tweaks:
es_es: Aunque se trata de un ejemplo sencillo, demuestra algunos ajustes importantes:

source: A simple line plot with custom color and line width.
es_es: Un simple gráfico de líneas con color y ancho de línea personalizados.

source: A shaded region created using a Polygon patch.
es_es: Una región sombreada creada con un parche de polígono.

source: A text label with mathtext rendering.
es_es: Una etiqueta de texto con representación de texto matemático.

source: figtext calls to label the x- and y-axes.
es_es: invoca a figtext para etiquetar los ejes X e Y.

source: Use of axis spines to hide the top and right spines.
es_es: Utilización de spine de eje para ocultar los spines superior y derecho.

source: Custom tick placement and labels.
es_es: Colocación de tick y etiquetas personalizadas.

source: :download:`Download Python source code: integral.py <integral.py>`
es_es: :download:`Descarga el código fuente de Python: integral.py <integral.py>`

source: :download:`Download Jupyter notebook: integral.ipynb <integral.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: integral.ipynb <integral.ipynb>`
