Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/advanced/blitting.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_tutorials_advanced_blitting.py>` to download the full example code
es_es: Haz click en :ref:`aquí <sphx_glr_download_tutorials_advanced_blitting.py>` para descargar el código de ejemplo completo

source: Faster rendering by using blitting
es_es: Renderización más rápida mediante el uso de blitting

source: *Blitting* is a `standard technique <https://en.wikipedia.org/wiki/Bit_blit>`__ in raster graphics that, in the context of Matplotlib, can be used to (drastically) improve performance of interactive figures. For example, the :mod:`.animation` and :mod:`.widgets` modules use blitting internally. Here, we demonstrate how to implement your own blitting, outside of these classes.
es_es: *Blitting* es una `técnica estándar <https://en.wikipedia.org/wiki/Bit_blit>` en gráficos rasterizados que, en el contexto de Matplotlib, puede utilizarse para mejorar (drásticamente) el rendimiento de las figuras interactivas. Por ejemplo, los módulos :mod:`.animation` y :mod:`.widgets` utilizan el blitting internamente. Aquí, demostramos cómo implementar tu propio blitting, fuera de estas clases.

source: Blitting speeds up repetitive drawing by rendering all non-changing graphic elements into a background image once. Then, for every draw, only the changing elements need to be drawn onto this background. For example, if the limits of an Axes have not changed, we can render the empty Axes including all ticks and labels once, and only draw the changing data later.
es_es: El Blitting acelera el dibujo repetitivo al renderizar todos los elementos gráficos que no cambian en una imagen de fondo una sola vez. Entonces, para cada dibujo, sólo los elementos que cambian necesitan ser dibujados en este fondo. Por ejemplo, si los límites de un Eje no han cambiado, podemos renderizar los Ejes vacíos incluyendo todos los marcadores y etiquetas una vez, y sólo dibujar los datos cambiantes después.

source: The strategy is
es_es: La estrategia es

source: Prepare the constant background:
es_es: Preparar el fondo constante:

source: Draw the figure, but exclude all artists that you want to animate by marking them as *animated* (see `.Artist.set_animated`).
es_es: Dibuja la figura, pero excluye todos los artistas que quieras animar marcándolos como *animados* (ver `.Artist.set_animated`).

source: Save a copy of the RBGA buffer.
es_es: Guarda una copia del buffer RBGA.

source: Render the individual images:
es_es: Renderizar las imágenes individuales:

source: Restore the copy of the RGBA buffer.
es_es: Restaurar la copia del buffer RGBA.

source: Redraw the animated artists using `.Axes.draw_artist` / `.Figure.draw_artist`.
es_es: Redibuja los artistas animados usando `.Axes.draw_artist` / `.Figure.draw_artist`.

source: Show the resulting image on the screen.
es_es: Mostrar la imagen resultante en la pantalla.

source: One consequence of this procedure is that your animated artists are always drawn on top of the static artists.
es_es: Una consecuencia de este procedimiento es que tus artistas animados se dibujan siempre encima de los artistas estáticos.

source: Not all backends support blitting. You can check if a given canvas does via the `.FigureCanvasBase.supports_blit` property.
es_es: No todos los backends soportan blitting. Puedes comprobar si un lienzo determinado lo hace a través de la propiedad `.FigureCanvasBase.supports_blit`.

source: This code does not work with the OSX backend (but does work with other GUI backends on mac).
es_es: Este código no funciona con el backend de OSX (pero sí con otros backends de IGU en mac).

source: Minimal example
es_es: Ejemplo mínimo

source: We can use the `.FigureCanvasAgg` methods `~.FigureCanvasAgg.copy_from_bbox` and `~.FigureCanvasAgg.restore_region` in conjunction with setting ``animated=True`` on our artist to implement a minimal example that uses blitting to accelerate rendering
es_es: Podemos utilizar los métodos `.FigureCanvasAgg` `~.FigureCanvasAgg.copy_from_bbox` y `~.FigureCanvasAgg.restore_region` junto con la configuración de ``animated=True`` en nuestro artista para implementar un ejemplo mínimo que utiliza el blitting para acelerar el renderizado

source: This example works and shows a simple animation, however because we are only grabbing the background once, if the size of the figure in pixels changes (due to either the size or dpi of the figure changing) , the background will be invalid and result in incorrect (but sometimes cool looking!) images. There is also a global variable and a fair amount of boiler plate which suggests we should wrap this in a class.
es_es: Este ejemplo funciona y muestra una animación simple, sin embargo, debido a que sólo estamos tomando el fondo una vez, si el tamaño de la figura en píxeles cambia (debido a que el tamaño o los ppp de la figura cambian), el fondo no será válido y resultará en imágenes incorrectas (¡pero a veces de aspecto genial!). También hay una variable global y una buena cantidad de información que sugiere que debemos incluir esto en una clase.

source: Class-based example
es_es: Ejemplo basado en clases

source: We can use a class to encapsulate the boilerplate logic and state of restoring the background, drawing the artists, and then blitting the result to the screen. Additionally, we can use the ``'draw_event'`` callback to capture a new background whenever a full re-draw happens to handle resizes correctly.
es_es: Podemos utilizar una clase para encapsular la lógica y el estado de la restauración del fondo, el dibujo de los artistas, y luego blitting el resultado a la pantalla. Además, podemos utilizar la llamada de retorno ``'draw_event'`` para capturar un nuevo fondo cada vez que se produzca un redibujado completo para manejar correctamente los cambios de tamaño.

source: Here is how we would use our class. This is a slightly more complicated example than the first case as we add a text frame counter as well.
es_es: A continuación se muestra cómo utilizaríamos nuestra clase. Este es un ejemplo un poco más complicado que el primer caso ya que añadimos también un contador de marcos de texto.

source: This class does not depend on `.pyplot` and is suitable to embed into larger GUI application.
es_es: Esta clase no depende de `.pyplot` y es adecuada para incrustar en una aplicación GUI más grande.

source: **Total running time of the script:** ( 0 minutes 1.271 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.271 segundos)

source: :download:`Download Python source code: blitting.py <blitting.py>`
es_es: :download:`Descargar Python source code: blitting.py <blitting.py>`

source: :download:`Download Jupyter notebook: blitting.ipynb <blitting.ipynb>`
es_es: :download:`Descargar notebook de Jupyter: blitting.ipynb <blitting.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
