Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/tutorials/advanced/transforms_tutorial.po
Languages: es_es

source: Here we apply the transforms in the *opposite* order to the use of :class:`~matplotlib.transforms.ScaledTranslation` above. The plot is first made in data coordinates (``ax.transData``) and then shifted by ``dx`` and ``dy`` points using ``fig.dpi_scale_trans``. (In typography, a `point <https://en.wikipedia.org/wiki/Point_%28typography%29>`_ is 1/72 inches, and by specifying your offsets in points, your figure will look the same regardless of the dpi resolution it is saved in.)
es_es: Aquí aplicamos las transformaciones en el orden *opuesto* al uso de :class:`~matplotlib.transforms.ScaledTranslation` anterior. El gráfico se hace primero en coordenadas de datos (``ax.transData``) y luego se desplaza por puntos ``dx`` y ``dy`` utilizando ``fig.dpi_scale_trans``. (En tipografía, un `punto <https://en.wikipedia.org/wiki/Point_%28typography%29>`_ es 1/72 pulgadas, y al especificar sus desplazamientos en puntos, su figura tendrá el mismo aspecto independientemente de la resolución de dpi en la que se guarde)

source: The dpi and inches offset is a common-enough use case that we have a special helper function to create it in :func:`matplotlib.transforms.offset_copy`, which returns a new transform with an added offset. So above we could have done::
es_es: El desplazamiento de dpi y pulgadas es un caso de uso tan común que tenemos una función especial de ayuda para crearlo en :func:`matplotlib.transforms.offset_copy`, que devuelve una nueva transformación con un desplazamiento añadido. Así que arriba podríamos haber hecho::

source: The transformation pipeline
es_es: El proceso de transformación

source: The ``ax.transData`` transform we have been working with in this tutorial is a composite of three different transformations that comprise the transformation pipeline from *data* -> *display* coordinates. Michael Droettboom implemented the transformations framework, taking care to provide a clean API that segregated the nonlinear projections and scales that happen in polar and logarithmic plots, from the linear affine transformations that happen when you pan and zoom. There is an efficiency here, because you can pan and zoom in your axes which affects the affine transformation, but you may not need to compute the potentially expensive nonlinear scales or projections on simple navigation events. It is also possible to multiply affine transformation matrices together, and then apply them to coordinates in one step. This is not true of all possible transformations.
es_es: La transformación ``ax.transData`` con la que hemos estado trabajando en este tutorial es un compuesto de tres transformaciones diferentes que comprenden la tubería de transformación de coordenadas *data* -> *display*. Michael Droettboom implementó el framework de transformaciones, cuidando de proporcionar una API limpia que segregara las proyecciones no lineales y las escalas que ocurren en los gráficos polares y logarítmicos, de las transformaciones lineales afines que ocurren cuando se hace paneo y zoom. Hay una eficiencia aquí, porque usted puede panear y hacer zoom en sus ejes que afecta a la transformación afín, pero puede que no necesite calcular las escalas o proyecciones no lineales potencialmente costosas en eventos de navegación simples. También es posible multiplicar las matrices de transformación afín juntas, y luego aplicarlas a las coordenadas en un solo paso. Esto no es cierto para todas las transformaciones posibles.

source: Here is how the ``ax.transData`` instance is defined in the basic separable axis :class:`~matplotlib.axes.Axes` class::
es_es: Así es como se define la instancia ``ax.transData`` en el eje básico separable :class:`~matplotlib.axes.Axes` class::

source: We've been introduced to the ``transAxes`` instance above in :ref:`axes-coords`, which maps the (0, 0), (1, 1) corners of the axes or subplot bounding box to *display* space, so let's look at these other two pieces.
es_es: Ya hemos conocido la instancia ``transAxes`` en :ref:`axes-coords`, que mapea las esquinas (0, 0), (1, 1) de la caja delimitadora de los ejes o de la subparcela al espacio de *display*, así que veamos estas otras dos piezas.

source: ``self.transLimits`` is the transformation that takes you from *data* to *axes* coordinates; i.e., it maps your view xlim and ylim to the unit space of the axes (and ``transAxes`` then takes that unit space to display space). We can see this in action here
es_es: ``self.transLimits`` es la transformación que te lleva de las coordenadas de los *datos* a las coordenadas de los *ejes*; es decir, mapea tu vista xlim e ylim al espacio unitario de los ejes (y ``transAxes`` luego lleva ese espacio unitario al espacio de visualización). Podemos ver esto en acción aquí

source: and we can use this same inverted transformation to go from the unit *axes* coordinates back to *data* coordinates.
es_es: y podemos utilizar esta misma transformación invertida para pasar de las coordenadas de los *ejes* unitarios a las coordenadas de los *datos*.

source: The final piece is the ``self.transScale`` attribute, which is responsible for the optional non-linear scaling of the data, e.g., for logarithmic axes. When an Axes is initially setup, this is just set to the identity transform, since the basic Matplotlib axes has linear scale, but when you call a logarithmic scaling function like :meth:`~matplotlib.axes.Axes.semilogx` or explicitly set the scale to logarithmic with :meth:`~matplotlib.axes.Axes.set_xscale`, then the ``ax.transScale`` attribute is set to handle the nonlinear projection. The scales transforms are properties of the respective ``xaxis`` and ``yaxis`` :class:`~matplotlib.axis.Axis` instances. For example, when you call ``ax.set_xscale('log')``, the xaxis updates its scale to a :class:`matplotlib.scale.LogScale` instance.
es_es: La última pieza es el atributo ``self.transScale``, que es responsable del escalado no lineal opcional de los datos, por ejemplo, para los ejes logarítmicos. Cuando un eje se configura inicialmente, se establece la transformación de identidad, ya que los ejes básicos de Matplotlib tienen una escala lineal, pero cuando se llama a una función de escala logarítmica como :meth:`~matplotlib.axes.Axes.semilogx` o se establece explícitamente la escala logarítmica con :meth:`~matplotlib.axes.Axes.set_xscale`, entonces el atributo ``ax.transScale`` se establece para manejar la proyección no lineal. Las escalas de transformación son propiedades de las respectivas instancias del ``xaxis`` y del ``yaxis`` :class:`~matplotlib.axis.Axis`. Por ejemplo, cuando se llama a ``ax.set_xscale('log')``, el eje x actualiza su escala a una instancia :class:`matplotlib.scale.LogScale`.

source: For non-separable axes the PolarAxes, there is one more piece to consider, the projection transformation. The ``transData`` :class:`matplotlib.projections.polar.PolarAxes` is similar to that for the typical separable matplotlib Axes, with one additional piece ``transProjection``::
es_es: Para los ejes no separables, los PolarAxes, hay una pieza más a considerar, la transformación de la proyección. La transformación ``transData`` :class:`matplotlib.projections.polar.PolarAxes` es similar a la de los típicos ejes separables de matplotlib, con una pieza adicional ``transProjection``::

source: ``transProjection`` handles the projection from the space, e.g., latitude and longitude for map data, or radius and theta for polar data, to a separable Cartesian coordinate system. There are several projection examples in the :mod:`matplotlib.projections` package, and the best way to learn more is to open the source for those packages and see how to make your own, since Matplotlib supports extensible axes and projections. Michael Droettboom has provided a nice tutorial example of creating a Hammer projection axes; see :doc:`/gallery/misc/custom_projection`.
es_es: ``transProjection`` maneja la proyección desde el espacio, por ejemplo, latitud y longitud para datos cartográficos, o radio y theta para datos polares, a un sistema de coordenadas cartesianas separable. Hay varios ejemplos de proyecciones en el paquete :mod:`matplotlib.projections`, y la mejor manera de aprender más es abrir el código fuente de esos paquetes y ver cómo hacer el tuyo propio, ya que Matplotlib soporta ejes y proyecciones extensibles. Michael Droettboom ha proporcionado un buen ejemplo de tutorial para crear un eje de proyección Hammer; ver :doc:`/gallery/misc/custom_projection`.

source: **Total running time of the script:** ( 0 minutes 2.926 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2.926 segundos)

source: :download:`Download Python source code: transforms_tutorial.py <transforms_tutorial.py>`
es_es: :download:`Descargar código fuente de Python: transforms_tutorial.py <transforms_tutorial.py>`

source: :download:`Download Jupyter notebook: transforms_tutorial.ipynb <transforms_tutorial.ipynb>`
es_es: :download:`Descargar Jupyter notebook: transforms_tutorial.ipynb <transforms_tutorial.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
