Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/event_handling/ginput_manual_clabel_sgskip.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_event_handling_ginput_manual_clabel_sgskip.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_event_handling_ginput_manual_clabel_sgskip.py>` para descargar el código de ejemplo completo

source: Interactive functions
es_es: Funciones interactivas

source: This provides examples of uses of interactive functions, such as ginput, waitforbuttonpress and manual clabel placement.
es_es: Proporciona ejemplos de uso de funciones interactivas, como ginput, waitforbuttonpress y colocación manual de etiquetas.

source: This script must be run interactively using a backend that has a graphical user interface (for example, using GTK3Agg backend, but not PS backend).
es_es: Este script debe ejecutarse de forma interactiva utilizando un backend que tenga una interfaz gráfica de usuario (por ejemplo, utilizando el backend GTK3Agg, pero no el backend PS).

source: Define a triangle by clicking three points
es_es: Definir un triángulo haciendo clic en tres puntos

source: Now contour according to distance from triangle corners - just an example
es_es: Ahora el contorno de acuerdo a la distancia de las esquinas del triángulo - sólo un ejemplo

source: Now do a zoom
es_es: Ahora haz un zoom

source: :download:`Download Python source code: ginput_manual_clabel_sgskip.py <ginput_manual_clabel_sgskip.py>`
es_es: :download:`Descarga el código fuente de Python: ginput_manual_clabel_sgskip.py <ginput_manual_clabel_sgskip.py>`

source: :download:`Download Jupyter notebook: ginput_manual_clabel_sgskip.ipynb <ginput_manual_clabel_sgskip.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: ginput_manual_clabel_sgskip.ipynb <ginput_manual_clabel_sgskip.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
