Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/event_handling/pick_event_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_event_handling_pick_event_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_event_handling_pick_event_demo.py>` para descargar el código de ejemplo completo

source: Pick Event Demo
es_es: Demostración de selección de eventos

source: You can enable picking by setting the "picker" property of an artist (for example, a matplotlib Line2D, Text, Patch, Polygon, AxesImage, etc...)
es_es: Puedes habilitar la selección estableciendo la propiedad "picker" de un artista (por ejemplo, un matplotlib Line2D, Text, Patch, Polygon, AxesImage, etc...)

source: There are a variety of meanings of the picker property:
es_es: Hay una variedad de significados de la propiedad picker:

source: *None* - picking is disabled for this artist (default)
es_es: *None* - la selección está desactivada para este artista (por defecto)

source: bool - if *True* then picking will be enabled and the artist will fire a pick event if the mouse event is over the artist.
es_es: bool - si *True* entonces la selección estará habilitada y el artista disparará un evento de selección si el evento del ratón está sobre el artista.

source: Setting ``pickradius`` will add an epsilon tolerance in points and the artist will fire off an event if its data is within epsilon of the mouse event. For some artists like lines and patch collections, the artist may provide additional data to the pick event that is generated, for example, the indices of the data within epsilon of the pick event
es_es: Al establecer ``pickradius`` se añadirá una tolerancia epsilon en puntos y el artista disparará un evento si sus datos están dentro de epsilon del evento del ratón. Para algunos artistas como las líneas y las colecciones de parches, el artista puede proporcionar datos adicionales al evento de selección que se genera, por ejemplo, los índices de los datos dentro de epsilon del evento de selección

source: function - if picker is callable, it is a user supplied function which determines whether the artist is hit by the mouse event.
es_es: function - si el picker es invocable, es una función suministrada por el usuario que determina si el artista es golpeado por el evento del ratón.

source: to determine the hit test. If the mouse event is over the artist, return hit=True and props is a dictionary of properties you want added to the PickEvent attributes.
es_es: para determinar la prueba de acierto. Si el evento del ratón está sobre el artista, devuelve hit=True y props es un diccionario de propiedades que quiere añadir a los atributos de PickEvent.

source: After you have enabled an artist for picking by setting the "picker" property, you need to connect to the figure canvas pick_event to get pick callbacks on mouse press events. For example,
es_es: Una vez que hayas habilitado un artist para la selección estableciendo la propiedad "picker", necesitas conectarlo al lienzo de la figura pick_event para obtener las devoluciones de llamada de la selección en los eventos de pulsación del ratón. Por ejemplo,

source: mouseevent = event.mouseevent artist = event.artist # now do something with this...
es_es: mouseevent = event.mouseevent artist = event.artist # ahora haz algo con esto...

source: The pick event (matplotlib.backend_bases.PickEvent) which is passed to your callback is always fired with two attributes:
es_es: El evento pick (matplotlib.backend_bases.PickEvent) que se pasa a su callback, se dispara siempre con dos atributos:

source: mouseevent - the mouse event that generate the pick event. The
es_es: mouseevent - el evento del ratón que genera el evento de selección. El

source: mouse event in turn has attributes like x and y (the coordinates in display space, such as pixels from left, bottom) and xdata, ydata (the coords in data space). Additionally, you can get information about which buttons were pressed, which keys were pressed, which Axes the mouse is over, etc. See matplotlib.backend_bases.MouseEvent for details.
es_es: evento del ratón tiene, a su vez, atributos como x e y (las coordenadas en el espacio de visualización, como píxeles desde la izquierda, abajo) y xdata, ydata (las coordenadas en el espacio de datos). Además, se puede obtener información sobre qué botones se han pulsado, qué teclas se han pulsado, sobre qué ejes está el ratón, etc. Ver matplotlib.backend_bases.MouseEvent para más detalles.

source: artist - the matplotlib.artist that generated the pick event.
es_es: artist - el matplotlib.artist que generó el evento de selección.

source: Additionally, certain artists like Line2D and PatchCollection may attach additional meta data like the indices into the data that meet the picker criteria (for example, all the points in the line that are within the specified epsilon tolerance)
es_es: Además, algunos artistas como Line2D y PatchCollection pueden adjuntar metadatos adicionales como los índices en los datos que cumplen los criterios del picker (por ejemplo, todos los puntos de la línea que están dentro de la tolerancia epsilon especificada)

source: The examples below illustrate each of these methods.
es_es: Los ejemplos siguientes ilustran cada uno de estos métodos.

source: **Total running time of the script:** ( 0 minutes 1.082 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.082 segundos)

source: :download:`Download Python source code: pick_event_demo.py <pick_event_demo.py>`
es_es: :download:`Descarga el código fuente de Python: pick_event_demo.py <pick_event_demo.py>`

source: :download:`Download Jupyter notebook: pick_event_demo.ipynb <pick_event_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: pick_event_demo.ipynb <pick_event_demo.ipynb>`

source: Keywords: matplotlib code example, codex, python plot, pyplot `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
es_es: Palabras clave: ejemplo de código matplotlib, codex, python plot, pyplot `Galería generada por Sphinx-Gallery <https://sphinx-gallery.readthedocs.io>`_
