Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/barcode_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_barcode_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_barcode_demo.py>` para descargar el código de ejemplo completo

source: Barcode
es_es: Código de barras

source: This demo shows how to produce a bar code.
es_es: Esta demostración muestra cómo generar un código de barras.

source: The figure size is calculated so that the width in pixels is a multiple of the number of data points to prevent interpolation artifacts. Additionally, the ``Axes`` is defined to span the whole figure and all ``Axis`` are turned off.
es_es: El tamaño de la figura se calcula de forma que la anchura en píxeles sea un múltiplo del número de puntos de datos para evitar artefactos de interpolación. Además, los ``Ejes`` se definen para abarcar toda la figura y todos los ``Ejes`` se desactivan.

source: The data itself is rendered with `~.Axes.imshow` using
es_es: Los datos en sí mismos se representan con `~.Axes.imshow` utilizando

source: ``code.reshape(1, -1)`` to turn the data into a 2D array with one row.
es_es: ``code.reshape(1, -1)`` para convertir los datos en un arreglo 2D con una fila.

source: ``imshow(..., aspect='auto')`` to allow for non-square pixels.
es_es: ``imshow(..., aspect='auto')`` para permitir píxeles no cuadrados.

source: ``imshow(..., interpolation='nearest')`` to prevent blurred edges. This should not happen anyway because we fine-tuned the figure width in pixels, but just to be safe.
es_es: ``imshow(..., interpolación='más cercana')`` para evitar los bordes borrosos. Esto no debería ocurrir de todos modos porque hemos ajustado el ancho de la figura en píxeles, pero sólo para estar seguros.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: barcode_demo.py <barcode_demo.py>`
es_es: :download:`Descargar el código fuente de Python: barcode_demo.py <barcode_demo.py>`

source: :download:`Download Jupyter notebook: barcode_demo.ipynb <barcode_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: barcode_demo.ipynb <barcode_demo.ipynb>`
