Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/colormap_normalizations_symlognorm.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_colormap_normalizations_symlognorm.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_colormap_normalizations_symlognorm.py>` para descargar el código de ejemplo completo

source: Colormap Normalizations SymLogNorm
es_es: Normalizaciones del mapa de colores SymLogNorm

source: Demonstration of using norm to map colormaps onto data in non-linear ways.
es_es: Demostración del uso de la norma para mapear los mapas de color en los datos de forma no lineal.

source: Synthetic dataset consisting of two humps, one negative and one positive, the positive with 8-times the amplitude. Linearly, the negative hump is almost invisible, and it is very difficult to see any detail of its profile. With the logarithmic scaling applied to both positive and negative values, it is much easier to see the shape of each hump.
es_es: Conjunto de datos sintéticos compuesto por dos jorobas, una negativa y otra positiva, la positiva con una amplitud 8 veces mayor. Linealmente, la joroba negativa es casi invisible, y es muy difícil ver algún detalle de su perfil. Con la escala logarítmica aplicada a los valores positivos y negativos, es mucho más fácil ver la forma de cada joroba.

source: See `~.colors.SymLogNorm`.
es_es: Ver `~.colors.SymLogNorm`.

source: Out:
es_es: Salida:

source: In order to find the best visualization for any particular dataset, it may be necessary to experiment with multiple different color scales. As well as the `~.colors.SymLogNorm` scaling, there is also the option of using `~.colors.AsinhNorm` (experimental), which has a smoother transition between the linear and logarithmic regions of the transformation applied to the data values, "Z". In the plots below, it may be possible to see contour-like artifacts around each hump despite there being no sharp features in the dataset itself. The ``asinh`` scaling shows a smoother shading of each hump.
es_es: Con el fin de encontrar la mejor visualización para cualquier conjunto de datos en particular, puede ser necesario experimentar con múltiples escalas de color diferentes. Además de la escala `~.colors.SymLogNorm`, también existe la opción de utilizar `~.colors.AsinhNorm` (experimental), que tiene una transición más suave entre las regiones lineal y logarítmica de la transformación aplicada a los valores de los datos, "Z". En los gráficos de abajo, es posible ver artefactos de contorno alrededor de cada joroba, a pesar de que no hay rasgos agudos en el conjunto de datos en sí. La escala ``asinh`` muestra un sombreado más suave de cada joroba.

source: **Total running time of the script:** ( 0 minutes 2.309 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2.309 segundos)

source: :download:`Download Python source code: colormap_normalizations_symlognorm.py <colormap_normalizations_symlognorm.py>`
es_es: :download:`Descargar el código fuente de Python: colormap_normalizations_symlognorm.py <colormap_normalizations_symlognorm.py>`

source: :download:`Download Jupyter notebook: colormap_normalizations_symlognorm.ipynb <colormap_normalizations_symlognorm.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: colormap_normalizations_symlognorm.ipynb <colormap_normalizations_symlognorm.ipynb>`
