Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/contour_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_contour_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_contour_demo.py>` para descargar el código de ejemplo completo

source: Contour Demo
es_es: Demostración de contornos

source: Illustrate simple contour plotting, contours on an image with a colorbar for the contours, and labelled contours.
es_es: Ilustra el trazado simple de contornos, contornos en una imagen con una barra de colores para los contornos, y contornos etiquetados.

source: See also the :doc:`contour image example </gallery/images_contours_and_fields/contour_image>`.
es_es: Ver también el :doc:`ejemplo de imagen de contorno </gallery/images_contours_and_fields/contour_image>`.

source: Create a simple contour plot with labels using default colors. The inline argument to clabel will control whether the labels are draw over the line segments of the contour, removing the lines beneath the label.
es_es: Crea un sencillo gráfico de contorno con etiquetas utilizando los colores por defecto. El argumento inline de clabel controlará si las etiquetas se dibujan sobre los segmentos de línea del contorno, eliminando las líneas bajo la etiqueta.

source: Out:
es_es: Salida:

source: Contour labels can be placed manually by providing list of positions (in data coordinate). See :doc:`/gallery/event_handling/ginput_manual_clabel_sgskip` for interactive placement.
es_es: Las etiquetas de los contornos se pueden colocar manualmente proporcionando una lista de posiciones (en coordenadas de datos). Ver :doc:`/gallery/event_handling/ginput_manual_clabel_sgskip` para la colocación interactiva.

source: You can force all the contours to be the same color.
es_es: Puedes forzar que todos los contornos sean del mismo color.

source: You can set negative contours to be solid instead of dashed:
es_es: Puedes configurar los contornos negativos para que sean sólidos en lugar de discontinuos:

source: And you can manually specify the colors of the contour
es_es: Y puedes especificar manualmente los colores del contorno

source: Or you can use a colormap to specify the colors; the default colormap will be used for the contour lines
es_es: O puedes utilizar un mapa de colores para especificar los colores; el mapa de colores por defecto se utilizará para las líneas de contorno

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 2.503 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2.503 segundos)

source: :download:`Download Python source code: contour_demo.py <contour_demo.py>`
es_es: :download:`Descarga el código fuente de Python: contour_demo.py <contour_demo.py>`

source: :download:`Download Jupyter notebook: contour_demo.ipynb <contour_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: contour_demo.ipynb <contour_demo.ipynb>`
