Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/contour_label_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_contour_label_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_contour_label_demo.py>` para descargar el código de ejemplo completo

source: Contour Label Demo
es_es: Demostración de la etiqueta de contorno

source: Illustrate some of the more advanced things that one can do with contour labels.
es_es: Ilustra algunas de las cosas más avanzadas que se pueden hacer con las etiquetas de contorno.

source: See also the :doc:`contour demo example </gallery/images_contours_and_fields/contour_demo>`.
es_es: Ver también el :doc:`ejemplo de demostración de contorno </gallery/images_contours_and_fields/contour_demo>`.

source: Define our surface
es_es: Definir nuestra superficie

source: Make contour labels with custom level formatters
es_es: Hacer etiquetas de contorno con formateadores de nivel personalizados

source: Out:
es_es: Salida:

source: Label contours with arbitrary strings using a dictionary
es_es: Etiquetar contornos con cadenas arbitrarias utilizando un diccionario

source: Use a Formatter
es_es: Utilizar un formateador

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.385 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.385 segundos)

source: :download:`Download Python source code: contour_label_demo.py <contour_label_demo.py>`
es_es: :download:`Descarga el código fuente de Python: contour_label_demo.py <contour_label_demo.py>`

source: :download:`Download Jupyter notebook: contour_label_demo.ipynb <contour_label_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: contour_label_demo.ipynb <contour_label_demo.ipynb>`
