Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/contourf_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_contourf_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_contourf_demo.py>` para descargar el código de ejemplo completo

source: Contourf Demo
es_es: Demostración de Contourf

source: How to use the `.axes.Axes.contourf` method to create filled contour plots.
es_es: Cómo utilizar el método `.axes.Axes.contourf` para crear gráficos de contorno rellenos.

source: Automatic contour levels
es_es: Niveles automáticos de contorno

source: We are using automatic selection of contour levels; this is usually not such a good idea, because they don't occur on nice boundaries, but we do it here for purposes of illustration.
es_es: Estamos utilizando la selección automática de los niveles de contorno; esto normalmente no es tan buena idea, porque no se dan en límites agradables, pero lo hacemos aquí a efectos de ilustración.

source: Explicit contour levels
es_es: Niveles de contorno explícitos

source: Now make a contour plot with the levels specified, and with the colormap generated automatically from a list of colors.
es_es: Ahora haz un gráfico de contorno con los niveles especificados, y con el mapa de colores generado automáticamente a partir de una lista de colores.

source: Out:
es_es: Salida:

source: Extension settings
es_es: Configuración de la extensión

source: Illustrate all 4 possible "extend" settings:
es_es: Ilustra las 4 posibles configuraciones de "extender":

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 2.510 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2,510 segundos)

source: :download:`Download Python source code: contourf_demo.py <contourf_demo.py>`
es_es: :download:`Descarga el código fuente de Python: contourf_demo.py <contourf_demo.py>`

source: :download:`Download Jupyter notebook: contourf_demo.ipynb <contourf_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: contourf_demo.ipynb <contourf_demo.ipynb>`
