Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/image_transparency_blend.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_image_transparency_blend.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_image_transparency_blend.py>` para descargar el código de ejemplo completo

source: Blend transparency with color in 2D images
es_es: Mezclar la transparencia con el color en imágenes 2D

source: Blend transparency with color to highlight parts of data with imshow.
es_es: Mezclar la transparencia con el color para resaltar partes de los datos con imshow.

source: A common use for `matplotlib.pyplot.imshow` is to plot a 2D statistical map. The function makes it easy to visualize a 2D matrix as an image and add transparency to the output. For example, one can plot a statistic (such as a t-statistic) and color the transparency of each pixel according to its p-value. This example demonstrates how you can achieve this effect.
es_es: Un uso común de `matplotlib.pyplot.imshow` es trazar un mapa estadístico 2D. La función facilita la visualización de una matriz 2D como imagen y añade transparencia a la salida. Por ejemplo, se puede trazar un estadístico (como un estadístico t) y colorear la transparencia de cada píxel según su valor p. Este ejemplo demuestra cómo se puede conseguir este efecto.

source: First we will generate some data, in this case, we'll create two 2D "blobs" in a 2D grid. One blob will be positive, and the other negative.
es_es: Primero generaremos algunos datos, en este caso, crearemos dos "blobs" 2D en una Cuadrícula 2D. Un blob será positivo y el otro negativo.

source: Blending in transparency
es_es: Mezcla de transparencia

source: The simplest way to include transparency when plotting data with `matplotlib.pyplot.imshow` is to pass an array matching the shape of the data to the ``alpha`` argument. For example, we'll create a gradient moving from left to right below.
es_es: La forma más sencilla de incluir la transparencia al trazar datos con `matplotlib.pyplot.imshow` es pasar un arreglo que coincida con la forma de los datos al argumento ``alpha``. Por ejemplo, crearemos un gradiente que se mueva de izquierda a derecha a continuación.

source: Using transparency to highlight values with high amplitude
es_es: Uso de la transparencia para resaltar los valores con alta amplitud

source: Finally, we'll recreate the same plot, but this time we'll use transparency to highlight the extreme values in the data. This is often used to highlight data points with smaller p-values. We'll also add in contour lines to highlight the image values.
es_es: Por último, recrearemos el mismo gráfico, pero esta vez utilizaremos la transparencia para resaltar los valores extremos de los datos. Esto se utiliza a menudo para resaltar los puntos de datos con valores p más pequeños. También añadiremos líneas de contorno para resaltar los valores de la imagen.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: image_transparency_blend.py <image_transparency_blend.py>`
es_es: :download:`Descarga el código fuente de Python: image_transparency_blend.py <image_transparency_blend.py>`

source: :download:`Download Jupyter notebook: image_transparency_blend.ipynb <image_transparency_blend.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: image_transparency_blend.ipynb <image_transparency_blend.ipynb>`
