Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/image_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_image_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_image_demo.py>` para descargar el código de ejemplo completo

source: Image Demo
es_es: Imagen de demostración

source: Many ways to plot images in Matplotlib.
es_es: Muchas formas de trazar imágenes en Matplotlib.

source: The most common way to plot images in Matplotlib is with `~.axes.Axes.imshow`. The following examples demonstrate much of the functionality of imshow and the many images you can create.
es_es: La forma más común de trazar imágenes en Matplotlib es con `~.axes.Axes.imshow`. Los siguientes ejemplos demuestran gran parte de la funcionalidad de imshow y las muchas imágenes que se pueden crear.

source: First we'll generate a simple bivariate normal distribution.
es_es: Primero generaremos una distribución normal bivariada simple.

source: It is also possible to show images of pictures.
es_es: También es posible mostrar imágenes de cuadros.

source: Interpolating images
es_es: Interpolación de imágenes

source: It is also possible to interpolate images before displaying them. Be careful, as this may manipulate the way your data looks, but it can be helpful for achieving the look you want. Below we'll display the same (small) array, interpolated with three different interpolation methods.
es_es: También es posible interpolar las imágenes antes de mostrarlas. Hay que tener cuidado, ya que esto puede manipular el aspecto de los datos, pero puede ser útil para conseguir el aspecto deseado. A continuación mostraremos el mismo arreglo (pequeño), interpolado con tres métodos de interpolación diferentes.

source: The center of the pixel at A[i, j] is plotted at (i+0.5, i+0.5). If you are using interpolation='nearest', the region bounded by (i, j) and (i+1, j+1) will have the same color. If you are using interpolation, the pixel center will have the same color as it does with nearest, but other pixels will be interpolated between the neighboring pixels.
es_es: El centro del píxel en A[i, j] se traza en (i+0,5, i+0,5). Si está utilizando interpolación='más cercano', la región delimitada por (i, j) y (i+1, j+1) tendrá el mismo color. Si utiliza la interpolación, el centro del píxel tendrá el mismo color que con nearest, pero los demás píxeles se interpolarán entre los píxeles vecinos.

source: To prevent edge effects when doing interpolation, Matplotlib pads the input array with identical pixels around the edge: if you have a 5x5 array with colors a-y as below::
es_es: Para evitar los efectos de los bordes al hacer la interpolación, Matplotlib rellena el arreglo de entrada con píxeles idénticos alrededor del borde: si tienes un arreglo de 5x5 con colores a-y como el siguiente::

source: Matplotlib computes the interpolation and resizing on the padded array ::
es_es: Matplotlib calcula la interpolación y el redimensionamiento en el arreglo acolchado ::

source: and then extracts the central region of the result. (Extremely old versions of Matplotlib (<0.63) did not pad the array, but instead adjusted the view limits to hide the affected edge areas.)
es_es: y luego extrae la región central del resultado. (Las versiones extremadamente antiguas de Matplotlib (<0.63) no acolchaban el arreglo, sino que ajustaban los límites de la vista para ocultar las áreas de los bordes afectados).

source: This approach allows plotting the full extent of an array without edge effects, and for example to layer multiple images of different sizes over one another with different interpolation methods -- see :doc:`/gallery/images_contours_and_fields/layer_images`. It also implies a performance hit, as this new temporary, padded array must be created. Sophisticated interpolation also implies a performance hit; for maximal performance or very large images, interpolation='nearest' is suggested.
es_es: Este enfoque permite trazar toda la extensión de un arreglo sin efectos de borde y, por ejemplo, superponer múltiples imágenes de diferentes tamaños con diferentes métodos de interpolación -- ver :doc:`/gallery/images_contours_and_fields/layer_images`. También implica un impacto en el rendimiento, ya que este nuevo arreglo temporal y acolchado debe ser creado. La interpolación sofisticada también implica un impacto en el rendimiento; para un rendimiento máximo o imágenes muy grandes, se sugiere interpolación='nearest'.

source: You can specify whether images should be plotted with the array origin x[0, 0] in the upper left or lower right by using the origin parameter. You can also control the default setting image.origin in your :ref:`matplotlibrc file <customizing-with-matplotlibrc-files>`. For more on this topic see the :doc:`complete guide on origin and extent </tutorials/intermediate/imshow_extent>`.
es_es: Puede especificar si las imágenes deben ser trazadas con el arreglo origen x[0, 0] en la parte superior izquierda o inferior derecha utilizando el parámetro origen. También puede controlar la configuración por defecto image.origin en su archivo :ref:`matplotlibrc <customizing-with-matplotlibrc-files>`. Para más información sobre este tema, consulte la :doc:`guía completa sobre origen y extensión </tutorials/intermediate/imshow_extent>`.

source: Finally, we'll show an image using a clip path.
es_es: Por último, mostraremos una imagen utilizando una ruta de clip.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 2.059 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2.059 segundos)

source: :download:`Download Python source code: image_demo.py <image_demo.py>`
es_es: :download:`Descarga el código fuente de Python: image_demo.py <image_demo.py>`

source: :download:`Download Jupyter notebook: image_demo.ipynb <image_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: image_demo.ipynb <image_demo.ipynb>`
