Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/interpolation_methods.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_interpolation_methods.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_interpolation_methods.py>` para descargar el código de ejemplo completo

source: Interpolations for imshow
es_es: Interpolaciones para imshow

source: This example displays the difference between interpolation methods for `~.axes.Axes.imshow`.
es_es: Este ejemplo muestra la diferencia entre los métodos de interpolación para `~.axes.Axes.imshow`.

source: If *interpolation* is None, it defaults to the :rc:`image.interpolation`. If the interpolation is ``'none'``, then no interpolation is performed for the Agg, ps and pdf backends. Other backends will default to ``'antialiased'``.
es_es: Si *interpolación* es None, se utiliza por defecto el método :rc:`image.interpolation`. Si la interpolación es ``ninguna``, no se realiza ninguna interpolación para los backends Agg, ps y pdf. Los demás backends tendrán por defecto ``antialiased``.

source: For the Agg, ps and pdf backends, ``interpolation = 'none'`` works well when a big image is scaled down, while ``interpolation = 'nearest'`` works well when a small image is scaled up.
es_es: Para los backends Agg, ps y pdf, ``interpolación = 'none'`` funciona bien cuando se reduce una imagen grande, mientras que ``interpolación = 'nearest'`` funciona bien cuando se aumenta una imagen pequeña.

source: See :doc:`/gallery/images_contours_and_fields/image_antialiasing` for a discussion on the default ``interpolation="antialiased"`` option.
es_es: Ver :doc:`/gallery/images_contours_and_fields/image_antialiasing` para una discusión sobre la opción por defecto ``interpolation="antialiased"``.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.369 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.369 segundos)

source: :download:`Download Python source code: interpolation_methods.py <interpolation_methods.py>`
es_es: :download:`Descarga el código fuente de Python: interpolation_methods.py <interpolation_methods.py>`

source: :download:`Download Jupyter notebook: interpolation_methods.ipynb <interpolation_methods.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: interpolation_methods.ipynb <interpolation_methods.ipynb>`
