Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/irregulardatagrid.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_irregulardatagrid.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_irregulardatagrid.py>` para descargar el código de ejemplo completo

source: Contour plot of irregularly spaced data
es_es: Gráfico de contorno de datos espaciados irregularmente

source: Comparison of a contour plot of irregularly spaced data interpolated on a regular grid versus a tricontour plot for an unstructured triangular grid.
es_es: Comparación de un gráfico de contorno de datos espaciados irregularmente interpolados en una cuadrícula regular frente a un gráfico de tricontour para una cuadrícula triangular no estructurada.

source: Since `~.axes.Axes.contour` and `~.axes.Axes.contourf` expect the data to live on a regular grid, plotting a contour plot of irregularly spaced data requires different methods. The two options are:
es_es: Dado que `~.axes.Axes.contour` y `~.axes.Axes.contourf` esperan que los datos vivan en una cuadrícula regular, el trazado de un gráfico de contorno de datos espaciados irregularmente requiere métodos diferentes. Las dos opciones son:

source: Interpolate the data to a regular grid first. This can be done with on-board means, e.g. via `~.tri.LinearTriInterpolator` or using external functionality e.g. via `scipy.interpolate.griddata`. Then plot the interpolated data with the usual `~.axes.Axes.contour`.
es_es: Interpolar los datos a una cuadrícula regular primero. Esto se puede hacer con los medios de a bordo, por ejemplo, a través de `~.tri.LinearTriInterpolator` o utilizando la funcionalidad externa, por ejemplo, a través de `scipy.interpolate.griddata`. A continuación, trazar los datos interpolados con el habitual `~.axes.Axes.contour`.

source: Directly use `~.axes.Axes.tricontour` or `~.axes.Axes.tricontourf` which will perform a triangulation internally.
es_es: Utilizar directamente `~.axes.Axes.tricontour` o `~.axes.Axes.tricontourf` que realizará una triangulación internamente.

source: This example shows both methods in action.
es_es: Este ejemplo muestra ambos métodos en acción.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: irregulardatagrid.py <irregulardatagrid.py>`
es_es: :download:`Descarga el código fuente de Python: irregulardatagrid.py <irregulardatagrid.py>`

source: :download:`Download Jupyter notebook: irregulardatagrid.ipynb <irregulardatagrid.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: irregulardatagrid.ipynb <irregulardatagrid.ipynb>`
