Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/pcolormesh_levels.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_pcolormesh_levels.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_pcolormesh_levels.py>` para descargar el código de ejemplo completo

source: `.axes.Axes.pcolormesh` allows you to generate 2D image-style plots. Note it is faster than the similar `~.axes.Axes.pcolor`.
es_es: `.axes.Axes.pcolormesh` permite generar gráficos de estilo de imagen 2D. Tenga en cuenta que es más rápido que el similar `~.axes.Axes.pcolor`.

source: Basic pcolormesh
es_es: Pcolormesh básico

source: We usually specify a pcolormesh by defining the edge of quadrilaterals and the value of the quadrilateral. Note that here *x* and *y* each have one extra element than Z in the respective dimension.
es_es: Normalmente especificamos un pcolormesh definiendo el borde de los cuadriláteros y el valor del cuadrilátero. Nótese que aquí *x* y *y* tienen cada uno un elemento extra que Z en la dimensión respectiva.

source: Out:
es_es: Salida:

source: Non-rectilinear pcolormesh
es_es: Pcolormesh no rectilíneo

source: Note that we can also specify matrices for *X* and *Y* and have non-rectilinear quadrilaterals.
es_es: Observa que también podemos especificar matrices para *X* y *Y* y tener cuadriláteros no rectilíneos.

source: Centered Coordinates
es_es: Coordenadas centradas

source: Often a user wants to pass *X* and *Y* with the same sizes as *Z* to `.axes.Axes.pcolormesh`. This is also allowed if ``shading='auto'`` is passed (default set by :rc:`pcolor.shading`). Pre Matplotlib 3.3, ``shading='flat'`` would drop the last column and row of *Z*; while that is still allowed for back compatibility purposes, a DeprecationWarning is raised. If this is really what you want, then simply drop the last row and column of Z manually:
es_es: A menudo un usuario quiere pasar *X* y *Y* con los mismos tamaños que *Z* a `.axes.Axes.pcolormesh`. Esto también se permite si se pasa ``shading='auto'`` (establecido por defecto por :rc:`pcolor.shading`). Antes de Matplotlib 3.3, ``shading='flat'`` eliminaba la última columna y fila de *Z*; aunque todavía se permite por motivos de retrocompatibilidad, se produce un DeprecationWarning. Si esto es realmente lo que quieres, entonces simplemente elimina la última fila y columna de Z manualmente:

source: Making levels using Norms
es_es: Hacer niveles usando normas

source: Shows how to combine Normalization and Colormap instances to draw "levels" in `.axes.Axes.pcolor`, `.axes.Axes.pcolormesh` and `.axes.Axes.imshow` type plots in a similar way to the levels keyword argument to contour/contourf.
es_es: Muestra cómo combinar las instancias de Normalización y Colormap para dibujar "niveles" en los gráficos de tipo `.axes.Axes.pcolor`, `.axes.Axes.pcolormesh` y `.axes.Axes.imshow` de forma similar al argumento de la palabra clave levels para contour/contourf.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.636 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.636 segundos)

source: :download:`Download Python source code: pcolormesh_levels.py <pcolormesh_levels.py>`
es_es: :download:`Descargar el código fuente de Python: pcolormesh_levels.py <pcolormesh_levels.py>`

source: :download:`Download Jupyter notebook: pcolormesh_levels.ipynb <pcolormesh_levels.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: pcolormesh_levels.ipynb <pcolormesh_levels.ipynb>`
