Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/pcolor_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_pcolor_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_pcolor_demo.py>` para descargar el código de ejemplo completo

source: Pcolor Demo
es_es: Demostración pcolor

source: Generating images with `~.axes.Axes.pcolor`.
es_es: Generando imágenes con `~.axes.Axes.pcolor`.

source: Pcolor allows you to generate 2D image-style plots. Below we will show how to do so in Matplotlib.
es_es: Pcolor permite generar gráficos de estilo de imagen 2D. A continuación mostraremos cómo hacerlo en Matplotlib.

source: A simple pcolor demo
es_es: Una simple demostración de pcolor

source: Comparing pcolor with similar functions
es_es: Comparación de pcolor con funciones similares

source: Demonstrates similarities between `~.axes.Axes.pcolor`, `~.axes.Axes.pcolormesh`, `~.axes.Axes.imshow` and `~.axes.Axes.pcolorfast` for drawing quadrilateral grids. Note that we call ``imshow`` with ``aspect="auto"`` so that it doesn't force the data pixels to be square (the default is ``aspect="equal"``).
es_es: Demuestra las similitudes entre `~.axes.Axes.pcolor`, `~.axes.Axes.pcolormesh`, `~.axes.Axes.imshow` y `~.axes.Axes.pcolorfast` para dibujar cuadrículas. Ten en cuenta que llamamos a ``imshow`` con ``aspecto="auto"`` para que no fuerce que los píxeles de los datos sean cuadrados (el valor por defecto es ``aspecto="igual"``).

source: Pcolor with a log scale
es_es: Pcolor con una escala logarítmica

source: The following shows pcolor plots with a log scale.
es_es: A continuación se muestran las gráficas de pcolor con una escala logarítmica.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.878 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.878 segundos)

source: :download:`Download Python source code: pcolor_demo.py <pcolor_demo.py>`
es_es: :download:`Descarga el código fuente de Python: pcolor_demo.py <pcolor_demo.py>`

source: :download:`Download Jupyter notebook: pcolor_demo.ipynb <pcolor_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: pcolor_demo.ipynb <pcolor_demo.ipynb>`
