Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/plot_streamplot.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_plot_streamplot.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_plot_streamplot.py>` para descargar el código de ejemplo completo

source: A stream plot, or streamline plot, is used to display 2D vector fields. This example shows a few features of the `~.axes.Axes.streamplot` function:
es_es: Un gráfico de corriente, o gráfico de línea de corriente, se utiliza para mostrar campos vectoriales en 2D. Este ejemplo muestra algunas características de la función `~.axes.Axes.streamplot`:

source: Varying the color along a streamline.
es_es: Variando el color a lo largo de una línea de corriente.

source: Varying the density of streamlines.
es_es: Variando la densidad de las líneas de corriente.

source: Varying the line width along a streamline.
es_es: Variando el ancho de la línea a lo largo de una línea de corriente.

source: Controlling the starting points of streamlines.
es_es: Control de los puntos de inicio de las líneas de corriente.

source: Streamlines skipping masked regions and NaN values.
es_es: Las líneas de flujo omiten las regiones enmascaradas y los valores NaN.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 3.064 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 3.064 segundos)

source: :download:`Download Python source code: plot_streamplot.py <plot_streamplot.py>`
es_es: :download:`Descarga el código fuente de Python: plot_streamplot.py <plot_streamplot.py>`

source: :download:`Download Jupyter notebook: plot_streamplot.ipynb <plot_streamplot.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: plot_streamplot.ipynb <plot_streamplot.ipynb>`
