Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/quiver_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_quiver_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_quiver_demo.py>` para descargar el código completo del ejemplo

source: Advanced quiver and quiverkey functions
es_es: Funciones avanzadas de quiver y quiverkey

source: Demonstrates some more advanced options for `~.axes.Axes.quiver`. For a simple example refer to :doc:`/gallery/images_contours_and_fields/quiver_simple_demo`.
es_es: Demuestra algunas opciones más avanzadas para `~.axes.Axes.quiver`. Para un ejemplo sencillo, consulta :doc:`/gallery/images_contours_and_fields/quiver_simple_demo`.

source: Note: The plot autoscaling does not take into account the arrows, so those on the boundaries may reach out of the picture. This is not an easy problem to solve in a perfectly general way. The recommended workaround is to manually set the Axes limits in such a case.
es_es: Nota: El autoescalado de la trama no tiene en cuenta las flechas, por lo que las que están en los límites pueden llegar a salirse de la imagen. Este no es un problema fácil de resolver de forma perfectamente general. La solución recomendada es establecer manualmente los límites de los ejes en este caso.

source: Out:
es_es: Salida:

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.221 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.221 segundos)

source: :download:`Download Python source code: quiver_demo.py <quiver_demo.py>`
es_es: :download:`Descarga el código fuente de Python: quiver_demo.py <quiver_demo.py>`

source: :download:`Download Jupyter notebook: quiver_demo.ipynb <quiver_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: quiver_demo.ipynb <quiver_demo.ipynb>`
