Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/tricontour_smooth_delaunay.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_tricontour_smooth_delaunay.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_tricontour_smooth_delaunay.py>` para descargar el código completo del ejemplo

source: Tricontour Smooth Delaunay
es_es: Tricontorno Suave Delaunay

source: Demonstrates high-resolution tricontouring of a random set of points; a `matplotlib.tri.TriAnalyzer` is used to improve the plot quality.
es_es: Demuestra el tri-contorneado de alta resolución de un conjunto aleatorio de puntos; se utiliza un `matplotlib.tri.TriAnalyzer` para mejorar la calidad del trazado.

source: The initial data points and triangular grid for this demo are:
es_es: Los puntos de datos iniciales y la Cuadrícula triangular para esta demo son:

source: a set of random points is instantiated, inside [-1, 1] x [-1, 1] square
es_es: se instala un conjunto de puntos aleatorios, dentro del cuadrado [-1, 1] x [-1, 1]

source: A Delaunay triangulation of these points is then computed, of which a random subset of triangles is masked out by the user (based on *init_mask_frac* parameter). This simulates invalidated data.
es_es: A continuación, se calcula una triangulación de Delaunay de estos puntos, de los cuales un subconjunto aleatorio de triángulos es enmascarado por el usuario (basado en el parámetro *init_mask_frac*). Esto simula datos invalidados.

source: The proposed generic procedure to obtain a high resolution contouring of such a data set is the following:
es_es: El procedimiento genérico propuesto para obtener un contorno de alta resolución de dicho conjunto de datos es el siguiente:

source: Compute an extended mask with a `matplotlib.tri.TriAnalyzer`, which will exclude badly shaped (flat) triangles from the border of the triangulation. Apply the mask to the triangulation (using set_mask).
es_es: Calcula una máscara extendida con un `matplotlib.tri.TriAnalyzer`, que excluirá los triángulos mal formados (planos) del borde de la triangulación. Aplica la máscara a la triangulación (usando set_mask).

source: Refine and interpolate the data using a `matplotlib.tri.UniformTriRefiner`.
es_es: Refine e interpola los datos utilizando un `matplotlib.tri.UniformTriRefiner`.

source: Plot the refined data with `~.axes.Axes.tricontour`.
es_es: Traza los datos refinados con `~.axes.Axes.tricontour`.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: tricontour_smooth_delaunay.py <tricontour_smooth_delaunay.py>`
es_es: :download:`Descarga el código fuente de Python: tricontour_smooth_delaunay.py <tricontour_smooth_delaunay.py>`

source: :download:`Download Jupyter notebook: tricontour_smooth_delaunay.ipynb <tricontour_smooth_delaunay.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: tricontour_smooth_delaunay.ipynb <tricontour_smooth_delaunay.ipynb>`
