Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/tripcolor_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_tripcolor_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_tripcolor_demo.py>` para descargar el código completo del ejemplo

source: Tripcolor Demo
es_es: Demostración de Tripcolor

source: Pseudocolor plots of unstructured triangular grids.
es_es: Gráficos de pseudocolor de Cuadrículas triangulares no estructuradas.

source: Creating a Triangulation without specifying the triangles results in the Delaunay triangulation of the points.
es_es: Al crear una triangulación sin especificar los triángulos se obtiene la triangulación de Delaunay de los puntos.

source: tripcolor plot.
es_es: gráfico de tripcolor.

source: Out:
es_es: Salida:

source: Illustrate Gouraud shading.
es_es: Ilustra el sombreado de Gouraud.

source: You can specify your own triangulation rather than perform a Delaunay triangulation of the points, where each triangle is given by the indices of the three points that make up the triangle, ordered in either a clockwise or anticlockwise manner.
es_es: Puedes especificar tu propia triangulación en lugar de realizar una triangulación de Delaunay de los puntos, donde cada triángulo viene dado por los índices de los tres puntos que lo componen, ordenados en el sentido de las agujas del reloj o en sentido contrario.

source: Rather than create a Triangulation object, can simply pass x, y and triangles arrays to tripcolor directly. It would be better to use a Triangulation object if the same triangulation was to be used more than once to save duplicated calculations. Can specify one color value per face rather than one per point by using the *facecolors* keyword argument.
es_es: En lugar de crear un objeto Triangulación, puede simplemente pasar arreglos de x, y y triángulos a tripcolor directamente. Sería mejor utilizar un objeto de Triangulación si la misma triangulación se fuera a utilizar más de una vez para ahorrar cálculos duplicados. Se puede especificar un valor de color por cara en lugar de uno por punto utilizando el argumento de la palabra clave *facecolors*.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: **Total running time of the script:** ( 0 minutes 1.458 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.458 segundos)

source: :download:`Download Python source code: tripcolor_demo.py <tripcolor_demo.py>`
es_es: :download:`Descarga el código fuente de Python: tripcolor_demo.py <tripcolor_demo.py>`

source: :download:`Download Jupyter notebook: tripcolor_demo.ipynb <tripcolor_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: tripcolor_demo.ipynb <tripcolor_demo.ipynb>`
