Repository: qu4nt/matplotlib-doc-es-
Catalog: doc/*/gallery/images_contours_and_fields/triplot_demo.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_gallery_images_contours_and_fields_triplot_demo.py>` to download the full example code
es_es: Haz clic en :ref:`aquí <sphx_glr_download_gallery_images_contours_and_fields_triplot_demo.py>` para descargar el código completo del ejemplo

source: Triplot Demo
es_es: Demostración de Triplot

source: Creating and plotting unstructured triangular grids.
es_es: Creación y trazado de Cuadrículas triangulares no estructuradas.

source: Creating a Triangulation without specifying the triangles results in the Delaunay triangulation of the points.
es_es: Al crear una triangulación sin especificar los triángulos se obtiene la triangulación de Delaunay de los puntos.

source: Plot the triangulation.
es_es: Trazar la triangulación.

source: Out:
es_es: Salida:

source: You can specify your own triangulation rather than perform a Delaunay triangulation of the points, where each triangle is given by the indices of the three points that make up the triangle, ordered in either a clockwise or anticlockwise manner.
es_es: Puedes especificar tu propia triangulación en lugar de realizar una triangulación de Delaunay de los puntos, donde cada triángulo viene dado por los índices de los tres puntos que lo componen, ordenados en el sentido de las agujas del reloj o en sentido contrario.

source: Rather than create a Triangulation object, can simply pass x, y and triangles arrays to triplot directly. It would be better to use a Triangulation object if the same triangulation was to be used more than once to save duplicated calculations.
es_es: En lugar de crear un objeto Triangulación, puede simplemente pasar arreglos de x, y y triángulos a triplot directamente. Sería mejor utilizar un objeto Triangulación si se va a utilizar la misma triangulación más de una vez para ahorrar cálculos duplicados.

source: References
es_es: Referencias

source: The use of the following functions, methods, classes and modules is shown in this example:
es_es: En este ejemplo se muestra el uso de las siguientes funciones, métodos, clases y módulos:

source: :download:`Download Python source code: triplot_demo.py <triplot_demo.py>`
es_es: :download:`Descarga el código fuente de Python: triplot_demo.py <triplot_demo.py>`

source: :download:`Download Jupyter notebook: triplot_demo.ipynb <triplot_demo.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: triplot_demo.ipynb <triplot_demo.ipynb>`
